{"title":"Sam Cooke+Soul Stirrers - Complete Specialty Recordings (3CD)","uid":7390749,"size":539398997,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0014afe4c8104188d8b12df0f4d86ef46a6fe42b&amp;dn=Sam+Cooke%2BSoul+Stirrers+-+Complete+Specialty+Recordings+%283CD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"mudmashers","files":84,"time":1340766979,"description":"The Complete Specialty Recordings of Sam Cooke with The Soul Stirrers [Specialty] (3CD320kb)\n\nMost people know Sam Cooke as the soul singer whose '60s hit singles &quot;Chain Gang&quot;, &quot;Cupid&quot; and &quot;Wonderful World&quot; are soul classics. But fewer people know that his musical roots were with the classic gospel quartet the Soul Stirrers. At the age of 19 he joined the group to replace original singer RH Harris and until he quit to start a pop and R&amp;B career in 1958, Sam spent years recording and touring with the group whilst he developed the vocal talent that would make him a world wide mainstream star. This triple CD set delivers up the best of the Soul Stirrers' sessions even including interesting alternative takes on some of the songs. \n\nFrom his earliest sessions in 1951 where he is finding his feet in the studio through classics like &quot;Be With Me Jesus&quot; and &quot;Jesus Gave Me Water&quot; to a number of different takes of &quot;The Last Mile Of The Way&quot; this is timeless music of extraordinary beauty and no little soul power. There's so much good stuff here including the highly charged &quot;Were You There?&quot; which is a gospel masterpiece and the powerful emotions of &quot;Touch The Hem Of His Garment&quot;. Every budding gospel or soul singer should have this set as required listening. It concludes with three live tracks recorded at a performance in 1955 which shows why the group were such a hot live act stirring the souls of the audience who shriek and holler as their extended performance of &quot;Be With Me Jesus&quot; and &quot;Nearer To Thee&quot; burns and burns. It's a fine package. Six short years after leaving the group, Cooke may have had material success but he was shot dead in a motel in seedy circumstances. I often wonder what might have happened if he'd stayed in church and stayed singing gospel and how his life might have panned out. He certainly played a huge part in revolutionising '50s gospel as this handsomely presented box set demonstrates. (Mike Rimmer - Cross Rhythms)","torrent":{"xt":"urn:btih:0014afe4c8104188d8b12df0f4d86ef46a6fe42b","amp;dn":"Sam+Cooke%2BSoul+Stirrers+-+Complete+Specialty+Recordings+%283CD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0014afe4c8104188d8b12df0f4d86ef46a6fe42b","infoHashBuffer":{"type":"Buffer","data":[0,20,175,228,200,16,65,136,216,177,45,240,244,216,110,244,106,111,228,43]},"announce":[],"urlList":[]}}