{"title":"Wendy Carlos - Tron (Original Soundtrack) [RePoPo] (CUE-BIN)","uid":4443190,"size":624073240,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:00b278fe004b623886c13c84fc7045e418d917c9&amp;dn=Wendy+Carlos+-+Tron+%28Original+Soundtrack%29+%5BRePoPo%5D+%28CUE-BIN%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"repopo","files":-1,"time":1223921120,"description":"*******************************************************************************\n                   Wendy Carlos - Tron (Original Soundtrack)\n*******************************************************************************\n\n-------------------------------------------------------------------------------\n                              General Information\n-------------------------------------------------------------------------------\n\nThis is an image file from the retail CD of Wendy Carlos' 1982 Tron Movie\nSoundtrack.  It contains (uncompressed) the 100% of the information contained \non the original retail CD.  Its format is .cue/.bin.\n\nI previously uploaded this very same CD, but the image file wasn't\nMAC-friendly, so here it's again, I hope it's easier now for Mac users.\n\nYou can use a tool to mount this image on your PC and use it virtually as a \nregular Audio-CD, or either burn it with your regular burnig soft on a CD.\n\nSo, if you prefer a .FLAC, .MP3 or whatever other audio format, now you have\nthe basic tool to encode the CD and upload it for others, that'd be OK for me.\n\n-------------------------------------------------------------------------------\n                                 Release Notes\n-------------------------------------------------------------------------------\n\nWendy Carlos - Disney's TRON Original Soundtrack\nRelease date: January 29, 2002\nOriginal Release date: July 9, 1982\nLabel: Disney\nTotal running time: 58:47\n\nTracklist\n\n1.  Creation of TRON \t\n2.  &quot;Only Solutions&quot; - Journey \t\n3.  We've Got Company \t\n4.  Wormhole \t\n5.  Ring Game and Escape \t\n6.  Water, Music and TRONAction \t\n7.  TRON Scherzo \t\n8.  Miracle and Magician \t\n9.  Magic Landings \t\n10. Theme from TRON \t\n11. 1990's Theme\n12. Love Theme \t\n13. Tower Music - Let Us Pray \t\n14. The Light Sailer \t\n15. Sea of Simulation \t\n16. A New TRON and the MCP \t\n17. Anthem \t\n18. Ending Titles \t\n19. TRONAction (Original Version) \t\n20. Break In (For Strings, Flutes and Celesta) \t\n21. Anthem for Keyboard Solo\n\n-------------------------------------------------------------------------------\n                                 SOME REVIES\n-------------------------------------------------------------------------------\n\nby David A. Koran (Soundtrack.net)\non May 13th, 2002\n\nThis review has been a long time in coming, due to both my procrastination, and \nthe length of time it's taken for Tron to be released on CD (and properly on \nDVD). In the day, both the movie and the music were the seminal works of their \ntime: one with groundbreaking animation and computer generated graphics and \nanother integrating synthesized music with a full orchestra. Since its release \nin 1982, the movie has inspired many, from filmmakers, animators, and scientists \nall the way to musicians, designers, and artists. One of the more particularly \ninnovative items from the film, the music, has been the one item languishing in \nobscurity. A &quot;digital&quot; film (in many respects), Tron had not had the advantage \nof releasing its music on the most popular format of today, that being a compact \ndisc. Listeners in 1982 were treated to cassette tapes and vinyl LPs for their \nfix.\n\nThere were hopes of a release back in the early 1990's when composer Wendy \nCarlos was asked by Disney to re-master her surviving tapes for a collector's \nedition laser disc release. However, the only isolated example of her hard work \nwas relegated to a section of the special features of the discs. Upon the rise \nof the Internet, I was able, under my own fruition, to contact Carlos's \nrepresentatives and asked the status of the tapes, since Ms. Carlos has become \nquite expert at the fine art of &quot;baking&quot; master tapes. As it came to be, the \nTron masters were some of the first bit of this work she had actually completed, \nhowever, there were rights issues with Disney (as it has been for many of their \nworks by other composers for their films), and a future release was in legal \nlimbo that would take more than a technical achievement to overcome. Fast \nforward a decade or so, and, according to Ms. Carlos, Disney called out of the \nblue about preparing a release to accompany their special edition DVD set. No \nsooner said than done, we have the release that is the subject of this review, \nwhich, is the same as the LP released in 1982 (in content) plus three additional \ntracks.\n\nFor the casual listener, one could easily write the sound off as dated, due to \nthe over saturation of electronics in modern (if you can call it that) music. \nHowever, to fans, and aficionados of classic &quot;electronic&quot; music (akin to \ncomparing CDs versus LPs), one cannot overlook the warmth that analog synths \nbring to the overall atmosphere of the score. An interesting item mentioned in \nthe liner notes (and on Carlos' website), is that the score was to be split \nalong a full orchestra, representing the &quot;analog&quot; flesh and blood world, and the \nsynthesizers, representing the &quot;digital&quot; computer world. The only superbly \ndiscernable crossover (outside of live percussion) between the two occurs during \nthe &quot;Creation of TRON&quot;, a blend of orchestra, chorus, and electronics, &quot;Miracle \nand Magician&quot; and &quot;End Titles&quot;, which occur, coincidentally when the analog \nhuman world comes in contact with the digital computer world. At times, some of \nthe pieces are dissonant in sound, but it helps provide a transition between \nsome of the major melodies and overt passages in the score. However, if one \nlooks back on Carlos' entire recording career, the solo works as well as the \ncoverage of Bach, this approach wouldn't sound as strange as it may appear.\n\nThe most recognizable themes from the score (some of which even my co-workers \nhave a penchant for humming incessantly all day at times) are from three pieces \non the album, &quot;TRON Scherzo&quot;, &quot;Theme from TRON&quot;, and &quot;The Light Sailer&quot;. \nAlthough the themes that comprise these three pieces do show up earlier in the \nscore, these tracks represent a coming together of each musical idea (in \ncorrespondence to the plot progression) that had been given birth in other areas \nof the film. Carlos mentioned that she had intended two thematic motifs to be \nused: one a militaristic sounding theme, corresponding to the MCP and it's \ncohorts, and a second theme, based on love story between Tron (Bruce Boxleitner) \nand Yori (Cindy Morgan). Although there is a &quot;Love Theme&quot; track, the full theme \nis best realized during the &quot;End Titles&quot; piece where every major musical point \nis brought to a resolution. A nice touch on that track is the addition of the \nlarge pipe organ, which really acts as a successful middle ground between the \nsynthetic and organic elements of the score.\n\nThe 20th Anniversary DVD set is truly worth the investments if you grew up \nadmiring the film. For those that find the CGI special effects of today as \nsomething that has become second nature, it's also a history lesson as to how \nfar we've come since those days. In fact, I purchased the latest advance in CGI \nanimation the same day I picked up the DVD for Tron as a comparison, which was \nFinal Fantasy: The Spirits Within. Both shared a few central ideological themes, \nbut other than that they are entirely different films, both in look and feel as \nwell as the technology. Tron sparingly used CGI effects since it took so long to \ngenerate even the most simple computer animation, whereas the latter film was \ncompletely computer generated, even down to the actors within. One could only \nwonder what will happen within the next 20 years. As for the music, one could \nsay it's gone backwards, from introducing electronics in the production of film \nscores to add something unique, to where the more popular scores are completely \ngenerated within a computer (which I have a tendency to dislike). However, for \nFinal Fantasy, composer Elliot Goldenthal chose the classic route with a full \norchestra and very little, if any electronic support. You can use Tron as a \nhistory lesson, and example of a genre, or let it stand alone as it may, but I'm \nsure you'll find it as fun and as interesting as I have for the past 20 years. \n\n-------------------------------------------------------------------------------\n\nRandyAU93 (Lithia Springs, GA United States) (Taken from Amazon)\n\nFor reasons unbeknownst to us (but knownst to Disney), the soundtrack to their \n1982 film &quot;TRON&quot; completely missed the digital revolution. You would think that \na movie whose whole premise is digitally-grounded would have been an early \nadopter of compact disc technology. But it wasn't. I still have my old LP \nversion of the soundtrack, but it certainly doesn't fit in my car's CD changer, \nand my tape of the soundtrack is old and over-used.\n\nWell, just in time for the movie's 20th anniversary year, Walt Disney Records \nhas finally brought the soundtrack to the CD format, and believe me, it was \nworth the wait.\n\nThe album has been completely remastered with the full assistance of the \ncomposer, Wendy Carlos. The CD's liner notes include a recent interview with \nCarlos, who details the creation of the unique digital/orchestral score that \naccompanies the on-screen computer animation. Being something of a novice when \nit comes to modern music composition, many of the terms sailed clear over my \nhead, but she managed to provide more than enough context to make her \ndescriptions make sense.\n\nOn to the tracks: All the tracks from the original LP soundtrack are here, \narranged in an order reasonably consistent with the progress of the film. What \nmakes this soundtrack so intriguing is not so much how it evokes memories of the \nfilm (which it certainly does) but how the merger of sythesized music with the \nwork of a symphony orchestra came across so well. Considering the movie itself \nwas a merger of traditional film techniques with cutting-edge (for the early \n80s) computer animation, the fact that the soundtrack is similarly composed \nmakes it that much more engrossing.\n\nAs owners of the original soundtrack might recall, 80s supergroup Journey \nprepared two tracks (one song, one instrumental) for use with the movie. Both \ntracks are in the movie, but there's nothing to call attention to them; check \nthe arcade scenes in the film and you'll hear them. They do seem somewhat out of \nplace, especially the anacronistically-named &quot;90s Theme,&quot; but not so much that \nyou'll skip them.\n\nAn added bonus on the CD is three previously unreleased tracks; Carlos mentions \nin her interview that they were intended for the original soundtrack, but were \nleft out because of lack of space on both the LP and cassette formats. The first \ntrack is an early &quot;draft&quot; of one of the action themes, the second is a piece \nthat was used in the film but not on the old album and the third is a simple \nsingle-instrument version of the &quot;TRON&quot; theme (being the last track on the disc, \nit's a welcome cool-down). The liner notes go into greater detail about how \nthese tracks came to be.\n\nThe fact that this disc has never been available before is enough of a selling \npoint. If you're on the fence, however, you would do well to pick up this \nexceptional compilation that was some twenty years in the making. \n\n-------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:00b278fe004b623886c13c84fc7045e418d917c9","amp;dn":"Wendy+Carlos+-+Tron+%28Original+Soundtrack%29+%5BRePoPo%5D+%28CUE-BIN%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00b278fe004b623886c13c84fc7045e418d917c9","infoHashBuffer":{"type":"Buffer","data":[0,178,120,254,0,75,98,56,134,193,60,132,252,112,69,228,24,217,23,201]},"announce":[],"urlList":[]}}