{"title":"FRANKENSTEIN MARY SHELLY [AUDIO BOOK]","uid":7257890,"size":229279112,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:00e1d140802cd7b3436fa7ce2e3fe4312d296990&amp;dn=FRANKENSTEIN+MARY+SHELLY+%5BAUDIO+BOOK%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"uk_spuddybuddy","files":1,"time":1336641888,"description":"this is a public domain recording and free to use for educational purposes\nFrankenstein; or, The Modern Prometheus is a novel written by Mary Shelley about a creature produced by an unorthodox scientific experiment. Shelley started writing the story when she was eighteen, and the novel was published when she was twenty-one. The first edition was published anonymously in London in 1818. Shelley's name appears on the second edition, published in France in 1823.\n\nShelley had travelled the region in which the story takes place, and the topics of galvanism and other similar occult ideas were themes of conversation among her companions, particularly her future husband, Percy. The storyline emerged from a dream. Mary, Percy, Lord Byron, and John Polidori decided to have a competition to see who could write the best horror story. After thinking for weeks about what her possible storyline could be, Shelley dreamt about a scientist who created life and was horrified by what he had made. She then wrote Frankenstein.\n\nFrankenstein is infused with some elements of the Gothic novel and the Romantic movement and is also considered to be one of the earliest examples of science fiction. Brian Aldiss has argued that it should be considered the first true science fiction story, because unlike in previous stories with fantastical elements resembling those of later science fiction, the central character &quot;makes a deliberate decision&quot; and &quot;turns to modern experiments in the laboratory&quot; to achieve fantastic results.[1] The story is partially based on Giovanni Aldini's electrical experiments on dead and (sometimes) living animals and was also a warning against the expansion of modern humans in the Industrial Revolution, alluded to in its subtitle, The Modern Prometheus. It has had a considerable influence across literature and popular culture and spawned a complete genre of horror stories and films.\n\nSince publication of the novel, the name &quot;Frankenstein&quot; is often used to refer to the monster itself, as is done in the stage adaptation by Peggy Webling. This usage is sometimes considered erroneous, but usage commentators regard the monster sense of &quot;Frankenstein&quot; as well-established and not an error[2][3][4]. In the novel, the monster is identified via words such as &quot;creature,&quot; &quot;monster&quot;, &quot;fiend&quot;, &quot;wretch&quot;, &quot;vile insect&quot;, &quot;daemon&quot;, and &quot;it&quot;. The monster refers to himself speaking to Dr. Frankens &quot;the Adam of your labors&quot;, and elsewhere as someone who &quot;would have&quot; been &quot;your Adam&quot;, but is instead your &quot;fallen angel.&quot;\n\n","torrent":{"xt":"urn:btih:00e1d140802cd7b3436fa7ce2e3fe4312d296990","amp;dn":"FRANKENSTEIN+MARY+SHELLY+%5BAUDIO+BOOK%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00e1d140802cd7b3436fa7ce2e3fe4312d296990","infoHashBuffer":{"type":"Buffer","data":[0,225,209,64,128,44,215,179,67,111,167,206,46,63,228,49,45,41,105,144]},"announce":[],"urlList":[]}}