{"title":"YL Computing Dr. Folder v2.2.0.0","uid":15478334,"size":7668803,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:00eae433a9beeb05ee1b394441fd10e28f6b0e15&amp;dn=YL+Computing+Dr.+Folder+v2.2.0.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LxByte","files":1,"time":1470216209,"description":"YL Computing Dr. Folder v2.2.0.0\r\n\r\nDr. Folder is a software that search and replace the standard icon of a folder on any other icon. It has a pretty and friendly interface. It is a powerful software and easy to use. You can change icons of folders quickly and freely just by clicking several buttons. So, using Dr. Folder can save you lots of time. The most important is that it can make your folders lively and I think others will envy your beautiful folders!\r\n\r\nBenefits:\r\nGet organized - Prioritize your tasks or indicate process progress with 'priority' icons\r\nSave time on finding file - Put your folders in order in 1 click\r\nProtect valuable information from accidental removal - Highlight important folders that must not be removed\r\nPersonalize your workspace - Make your folders distinct from other folders, shared with other users on one PC or LAN\r\n\r\nKey features:\r\nYou have the right to use Dr. Folder in your office\r\nDr. Folder can change the Network folder icon. So you can customize your LAN\r\nDr. Folder contains additional icons for office work\r\nDr. Folder allows you to change the folder icon with the easiest way (Just one mouse click)\r\nDr. Folder has two additional options for folder icon changes: &quot;Make customized folder distributable&quot; (portable) and &quot;Apply selected icon to all subfolders&quot;\r\nDr. Folder can mark folders by priority (high, normal, low), by degree of work complete (done, half-done, planned), by work status (approved, rejected, pending) and by the type of the information contained in a folder (work files, important files, temp files, private files).\r\nDr. Folder can change a folder's color to normal, dark and light states\r\nDr. Folder changes folder icons from within a popup menu of the folders. To change a folder icon, you don't even need to run the program!\r\nDr. Folder's popup menu contains convenient category submenus.\r\nDr. Folder contains a User Icons tab where you can add an unlimited quantity of your favorite icons and mark folders with them. It's easy!\r\n\r\nDr. Folder allows you to:\r\nApply different icons to individual folders in one mouse click\r\nEasily change the folder icon from system context menu\r\nReplace the system-defined standard folder icon, which is used by Windows to display each folder on your computer\r\nSearch for icons on your computer\r\nCopy icon to the current folder to make your folder icons independent from icon source files (that allows you to move or copy your customized folders anywhere even to another computer! Your folders will be the look exactly as you specified)\r\nRebuild the system icon cache to repair incorrect icon images\r\nAdd your favorite icons to the user icon list to access them faster\r\nConvert icon from PNG, BMP, JPG or GIF file\r\n\r\nOfficial Website: http://hi.ylcomputing.com/products/dr-folder","torrent":{"xt":"urn:btih:00eae433a9beeb05ee1b394441fd10e28f6b0e15","amp;dn":"YL+Computing+Dr.+Folder+v2.2.0.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00eae433a9beeb05ee1b394441fd10e28f6b0e15","infoHashBuffer":{"type":"Buffer","data":[0,234,228,51,169,190,235,5,238,27,57,68,65,253,16,226,143,107,14,21]},"announce":[],"urlList":[]}}