{"title":"IMPERIUM CIVITAS PACK","uid":3980327,"size":4181405860,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:01191bea0ada52d97a9444e47e7586c230cd7866&amp;dn=IMPERIUM+CIVITAS+PACK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":4,"uploader":"pegalatas","files":27,"time":1200513335,"description":"\nGÃƒÂ©nero: RTS (estrategia en tiempo real)\nIdioma: Castellano\nTamaÃƒÂ±o: 3988 MB\n\nEste pack se compone de\n- Imperivm: La Guerra de las Galias (1 CD)\n- Imperivm II: La Conquista de Hispania (1 CD)\n- Imperivm III: Las Grandes Batallas de Roma (1 CD)\n- Imperivm Civitas (1 DVD)\n+ Actualizaciones y cracks al 10-Dic-2006\n+ Extras (documentaciÃƒÂ³n y trucos)\n\nDESCRIPCION\n\nImperivm: La Guerra de las Galias - Mes de septiembre del aÃƒÂ±o 51 a.C. Las legiones de Roma, lideradas por Cayo Julio CÃƒÂ©sar, avanzan hacia Alesia. 80.000 guerreros galos, al mando del noble VercingÃƒÂ©torix, velan armas para la batalla. La guerra de las Galias estÃƒÂ¡ en su momento decisivo. DesafÃƒÂ­a el poder de Roma o lleva a las legiones de CÃƒÂ©sar hacia la victoria. TÃƒÂº eliges.\n\nImperivm II: La Conquista de Hispania - AÃƒÂ±o 238 a.C. Cartago emprende la conquista de la penÃƒÂ­nsula ibÃƒÂ©rica como primer paso para recuperar su hegemonÃƒÂ­a en el MediterrÃƒÂ¡neo. Un plan que ni Roma ni los pueblos iberos estÃƒÂ¡n dispuestos a aceptar. En Hispania se decide el destino del mundo conocido, un inmenso campo de batalla en el que brillan el genio de AnÃƒÂ­bal, el arrojo de EscipiÃƒÂ³n el Africano y la valentÃƒÂ­a de los guerreros iberos...\n\nImperivm III: Las Grandes Batallas de Roma - El asedio de Numancia, la victoria de Augusto sobre Marco Antonio y Cleopatra en tierras egipcias; las campaÃƒÂ±as de Marco Aurelio frente a los germanos al norte del Rhin; la insurrecciÃƒÂ³n de Viriato al oeste de la penÃƒÂ­nsula IbÃƒÂ©rica, el sitio de Alesia liderado por Julio CÃƒÂ©sar...\n\nCivitas - La Historia de Roma ha sido relatada a travÃƒÂ©s de sus conquistas militares, pero la contribuciÃƒÂ³n de la civilizaciÃƒÂ³n romana trasciende mucho mÃƒÂ¡s allÃƒÂ¡ del campo de batalla. SerÃƒÂ­a imposible imaginar un mundo sin sus avances en arquitectura, comercio, sanidad, formas de gobierno...\n\nINSTALACION de Imperivm - La Guerra de las Galias\n\n- Quemar o montar la imagen\n- Instalar Imperivm\n- Aplicar la actualizaciÃƒÂ³n &quot;Imperivm116.exe&quot;\n- Copiar el crack, reemplazando el fichero original\n\nINSTALACION de Imperivm II - La Conquista de Hispania\n\n- Quemar o montar la imagen\n- Instalar Imperivm_II\n- Aplicar la actualizaciÃƒÂ³n &quot;Imperivm_II_1.02.exe&quot;\n- Copiar el crack, reemplazando el fichero original (ver NOTAS)\n\nINSTALACION de Imperivm III - Las Grandes Batallas de Roma\n\n- Quemar o montar la imagen\n- Instalar Imperivm_III\n- Aplicar la actualizaciÃƒÂ³n &quot;Imperivm III-1.20.exe&quot; (ver NOTAS)\n- Aplicar la actualizaciÃƒÂ³n &quot;Imperivm III-1.28.exe&quot;\n- Aplicar la actualizaciÃƒÂ³n &quot;Imperivm III-1.40.exe&quot;\n\nINSTALACION de Imperivm Civitas\n- Quemar o montar la imagen\n- Instalar Civitas\n\nNOTAS\n\n- Con la actualizaciÃƒÂ³n de Imperivm II a la versiÃƒÂ³n 1.02 no se necesita crack, pero me han comentado que hay casos en los que pide el CD (tal vez en versiones extranjeras, no lo he podido comprobar), por lo que incluyo un crack para evitarlo (de hecho la rutina de chequeo del CD sigue en el ejecutable)\n- Al terminar de instalar el update 1.20 de Imperivm III el juego arranca sÃƒÂ³lo, por lo que recomiendo salir sin jugar para instalar el resto de updates\n- Ni Imperivm III ni Civitas necesitan crack","torrent":{"xt":"urn:btih:01191bea0ada52d97a9444e47e7586c230cd7866","amp;dn":"IMPERIUM+CIVITAS+PACK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01191bea0ada52d97a9444e47e7586c230cd7866","infoHashBuffer":{"type":"Buffer","data":[1,25,27,234,10,218,82,217,122,148,68,228,126,117,134,194,48,205,120,102]},"announce":[],"urlList":[]}}