{"title":"Diet for a New America (why you need to avoid eating meat)","uid":3535662,"size":508446348,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:01cc1bb0a1511cc21176e545638b9a5b81fcfb67&amp;dn=Diet+for+a+New+America+%28why+you+need+to+avoid+eating+meat%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ReVIsed","files":1,"time":1160284192,"description":"Diet for a New America (why you need to avoid eating meat) (John Robbins) (1992)\n\nred_gonzo wrote:\n\n&quot;This is John Robbins&amp;#039; amazing video documentary Diet for a New America (1992) which explores the causes why Americans eat so much meat and what does this do to their health and the environment. \n\nAlthough it is commonly known today that meat and diary products are one of the primary causes for heart and other deadly diseases, Americans don&amp;#039;t seem to care at all and are living (and dying) with them every day. When this award-winning documentary was first aired the US National Cattlemen&amp;#039;s Association mounted an aggressive campaign to discredit the program and keep it from being aired. But the attempt to thwart the show failed, and the program went on to be one of public television&amp;#039;s all-time most successful documentaries.\n\nThis well-documented expose of America&amp;#039;s &quot;factory farms&quot; should prompt even die-hard meat-and-potatoes lovers to reevaluate their diets. Asserting that &quot;we are ingesting nightmares for breakfast, lunch and dinner,&quot; Robbins details how livestock is raised under increasingly industrialized conditions by &quot;agribusiness oligopolies.&quot; Grazing and foraging have given way to debeaking, tail-docking, dehorning and castration, and treatment with pesticides, hormones, growth and appetite stimulants, tranquilizers and antibiotics which, in turn, are assimilated by humans who then suddenly become sick.\n\nThe author correlates our &quot;protein obsessed&quot; society with a higher incidence of arteriosclerosis, osteoporosis, cancer and other degenerative diseases, as well as freakish occurrences like premature puberty from estrogen contamination. As Robbins debunks nutritional myths perpetuated by the powerful meat and dairy industries (indicting as well his family&amp;#039;s Baskin-Robbins ice-cream empire), this is sure to prove controversial.\n\nRobbins, the author of bestselling book Diet for a New America, decided to completely change the way he lived and set out to explore a way to live with nature in harmony and also grow his own food without eating meat. His classic book awakened the conscience of a nation and since its first publication in 1987 beef consumption in the United States has fallen a remarkable 19%. Diet for a New America is a startling examination of the food Americans currently buy and eat in the United States, and the shocking moral, economic, and emotional price we pay for it. John Robbins takes an extraordinary look at our dependence on animals for food and the inhumane conditions under which these animals are raised. It becomes clear that the price we pay for our eating habits is measured in the suffering of animals, a suffering so extreme and needless that it disrupts our very place in the web of life. He then challenges the belief that consuming meat is a requirement for health by pointing our the vastly increased rate of disease caused by pesticides, hormones, additives, and other chemicals now a routine part of our food production\n\nThe author shows us that the high health risk is unnecessary, and that the production, preparation, and consumption of food can once again be a healthy process. He also looks at the global implications of a meat-based diet and concludes that the consumption of the resources necessary to produce meat is a major factor in our ecological crisis. Find our how your food choices affect your health, happiness and the future of life on Earth so hopefully the next time you&amp;#039;ll be passing McDonalds you&amp;#039;ll just keep walking on - it&amp;#039;s worth every step you take away from it. 1h long. A must see for everyone.\n\nNote: a small part in the middle is missing (audio still plays) but the rest is there.\n\nVideo specs: Video codec: DIVX, 720x480 Audio codec: Unknown (tag 0055), 48kHz, Stereo&quot;\n\n","torrent":{"xt":"urn:btih:01cc1bb0a1511cc21176e545638b9a5b81fcfb67","amp;dn":"Diet+for+a+New+America+%28why+you+need+to+avoid+eating+meat%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01cc1bb0a1511cc21176e545638b9a5b81fcfb67","infoHashBuffer":{"type":"Buffer","data":[1,204,27,176,161,81,28,194,17,118,229,69,99,139,154,91,129,252,251,103]},"announce":[],"urlList":[]}}