{"title":"The Allman Brothers Band - Brothers And Sisters [DELUXE] [320k M","uid":10648380,"size":597700793,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:02fb50ebbf886adce57c36aaee1f22005ba2055c&amp;dn=The+Allman+Brothers+Band+-+Brothers+And+Sisters+%5BDELUXE%5D+%5B320k+M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"smbdownload","files":-1,"time":1406576005,"description":"Brothers and Sisters is the fourth studio album by American rock band the Allman Brothers Band. Produced by Johnny Sandlin and the band themselves, the album was released in August 1973 in the United States by Capricorn Records. Following the death of group leader Duane Allman in 1971, the Allman Brothers Band released Eat a Peach (1972), a hybrid studio/live album that became their biggest yet. Afterwards, the group purchased a farm in Juliette, Georgia to become a &quot;group hangout.&quot; However, bassist Berry Oakley was visibly suffering from the death of Duane: he excessively drank and consumed drugs. After nearly a year of severe depression, things seemed to be looking up for Oakley before he was killed in a motorcycle accident not dissimilar from his friend's in November 1972.\n\nThe band carried on, adding new members Chuck Leavell on piano and Lamar Williams on bass. Brothers and Sisters was largely recorded over a period of three months at Capricorn Sound Studios in Macon, Georgia. Lead guitarist Dickey Betts assumed the role of band leader, and many of his compositions reflected a more country-inspired twang. The band did not replace Duane with another lead guitarist, although session musicians Les Dudek and Tommy Talton sat in to play on several songs. The album was being produced at the same time as vocalist Gregg Allman's solo debut, Laid Back, and features many of the same musicians and engineers. The front album cover features a photograph of Vaylor Trucks, the son of drummer Butch Trucks and his wife Linda. The back cover features a photograph of Brittany Oakley, the daughter of bassist Berry Oakley and his wife Linda.\n\nThe album represented the Allman's commercial peak: it was released to high sales, landing it at the top of the Top 200 Pop Albums for five weeks. &quot;Ramblin' Man&quot; became the band's first and only hit single, peaking at number two on the Billboard Hot 100 in 1973. The commercial success of the record propelled the Allman Brothers Band to the forefront of popular music. The album's extended touring cycle saw the band performing in arenas and stadiums, all while drug use spiraled out of control within the group, in addition to strained friendship and miscommunication.\n\nTrack Listing [320k MP3]\n\nDisc 1\n\n   01. Wasted Words                 \n   02. Ramblin' Man                 \n   03. Come and Go Blues            \n   04. Jelly Jelly                 \n   05. Southbound                  \n   06. Jessica \n   07. Pony Boy  \n\nDisc 2\n\n   01. Wasted Words (Rehearsal/1972)\n   02. Trouble No More (Rehearsal/1972)\n   03. Southbound (Instrumental Outtake/1972)\n   04. One Way Out (Rehearsal)      \n   05. I'm Gonna Move to the Outskirts of Town (Rehearsal)\n   06. Done Somebody Wrong (Rehearsal/1972)\n   07. Double Cross (Outtake/1973)  \n   08. Early Morning Blues (Outtake/1973)\n   09. A Minor Jam (Studio Jam/1973)\n\nDisc 3\n\n   01. Introduction By Bill Graham (Live at Winterland/1973)\n   02. Wasted Words (Live at Winterland/1973)\n   03. Done Somebody Wrong (Live at Winterland/1973)\n   04. One Way Out (Live at Winterland/1973)\n   05. Stormy Monday (Live at Winterland/1973)\n   06. Midnight Rider (Live at Winterland/1973)\n   07. Ramblin' Man (Live at Winterland/1973)\n   08. In Memory of Elizabeth Reed (Live at Winterland/1973)\n   09. Statesboro Blues (Live at Winterland/1973)\n   10. Come and Go Blues (Live at Winterland/1973)\n\nDisc 4\n\n   01. Southbound (Live at Winterland/1973)\n   02. Jessica (Live at Winterland/1973)\n   03. You Don't Love Me / Amazing Grace (Live at Winterland/1973)\n   04. Les Brers in A Minor (Live at Winterland/1973)\n   05. Blue Sky (Live at Winterland/1973)\n   06. Trouble No More (Live at Winterland/1973)\n   07. Whipping Post (Live at Winterland/1973)\n\n                ","torrent":{"xt":"urn:btih:02fb50ebbf886adce57c36aaee1f22005ba2055c","amp;dn":"The+Allman+Brothers+Band+-+Brothers+And+Sisters+%5BDELUXE%5D+%5B320k+M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02fb50ebbf886adce57c36aaee1f22005ba2055c","infoHashBuffer":{"type":"Buffer","data":[2,251,80,235,191,136,106,220,229,124,54,170,238,31,34,0,91,162,5,92]},"announce":[],"urlList":[]}}