{"title":"Immortality: The Quest to Live Forever  (2012 - epub)","uid":7231015,"size":2490050,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0329f72d0544ed48fbb49345ee7c6c3c84b36b48&amp;dn=Immortality%3A+The+Quest+to+Live+Forever++%282012+-+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Lucybabe","files":3,"time":1335836502,"description":"Immortality shows how the quest to live forever has driven the development of human civilisation, and how that quest is now coming to a climax through modern science. It argues that humans are hardwired to pursue eternal life - and that the way they have done so has stayed remarkably consistent through the ages. All the main beliefs on defying death, from freeing your soul to freezing your brain, fall into four simple categories - the four paths to immortality. Although all four paths are ancient, science is now showing us - for the first time in human history - which of them could really lead to infinity. Immortality uses the stories of ten exceptional characters, from Queen Nefertiti to the Dalai Lama, to show how these four paths have shaped our culture from ancient times through to today. Unlike most books on this hugely popular subject, Immortality does not argue from a particular religious viewpoint. Written by Stephen Cave, philosopher (PhD, Cambridge) and regular writer for the Financial Times, it shows general readers how the latest research in fields from anti-aging to neuroscience is providing new answers to life's most important question.\n\nCrown 2012","torrent":{"xt":"urn:btih:0329f72d0544ed48fbb49345ee7c6c3c84b36b48","amp;dn":"Immortality%3A+The+Quest+to+Live+Forever++%282012+-+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0329f72d0544ed48fbb49345ee7c6c3c84b36b48","infoHashBuffer":{"type":"Buffer","data":[3,41,247,45,5,68,237,72,251,180,147,69,238,124,108,60,132,179,107,72]},"announce":[],"urlList":[]}}