{"title":"STEVIE WONDER  -  I JUST CALLED TO SAY I LOVE YOU-VIRUSOFSATEN","uid":4686631,"size":9154872,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:03784c09d32f3c002eed93f093d5ed183a2bb6f8&amp;dn=STEVIE+WONDER++-++I+JUST+CALLED+TO+SAY+I+LOVE+YOU-VIRUSOFSATEN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"virusofsaten","files":-1,"time":1233255328,"description":"STEVIE WONDER  -  AVI  .\n\n\n\n{Biography}\n\n\n{Stevie Wonder}\n\n\nStevie Wonder is a much-beloved American icon and an indisputable genius not only of R&amp;B but popular music in general. Blind virtually since birth, Wonder's heightened awareness of sound helped him create vibrant, colorful music teeming with life and ambition. Nearly everything he recorded bore the stamp of his sunny, joyous positivity; even when he addressed serious racial, social, and spiritual issues (which he did quite often in his prime), or sang about heartbreak and romantic uncertainty, an underlying sense of optimism and hope always seemed to emerge. Much like his inspiration, Ray Charles, Wonder had a voracious appetite for many different kinds of music, and refused to confine himself to any one sound or style. His best records were a richly eclectic brew of soul, funk, rock &amp; roll, sophisticated Broadway/Tin Pan Alley-style pop, jazz, reggae, and African elements -- and they weren't just stylistic exercises; Wonder took it all and forged it into his own personal form of expression. His range helped account for his broad-based appeal, but so did his unique, elastic voice, his peerless melodic facility, his gift for complex arrangements, and his taste for lovely, often sentimental ballads. Additionally, Wonder's pioneering use of synthesizers during the '70s changed the face of R&amp;B; he employed a kaleidoscope of contrasting textures and voices that made him a virtual one-man band, all the while evoking a surprisingly organic warmth. Along with Marvin Gaye and Isaac Hayes, Wonder brought R&amp;B into the album age, crafting his LPs as cohesive, \nconsistent statements with compositions that often took time to make their point. All of this made Wonder perhaps R&amp;B's greatest individual auteur, rivaled only by Gaye or, in later days, Prince. Originally, Wonder was a child prodigy who started out in the general Motown mold, but he took control of his vision in the '70s, spinning off a series of incredible albums that were as popular as they were acclaimed; most of his reputation rests on these works, which most prominently include Talking Book, Innervisions, and Songs in the Key of Life. His output since then has been inconsistent, marred by excesses of sentimentality and less of the progressive imagination of his best work, but it's hardly lessened the reverence in which he's long been held. Wonder was born Steveland Hardaway Judkins in Saginaw, MI, on May 13, 1950 (he later altered his name to Steveland Morris when his mother married). A premature infant, he was put on oxygen treatment in an incubator; likely it was an excess of oxygen that exacerbated a visual condition known as retinopathy of prematurity, causing his blindness. In 1954, his family moved to Detroit, where the already musically inclined Stevie began singing in his church's choir; from there he blossomed into a genuine prodigy, learning piano, drums, and harmonica all by the age of nine. While performing for some of his friends in 1961, Stevie was discovered by Ronnie White of the Miracles, who helped arrange an audition with Berry Gordy at Motown. Gordy signed the youngster immediately and teamed him with producer/songwriter Clarence Paul, under the new name Little Stevie Wonder. Stevie released his first two albums in 1962: A Tribute to Uncle Ray, which featured covers of Stevie's hero Ray Charles, and The Jazz Soul of Little Stevie, an orchestral jazz album spotlighting his instrumental skills on piano, harmonica, and assorted percussion. Neither sold very well, but that all changed in 1963 with the live album The 12 Year Old Genius, which featured a new extended version of the harmonica instrumental &quot;Fingertips.&quot; Edited for release as a single, &quot;Fingertips, Pt. 2&quot; rocketed to the top of both the pop and R&amp;B charts, thanks to Wonder's irresistible, youthful exuberance; meanwhile, The 12 Year Old Genius became Motown's first chart-topping LP. Wonder charted a few more singles over the next year, but none on the level of &quot;Fingertips, Pt. 2.&quot; As his voice changed, his recording career was temporarily put on hold, and he studied classical piano at the Michigan School for the Blind in the meantime. He dropped the &quot;Little&quot; portion of his stage name in 1964, and re-emerged the following year with the infectious, typically Motown-sounding dance tune &quot;Uptight (Everything's Alright),&quot; a number one R&amp;B/Top Five pop smash. Not only did he co-write the song for his first original hit, but it also reinvented him as a more mature vocalist in the public's mind, making the similar follow-up &quot;Nothing's Too Good for My Baby&quot; another success. The first signs of Wonder's social activism appeared .\nin 1966 via his hit cover of Bob Dylan's &quot;Blowin' in the Wind&quot; and its follow-up, &quot;A Place in the Sun,&quot; but as Motown still had the final say on Wonder's choice of material, this new direction would not yet become a major facet of his work. By this time, Wonder was, however, beginning to take more of a hand in his own career. He co-wrote his next several hits, all of which made the R&amp;B Top Ten -- &quot;Hey Love,&quot; &quot;I Was Made to Love Her&quot; (an R&amp;B number one that went to number two pop in 1967), and &quot;For Once in My Life&quot; (another smash that reached number two pop and R&amp;B). Wonder's 1968 album For Once in My Life signaled his budding ambition; he co-wrote about half of the material and, for the first time, co-produced several tracks. The record also contained three more singles in the R&amp;B chart-topper &quot;Shoo-Be-Doo-Be-Doo-Da-Day,&quot; &quot;You Met Your Match,&quot; and &quot;I Don't Know Why.&quot; Wonder scored again in 1969 with the pop and R&amp;B Top Five hit &quot;My Cherie Amour&quot; (which he'd actually recorded three years prior) and the Top Ten &quot;Yester-Me, Yester-You, Yesterday.&quot; In 1970, Wonder received his first-ever co-production credit for the album Signed, Sealed &amp; Delivered; he co-wrote the R&amp;B chart-topper &quot;Signed, Sealed, Delivered I'm Yours&quot; with singer Syreeta Wright, whom he married later that year, and also scored hits with &quot;Heaven Help Us All&quot; and a rearrangement of the Beatles' &quot;We Can Work It Out.&quot; In addition, two other .Motown artists had major success with Wonder co-writes: the Spinners' &quot;It's a Shame&quot; and the Miracles' only pop number one, &quot;Tears of a Clown.&quot; 1971 brought a turning point in Wonder's career. On his 21st birthday, his contract with Motown expired, and the royalties set aside in his trust fund became available to him. A month before his birthday, Wonder released Where I'm Coming From, his first entirely self-produced album, which also marked the first time he wrote or co-wrote every song on an LP (usually in tandem with Wright) and the first time his keyboard and synthesizer work dominated his arrangements. Gordy was reportedly not fond of the work, and it wasn't a major commercial success, producing only the Top Ten hit &quot;If You Really Love Me&quot; (plus a classic B-side in &quot;Never Dreamed You'd Leave in Summer&quot;). Nonetheless, it was clearly an ambitious attempt at making a unified album-length artistic statement, and served notice that Wonder was no longer content to release albums composed of hit singles and assorted filler. Accordingly, Wonder did not immediately renew his contract with Motown, as the label had expected; instead, he used proceeds from his trust fund to build his own recording studio and to enroll in music theory classes at USC. He negotiated a new deal with Motown that dramatically increased his royalty rate and established his own publishing company, Black Bull Music, which allowed him to retain the rights to his music; most importantly, he wrested full artistic control over his recordings, as Gaye had just done with the landmark What's Going On. Freed from the dictates of Motown's hit-factory mindset, Wonder had already begun following a more personal and idiosyncratic muse. One of his negotiating chips had been a full album completed at his new studio; Wonder had produced, played nearly all the instruments, and written all the material (with Wright contributing to several tracks). Released under Wonder's new deal in early 1972, Music of My Mind heralded his arrival as a major, self-contained talent with an original vision that pushed the boundaries of R&amp;B. The album produced a hit single in the spacy, synth-driven ballad &quot;Superwoman (Where Were You When I Needed You),&quot; but like contemporary work by Hayes and Gaye, Music of My Mind worked as a smoothly flowing song suite unto itself. Around the same time it was released, Wonder's marriage to Wright broke up; the two remained friends, however, and Wonder produced and wrote several songs for her debut album. The same year, Wonder toured with the Rolling Stones, bringing his music to a large white audience as well. For the follow-up to Music of My Mind, Wonder refined his approach, tightening up his songcraft while addressing his romance with Wright. The result, Talking Book, was released in late 1972 and made him a superstar. Song for song one of the strongest R&amp;B albums ever released, Talking Book also perfected Wonder's spacy, futuristic experiments with electronics, and was hailed as a magnificently realized masterpiece. Wonder topped the charts .with the gutsy, driving funk classic &quot;Superstition&quot; and the mellow, jazzy ballad &quot;You Are the Sunshine of My Life,&quot; which went on to become a pop standard; those two songs went on to win three Grammys between them. Amazingly, Wonder only upped the ante with his next album, 1973's Innervisions, a concept album about the state of contemporary society that ranks with Gaye's What's Going On as a pinnacle of socially conscious R&amp;B. The ghetto chronicle &quot;Living for the City&quot; and the intense spiritual self-examination &quot;Higher Ground&quot; both went to number one on the R&amp;B charts and the pop Top Ten, and Innervisions took home a Grammy for Album of the Year. Wonder was lucky to be alive to enjoy the success; while being driven to a concert in North Carolina, a large timber fell on Wonder's car. He sustained serious head injuries and lapsed into a coma, but fortunately made a full recovery. Wonder's next record, 1974's Fulfillingness' First Finale, was slightly more insular and less accessible than its immediate predecessors, and unsurprisingly imbued with a sense of mortality. The hits, however, were the upbeat &quot;Boogie On, Reggae Woman&quot; (a number one R&amp;B and Top Five pop hit) and the venomous Richard Nixon critique &quot;You Haven't Done Nothin'&quot; (number one on both sides). It won him a second straight Album of the Year Grammy, by which time he'd been heavily involved as a producer and writer on Syreeta's second album, Stevie Wonder Presents Syreeta. Wonder subsequently retired to his studio .\nand spent two years crafting a large-scale project that would stand as his magnum opus. Finally released in 1976, Songs in the Key of Life was a sprawling two-LP-plus-one-EP set that found Wonder at his most ambitious and expansive. Some critics called it brilliant but prone to excess and indulgence, while others hailed it as his greatest masterpiece and the culmination of his career; in the end, they were probably both right. &quot;Sir Duke,&quot; an ebullient tribute to music in general and Duke Ellington in particular, and the funky &quot;I Wish&quot; both went to number one pop and R&amp;B; the hit &quot;Isn't She Lovely,&quot; a paean to Wonder's daughter, became something of a standard, and &quot;Pastime Paradise&quot; was later sampled for the backbone of Coolio's rap smash &quot;Gangsta's Paradise.&quot; Not surprisingly, Songs in the Key of Life won a Grammy for Album of the Year; in hindsight, though, it marked the end of a remarkable explosion of creativity and of Wonder's artistic prime. Having poured a tremendous amount of energy into Songs in the Key of Life, Wonder released nothing for the next three years. When he finally returned in 1979, it was with the mostly instrumental Journey Through the Secret Life of Plants, ostensibly the soundtrack to a never-released documentary. Although it contained a few pop songs, including the hit &quot;Send One Your Love,&quot; its symphonic flirtations befuddled most listeners and critics. It still made the Top Ten on the LP chart on Wonder's momentum alone -- one of the .stranger releases to do so. To counteract possible speculation that he'd gone off the deep end, Wonder rushed out the straightforward pop album Hotter Than July in 1980. The reggae-flavored &quot;Master Blaster (Jammin')&quot; returned him to the top of the R&amp;B charts and the pop Top Five, and &quot;Happy Birthday&quot; was part of the ultimately successful campaign to make Martin Luther King's birthday a national holiday (Wonder being one of the cause's most active champions). Artistically speaking, Hotter Than July was a cut below his classic '70s output, but it was still a solid outing; fans were so grateful to have the old Wonder back that they made it his first platinum-selling LP. In 1981, Wonder began work on a follow-up album that was plagued by delays, suggesting that he might not be able to return to the visionary heights of old. He kept busy in the meantime, though; in 1982, his racial-harmony duet with Paul McCartney, &quot;Ebony and Ivory,&quot; hit number one, and he released a greatest-hits set covering 1972-1982 called Original Musiquarium I. It featured four new songs, of which &quot;That Girl&quot; (number one R&amp;B, Top Five pop) and the lengthy, jazzy &quot;Do I Do&quot; (featuring Dizzy Gillespie; number two R&amp;B) were significant hits. In 1984, still not having completed the official follow-up to Hotter Than July, he recorded the soundtrack to the Gene Wilder comedy The Woman in Red, which wasn't quite a full-fledged Stevie Wonder album but did feature a number of new songs, including &quot;I Just .\nCalled to Say I Love You.&quot; Adored by the public (it was his biggest-selling single ever) and loathed by critics (who derided it as sappy and simple-minded), &quot;I Just Called to Say I Love You&quot; was an across-the-board number one smash, and won an Oscar for Best Song. Wonder finally completed the official album he'd been working on for nearly five years, and released In Square Circle in 1985. Paced by the number one hit &quot;Part Time Lover&quot; -- his last solo pop chart-topper -- and several other strong songs, In Square Circle went platinum, even if Wonder's synthesizer arrangements now sounded standard rather than groundbreaking. He performed on the number one charity singles &quot;We Are the World&quot; by USA for Africa and &quot;That's What Friends Are For&quot; by Dionne Warwick &amp; Friends, and returned quickly with a new album, Characters, in 1987. While Characters found Wonder's commercial clout on the pop charts slipping away, it was a hit on the R&amp;B side, topping the album charts and producing a number one hit in &quot;Skeletons.&quot; It would be his final release of the '80s; he didn't return until 1991, with the soundtrack to the Spike Lee film Jungle Fever. His next full album of new material, 1995's Conversation Peace, was a commercial disappointment, despite winning two Grammys for the single &quot;For Your Love.&quot; That same year, Coolio revived &quot;Pastime Paradise&quot; in his own brooding rap smash &quot;Gangsta's Paradise,&quot; which became the year's biggest hit. Wonder capitalized on the renewed notoriety by cutting a hit duet with Babyface, &quot;How Come, How Long,&quot; in 1996. Since then, Motown has released a number of remasters and compilations attempting to define and repackage Wonder's vast legacy. His far-reaching influence was felt in the neo-soul movement that came to prominence in the late '90s, and he also remained a composer of choice for jazz artists looking to incorporate harmonically sophisticated pop/R&amp;B tunes into their repertoires. That only scratches the surface of Wonder's impact on contemporary popular music, which is why he was inducted into the Rock 'n' Roll Hall of Fame in 1989, and remains a living legend regardless of whatever else he does. After a decade hiatus, Wonder returnted to the spotlight in autumn of 2005 with A Time 2 Love, a comeback album on par with his classic releases featuring a tour de force of guest appearances including &quot;So What the Fuss&quot;, which featured Prince on guitar.~ Steve Huey, All Music Guide\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n\n\n   \n   \n\n\n\n\n\n     \n\n\n\n     * AFTER DOWNLOADING PLEASE SEED SO OTHERS CAN DOWNLOAD THIS TORRENT AS WELL*\n\n\n  {IF EVERY ONE SEEDS TO A 3.0 % RATIO THE NEXT PERSON WILL GET THERE FILE QUICKER}\n\n                {THE MORE SEEDERS THERE ARE THE FASTER THE DOWNLOAD}\n\n\n                         {PLEASE ENJOY FROM THE VIRUSOFSATEN}\n          \n\n                                {LETS SHARE THE FILES}\t\n\n\n                         {SUPPORT THE BAY DOWNLOAD AND SEED}\n\n\n","torrent":{"xt":"urn:btih:03784c09d32f3c002eed93f093d5ed183a2bb6f8","amp;dn":"STEVIE+WONDER++-++I+JUST+CALLED+TO+SAY+I+LOVE+YOU-VIRUSOFSATEN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03784c09d32f3c002eed93f093d5ed183a2bb6f8","infoHashBuffer":{"type":"Buffer","data":[3,120,76,9,211,47,60,0,46,237,147,240,147,213,237,24,58,43,182,248]},"announce":[],"urlList":[]}}