{"title":"Ry Cooder Jazz","uid":7056944,"size":209280847,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:038d5223a1e9a5a975d7c428ab94af1227bb67f7&amp;dn=Ry+Cooder+Jazz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"akasyliphone","files":-1,"time":1330163774,"description":"Needledrop from  K56 488, West German mid 80s press in mint condition.\n\nEquipment used: Linn LP12, Lingo, Ekos and Dynavector XX2 moving coil cartridge, via   Naim 62 pre-amp into Pioneer PDR-609 CDR, using TDK audio CDR.\n\nArtwork from lp included.\n\nBeginning with his self-titled debut in 1970, Ry Cooder's records seemed to be as much history lesson as they were entertainment. Not because Cooder was trying to club you over the head with this stuff; he simply gravitated to great songs, no matter what the era or genre. Released in 1978, Jazz seems to be his first conscious attempt at a concept album, in the historical sense. Here he pays homage to some of the early tunes and masters of jazz, ranging from the late 1800s through the &quot;coon songs&quot; of the early part of the next century, to the ragtime and &quot;Spanish&quot; music of Jelly Roll Morton, and the sophistication of cornetist Bix Beiderbecke. The only living artist (at the time of release) whos represented here is the great Bahamian guitarist Joseph Spence, who recorded from the 50s through the 80s, and whose syncopated style was extremely influential in Cooder's own development as a guitarist. Spence's sacred songs are presented here in string and brass band arrangements that emphasize the Caribbean connection between his music and Morton's habaniera pieces. The complexity of the material on Jazz, as well as the arrangements by Joseph Byrd, dictate that this is Cooder's most polished and orchestrated effort to date. Whereas in the past, even at their most removed, Cooders records usually kept at least one foot in rock &amp; roll or blues, Jazz can, at times, lack some of that fire and be almost bookish in its approach. Still, there is enough excitement in the music's intricacies and Cooders beautiful, fluid playing to forgive the politeness of some of the performances. From the informative liner notes by Ry Cooder himself to the brilliant compositions, Jazz is, at the very least, educational. But, a little time spent with this music and you'll see why it was and continues to be relevant, as well as beloved.\n\n\nAllmusic","torrent":{"xt":"urn:btih:038d5223a1e9a5a975d7c428ab94af1227bb67f7","amp;dn":"Ry+Cooder+Jazz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"038d5223a1e9a5a975d7c428ab94af1227bb67f7","infoHashBuffer":{"type":"Buffer","data":[3,141,82,35,161,233,165,169,117,215,196,40,171,148,175,18,39,187,103,247]},"announce":[],"urlList":[]}}