{"title":"Men Trapped in Men's Bodies: Narratives of Autogynephilic Transs","uid":8309030,"size":176620836,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:03a85c774655ec5c9b4805ae98db194104e207f8&amp;dn=Men+Trapped+in+Men%27s+Bodies%3A+Narratives+of+Autogynephilic+Transs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"trentrent","files":1,"time":1364430770,"description":"Some Previews:\n[img]http://i.imgur.com/pd4K4Yi.jpg[/img]\n[img]http://i.imgur.com/r72Qnv6.jpg[/img]\n[img]http://i.imgur.com/KCkR5vl.jpg[/img]\n[img]http://i.imgur.com/qDzn5OO.jpg[/img]\n[img]http://i.imgur.com/ubCSasb.jpg[/img]\n\nBook Description:\nThere are few topics in sex research as compelling and confounding to researchers, clinicians, and the general public as that of transsexualism. Upending normative notions of gender, eroticism, and identity, it poses significant scientific and clinical challenges. The book addresses a fascinating and largely unexplored topic within the study of transsexualism: The feelings and desires of conventionally masculine men who are attracted to women yet want to become women themselves. Through a collection and discussion of vivid first-person narratives, the book provides an in-depth examination of these men's unusual propensity to be sexually aroused by the thought of themselves as women and how these men's sexual feelings influence their decisions to seek or undergo sex reassignment. \n\nThese narratives about autogynephilia by autogynephilic male-to-female (MtF) transsexuals provide the first comprehensive documentation of the erotic ideation that underlies the most common form of MtF transsexualism. The narratives provide empirical evidence for Blanchard's theory of MtF transsexual motivation, and thus are of interest to researchers and theorists studying the phenomenology of MtF transsexualism.\n\nThe narratives are likely to be eye-opening to psychologists, psychiatrists, physicians, and other professionals who work with MtF transsexuals: Most clinicians probably do not fully appreciate the erotic underpinnings of their clients' condition. A better understanding of their clients' autogynephilic feelings and motivations would enable these professionals to provide more empathetic and effective clinical care.\n","torrent":{"xt":"urn:btih:03a85c774655ec5c9b4805ae98db194104e207f8","amp;dn":"Men+Trapped+in+Men%27s+Bodies%3A+Narratives+of+Autogynephilic+Transs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03a85c774655ec5c9b4805ae98db194104e207f8","infoHashBuffer":{"type":"Buffer","data":[3,168,92,119,70,85,236,92,155,72,5,174,152,219,25,65,4,226,7,248]},"announce":[],"urlList":[]}}