{"title":"Monsters - Seasons 1-3 (Complete)","uid":4868666,"size":13219478134,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:047680c3498aee196ce359ea0ba06a2cb1e909f4&amp;dn=Monsters+-+Seasons+1-3+%28Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"BloodLogic","files":74,"time":1240673223,"description":"Monsters (1988-1991) - Seasons 1-3 (Complete)\n(1988-1991) (Sci-Fi Channel * NBC Universal Chiller)\n[Suspense ~ Horror ~ SciFi / Science Fiction ~ Fantasy ~ Thriller]\n\nSeasons 1-3 (Complete)\nRipped By Unknown\nDelivered to the MySpleen.Net Network by RoboGigante\nDelivered to the Public by BloodLogic\n\nScreenshots (for season 1): &lt;a href=&quot;\nhttp://bayimg.com/cApeHAABe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/cApeHAABe&lt;/a&gt;\nScreenshots (for season 2): &lt;a href=&quot;\nhttp://bayimg.com/cApEkAABE&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/cApEkAABE&lt;/a&gt;\nScreenshots (for season 3): &lt;a href=&quot;\nhttp://bayimg.com/CaPEOaabE&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/CaPEOaabE&lt;/a&gt;\n\nSee a young Steve Buscemi try to survive in a cheesy horror film; Meat Loaf launching his brief career in serious acting; and an infant David Spade plays a psychotic, knife-'em-up killer. How can you even resist?\n\nDescription: In a similar vein to Tales from the Darkside, Monsters shared the same producer (Richard P. Rubenstein), and in some ways succeeded the show (which had ended the same year in which Monsters began). It differed in some respects nonetheless. While Tales sometimes dabbled in stories of science fiction and fantasy, this series was more strictly horror. As the name implies, each episode of Monsters (with very few exceptions) featured a different monster which the story concerned, from the animatronic puppet of a fictional children's television program to mutated, weapon-wielding lab rats. Similar to Tales, however, the stories in Monsters were rarely very straightforward action plots and often contained some ironic twist in which a character's conceit or greed would do him in, often with gruesome results. Adding to this was a sense of comedy often lost on horror productions which might in some instances lighten the audience's mood (often deceptively) but in many cases added to the overall eeriness of the production.\n\nWIKI: http://en.wikipedia.org/wiki/Monsters_(TV_series)\nIMDB: http://www.imdb.com/title/tt0094512/\n\nProducers: Richard P. Rubenstein, Bill Siegler.\nCreators: Mitchell Galin, Richard P. Rubenstein.\n\nDirectors: Michael Gornick, Ted Gershundy, Jerry Smith, David Misch, Dick Benner, Jeffrey Wolf, Mark Rezyka, Alan Kingsberg, Carl Stine, Mark Shostrum, Peter Michael Stone, Frank DePalma, Michael Brandon, Richard Friedman, Allen Couther, Warner Shook, Ernest Farino, Michael McDowell, Allan Coulter, John Auerbach, Manny Goto, Michael Powell, Michael Warren Powell, Scott Alexander, Jean Patenaude, Brian Thomas Jones, Christopher Todd, Ted Gerdshuny, Bette Gordon, Sara Driver, Paul Boyington, Alex Zamm, Haskell Barkin, Tom Noonan, Ken Meyers, Steve Tolkin, T.K. Hudson, David Severeid, Roger Nygard, John Strysik, Tom Abrahms, Bruno Spandello, P. J. Pesce, Brian Jones, Robert Megginson, Philip Alderton, John Tillinger, Bruce Feirstein, Tom Whelan, Randall Moldave, Wiliam Wesley.\n\nWriters: Dick Benner, John Sunderland, Michael Reaves, Alan Kingsberg, David Odell, Michael Parry, F. Paul Wilson, Bob Schneider, D. Emerson Smith, Michael Bishop, Larry Charles, David Chaskin, Michael Kimball, Julie Selbo, Barbara Boatner, Joseph Anderson, Michael McDowell, Keith Mano, Peg Haller, Kenneth Pressman, Bob Baladan, Martin Olson, Robert Sheckley, Josef Anderson, Harvey Jacobs, Thomas Babe, Ted Gerdshuny, David Morrell (II), June Selbo, Jule Selbo, Paul Dini, Dan Simmons, Emerson Smith, Haskell Barkin, Tom Noonan, Allen Coulter, Gordon Rayfield, Scott Alexander, John Fox, Alan Bogue, Robert Megginson, Gahan Wilson, Bruce Feirstein, Ron Goulart, Jonathan Valin.\n\nStarring (in season 1): Katie Dierlam, David McCallum, John C. Vennema, Abby Lewis, Patrick Garner, Michele Gornick, Marilyn Jones, Perry Lang, Pamela Dean Kenny, Neil Smith, Michael Anderson, Andrea Thompson, Lewis J. Stadlen, MacIntyre Dixon, Elaine Bromka, Robert Lansing, John Bolger, Page Hannah, Jack Koenig, Sylvia Short, Ed Wheeler, Tempestt Bledsoe, Steve Harper, Marcella Lowery, Eugene Byrd, Franco Harris, Meat Loaf/MeatLoaf, Regina Wells, Drew Eliot, Frank Tarsia, Lara Harris, Mary Ann Gibson, Kevin Jeffries, Kin Shriner, Russell Johnson, Wayne Toth, Brenda White, Beth Toussaint, Tom Mason, Irving Metzman, Rebecca Downs, Page Johnson, John Diehl, Mary Woronov, Ruth DeSosa, Laraine Newman, Alex Cord, Terrence Evans, Jeff Conaway, Mary Cadorette, T.J. Castronovo, Debbie Carrington, Jenna von Oy, Brian Fitzpatrick, Ken Walker, Mark Hofmaier, Peggy Cass, Frank Gorshin, Mary Griffin, Ann Hilary, Elizabeth Franz, Tom Gilroy, Finn Carter, David L. Lander, Keith Mackechnie, Rich Hall, Karen Haber, Edye Byrde, Mary Jo Keenen, Neal Jones, Dan Frazer, Tori Spelling, Ashley Laurence, Sasha Jenson, Byron Thames, Tom Woodruff Jr., Kent McCord, Teri Copley, Betty Carvalho, Antonio Hoyos, Billy Drago, Silvana Galardo, Kim Johnston Ulrich, Erik Holland, Adrienne Barbeau, James Morrison, Brandon Bluhm, Eddie Velez, Chris Noth, Deborah Strang, Danny Gerard, Glynis Barber, William Prince, Brian Brophy, Linda Blair, Rob Morrow, Maria Tucci.\n\nStarring (in season 2): Imogene Coca, Gregory Grove, Gary Roberts, Darren McGavin, Cheryl Russell, Beeson Carroll, Laurie Kennedy, Lydia Cornell, Marc McClure, Kaye Ballard, Mark Nasser, Mitchell Whitfield, Rachel Jones, Robert Weil, Olivia Brown, Henry Brown, Ron Woods, Valentina Quinn, Fred Pinkard, Soupy Sales, Stephanie Philips, Bobo Lewis, George Hall, Fritz Weaver, Richard Edson, Gina Gershon, Ed Korens, Eddie Deezen, Richard Moll, Jeff Silverman, Karen Hensel, Louis Mustillo, Curt Lowens, Barbara Billingsley, George D. Wallace, Catherine Blue, Mary Dean, Claudia Silver, Byron Minns, Frankie Faison, Melba Moore, Valerie Wildman, Nick Ramus, Leif Garrett, Pamela Dean Kenney, Sarah Trigger, Louise Roberts, Patrick Breen, Frederick Wessler, Lili Taylor, Jodie Markell, Charles Kay Hune, Steve Buscemi, Danielle Ferland, Robert Olivieri, Kate McGregor, Rockets Redglare, Kate McGregor-Stewart, Robert Oliveri, Kenneth Danzinger, Sarah Buxton, Raphael Sbarge, Jerry Stiller, Anne Meara, Robert Clohessy, Amy Stiller, Karen Shallo, Karen Hittleman, Bob Larkin, Robert Krantz, Orson Bean, Jan Munroe, Rick Goldman, Calvin Levels, John Scott Clough, Barry Nelson, David Parmenter, Belle Avery, Troy Donahue, S.A. Griffin, Judy Geeson, Peter White, Philip Abbott, Zach Overton, Abe Vigoda, John Bolger, Brad Greenquist, Kim Greist, Sharon Schlarth, Kelli Rabke, Calvin Armitage, Annie Corley, Michael O'Gorman, Carlos Lauchu.\n\nStarring (in season 3): Carol Lynley, Victor Raider-Wexler, Scott J. Weir, Kathleen McCall, Marvin Kaplan, Marvin Kapland, Teresa Ganzel, Miriam Flynn, Joe Flaherty, Juliette Kurth, Robert Kerbeck, Karen Sillas, Geno Silva, Ferdinand Mayne, Maxwell Caulfield, Juliet Mills, Tony Dean Fields, Mitchell McCormack, Antone Pagan, Glenn Kubota, Ahmad Rashad, Julie Brown, Kevin Nealon, Peggy Rea, David Spade, Matt LeBlanc, Wil Wheaton, John O'Leary, Al Mancini, George Reinholt, Karen Valentine, John Schiappa, Leo Garcia, Doug McKeon, Stephen Burleigh, Carrington Garland, Robert Valenzi, Christine Dunford, Charlotte Booker, Christopher Shaw, Richard Borg, Mason Adams, Don Butler, Tom McDermott, Dan Butler, Ed Lauter, Donald Smyth, Bill Potts, Farley Granger, Carole Shelley, Lindsay Schwartz, Lynn Frazen-Cohen, Michael Anderson, Jeff Ware, Deborah Van Valkenburgh, Priscilla Shanks, Richard M. Hughs, Mart Hulswit, Richard Clarke, John Saxon, Denise Gentile, Lisa Waltz, Christian LeBlanc, Tony Shalhoub, Clifton James, John Robert Bloom, John Costigan, John Christopher Jones, Deborah Harry, Rick Aviles, Luis Guzman, Wendy Makkena, Tony Spiridakis, Morton Downey Jr., Laura Branigan, Lori Krebs, Philip Stewart, Julie Wilson, Rick Wexler, Shelley Berman, David Leary, Richard Belzer, Geraldine Leer, David Speilberg, Teri Ann Linn, Ed Marinaro, Dennis Christopher, Pam Grier, William Lanteau, Tracey Walter, Eddie Bracken, Philip Anglim, Carla Herd, Sharon Cornell, Alice Playten, Tom Noonan.\n\nVLC Player Compatible (verson # 0.9.9): {Tested and Confirmed}\n\nSeason 1...\n\nS1E01 - The Feverman\nS1E02 - Holly's House\nS1E03 - New York Honey\nS1E04 - The Vampire Hunter\nS1E05 - My Zombie Lover\nS1E06 - Where is the Rest of Me\nS1E07 - The Legacy\nS1E08 - Sleeping Dragon\nS1E09 - Pool Sharks\nS1E10 - Pillow Talk\nS1E11 - Rouse Him Not\nS1E12 - Fools' Gold\nS1E13 - Glim-Glim\nS1E14 - Parents from Space\nS1E15 - The Mother Instinct\nS1E16 - Their Divided Self\nS1E17 - Taps\nS1E18 - The Match Game\nS1E19 - Rain Dance\nS1E20 - The Cocoon\nS1E21 - All In A Day's Work\nS1E22 - Satan in the Suburbs\nS1E23 - Mannequins of Horror\nS1E24 - La Strega\n\nSeason 2...\n\nS2E01 - The Face\nS2E02 - Portrait of the Artist\nS2E03 - A Bond of Silk\nS2E04 - Rerun\nS2E05 - Love Hurts\nS2E06 - The Farmer's Daughter\nS2E07 - Jar\nS2E08 - The Demons\nS2E09 - Reaper\nS2E10 - The Mandrake Root\nS2E11 - Half as Old as Time\nS2E12 - Museum Hearts\nS2E13 - Habitat\nS2E14 - Bed and Boar\nS2E15 - Mr. Swlabr\nS2E16 - Perchance to Dream\nS2E17 - One Wolf's Family\nS2E18 - The Offering\nS2E19 - Far Below\nS2E20 - Micro Minds\nS2E21 - Refugee\nS2E22 - The Gift\nS2E23 - The Bargain\nS2E24 - The Family Man\n\nSeason 3...\n\nS3E01 - Stressed Environment\nS3E02 - Murray's Monster\nS3E03 - Bug House\nS3E04 - Cellmates\nS3E05 - Outpost\nS3E06 - The Hole\nS3E07 - Small Blessings\nS3E08 - A Shave and a Haircut, Two Bites\nS3E09 - The Young and the Headless\nS3E10 - The Waiting Game\nS3E11 - Sin-Sop\nS3E12 - A New Woman\nS3E13 - Malcolm\nS3E14 - Household Gods\nS3E15 - The Space Eaters\nS3E16 - The Waiting Room\nS3E17 - Leavings\nS3E18 - Desirable Alien\nS3E19 - A Face for Radio\nS3E20 - Werewolf of Hollywood\nS3E21 - Talk Nice to Me\nS3E22 - Hostile Takeover\nS3E23 - The Maker\nS3E24 - The Moving Finger\n\n[Episode Guide Included.]\n\n[BLX Note: I had to make only one small correction to these files. S2E22 had a blank right-speaker channel, so I just copied the left speaker data over. That was all the necessary fixing. Enjoy!]\n\n[BLX Note 2: This torrent is dedicated to Robbie Tolan, shot while unarmed by police in his own driveway. Where the hell are all these rednecks and NRA nutbags who always talk about &quot;our right to bear arms is so we can be protected from the state&quot;? Well, as far as I see it, the state is killing people openly in the streets, and none of the officers are being charged with murder. Instead of practicing what they preach, these National-Rifle-Association dirtbags are only responsible when a three year old girl blows her head off while messing with her father's gun cabinet. Yes, those guns need to be at home, in the hands of your daughter's corpse, as the police are uninhibited in the slaughter of the common people. And yet, there is no attempted murder charge! A grand jury has been planned to whitewash the whole incident, and at best, shooting someone in the chest is aggravated assault!! He'll get a week's paid vacation and then be back on the force, killing blacks again in no time. That's because it's not a crime for the police to murder and oppress the people -- it's the government's accepted policy. The fourteenth amendment is very clear: equal enforcement of the law before all citizens. But if you're poor and broke, shooting someone in the chest gets you fifteen years. If you're a cop, you get a week of vacation, and then rehired. At anywhere in the structure of the government, there's a chance for someone to do something. The district attorney could press charges, the police officers could make an arrest of their murdering brethren, the governor could order trials, the judges could sign warrants of arrest -- but when a black man is gunned down at his own home by the police, everyone with power knows how to shut up! Throw those marijuana users into prison, but keep those murdering pigs on our streets. You can either disarm the police, or enforce the laws against them that they break. If your government can't do that, then there's no such thing as an innocent participant in your state. In the words of Martin Luther King, &quot;THOSE WHO MAKE PEACEFUL REVOLUTION IMPOSSIBLE, MAKE VIOLENT REVOLUTION NECESSARY!&quot;]\n\nThis torrent is a part of Operation: Massive Information Leak, Wave Three.\nBloodLogic","torrent":{"xt":"urn:btih:047680c3498aee196ce359ea0ba06a2cb1e909f4","amp;dn":"Monsters+-+Seasons+1-3+%28Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"047680c3498aee196ce359ea0ba06a2cb1e909f4","infoHashBuffer":{"type":"Buffer","data":[4,118,128,195,73,138,238,25,108,227,89,234,11,160,106,44,177,233,9,244]},"announce":[],"urlList":[]}}