{"title":"Operation Terror (2012) and best 9-11 videos","uid":11954477,"size":2748710601,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:0480fb9c90d0d5f2fe915b3f263e1b7659f98d52&amp;dn=Operation+Terror+%282012%29+and+best+9-11+videos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"romcomsrock","files":5,"time":1432335358,"description":"This is an MP4 file with 1080p resolution.\n\nOperation Terror (2012) puts together the under-reported events of the 9/11 attacks into a gripping political thriller. The movie includes Able Danger, the arrest of Zacarias Moussaoui, BBC announcing the collapse of Building 7 before it happened, nanothermite in the World Trade Center, the empty hole in Shanksville, the small hole in the Pentagon, Dick Cheney in the White House EOC, the NASA facility in Cleveland, and much, much more. Even though there are fictional characters mixed in with the real perpetrators and victims, viewers will discover more truth in this feature film than they would by watching a decade of nightly news programs.\n\nJames McCullough, from the mysterious &quot;Council&quot;, assigns CIA agent Aaron Delgado to implement a plan to attack the World Trade Center and the Pentagon and pin the blame on Muslim Terrorists. Delgado and fellow agents, Phillip Singer and Chase Jordan, work with a group of unsuspecting engineers to develop unmanned jets to hit the Twin Towers and the Pentagon. The CIA agents have to deal with an increasingly suspicious George Poole, the lead engineer working on the drones. Also the Army and the FBI begin to uncover the plot, forcing Delgado to shut down their investigations. On the day of the attacks, Delgado becomes livid as the media reports on the destruction of WTC Building 7 before it is blown up and that there are no signs of planes hitting the Pentagon and the supposed crash site of Flight 93.\n\n-------\n\nAs a bonus, this torrent contains the best book on 9/11: David Ray Griffin's &quot;New Pearl Harbor Revisited&quot; (2008), and a list of links to best 9/11 videos","torrent":{"xt":"urn:btih:0480fb9c90d0d5f2fe915b3f263e1b7659f98d52","amp;dn":"Operation+Terror+%282012%29+and+best+9-11+videos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0480fb9c90d0d5f2fe915b3f263e1b7659f98d52","infoHashBuffer":{"type":"Buffer","data":[4,128,251,156,144,208,213,242,254,145,91,63,38,62,27,118,89,249,141,82]},"announce":[],"urlList":[]}}