{"title":"Dirty Vegas - Days Go By (Oakenfold Vox Remix).VOB","uid":6079788,"size":195670016,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:0488af0bf0dc26c0845793a73f43457c2c03d0b3&amp;dn=Dirty+Vegas+-+Days+Go+By+%28Oakenfold+Vox+Remix%29.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1294063681,"description":"Dirty Vegas - Days Go By (Oakenfold Vox Remix).VOB\n\n\n\nVery HQ rare promo music video. &quot;Days Go By&quot; is a 2001 song by the band Dirty Vegas from their eponymous album. The song became a radio hit in 2002, peaking at #14 in the U.S., and received the Grammy Award for Best Dance Recording. It also peaked at #16 in Dirty Vegas' home country, the U.K. &quot;Days Go By&quot; received significant public exposure in a commercial for the 2003 Mitsubishi Eclipse.\n\nThis music video for the song is unusual in that it largely consists of two dancers representing one character performing a routine of popping, locking, the robot and breakdancing. The performance occurs in front of Chroni's Famous Sandwich Shop in East Los Angeles, California, and tells the story of a dancer who shows up once a year and dances all day from sunrise to sunset. He dances in hopes of bringing back a lost love, who left him because he couldn't stop dancing. (The video even halts abruptly while some of the bystanders interject what they think happened to the aforementioned love.) The young dancer in the video is Garland Spencer. The older dancer is Byron McIntyre. The clue that both men represent the same character at different ages is provided by the dancer's shoes. The older dancer wears high-top Converse sneakers that are faded, scuffed, and one shoe is actually taped to hold it together; whereas the young dancer wears a clean, bright-red version of the same sneakers. \nAccording to the video's story, the man's lost love purchased the original sneakers for him as a gift, and now he wears them as part of his annual dance ritual. The sneakers match the style and attire of the young dancer in his sweatsuit (presumably in the 1980s), but pose a striking contrast for the older dancer who is otherwised attired in a suit, tie, and suspenders.\n\nThere are two versions of the music video; one has 3 of the onlookers observing from the restaurant while the other replaces those shots with shots of the same onlookers in a silver Mitsubishi Eclipse sitting at a stoplight. In addition to the replaced shots, the Eclipse version of the video includes footage of the approach to and departure from the stoplight. The implication in the Eclipse version is that the onlookers within the automobile arrived at the stoplight in the morning and remained in that same spot watching the dance ritual all day, before leaving the stoplight at sunset.\n '.' Edited Oakenfold Vox Remix promo video version '.'\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Days_Go_By_(Dirty_Vegas_song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Days_Go_By_(Dirty_Vegas_song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/nacHoaADG&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/nacHoaADG&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 768x480 (4:3) 29.97fps 9000kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 384kbps\n   Duration: 00:05:36\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Just updated September 7, 2010!\n\n*Media Player Classic Home Cinema*        &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n","torrent":{"xt":"urn:btih:0488af0bf0dc26c0845793a73f43457c2c03d0b3","amp;dn":"Dirty+Vegas+-+Days+Go+By+%28Oakenfold+Vox+Remix%29.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0488af0bf0dc26c0845793a73f43457c2c03d0b3","infoHashBuffer":{"type":"Buffer","data":[4,136,175,11,240,220,38,192,132,87,147,167,63,67,69,124,44,3,208,179]},"announce":[],"urlList":[]}}