{"title":"Autodesk Revit Architecture 2014 Essentials: Autodesk Official P","uid":8752189,"size":44772170,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:053a1e99f501e4994cd66119e86b7270f8b08490&amp;dn=Autodesk+Revit+Architecture+2014+Essentials%3A+Autodesk+Official+P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"-nelly-","files":-1,"time":1375055481,"description":"  Autodesk Revit Architecture 2014 Essentials: Autodesk Official Press - -nelly-\n  ==============================================================================\n\n\n\nQuickly learn essential Revit Architecture tools and techniques Autodesk Revit Architecture is the powerful, sophisticated building information modeling (BIM) software that has transformed the architectural design industry. This Autodesk Official Press guide is the perfect introduction to the powerful software for architects, designers, and students. Three Revit experts provide concise explanations, real-world examples, and plenty of hands-on exercises and tutorials. You'll soon master the basics and then find yourself using the software confidently, productively, and effectively. Beginners will get comfortable with Revit's core features and functions. Current users will have a valuable reference to refresh and hone their skills. And everyone can use this practical book to help prepare for the Revit Architecture certification exams. Gets readers up and running on Autodesk Revit Architecture 2014, Autodesk's industry-leading building information modeling software Explains core Revit tools, features, functionality, real-world workflows, and BIM concepts Covers schematic design, modeling, families, views, creating drawing sets, and more Features best practices, rendering and visualization, worksharing, documentation, and annotation Provides downloadable starting and ending files, so readers can compare their work to that of the pro's Autodesk Revit Architecture 2014 Essentials is your perfect introduction toto the powerful industry-leading BIM software.\n\nAuthor: Ryan Duell, Tobias Hathorn, Tessa Reist Hathorn\nTitle: Autodesk Revit Architecture 2014 Essentials: Autodesk Official Press\nPublisher: Wiley\nYear: 2013\nISBN: 978-1-118-57508-6\nFormat: PDF\n\n\n=================================================================\n\n\n-nelly- home page at The Pirate Bay link below:\n\n  &lt;a href=&quot;\nhttp://thepiratebay.se/user/-nelly-/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/-nelly-/&lt;/a&gt;\n\n\nCheck out the new PirateWiki!\n\n           &lt;a href=&quot;\nhttps://forum.suprbay.org/wiki/index.php?title=Portal:Main_Page&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/wiki/index.php?title=Portal:Main_Page&lt;/a&gt;\n\n\nFor re-seed requests, help, support or anything else relating to The Pirate Bay. You'll find it all, and more, at suprbay. The official support forum of The Pirate Bay. Visit it at the link below:\n\n  &lt;a href=&quot;\nhttps://forum.suprbay.org/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/index.php&lt;/a&gt; \n\n\n\n","torrent":{"xt":"urn:btih:053a1e99f501e4994cd66119e86b7270f8b08490","amp;dn":"Autodesk+Revit+Architecture+2014+Essentials%3A+Autodesk+Official+P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"053a1e99f501e4994cd66119e86b7270f8b08490","infoHashBuffer":{"type":"Buffer","data":[5,58,30,153,245,1,228,153,76,214,97,25,232,107,114,112,248,176,132,144]},"announce":[],"urlList":[]}}