{"title":"Jorge Amado - Dona Flor and Her Two Husbands (pdf)","uid":8604191,"size":6395698,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:057a42cb845da395dfd24c4406a9918f1472542d&amp;dn=Jorge+Amado+-+Dona+Flor+and+Her+Two+Husbands+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1371961281,"description":"Jorge Amado - Dona Flor and Her Two Husbands (Avon Books, 1966). 521 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nVery popular novel, first published in 1966 and adapted into a film in the 70s, by Brazil's most famous novelist.\n\ndescription:\n\nWhen Dona Flor's husband dies suddenly, she forgets all his defects and remembers only his passion. Erotic nightmares haunt her. Dr Teodoro, a local pharmacist, proposes marriage and Dona Flor accepts, hoping to recapture the ecstasy she now craves. One night, her first husband materializes naked at the foot of her bed, eager to reclaim his conjugal rights. The visit is the first of many, as Dona Flor, racked by desire but reluctant to betray the upright pharmacist, responds to the ethereal demands of her first husband. &quot;Dona Flor and Her Two Husbands&quot; shows why Jorge Amado is Brazil's best-known writer. It is the work of a brilliant story-teller whose love for his characters matches his powers of evocation. This is an epic book.\n\nReview\n\n&quot;Bawdy, brilliant, human and humorous . . . full of unexpected delights--everything a modern novel should be.&quot; - The Denver Post \n\n&quot;A charismatic storyteller. . . . No other Latin American writer is more genuinely admired by his peers, nor has any other exerted so great a creative influence on the course of Latin American fiction.&quot; - The New York Times Book Review\n\n&quot;A sentimental masterpiece.&quot; - Los Angeles Times; \n\n&quot;Poetic, comical and very human.&quot; - Chicago Tribune\n\n&quot;One of the greatest writers . . . also one of the most entertaining.&quot; - Mario Vargas Llosa","torrent":{"xt":"urn:btih:057a42cb845da395dfd24c4406a9918f1472542d","amp;dn":"Jorge+Amado+-+Dona+Flor+and+Her+Two+Husbands+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"057a42cb845da395dfd24c4406a9918f1472542d","infoHashBuffer":{"type":"Buffer","data":[5,122,66,203,132,93,163,149,223,210,76,68,6,169,145,143,20,114,84,45]},"announce":[],"urlList":[]}}