{"title":"Der Rauber aka The Robber 2010 DVDRip Sonata Premiere","uid":9112377,"size":693854906,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:05949df933a8ed3f27fd028f3b38368d5d08d79c&amp;dn=Der+Rauber+aka+The+Robber+2010+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"klinho","files":4,"time":1382970831,"description":"Directed by Benjamin Heisenberg (Sleeper) and starring established actor Andreas Lust (Revanche), The Robber is slated to open in New York City on April 29, 2011, at the Lincoln Plaza and Cinema Village. The film will expand to other US and Canadian markets during the spring and summer of 2011. Based on a novel by the Austrian author Martin Prinz, and shot on location in Vienna, The Robber was one of the most critically acclaimed films featured at last year's New York Film Festival. The film was also an official selection at the 2010 Berlin and Toronto Film Festivals. The film's main character, Johann Rettenberger, was inspired by the life of Austrian bank-robber and runner Johann Kastenberger, a man who set records in long-distance races while - in the rest of his free time - secretly knocked over bank after bank. Widely referred to as &quot;Pump-gun Ronnie,&quot; after the Ronald Reagan mask he wore and the shotgun used on the assaults, Rettenberger still holds the record time in the Bergmarathon, a famous race held in the Austrian Alps. Deprived of by-the-books psychological motivations and character development, The Robber paints a visceral picture of pathological compulsion and it is the rare character portrait that also excels as an action film.\n\n\n\nSubs srt: Portuguese / English / Spanish","torrent":{"xt":"urn:btih:05949df933a8ed3f27fd028f3b38368d5d08d79c","amp;dn":"Der+Rauber+aka+The+Robber+2010+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05949df933a8ed3f27fd028f3b38368d5d08d79c","infoHashBuffer":{"type":"Buffer","data":[5,148,157,249,51,168,237,63,39,253,2,143,59,56,54,141,93,8,215,156]},"announce":[],"urlList":[]}}