{"title":"Emily Jane White - Dark Undercoat 2oo7","uid":3912508,"size":52683681,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0630ba8d98fa0bcded9eef68ac157266a5db3716&amp;dn=Emily+Jane+White+-+Dark+Undercoat+2oo7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"staywizu","files":12,"time":1196250519,"description":"Emily Jane White is a rare solo performer who can cut through noisy club din and turn antsy foot traffic into apt listeners. Her voice pierces the egos of those within earshot; it&amp;#039;s a low, lilting alto, often compared to Chan Marshall and Hope Sandoval. Ghostly melodies float through her songs on ornate piano passages and simple guitar figures. But no matter how you find your way into White&amp;#039;s world, it&amp;#039;s easy to stay there. Like the best songwriters, the San Franciscan leaves room for the listener&amp;#039;s subjectivity, with lyrics that read more like a Cormac McCarthy novel than a diary entry.\n\nWhite developed her brand of &quot;dark folk,&quot; at UC Santa Cruz in the early &amp;#039;00s. Her vision was shaped by both classic country and blues songwriters (and contemporary fare like Nick Cave and P.J. Harvey) and her discovery of cultural mythologies through the American Studies program. Although the Santa Cruz music scene provided White a comfortable place to develop her sound, she lacked the confidence to go beyond the house-show circuit with her band the Diamond Star Halos. A post-collegiate sojourn in France increased her sense of self-reliance and further shaped her outlook. &quot;My experience of the world became more vague, spiritual, strange, less concrete,&quot; she explains. Playing music to a warm Bordeaux audience provided new encouragement. People she met there wondered &quot;why I didn&amp;#039;t have a CD out, why I wasn&amp;#039;t touring, why wasn&amp;#039;t I on a record label,&quot; White explains. &quot;And I didn&amp;#039;t really know what to say.&quot;\n\nIn 2006, White moved to San Francisco and started performing with new musicians under her own name. Her debut album Dark Undercoat, which will be released in September on Oakland&amp;#039;s Double Negative Records, draws on five years of songwriting, collecting together songs that &quot;felt the most tangible.&quot; Indeed, the album has a warm physicality; you can feel the weight of her fingers on the keys. The song &quot;Wild Tigers I&amp;#039;ve Known&quot; features a particularly beautiful lead melody accompanied only by graceful piano passages and a brief vocal harmony. Though the song was written for Cam Archer&amp;#039;s film of the same name, it is movie-like on its own; visually rich and starkly scored. And like the rest of White&amp;#039;s work, it demands a repeat audience.\n\n\nTrackList:\n\n01 Bessie Smith            \n02 Hole In The Middle      \n03 Dark Undercoat          \n04 Dagger   \n05 Time On Your Side       \n06 The Demon \n07 Sleeping Dead           \n08 Blue\n09 Wild Tigers I Have Known\n10 Two Shots To The Head  \n\nspecial thanks to steven [at] ukoo . net","torrent":{"xt":"urn:btih:0630ba8d98fa0bcded9eef68ac157266a5db3716","amp;dn":"Emily+Jane+White+-+Dark+Undercoat+2oo7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0630ba8d98fa0bcded9eef68ac157266a5db3716","infoHashBuffer":{"type":"Buffer","data":[6,48,186,141,152,250,11,205,237,158,239,104,172,21,114,102,165,219,55,22]},"announce":[],"urlList":[]}}