{"title":"The Mighty Mighty Bosstones - Discography [FLAC]","uid":8832030,"size":3373431858,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:064ba4175d59961679f0454d779dbb6c255b61bd&amp;dn=The+Mighty+Mighty+Bosstones+-+Discography+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":4,"uploader":"politux","files":-1,"time":1377010209,"description":"\n  The Mighty Mighty Bosstones - Discography (1990-2009) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Ska-Punk, Third Wave Ska Revival, Punk-Pop\n  Source: CD\n  Codec: FLAC\n  Bit Rates: ~ 800 - 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  1990 Devil's Night Out\n  1991 Where'd You Go\n  1992 More Noise and Other Disturbances\n  1993 Ska-Core, The Devil and More\n  1994 Question the Answers\n  1997 Let's Face It\n  1997 So Far So Good\n  1997 The Impression That I Get (Single)\n  1998 Live from the Middle East\n  2000 Pay Attention\n  2002 A Jackknife to a Swan\n  2005 The Best of \n  2009 The Impossible Dream\n\n  A great deal of the groundwork for the mid- to late-'90s explosion of ska and ska-metal was laid by the Mighty Mighty Bosstones, who were one of the first bands to cross high-energy ska with hardcore punk and heavy metal and who also helped shift its tone toward testosterone-filled party music. The Bosstones built up a devoted cult following throughout their career, but their level of commercial success never quite matched that of more pop-oriented third wave ska bands, like No Doubt and Sublime, who followed in their wake; however, the band did achieve a long-overdue breakthrough in 1997 with the modern rock radio smash &quot;The Impression That I Get.&quot;\n\n  The Mighty Mighty Bosstones formed in 1985 in Boston, featuring Tim Bridewell, Dicky Barrett (vocals), Nate Albert (guitar), Joe Gittleman (bass), Josh Dalsimer (drums), and Tim &quot;Johnny Vegas&quot; Burton (saxophone), plus dancer Ben Carr. While all the members shared a love of ska, their tastes also ran elsewhere; Barrett, in particular, was involved in the local straight-edge hardcore scene and played with a band called Impact Unit. Originally calling themselves simply The Bosstones, the group appended &quot;Mighty Mighty&quot; to their name after discovering a Boston-area a cappella group with an identical moniker. The group appeared on a ska compilation, but then disbanded temporarily to allow Albert to finish high school. In 1989, The Bosstones re-formed and recorded their debut album, Devils Night Out, which was released in 1990 on Taang! Records. The follow-up, 1992's More Noise and Other Disturbances, saw several personnel shifts; Bridewell and Dalsimer departed, the latter to attend college, and the two were replaced by drummer Joe Sirois, saxophonist Kevin Lenear, and trombonist Dennis Brockenborough, a lineup that lasted through much of the band's career. 1992 also saw the release of the Where'd You Go EP, which contained several hard rock covers.\n\n  In 1993, The Bosstones signed a major-label deal with Mercury and released Don't Know How to Party; in spite of their fondness for plaid, a holdover from their early pajama-clad gigs, the group also landed a television commercial for a jean company. 1994 saw the band paying homage to their hardcore roots with a mini-album of mostly covers, Ska-Core, the Devil and More, as well as the full-length Question the Answers, one of their finest efforts. A year later, The Bosstones appeared in the film Clueless, performing &quot;Where'd You Go&quot; and &quot;Someday I Suppose,&quot; two of their most popular numbers; they also landed a main-stage slot on that summer's Lollapalooza tour.\n\n  Even if their music often strays far afield from classic 2 Tone ska revival (especially their earlier material), The Bosstones, unlike many of their contemporaries, have retained some of that movement's political consciousness. In 1996, the band helped organize the Safe and Sound benefit album in response to Boston-area family planning clinic slayings, and also perform frequently at benefit shows for battered women's groups; most of their concerts also feature information booths from the Anti-Racist Action Group. In 1997, the breakthrough of ska-pop bands like No Doubt and Sublime paved the way for the accessible, 2 Tone-inspired Let's Face It to become the band's biggest-selling album yet; it was eventually certified platinum, buoyed by the success of the anthemic &quot;The Impression That I Get,&quot; which fell just short of topping the modern rock charts that summer. Live from the Middle East followed in 1998 as a stopgap release, and the band experienced its first personnel shifts in some time: saxophonist Lenear was the first to leave, replaced by Roman &quot;The Showman&quot; Fleysher, and guitarist Albert departed again, partly to care for an ailing family member and partly to finish his education at Brown University (Kevin Stevenson of the Shods had already served as his temporary touring substitute in 1997). Albert's replacement, Lawrence Katz, signed on after the band completed the follow-up to Let's Face It; titled Pay Attention, the record was released in the spring of 2000 and produced another modern rock radio hit in &quot;So Sad to Say.&quot; A Jackknife to a Swan appeared two years later, as did a split with Madcap.","torrent":{"xt":"urn:btih:064ba4175d59961679f0454d779dbb6c255b61bd","amp;dn":"The+Mighty+Mighty+Bosstones+-+Discography+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"064ba4175d59961679f0454d779dbb6c255b61bd","infoHashBuffer":{"type":"Buffer","data":[6,75,164,23,93,89,150,22,121,240,69,77,119,157,187,108,37,91,97,189]},"announce":[],"urlList":[]}}