{"title":"[BlacksOnBlondes] Kaylee Hilton Interracial at Blacks On Blondes","uid":9750584,"size":364101412,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:06d6ae114d48e3de3978bb9b9e515a59b9e8a2cf&amp;dn=%5BBlacksOnBlondes%5D+Kaylee+Hilton+Interracial+at+Blacks+On+Blondes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"xuluhulu","files":1,"time":1394657365,"description":"Kaylee Hilton's overworked father is about to smell the sweet scene of interracial sex once he comes back home. The apple of his eye is going taboo twofold: She's going to fuck on camera for the first time WITH a big, black cock. When the cat's away the black cock slut will play. Kaylee Hilton has just finished watching Flash Brown decimate some white boys on the basketball court. His moves got her soaking in her cheerleader outfit, and the thought of his black cock in her ass was too much to pass up. Once in her father's office Kaylee laid on some heavy duty flirting which got Flash' black schlong at full attention. The sheer size of his big,black cock was overwhelming for Kaylee but she didn't let it stop her from trying to suck it all down. The spit coming from her mouth landed partially on Flash' cock and partly on papa's work desk. Kaylee had to feel the same black cock inside her that's all the rage of her white girlfriends and she was soon getting impaled on 12 inches of South Central salami. Kaylee's creamy pussy juices slowly rub off on a black cock that's as long as her forearm. The true test of this girl's dedication to black cock comes in the form of her gaping sphincter which is now only taking reservations for black cock. Flash takes his time as to not rip her in half and the moans coming from Kaylee will now be burned into your head. Kaylee's entry into the interracial sex hall of fame was a lock when she took 12 inches of black gunk right across the face.\n\nSCREENS:\n &lt;a href=&quot;\nhttp://imghoney.com/viewer.php?file=39608029139505010136.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imghoney.com/viewer.php?file=39608029139505010136.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imghoney.com/viewer.php?file=64930889772739643723.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imghoney.com/viewer.php?file=64930889772739643723.jpg&lt;/a&gt;\n\n\nSEED &amp; ENJOY!!!\t\n","torrent":{"xt":"urn:btih:06d6ae114d48e3de3978bb9b9e515a59b9e8a2cf","amp;dn":"%5BBlacksOnBlondes%5D+Kaylee+Hilton+Interracial+at+Blacks+On+Blondes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06d6ae114d48e3de3978bb9b9e515a59b9e8a2cf","infoHashBuffer":{"type":"Buffer","data":[6,214,174,17,77,72,227,222,57,120,187,155,158,81,90,89,185,232,162,207]},"announce":[],"urlList":[]}}