{"title":"Cold War Submarines: The Design and Construction of U.S. and Sov","uid":10228267,"size":16736437,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0733fbc8957accbebfbffa716bff014f05d24cf2&amp;dn=Cold+War+Submarines%3A+The+Design+and+Construction+of+U.S.+and+Sov&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1401115157,"description":"Cold War Submarines: The Design and Construction of U.S. and Soviet Submarines, 1945-2001\nby Norman Polmar, K.J. Moore\n\nDESCRIPTION:\n\nAnalyzes the development of U.S. and Soviet submarines during the Cold War - Uses materials obtained from the former Soviet submarine design bureaus - Includes numerous photographs and drawings, many never before published, illustrating U.S. and Soviet submarine designs Submarines had a vital, if often unheralded, role in the superpower navies during the Cold War. Their crews carried out intelligence-collection operations, sought out and stood ready to destroy opposing submarines, and, from the early 1960s, threatened missile attacks on their adversary's homeland, providing in many respects the most survivable nuclear deterrent of the Cold War. For both East and West, the modern submarine originated in German U-boat designs obtained at the end of World War II. Although enjoying a similar technology base, by the 1990s the superpowers had created submarine fleets of radically different designs and capabilities. Written in collaboration with the former Soviet submarine design bureaus, Norman Polmar and K. J. Moore authoritatively demonstrate in this landmark study how differing submarine missions, antisubmarine priorities, levels of technical competence, and approaches to submarine design organizations and management caused the divergence.","torrent":{"xt":"urn:btih:0733fbc8957accbebfbffa716bff014f05d24cf2","amp;dn":"Cold+War+Submarines%3A+The+Design+and+Construction+of+U.S.+and+Sov","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0733fbc8957accbebfbffa716bff014f05d24cf2","infoHashBuffer":{"type":"Buffer","data":[7,51,251,200,149,122,204,190,191,191,250,113,107,255,1,79,5,210,76,242]},"announce":[],"urlList":[]}}