{"title":"Peter &amp; Gordon - I Go To Pieces (1965) + True Love Ways (196","uid":8686903,"size":422486137,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:076b1adcc5a438fd53762ecbc04fc16392e04444&amp;dn=Peter+%26amp%3B+Gordon+-+I+Go+To+Pieces+%281965%29+%2B+True+Love+Ways+%28196&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":36,"time":1373822432,"description":"This is the same torrent that was uploaded to Demonoid in June 2008.\n\n\nPeter &amp; Gordon - I Go To Pieces (1965) + True Love Ways (1965) [1998]\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/416WJPGBTCL._SL500_AA240_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/416WJPGBTCL._SL500_AA240_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nTracks have full tags (including embedded thumbnail).\nAll artwork in jpgs at 300 d.p.i. Rotated and cropped losslessly using jpegcrop.\nAMG Bio.txt\nAMG Review.txt\nNotes.txt (which is simply these notes included in the torrent)\n\nBio Excerpt from All Music:\n\nIn June 1964, Peter &amp; Gordon became the very first British Invasion act after the Beatles to take the number one spot on the American charts with &quot;A World Without Love.&quot; That hit, and their subsequent successes, were due as much or more to their important connections as to their talent. ...\n\n... a sort of Everly Brothers-styled duo for the British Invasion that faintly prefigured the folk-rock of the mid-'60s. ...\n\nTo read the entire bio: &lt;a href=&quot;\nhttp://wc04.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:kifexqr5ldhe~T1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://wc04.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:kifexqr5ldhe~T1&lt;/a&gt;\n\nAll Music Album Reviews:\n\nI Go To Pieces (1965)\n---------------------\nThe duo's third album was a versatile but patchy collection. And there was no getting around it: The best tracks, as was the case in many acts of the era, were the hits -- &quot;I Go to Pieces&quot; and the less well-remembered brassy, pounding &quot;Don't Pity Me.&quot; They were at their best when they were at their folkiest, as on their nice cover of the Everly Brothers' &quot;Sleepless Nights&quot; and the decent original &quot;Tears Don't Stop,&quot; which wouldn't have sounded out of place in the Searchers' repertoire. But they weren't well-equipped to tackle bluesy rock and folk oldies, as they tried to do with Elvis Presley's &quot;All Shook Up&quot; and &quot;A Mess of Blues,&quot; Doris Troy's &quot;Whatcha Gonna Do About It&quot; (done better by the Hollies), and Leadbelly's &quot;Good Morning Blues&quot;). Still, it's a slightly above-average British Invasion pop/rock album. It's included in its entirety as half of the two-for-one package I Go to Pieces/True Love Ways on Collectables, which adds their fourth album, True Love Ways, and their 1967 hit &quot;Sunday for Tea.&quot;\n\nFrom: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:h9fexqr5ldhe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:h9fexqr5ldhe&lt;/a&gt;\n\nTrue Love Ways (1965)\n---------------------\nPeter &amp; Gordon branched further from their initial pop-folky British Invasion harmony sound on their fourth album, with erratic results. There was an increased tilt toward heavy orchestrated ballads, which could work very well at times, as on the title track, a worthy updating of the old Buddy Holly song (and a big hit on both sides of the Atlantic). Their less impressive reworking of &quot;To Know Him Is to Love Him&quot; (retitled &quot;To Know You Is to Love You&quot;) made the Top Five in Britain. However, they weren't well-suited to soul covers like &quot;Cry to Me,&quot; and on their solo vocal showcases (Gordon Waller on Smokey Robinson's &quot;Who's Lovin' You&quot; and Peter Asher on &quot;Any Day Now&quot;), they overextend themselves without the support of a harmonizing partner. As for the better tracks, their cover of the Everly Brothers' &quot;Crying in the Rain&quot; was a natural choice, and the melodramatically arranged &quot;Hurtin' Is Lovin'&quot; and the folkier &quot;I Told You So&quot; are two of their better originals. Want some dig-deep trivia? The opening notes of their cover of Del Shannon's &quot;Broken Promises&quot; are identical to the opening notes of the subsequent Neil Young composition &quot;Flying on the Ground Is Wrong,&quot; done by Buffalo Springfield on their first album. True Love Ways is included in its entirety as half of the two-for-one package I Go to Pieces/True Love Ways on Collectables, which adds their third album, I Go to Pieces, and their 1967 hit &quot;Sunday for Tea.&quot;\n\nFrom: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:j9fexqr5ldhe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:j9fexqr5ldhe&lt;/a&gt;\n\nTrack List (the tracks of the two albums appear to be scrambled and some may be missing):\n\n01. I Go To Pieces\n02. Sleepless Nights\n03. Tears Don't Stop\n04. If You Wish\n05. All Shook Up\n06. Whatcha Gonna Do 'Bout It\n07. Good Morning Blues\n08. Someone Ain't Right\n09. A Mess Of Blues\n10. I Still Love You\n11. I Don't Care What They Say\n12. Don't Pity Me\n13. Cry To Me\n14. To Know You Is To Love You\n15. I Told You So\n16. Who's Lovin' You\n17. Any Day Now (My Wild Beautiful Bird)\n18. Crying In The Rain\n19. Hurtin' Is Lovin'\n20. Broken Promises\n21. When The Black Of Your Eye Turns To Grey\n22. True Love Ways\n23. Sunday For Tea\n","torrent":{"xt":"urn:btih:076b1adcc5a438fd53762ecbc04fc16392e04444","amp;dn":"Peter+%26amp%3B+Gordon+-+I+Go+To+Pieces+%281965%29+%2B+True+Love+Ways+%28196","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"076b1adcc5a438fd53762ecbc04fc16392e04444","infoHashBuffer":{"type":"Buffer","data":[7,107,26,220,197,164,56,253,83,118,46,203,192,79,193,99,146,224,68,68]},"announce":[],"urlList":[]}}