{"title":"[EPUB/PDF] Ken Wilber - Boomeritis","uid":6857759,"size":3705626,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:078844976a848db4d998b6780a18bf46b22a9c5d&amp;dn=%5BEPUB%2FPDF%5D+Ken+Wilber+-+Boomeritis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"asperge","files":3,"time":1322764398,"description":"Wilber here introduces concepts discussed in his Integral Psychology in the form of a highly entertaining postmodernist novel. Wilber's central character, also named Ken Wilber, is a student at MIT who is energized by his belief that within 30 years artificial intelligence (AI) will have so progressed that humans can upload their consciousness and move from carbon-based to silicon-based life forms. One day he stumbles into an integral psychology seminar and comes to realize that what humans do with these next 30 carbon-based years will greatly affect the AI of the future. The entire seminar is presented within the framework of the novel, along with lunchtime synthesis and analysis presented by Ken and his friends (representatives of Gen X and Y), with Ken's sexual fantasies intruding at regular intervals. Integral psychology is based on levels of consciousness, along with the belief that Gen X and Y will be the first to enter the second tier of consciousness. The boomers came close but then got bogged down in egocentrism and ethnocentrism. Unfortunately, as Ken and his friends are discovering, boomers are ruling the world and trying to perpetuate their flawed philosophies. Boomeritis is destined to be a cult classic and is recommended for all libraries.","torrent":{"xt":"urn:btih:078844976a848db4d998b6780a18bf46b22a9c5d","amp;dn":"%5BEPUB%2FPDF%5D+Ken+Wilber+-+Boomeritis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"078844976a848db4d998b6780a18bf46b22a9c5d","infoHashBuffer":{"type":"Buffer","data":[7,136,68,151,106,132,141,180,217,152,182,120,10,24,191,70,178,42,156,93]},"announce":[],"urlList":[]}}