{"title":"Coast to Coast AM June 27, 2013 - Surveillance, Crazy Ants, CO2,","uid":8648732,"size":56705660,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:088309efd964dea513e81d22cb59824de6f5648e&amp;dn=Coast+to+Coast+AM+June+27%2C+2013+-+Surveillance%2C+Crazy+Ants%2C+CO2%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pyramid91","files":5,"time":1373050080,"description":"MP3 version wins!\nCourtesy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\n\nDate:\n06-27-13\nHost:\nGeorge Noory\nGuests:\nLinda Moulton  Howe,                   John  Hogue\nInvestigative reporter Linda Moulton Howe discussed the NSA's dragnet collection of phone and computer records, concern over the Crazy Ant invasion, the increase of CO2 emissions and changes in the jet stream, and the continuing unexplained boom phenomenon. In her first report, she spoke with Patrick Toomey of the ACLU, which is preparing a lawsuit against various intelligence agency defendants. &quot;It's a shame that the United States which fashions itself and believes itself to be really a pillar of liberty for the whole world, that we seem to be the first society exercising this ability to capture and compile and store the records of every communication or phone call that Americans make,&quot; Toomey lamented. He added that even if we put our faith in our current government, there is risk that eventually citizens' information will be used in ways that are inconsistent with democratic values and government accountability. More here. \nThe &quot;crazy ant,&quot; so named because it doesn't travel in straight lines, has spread from Texas to Louisiana, Mississippi and Florida challenging pest removal companies, authorities and homeowners who have literally been overrun in some cases. The ants forage together in the millions and devour so many insects that bird populations are being driven elsewhere to look for food. She interviewed entomologist Prof. Robert Puckett who said the density of the ants can become overwhelming. &quot;I've seen infestations where there were loads and loads of ants crawling around inside the house...I've literally seen trash bags full of ants,&quot; he remarked. The crazy ants which are strangely attracted to electrical wiring and components (and have caused much damage), are not easily eradicated, and states may have to develop quarantine procedures, said Puckett. Further info. \nIn her third report, Linda detailed how CO2 emissions jumped 1.4% in 2012 alone, largely from Chinese industries. Now the U.K.'s University of Sheffield reports new data that &quot;unusual changes in the jet stream circulation caused exceptional surface melt of the Greenland Ice Sheet in summer 2012 - a record for at least the last 50 years.&quot; Further, updated computer models project our planet is likely to warm by 6.5 to 9.5 degrees Fahrenheit by the end of the century - doubling the original projections made just ten years ago. She interviewed Prof. Edward Hanna with the Univ. of Sheffield, who said because of these conditions, we'll see an increase in extreme weather. More. \nUpdating her investigation into the unexplained boom phenomenon, she talked with John Nyberg, a retired USAF Captain, who heard a loud explosive sound on June 10th and again on June 21st in Jamestown, North Dakota. According to the anonymous geophysicist she's been communicating with for the past couple of months, Earth core changes are the cause of the mysterious booms, light flashes and even increasing sinkholes since 2011. She spoke with Stanford University geophysicist Arianna Gleason, who explained what is known about the still-mysterious Earth's inner cores. Further info. \nProphecy Update\nFirst hour guest, prophecy expert John Hogue shared an update on his predictions. Back in April, he noted that 2013 was the 'Year of the Snake,' and the Obama administration would face major scandals, and now we're seeing that come to pass with the NSA spying revelations coming out. Looking toward 2016, he foresees the Republicans taking back the White House, with possibly Jeb Bush making a run. In terms of the environment, he cited an &quot;invisible&quot; supervolcano in the Arctic as pumping massive amounts of methane into the environment, along with the effects of increased fracking, which will lead to a cataclysmic &quot;climate cascade&quot; by 2017-18.  \nNews segment guests: Lauren Weinstein, Jeff Nelken\nWebsite(s):\n earthfiles.com\n hogueprophecy.com\nbook(s):\n Mysterious Lights and Crop Circles\n Glimpses of Other Realities, Volume 2\n Predictions for 2013-2014\n","torrent":{"xt":"urn:btih:088309efd964dea513e81d22cb59824de6f5648e","amp;dn":"Coast+to+Coast+AM+June+27%2C+2013+-+Surveillance%2C+Crazy+Ants%2C+CO2%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"088309efd964dea513e81d22cb59824de6f5648e","infoHashBuffer":{"type":"Buffer","data":[8,131,9,239,217,100,222,165,19,232,29,34,203,89,130,77,230,245,100,142]},"announce":[],"urlList":[]}}