{"title":"Joaquin Diaz - Merengue Alegre (arhoolie)","uid":8310838,"size":175270634,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0969366f26711fd9758289c2d8218285adc00c78&amp;dn=Joaquin+Diaz+-+Merengue+Alegre+%28arhoolie%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":23,"time":1364432117,"description":"Diaz sings and plays accordion on a mixture of traditional songs and original compositions on this lively merengue album, accompanied by the sort of rhythm section found in the traditional style of perico ripiao: guiro (a scraped metallophone) and tambora. Although this music has some resemblance to Tex-Mex conjunto music in the instrumentation (particularly the accordion and vocals), to North Americans who might be wearying of the wealth of similar-sounding conjunto combos, this is considerably more interesting. The tempos are so fast that it can initially be disorienting, as if these are Tex-Mex conjunto records playing at the wrong speed. But it's not just speed for speed's sake: The rhythms are cleverly syncopated and varied, and there's a cheerful urgency to the vocals and playing not always in found in other, similar forms of Latin American folk-based music. The original Spanish lyrics and their English translations are printed for about half the songs, and these are much in keeping with the energy of the record: exhortations to dance and celebrate and expressions of regional pride. ","torrent":{"xt":"urn:btih:0969366f26711fd9758289c2d8218285adc00c78","amp;dn":"Joaquin+Diaz+-+Merengue+Alegre+%28arhoolie%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0969366f26711fd9758289c2d8218285adc00c78","infoHashBuffer":{"type":"Buffer","data":[9,105,54,111,38,113,31,217,117,130,137,194,216,33,130,133,173,192,12,120]},"announce":[],"urlList":[]}}