{"title":"Chemical Kinetics of Solids","uid":12076856,"size":20582178,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0a7cc703860908356b1c4ef7366a6c0a16e4a1e0&amp;dn=Chemical+Kinetics+of+Solids&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"clouderone","files":1,"time":1435662546,"description":"Chemical Kinetics of Solids - H. Schmalzried (Wiley).pdf\n\nMany different chemical processes take place inside solids or at solid surfaces and interfaces. However, their quantitative description sometimes seems difficult to understand. This book by Professor Schmalzried, author of the eminently successful Solid State Reactions; bridges the gap between the 'physical' and 'chemical' approaches to this subject because it is written in a language which both sides understand. For the first time, a comprehensive coverage of the rapidly developing field of Solid State Kinetics is available. \nThe topics covered in this book go far beyond diffusional transport. Homogeneous and heterogeneous solid-state reactions, phase transitions or the influence of external fields are also treated in detail. With this background, the author explains e.g. charge transport mechanisms in ionic conductors, principles of sensor technology, or oxidation processes clearly and comprehensibly. \nThis book is a must for every solid-state chemist and an indispensable tool for academic and industrial readers alike","torrent":{"xt":"urn:btih:0a7cc703860908356b1c4ef7366a6c0a16e4a1e0","amp;dn":"Chemical+Kinetics+of+Solids","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a7cc703860908356b1c4ef7366a6c0a16e4a1e0","infoHashBuffer":{"type":"Buffer","data":[10,124,199,3,134,9,8,53,107,28,78,247,54,106,108,10,22,228,161,224]},"announce":[],"urlList":[]}}