{"title":"Nanomaterials and Nanotechnology for Composites","uid":15430173,"size":20846377,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0a9e438d8c50c6024b654c1d85c15f82eda8a9fe&amp;dn=Nanomaterials+and+Nanotechnology+for+Composites&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1469717020,"description":"Nanomaterials and Nanotechnology for Composites - A.K. Haghi et al. (AAP, 2015).pdf\r\n\r\nEngineered nanopolymer and nanoparticles, with their extraordinary mechanical and unique electronic properties, have garnered much attention in recent years. With a broad range of potential applications, including nanoelectronics, composites, chemical sensors, biosensors, microscopy, nanoelectromechanical systems, and many more, the scientific community is more motivated than ever to move beyond basic properties and explore the real issues associated with carbon nanotube-based applications.\r\n\r\nEngineered nanopolymer and nanoparticles are exceptionally interesting from a fundamental research point of view. They open up new perspectives for various applications, such as nano-transistors in circuits, field-emission displays, artificial muscles, or added reinforcements in alloys. This informative book is an introduction to the physical concepts needed for investigating carbon nanotubes and other one-dimensional solid-state systems. Written for a wide scientific readership, each chapter consists of an instructive approach to the topic and sustainable ideas for solutions.\r\n\r\nThis new book presents leading-edge research in this dynamic field. It reviews the recent progress in application of engineered nanopolymer and nanoparticles and their composites. The advantages and disadvantages of different methods are discussed. The ability of continuum methods to bridge different scales is emphasized.\r\n\r\nRecommendations for future research are given by focusing on what each method has to learn from the nano-scale. The scope of the book is to provide current knowledge to support researchers entering the scientific area of carbon nanotubes and help them choose the appropriate modeling tool for accomplishing their study and where to place their efforts to further improve continuum methods","torrent":{"xt":"urn:btih:0a9e438d8c50c6024b654c1d85c15f82eda8a9fe","amp;dn":"Nanomaterials+and+Nanotechnology+for+Composites","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a9e438d8c50c6024b654c1d85c15f82eda8a9fe","infoHashBuffer":{"type":"Buffer","data":[10,158,67,141,140,80,198,2,75,101,76,29,133,193,95,130,237,168,169,254]},"announce":[],"urlList":[]}}