{"title":"Catalysis in the Refining of Fischer-Tropsch Syncrude","uid":12074537,"size":2300142,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0aede622f40382cfb8209711dfa72908ec0ce24f&amp;dn=Catalysis+in+the+Refining+of+Fischer-Tropsch+Syncrude&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1435600670,"description":"Catalysis in the Refining of Fischer-Tropsch Syncrude - Arno de Klerk and Edward Furimsky (RSC, 2010).pdf\n\nISBN: 978-1-84973-080-8\n\nFischer-Tropsch Synthesis (FTS) has been used on a commercial scale for more than eighty years. It was initially developed for strategic reasons because it offered a source of transportation fuels that was independent from crude oil. Unlike crude, Fischer-Tropsch synthetic crude is rich in olefins and oxygenates, while being sulphur and nitrogen free. Consequently, the catalysis involved in refining it is significantly different and only a few catalysts have been developed for the purpose. Until now, an account of this topic has been missing from the literature, despite mounting interest in the technology. This is the first book to provide a review and analysis of the literature (journal and patent) on the catalysis needed to refine syncrude to transportation fuels. It specifically highlights the impact of oxygenates and how oxygenates affect selectivity and deactivation. This aspect is also related to the refining of biomass derived liquids. Topics covered include: dimerisation / oligomerisation, isomerisation / hydroisomerisation, catalytic cracking / hydrocracking and hydrogenation, catalytic reforming, aromatic alkylation, etherification, dehydration, and some oxygenate and wax specific conversions","torrent":{"xt":"urn:btih:0aede622f40382cfb8209711dfa72908ec0ce24f","amp;dn":"Catalysis+in+the+Refining+of+Fischer-Tropsch+Syncrude","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0aede622f40382cfb8209711dfa72908ec0ce24f","infoHashBuffer":{"type":"Buffer","data":[10,237,230,34,244,3,130,207,184,32,151,17,223,167,41,8,236,12,226,79]},"announce":[],"urlList":[]}}