{"title":"Stewart Swerdlow on Coast to Coast July 2007 - (Anc!ent)","uid":4845103,"size":89170276,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:0b094fee3ef83f1ed5eeb955fd8fe4bd030c1a44&amp;dn=Stewart+Swerdlow+on+Coast+to+Coast+July+2007+-+%28Anc%21ent%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Ancient_Prime","files":1,"time":1239648973,"description":"94 Min.\nSpecial This Show Everyone Must Hear!!!!!\n\nStewart Swerdlow on Coast to Coast July 2007. \nAuthor Stewart Swerdlow spoke \nabout a Reptilian race which lives underground and first \ncame here over 800,000 years ago. This information was \nimparted to him, he claimed, during the 13 years he served \nas an experimental subject in a government-sponsored mind \ncontrol project in Montauk, NY. Between 200,000 to 300,000 \npeople were experimented on in Montauk, and most of them \ndid not survive, he said. Now, mind control can be employed \nworldwide via satellites, he noted. Among the details Swerdlow \nshared about the Reptilians: They originated in the Draco star \nsystem, and arrived in our solar system via hollowed-out asteroids. \nThey colonized a Pacific content called Lemuria and later battled \nwith the Atlanteans. Eventually they formed a hybrid race with the \nAtlanteans. It is from this group that the Illuminati or ruling \nfamilies descended. There are seven different species in the \nDraco empire. One type has white segmented skin, cat-like eyes, \nwings, and a pronounced jaw and teeth. The Illuminati are planning \na &quot;staged alien invasion&quot; to trick people into forming a one-world \ngovernment and they'll use holographic technology to project imaginary \nbattles, Swerdlow warned. Ultimately, they seek to send millions of \npeople out to colonize habitable moons of Jupiter and Saturn, he added. \nLiterary Credits include: Blue Blood-True Blood, The Healers Handbook, \nThe Hyperspace Helper","torrent":{"xt":"urn:btih:0b094fee3ef83f1ed5eeb955fd8fe4bd030c1a44","amp;dn":"Stewart+Swerdlow+on+Coast+to+Coast+July+2007+-+%28Anc%21ent%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b094fee3ef83f1ed5eeb955fd8fe4bd030c1a44","infoHashBuffer":{"type":"Buffer","data":[11,9,79,238,62,248,63,30,213,238,185,85,253,143,228,189,3,12,26,68]},"announce":[],"urlList":[]}}