{"title":"Logan's Run (1975)-DVDRip-Xvid-gimmeshelter.avi","uid":4109085,"size":729911296,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0b102d0b51381a071c57f3516b23ea046cce77dd&amp;dn=Logan%5C%27s+Run+%281975%29-DVDRip-Xvid-gimmeshelter.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"gimmeshelter","files":1,"time":1206962850,"description":"In the 23rd century, the survivors of a holocaust now lives within a domed city that is sealed off from the outside world. In the domed city, men and women live in a society where you can only live until you are 30-years old (due to population control and limited resources), the people have two choices: They can either take part in a extermination ceremony called &quot;Carousel&quot; where they are promised of being reborn or they can go on the run and escape to outside the domed city. Logan 5 is a Sandman, a elite policeman whose job is terminate all &quot;Runners&quot; who refuse to be exterminated on Carousel and escape to outside the city. When Logan finds a symbol, the computer that controls all life in the city, gives Logan a undercover assignment to find and destroy a mysterious place called Sanctuary by posing as a runner, by removing the last four years of his life from his life crystal. Now on the run himself, and hunted by his partner and best friend Francis 7, Logan and a woman named Jessica 6 working for a underground resistance group that are helping all Runners search for Sanctuary escapes from the domed city and find themselves in a devastated Washington D.C, where Logan and Jessica discover another world and find there is much to live for and Logan begins to question the system.","torrent":{"xt":"urn:btih:0b102d0b51381a071c57f3516b23ea046cce77dd","amp;dn":"Logan%5C%27s+Run+%281975%29-DVDRip-Xvid-gimmeshelter.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b102d0b51381a071c57f3516b23ea046cce77dd","infoHashBuffer":{"type":"Buffer","data":[11,16,45,11,81,56,26,7,28,87,243,81,107,35,234,4,108,206,119,221]},"announce":[],"urlList":[]}}