{"title":"Passport To Pimlico - Audio Comedy Drama - MP3 - Slimoo","uid":5717794,"size":68533230,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0b2ed5fc6b3b5f19d98dfbfd2aec83fc95d92466&amp;dn=Passport+To+Pimlico+-+Audio+Comedy+Drama+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_Slimoo_","files":1,"time":1280173865,"description":"Passport To Pimlico - Audio Drama - BBC Radio 4\n1 x 70 Minute Episode - 128Kbps - Mp3 - Slimoo \n\nThanks to Velvet\n\n\nPassport to Pimlico is a 1949 British comedy film made by Ealing Studios. \n\nA bomb left over from the Second World War blows up in Miramont Gardens in the Pimlico district of London after some local children roll a tractor tyre down a hole. The explosion reveals a buried cellar from the manor house that gave Miramont Gardens its name, in which artwork, coins, jewellery and an ancient parchment document are found. Professor Hatton-Jones authenticates it as a royal charter of Edward IV that ceded the house its estates to Charles VII (&quot;the Rash&quot;), the last Duke of Burgundy, when he sought refuge there several centuries ago after being presumed dead at the Battle of Nancy. As the charter had never been revoked, Pimlico is legally part of Burgundy. &quot;\n\nThe British government has no legal jurisdiction and requires the Burgundians to form a committee according to the laws of the long-defunct dukedom before negotiating with them. Ancient Burgundian law requires that the Duke himself appoint a council. \nWithout one, all seems lost - until a young man from Dijon steps forward and proves that he is the heir to the dukedom. \n\nVery quickly, Burgundy (followed soon after by the rest of London) realises that it is not subject to post-war rationing and other bureaucratic restrictions, and the district is quickly flooded with entrepreneurs, crooks and eager shoppers. A noisy free-for-all ensues, the Chief (and only) Constable of Burgundy, finds himself unable to handle. \n\nThen the British authorities close the &quot;border&quot; with barbed wire. Having left England without their passports, the bargain hunters have trouble returning home - as one policeman replies to an indignant woman, &quot;Don't blame me Madam, if you choose to go abroad to do your shopping.&quot;\n\n\n\n\n\nCast:\nGeorge Cole \nJoan Sims \nJohn Junkin \nStephen Critchlow \nJonathan Tafler \nDavid Collings \nTeresa Gallagher\nGavin Muir \nMichael Maloney \nJonathan Keeble \nJohn Hartley \nDavid King \nTom Bevan \nLouise Lombard \nVivian Pickles \nRoss Livingstone \nDiana Coupland \nPaul Jenkins \nLinda Regan \nJohn Redford \nMatthew Marr\n\n\nH Clark (Author)\nJohn Peacock (adap)\nCelia de Wolfe (Producer)\n\n\n\n\nAudio Format    : MP3\nDuration Approx : 71mn 23s\nBit rate mode   : Constant\nBit rate        : 128 Kbps \nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n \n\n\n[","torrent":{"xt":"urn:btih:0b2ed5fc6b3b5f19d98dfbfd2aec83fc95d92466","amp;dn":"Passport+To+Pimlico+-+Audio+Comedy+Drama+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b2ed5fc6b3b5f19d98dfbfd2aec83fc95d92466","infoHashBuffer":{"type":"Buffer","data":[11,46,213,252,107,59,95,25,217,141,251,253,42,236,131,252,149,217,36,102]},"announce":[],"urlList":[]}}