{"title":"Car and Driver Magazine Collection PDF MEGAPACK [CARG]","uid":7380798,"size":1987830626,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0b35c94c4bff41673c1326eef5516ec70e91efa3&amp;dn=Car+and+Driver+Magazine+Collection+PDF+MEGAPACK+%5BCARG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"Hard2Find2","files":-1,"time":1340493949,"description":"CARG Release Car and Driver Magazine Collection PDF MEGAPACK. \n\n\n\nBe sure to check out the other CARG PDF release's. To show your support for the time and effort in building this collection, Please seed at full speed during and after download so that others can also enjoy.\n\n\n\nThis collection contains 35 Car and Driver Magazine Pdf files. They are from January of 2010 to the current issue at the time of the collection upload August of 2012 with 3 Buyer's Guide issues included.\n\n\n\n\n\n\n\n\nCar and Driver (sometimes abbreviated C/D) is an American automotive enthusiast magazine. Its total circulation is 1.31 million. It is owned by Hearst Magazines, who purchased prior owner Hachette Filipacchi Media U.S. in 2011. Originally headquartered in New York City, the magazine has been based in Ann Arbor, Michigan since the late 1970s.\n\nCar and Driver was founded as Sports Cars Illustrated in 1955. In its early years, the magazine focused primarily on small, imported sports cars. In 1961, editor Karl Ludvigsen renamed the magazine Car and Driver to show a more general automotive focus. 2005 marked the 50th anniversary of Car and Driver .\n \nCar and Driver once featured Bruce McCall, Jean Shepherd, Dick Smothers, and Brock Yates as columnists, and PJ O'Rourke as a frequent contributor. Former editors include William Jeanes and David E. Davis, the latter of whom led some employees to defect in order to create Automobile Magazine.\n \nRather than electing a Car of the Year, Car and Driver publishes its top ten picks each year in its Car and Driver 10Best.\n \nCar and Driver is home to the John Lingenfelter Memorial Trophy. This award is given annually at their Car and Driver Supercar Challenge.\n \nToday, Car and Driver is also published in Spain. The Spanish version just makes use of the Car and Driver \n","torrent":{"xt":"urn:btih:0b35c94c4bff41673c1326eef5516ec70e91efa3","amp;dn":"Car+and+Driver+Magazine+Collection+PDF+MEGAPACK+%5BCARG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b35c94c4bff41673c1326eef5516ec70e91efa3","infoHashBuffer":{"type":"Buffer","data":[11,53,201,76,75,255,65,103,60,19,38,238,245,81,110,199,14,145,239,163]},"announce":[],"urlList":[]}}