{"title":"Weber: Clarinet Concertos - Walter Boeykens (1991)","uid":13540388,"size":244012291,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0c5973670e3b459dda7a1661099b9af1aed1230f&amp;dn=Weber%3A+Clarinet+Concertos+-+Walter+Boeykens+%281991%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Scheheraz","files":23,"time":1455480212,"description":"CARL-MARIA VON WEBER (1786-1826)\r\nWorks for Clarinet &amp; Orchestra\r\n\r\n&quot;In 1811, the clarinettist Heinrich Barmann appeared in Munich at a performance of Carl-Maria von Weber's Concertino opus 26, under the direction of the composer. In the audience was the King of Bavaria, Maximilian-Josef. The concert was such a success that the King requested the composer of the Invitation to the Dance to quickly write another work in concerted form for his favourite instrument.\r\nThe monarch's impatience was gratified to the full; from the relatively small format of the Op. 26, Weber moved to the ample dimensions of the Romantic concerto. His musical ideas abounded, leading him to create not one but two concertos, catalogued respectively under opus numbers 73 and 74. The key of the former is F minor, the latter E flat major. Both works were completed before the end of 1811, a period which also saw the birth of the King of Rome and the beginning of Beethoven's work on his Seventh Symphony.\r\nLike his elders Haydn and Mozart, the Viennese composer (by adoption) had completely emancipated wind instruments. Woodwinds were a must, whether they were playing serenades at Esterhaza Castle, the Clarinet Concerto or the Gran Partita due to the irreverent Wolfgang Amadeus, or else pieces written for open- air performances during the French Revolution. Woodwinds took on a hitherto unsuspected dignity, and sometimes they even ravished the limelight reserved for the violin by Bach, or for the cello by Boccherini. The usufruct of this conquest was, notably, Weber's privilege. Besides a Grand duo concertant destined for the clarinet and the piano, his complete catalogue conceals a numberof brilliant compositions for bassoon, horn or oboe. Nor should one forget the Waltzes. These were written for a wind ensemble with a part for clarinet oblige... The Concertos Op. 73 and 74 plunge their roots to the deepest part of German Romanticism, a strange mixture of naive poetry, dark metaphysics and worship whose nature is as enigmatic as it is omnipotent. At times, the atmosphere of Weber's great operas - which were yet to be written in 1811 - completely crosses, in a premonitory form, these tormented or bright skies. The magic of the Freischütz, the language of love in Euryanthe and the seascape enchantment of Oberon find a remarkable preface in these pieces.\r\nAs for the tonal conventions, they are prisoners of the clichés of the time: the Concerto Op. 73 is in F minor, like several of Field's Nocturnes, many works by Mendelssohn, and Chopin's Concerto No. 1.\r\nIt is a truism to say that one can recognize in these works a close relationship to the art of song. Mozart's cousin uses the clarinet's extremely wide tessitura to the utmost. He showcases the specific colour of each of its registers to perfection, while setting the most compact legatissimo against a pyrotechnical virtuosity that is worthy of the goddesses of opera and the hussies of the singspiel...&quot;\r\nPhilippe Olivier\r\nTranslated by Stuart Walters\r\n\r\nConcerto No. 1 Opus 73 in F minor for clarinet and orchestra\r\n1. I. Allegro [7'45]\r\n2. II. Adagio, ma non troppo [5'54]\r\n3. III. Rondo-allegretto [6'05]\r\nConcertino Opus 26 in E flat Major for clarinet and orchestra\r\n4. Adagio ma non troppo - andante - allegro [8'51]\r\nConcerto No. 2 Opus 74 in E flat Major for clarinet and orchestra\r\n5. I. Allegro [8'12]\r\n6. II. Andante con moto [6'54]\r\n7. III. Alla polacca [6'18]\r\nTotal 49'59\r\n\r\nWalter Boeykens, clarinet\r\nRotterdam Philharmonic Orchestra\r\nJames Conlon\r\n\r\nDigital recording\r\nRecorded: 01/1989, De Doelen, Rotterdam\r\nRecording supervision: Tini Mathot\r\nSound engineer: Adriaan Verstijnen\r\nEditing: Tini Mathot &amp; Adriaan Verstijnen\r\nProduction: Tjako Fennema\r\nErato-Disques S.A. 1991\r\nErato 2292-45459-2","torrent":{"xt":"urn:btih:0c5973670e3b459dda7a1661099b9af1aed1230f","amp;dn":"Weber%3A+Clarinet+Concertos+-+Walter+Boeykens+%281991%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c5973670e3b459dda7a1661099b9af1aed1230f","infoHashBuffer":{"type":"Buffer","data":[12,89,115,103,14,59,69,157,218,122,22,97,9,155,154,241,174,209,35,15]},"announce":[],"urlList":[]}}