{"title":"Braid[PS3-PSN Multi9][Nautilus-bt]","uid":6433579,"size":250145341,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:0c728c09a7d8896c76307b7cda832803ec5f80c1&amp;dn=Braid%5BPS3-PSN+Multi9%5D%5BNautilus-bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"someuser11","files":1,"time":1306750002,"description":"Braid is a puzzle-platformer, drawn in a painterly style, where the player manipulates the flow of time in strange and unusual ways. From a house in the city, journey to a series of worlds and solve puzzles to rescue an abducted princess. In each world, you have a different power to affect the way time behaves, and it is time's strangeness that creates the puzzles. The time behaviors include: the ability to rewind, objects that are immune to being rewound, time that is tied to space, parallel realities, time dilation, and perhaps more. Braid treats your time and attention as precious; there is no filler in this game. Every puzzle shows you something new and interesting about the game world.\n\nClick here to read the complete review\n\nBraid ÃƒÂ¨ un platform-puzzle, disegnato in uno stile pittorico, in cui il giocatore manipola il flusso del tempo in modi strani e insoliti. Da una casa in cittÃƒÂ , viaggia in una serie di mondi e risolvi gli enigmi per salvare una principessa rapita. In ogni mondo, si ha un diverso potere per influenzare il comportamento del tempo, ed ÃƒÂ¨ la stranezza del tempo che crea i puzzle. I comportamenti del tempo includono: la capacitÃƒÂ  di rewind, oggetti che sono immuni a essere riavvolti, il tempo che ÃƒÂ¨ legato alla spazio, realtÃƒÂ  parallele, dilatazione del tempo, e forse piÃƒÂ¹. Braid tratta il vostro tempo e attenzione preziosamente. Ogni puzzle ti mostra qualcosa di nuovo e interessante sul mondo del gioco.\n\nClicca qui per leggere la recensione completa\n\n\n\nYear : 2009\nGenre : Platoform\nLanguage : Multi9 (English, Italian, Spanish, German, French, Portoguese, Japanese, Chinese, Korean)\nTested: on PS3 Phat 60GB with CFW Kmeaw 3.55\n\n\n\n\n\n\n\n\nInstall CFW on your PS3\nExtract the files\nPut pkg files in the root of a memory stick, insert the memory in the PS3, install pkg from the XMB &quot;Install Package file&quot;, start the game from XMB\n\ninstallare CFW sulla PS3\nEstrarre i files\nMettere il file pkg nella root di una penna USB, inserire la penna nella PS3, installare il file pkg dal menu &quot;install Package file&quot;, far partire il gioco da XMB.","torrent":{"xt":"urn:btih:0c728c09a7d8896c76307b7cda832803ec5f80c1","amp;dn":"Braid%5BPS3-PSN+Multi9%5D%5BNautilus-bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c728c09a7d8896c76307b7cda832803ec5f80c1","infoHashBuffer":{"type":"Buffer","data":[12,114,140,9,167,216,137,108,118,48,123,124,218,131,40,3,236,95,128,193]},"announce":[],"urlList":[]}}