{"title":"How to Watch a Movie - David Thomson.epub","uid":12936235,"size":298920,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0df449c0c16afdfc49e51dab79a801da572de3ab&amp;dn=How+to+Watch+a+Movie+-+David+Thomson.epub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mr_mando","files":1,"time":1449584406,"description":"How to Watch a Movie - David Thomson\r\n\r\nFrom one of the most admired critics of our time, brilliant insights into the act of watching movies and an enlightening discussion about how to derive more from any film experience.\r\n\r\nSince first publishing his landmark Biographical Dictionary of Film in 1975 (recently released in its sixth edition), David Thomson has been one of our most provocative authorities on all things cinema. Now he offers his most inventive exploration of the medium yet: guiding us through each element of the viewing experience, considering the significance of everything from what we see and hear on-screen—actors, shots, cuts, dialogue, music—to the specifics of how, where, and with whom we do the viewing. \r\n\r\nWith customary candor and wit, Thomson delivers keen analyses of a range of films from classics such as Psycho and Citizen Kane to contemporary fare such as 12 Years a Slave and All Is Lost, revealing how to more deeply appreciate both the artistry and (yes) manipulation of film, and how watching movies approaches something like watching life itself. \r\n\r\nDiscerning, funny, and utterly unique, How to Watch a Movie is a welcome twist on a classic proverb: Give a movie fan a film, she’ll be entertained for an hour or two; teach a movie fan to watch, his experience will be enriched forever","torrent":{"xt":"urn:btih:0df449c0c16afdfc49e51dab79a801da572de3ab","amp;dn":"How+to+Watch+a+Movie+-+David+Thomson.epub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0df449c0c16afdfc49e51dab79a801da572de3ab","infoHashBuffer":{"type":"Buffer","data":[13,244,73,192,193,106,253,252,73,229,29,171,121,168,1,218,87,45,227,171]},"announce":[],"urlList":[]}}