{"title":"HandsOnHardcore - Aria Logan, Vicky Love, Cindy (Pussy Abundance","uid":13799227,"size":334160075,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:0dfe7245d47dacf12c113d23696a4fecd7f2d9c9&amp;dn=HandsOnHardcore+-+Aria+Logan%2C+Vicky+Love%2C+Cindy+%28Pussy+Abundance&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1457440050,"description":"Sabby, the well-built Hungarian sex machine, finds himself among an abundance of pussies in todayâ™s episode of DDF Networkâ™s Hands on Hardcore series. We proudly introduce a new face to our eclectic team of glamour babes and welcome Aria Logan from the Ukraine! The blonde teen with blue eyes and beautiful natural tits has silken soft light skin and a curvy ass. In todayâ™s scene, she will get her shaved pussy stuffed by Sabbyâ™s hard prick, along with Cindy and Vicky Love. The three hotties take his boner out of his pants and start a warmup blowjob round before introducing that hard boner to that new fuckhole! After sharing his cock, the two dark-haired beauties start French kissing while our new face rides Sabbyâ™s rod like a cowgirl. The lucky stud starts licking Vickyâ™s tasty snatch before the three hot girls shift on top of each other, so he gets three juicy cunnies to choose from. Vicky goes first and gets her pink pussy banged doggy style while Vicky gives our blonde new face Aria some pussy licking. Then itâ™s time for Vicky to get her anus fucked by that thick shaft. The scene heats up and the one cock stuffs all three pussies and asses one after the other before blowing his cum on that asshole.\r\nTags: Anal, Ass to mouth, Cum on ass, Facial, Hardcore, Group, Ball licking, Blowjob\r\n \nhttp://imgdone.com/viewer.php?file=31215948634237792168.jpg\r\n \nhttp://imgdone.com/viewer.php?file=81532586052372265332.jpg","torrent":{"xt":"urn:btih:0dfe7245d47dacf12c113d23696a4fecd7f2d9c9","amp;dn":"HandsOnHardcore+-+Aria+Logan%2C+Vicky+Love%2C+Cindy+%28Pussy+Abundance","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0dfe7245d47dacf12c113d23696a4fecd7f2d9c9","infoHashBuffer":{"type":"Buffer","data":[13,254,114,69,212,125,172,241,44,17,61,35,105,106,79,236,215,242,217,201]},"announce":[],"urlList":[]}}