{"title":"American_Top_40_1972_June_3rd","uid":10326576,"size":366808511,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0fca108122faf3adb9db36c215912b0b948b9545&amp;dn=American_Top_40_1972_June_3rd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"RocketMan999","files":-1,"time":1402363218,"description":"&quot;To those of you hearing American Top 40 for the first time, my name is Casey Kasem and I welcome you to our weekly countdown of the forty most popular songs in America.&quot;\n\n\nAmerican Top 40 with Casey Kasem aired on radio from July 4, 1970 until August 6, 1988. This recording is a rebroadcast from internet radio.\n\nIn this countdown:\n\nThere is a debut song by the youngest solo artist to hit the top 40 in sixteen years.\n\nElton John debuts his latest hit (and my theme song), &quot;Rocket Man&quot; at number 32. Since I am RocketMan999, it makes you wonder what RocketMen 1 through 998 are doing right now doesn't it?\n\nA listener asks, &quot;What artist had the most songs that went to number two without ever hitting number one?&quot; Casey answers by telling about a group (not an artist) which has 5 number two songs (and others that never got that far) to their credit. They are in this countdown with another single that would only climb to number 25.\n\nCasey answers another question. &quot;Who was the oldest artist ever to have a number one song, and who was the youngest?&quot; (It is here is a correction for May 30th, 1987, where I reported this man had a #1 hit at age 71). The oldest was 71 when he died, but 64 in 1964 when he hit number one. The youngest hit number one when he was 13-years-old in 1952.\n\nThe only man ever to share credit with the Beatles has a hit in this countdown. His named was listed on the &quot;Let It Be&quot; album for his great piano solo in the song &quot;Get Back.&quot;\n\nFinally, Casey reminds listeners that a special AT40 broadcast is coming up: The 40 Top Hits of the Rock 'n' Roll Era. Keep some space reserved on your hard drive because it is only a few weeks away for my RocketMan family as well (copyright laws, you all are my family if anyone asks).\n\n40:    Automatically Sunshine - The Supremes\n39:    Long-Haired Lover From Liverpool - Little Jimmy Osmond\n38:    Vincent - Don McLean        \n37:    Living In A House Divided - Cher     \n36:    Doctor My Eyes - Jackson Browne     \n35:    Day Dreaming - Aretha Franklin    \n34:    Love Theme From &quot;The Godfather&quot; (Speak Softly Love) - Andy Williams\n33:    I've Been Lonely For So Long - Frederick Knight\n32:    Rocket Man - Elton John\n31:    Old Man - Neil Young\n30:    Isn't Life Strange - The Moody Blues\n29:    Ask Me What You Want - Millie Jackson    \n28:    Someday Never Comes - Creedence Clearwater Revival\n27:    I Need You - America\n26:    Lean On Me - Bill Withers\n25:    Slippin' Into Darkness - War\n24:    Taxi - Harry Chapin\n23:    Amazing Grace - Pipes And Drums And The Military Band Of The Royal Scots Dragon Guards\n22:    Me And Julio Down By The Schoolyard\n21:    Betcha By Golly, Wow - Stylistics\n20:    I Gotcha - Joe Tex\n19:    Troglodyte (Cave Man) - Jimmy Castor Bunch\n18:    I Saw The Light - Todd Rundgren\n17:    Outa-Space - Billy Preston\n16:    Diary - Bread\n15:    It's Going To Take Some Time - The Carpenters\n14:    Walking In The Rain With The One I Love - Love Unlimited\n13:    Little Bitty Pretty One - Jackson 5\n12:    Song Sung Blue - Neil Diamond\n11:    (Last Night) I Didn't Get To Sleep At All - 5th Dimension\n10:    Look What You Done For Me - Al Green\n9:    Hot Rod Lincoln - Commander Cody &amp; His Lost Planet Airmen\n8:    Nice To Be With You - Gallery\n7:    Tumbling Dice - The Rolling Stones\n6:    Morning Has Broken - Cat Stevens\n5:    Sylvia's Mother - Dr. Hook and The Medicine Show\n4:    Candy Man - Sammy Davis Jr.\n3:    The First Time Ever I Saw Your Face - Roberta Flack\n2:    Oh Girl - The Chi-Lites\n1:    I'll Take You There - The Staple Singers","torrent":{"xt":"urn:btih:0fca108122faf3adb9db36c215912b0b948b9545","amp;dn":"American_Top_40_1972_June_3rd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fca108122faf3adb9db36c215912b0b948b9545","infoHashBuffer":{"type":"Buffer","data":[15,202,16,129,34,250,243,173,185,219,54,194,21,145,43,11,148,139,149,69]},"announce":[],"urlList":[]}}