{"title":"Area 51 Uncensored History-Annie Jacobsen-LibrAriuS-epub-mobi","uid":11709737,"size":53740852,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:102bd9b1fd4bf4886d2538f85030941336eb9ba1&amp;dn=Area+51+Uncensored+History-Annie+Jacobsen-LibrAriuS-epub-mobi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Shelob1","files":5,"time":1424278677,"description":"Area 51 is the most famous military installation in the world--&amp; it doesn't exist. Located 75 miles outside of Las Vegas in Nevada's desert, it's never been acknowledged by the government, but it's captivated imaginations for decades. Myths &amp; hypotheses about it have long abounded, thanks to the enveloping secrecy. Some claim it is home to aliens, underground tunnel systems &amp; nuclear facilities. Others believe that the lunar landings were filmed there. The prevalence of these rumors stems from the fact that no credible insiders have divulged the truth about their time inside the base--until now. Annie Jacobsen had exclusive access to 19 men who served the base for decades &amp; are now aged 75-92, &amp; unprecedented access to 55 additional military &amp; intelligence personnel, scientists, pilots &amp; engineers linked to the secret base, 32 of whom lived &amp; worked there for extended periods. In Area 51 she shows what's really gone on in the Nevada desert, from testing nuclear weapons to building super-secret, supersonic jets to pursuing the War on Terror. This is the first book based on interviews with eye witnesses to Area 51 history, which makes it a seminal work on the subject. Filled with formerly classified information that's never been accurately decoded for the public, Area 51 weaves the mysterious activities of the base into a gripping narrative, showing that facts are often more fantastic than fiction, especially when the distinction is almost impossible to make.\n\nEPUB/MOBI/AZW3/PDF/TXT Versions of retail EPUB. Enjoy&amp;Seed!","torrent":{"xt":"urn:btih:102bd9b1fd4bf4886d2538f85030941336eb9ba1","amp;dn":"Area+51+Uncensored+History-Annie+Jacobsen-LibrAriuS-epub-mobi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"102bd9b1fd4bf4886d2538f85030941336eb9ba1","infoHashBuffer":{"type":"Buffer","data":[16,43,217,177,253,75,244,136,109,37,56,248,80,48,148,19,54,235,155,161]},"announce":[],"urlList":[]}}