{"title":"2014 FIFA World Cup Brasil [MULTI][XBOX360][Region USA][GCP]","uid":9956642,"size":8747413680,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:10729a19d5e74d57dcd6860b7410729a96a9236a&amp;dn=2014+FIFA+World+Cup+Brasil+%5BMULTI%5D%5BXBOX360%5D%5BRegion+USA%5D%5BGCP%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Thhaque","files":-1,"time":1397455754,"description":"More Exclusive:\n &lt;a href=&quot;\nhttp://www.celeritygames.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.celeritygames.com/&lt;/a&gt;\n\n\n2014 FIFA World Cup Brazil\n\n\nRelease Date ...... : April 2014 Platform ..... : XBOX360\nGame Type ..... : Sports Origin ........ : NTSC \nRelease Type .. : Full DVD Image Format .. : ISO\n\nDescription:\n\nThe world's fiercest national rivalries ignite again in the only officially licensed videogame to let fans experience all the fun, excitement, and drama of the 2014 FIFA World Cup in Brazil. Featuring the deepest set of game modes ever in an EA Sports tournament title, all new gameplay innovations and improvements, and a rich presentation that captures the color and vibrancy of Brazil, 2014 FIFA World Cup Brazil will put fans in control of their nation?COs fate.\n\nEA Sports 2014 FIFA World Cup Brazil features multiple innovations and improvements to the award-winning gameplay of FIFA 14. From the ability to accelerate, decelerate, and change direction quickly on and off the ball with Explosive Movement, to the new World Class Control feature that uses Response Dribbling and Pinpoint Passing, fans will feel the athleticism and skill of their national football heroes. And one hundred new animations, including passing, saves, and penalty kicks, help play on the pitch explode with the drama and unpredictably of the official tournament.\n\nWith 203 national teams, 7,469 players, 19 officially licensed managers, and 21 new stadiums including all 12 authentic stadiums from Brazil, the 2014 FIFA World Cup comes to life with more detail and authenticity than ever before. In Road to the FIFA World Cup mode, players can choose from 203 national teams and play with one to 32 players locally through the qualifying rounds, and on to the group stages of the FIFA World Cup. Along the way, fans can get tournament updates from EA Sports Talk Radio, featuring Ian Darke and Andy Goldstein, or Roger Bennett and Michael Davies (Men in Blazers), with over 50 hours of recorded content to stay up to date on all the action. For those who want to celebrate the tournament online, Road to Rio de Janeiro is an all-new mode that lets players win their way across a map of Brazil?COs 12 host cities in licensed and authentic stadiums.\n\nRelease Date: April 15, 2014\nE for Everyone: No Descriptors\nGenre: Sports\nPublisher: Electronic Arts\nDeveloper: EA Canada\n\nFeatures:\n\n*Play in authentic Brazilian stadiums, and recognise the support of newly rendered crowds and patriotic presentation to replicate the passion of the World Cup.\n\n*New control systems with more responsive dribbling, and pinpoint passing on the agenda. Change direction on and off the ball with purpose.\n\n*New set piece tactics.\n\n*Adidas ball physics -- EA has partnered with Adidas to deliver the most realistic ball physics system on Xbox 360 and PS3, taking data from the Adidas Innovation Lab in Herzogenaurach, Germany, to implement it into the game to give the Brazuca and other Adidas balls true-to-life flight and grass friction\n\n*New penalty kicks -- With new save and animations and shot tuning that puts players in control of their nation?COs fate. Goalkeeper antics to throw off your opposition including wobbly-knees, matador and shoot-it-there animations.\n\n*EA Sports Talk Radio ?Co Receive dynamic tournament updates from your choice of Andy Goldstein and Ian Darke, or Michael Davies and Roger Bennett (Men in Blazers) as you play through various offline modes. Over 50 hours of recorded audio keeps the narrative fresh and entertaining.\n\n*Teams ?Co 203 teams sanctioned by FIFA.\n\n*Players ?Co 7,469 players in the game.\n\n*Managers ?Co 19 officially licensed managers.\n\n*Stadiums ?Co 21 new stadiums, including all 12 authentic stadiums in Brazil.\n\n*Road to the FIFA World Cup ?Co the most immersive tournament mode in EA SPORTS history, you can choose from any of the 203 National Teams sanctioned by FIFA and play through qualifying and through to the group stages of the World Cup.\n\n*Captain your Country ?Co one of the most popular FIFA modes of all time.\n\n*Road to Rio de Janeiro - Progress across a map of Brazil?COs 12 host cities. Compete in Online Stages with any of the 203 National Teams to advance, remain in a city, or be relegated. Win the final of 12 stages to hoist the FIFA World Cup Trophy.\n\n*Online FIFA World Cup ?Co compete in Group and World Cup Finals online.\n\n*Story of Qualifying ?Co over 60 scenarios that happened in real world qualifying.D\n\n*Story of Finals (online) ?Co activated at the start of the tournament and updated throughout, play challenges on the narrative of the day?COs real world events.\n\n*Additional modes: 2014 FIFA World Cup, Kick Off, Skill Games, Online Friendlies, EA SPORTS Football Club.\n\nScreens:\n &lt;a href=&quot;\nhttp://i.imgur.com/FbC8HTJ.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/FbC8HTJ.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i.imgur.com/X5DFhOG.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/X5DFhOG.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i.imgur.com/BWM4Npc.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/BWM4Npc.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:10729a19d5e74d57dcd6860b7410729a96a9236a","amp;dn":"2014+FIFA+World+Cup+Brasil+%5BMULTI%5D%5BXBOX360%5D%5BRegion+USA%5D%5BGCP%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10729a19d5e74d57dcd6860b7410729a96a9236a","infoHashBuffer":{"type":"Buffer","data":[16,114,154,25,213,231,77,87,220,214,134,11,116,16,114,154,150,169,35,106]},"announce":[],"urlList":[]}}