{"title":"Joe Henry...Civilians(2007)[FLAC]","uid":7021884,"size":334141916,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:109eb20e3f941be726c4123aed22751bc2ffc13f&amp;dn=Joe+Henry...Civilians%282007%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":16,"time":1328875191,"description":"[img]http://img89.imageshack.us/img89/4786/51e0dscyvlss500pe9.jpg[/img]\n\n[color=Green]Civilians [2007]Anti-\t68902[/color]\n\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n[1] Civilians |4:36|\n[2] Parker's Mood |4:16|\n[3] Civil War |4:42|\n[4] Time Is a Lion |3:54|\n[5] You Can't Fail Me Now |4:13|\n[6] Scare Me to Death |4:54|\n[7] Our Song |6:19|\n[8] Wave |4:30|\n[9] Love Is Enough |4:49|\n[10] I Will Write My Book |4:11|\n[11] Shut Me Up |6:16|\n[12] God Only Knows |5:02|\n\nThough Joe Henry has recently been busier as a producer (for the Grammy-winning Solomon Burke, a well-received collaboration between Elvis Costello and Allen Toussaint, and Henry's own collaboration with Loudon Wainwright III), his first recording of his own material in four years reminds that he has few peers among contemporary singer-songwriters. On previous releases, his adventurousness has pulled his music in all sorts of different directions, but focus and cohesion characterize this song cycle--one that suggests that all politics aren't merely local, but deeply personal. From the centerpiece of &quot;Our Song,&quot; where Willie Mays laments what the country has become and remembers what it was, Henry crafts a literate, typically inspired song cycle. Stately waltzes, chamber atmospherics, and jazz instrumentation contribute to the cinematic scope of the music, with guitarists Bill Frisell and Greg Leisz and keyboardists Van Dyke Parks and Patrick Warren providing support that leaves the songs plenty of room to breathe. On &quot;You Can't Fail Me Now&quot; and &quot;God Only Knows,&quot; it's hard to distinguish poetry from prayer. --Don McLeese\n\nProduct Description\nSince the release of 2003's acclaimed &quot;Tiny Voices&quot;, singer/songwriter Henry has appeared mainly as a producer, working on career defining releases by Aimee Mann, Ani DiFranco, Elvis Costello, Solomon Burke, and most recently as producer and co-writer of &quot;Strange Weirdos&quot; (with Loudon Wainwright), the soundtrack to the film &quot;Knocked Up&quot;. Working with this generation's finest songwriters inspired Joe to his strongest set of songs on &quot;Civilians&quot;; songs of a new warmth and directness and a bold sense of melody that rides atop the cutting edge arrangements he's become known for. Features legendary pianist/songwriter Van Dyke Parks (everyone from the Beach Boys to U2) and jazz guitar pioneer Bill Frisell (Elvis Costello, Norah Jones).\n\ncd ripped by EAC\n\nplease seed\n\n[url]http://dickthespic.org/[/url]","torrent":{"xt":"urn:btih:109eb20e3f941be726c4123aed22751bc2ffc13f","amp;dn":"Joe+Henry...Civilians%282007%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"109eb20e3f941be726c4123aed22751bc2ffc13f","infoHashBuffer":{"type":"Buffer","data":[16,158,178,14,63,148,27,231,38,196,18,58,237,34,117,27,194,255,193,63]},"announce":[],"urlList":[]}}