{"title":"Grand Illusions The Legacy of Planned Parenthood by George Grant","uid":9322042,"size":5319684,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:10ba236fea599576e160110d06d38cf1f26ea22b&amp;dn=Grand+Illusions+The+Legacy+of+Planned+Parenthood+by+George+Grant&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"conspiracyPDF","files":1,"time":1386569606,"description":"Grand Illusions The Legacy of Planned Parenthood by George Grant\n\nReview\n\nGRAND ILLUSIONS is a dramatic and challenging wake-up call to complacent Christians. -- Paige Comstock Cunningham, Attorney\n\nGRAND ILLUSIONS should be a key resource for everyone who works in, or supports the pro-life movement. -- Colleen Parro, Republican National Coalition for Life\n\nIf facts can make a difference, this book should put an end to the debate about the social value of Planned Parenthood. -- Connie Marshner, Focus on the Family\n\nNo one has done more to expose the deceitfulness of Planned Parenthood's contribution to this genocide of the pre-born than George Grant in his book GRAND ILLUSIONS. -- Darrow Miller, Food for the Hungry\n\nThis book demands a response. --Michael Card, Recording artist and author --This text refers to an out of print or unavailable edition of this title.\n\nFrom the Publisher\n\nThoroughly researched, carefully written, and comprehensively documented, &quot;Grand Illusions&quot; has already made its mark as the single best-selling volume of all time on Planned Parenthood's role in the controversial matters of abortion and sex education. No other book has so thoroughly surveyed the divisive issues, dominating personalities, legal and judicial precedents, educational and political initiatives, social consequences, and global impact of this organization and the great debates it has engendered worldwide. --This text refers to an out of print or unavailable edition of this title.","torrent":{"xt":"urn:btih:10ba236fea599576e160110d06d38cf1f26ea22b","amp;dn":"Grand+Illusions+The+Legacy+of+Planned+Parenthood+by+George+Grant","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10ba236fea599576e160110d06d38cf1f26ea22b","infoHashBuffer":{"type":"Buffer","data":[16,186,35,111,234,89,149,118,225,96,17,13,6,211,140,241,242,110,162,43]},"announce":[],"urlList":[]}}