{"title":"Battle For Middle Earth II Special Edition (v1.00/1.06/1.08)","uid":11005472,"size":3486908508,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:10dc2eae86f632f3672903b9689deb8bb55e56b1&amp;dn=Battle+For+Middle+Earth+II+Special+Edition+%28v1.00%2F1.06%2F1.08%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"_Yo1_","files":1,"time":1410221730,"description":"This is a Special Edition of the BFME2 v1.06 and I have also included All-In-One Patch Installer &amp; Switcher v.1.6 so you can switch between game versions 1.00/1.06/1.08 in seconds. Read Installation Guide carefully before installing the game and you will start playing in no time.\n\n\nThe Lord of the Rings\n\nThe Battle for Middle-Earth II\nSpecial Edition\n\nThis is The Battle for Middle Earth 2 Special Edition with patch 1.06. Remember that THIS IS NOT A MOD.  If you play with this edition vs someone who doesnt have , YOU DON'T HAVE MISMATCH PROBLEMS. If you ask me what the special edition is, I would say it's the best version of BfME2! With new game musics &quot;The Lord of The Rings Soundtracks&quot;, better graphics, images and much more features (read all features below). You dont need to crack or patch the game to play online with other players. All you need to download and install Special Edition. Next download Gameranger and play with your friends online.\n\nI use this version to play on Gameranger and suggest everyone do the same thing. You gonna like it so much :) I can do the same thing for  RotWK with a little bit help. So if anyone of you is interested for this project pm me via Gameranger (forshire GR ID: 1136172)\n\n\nSpecial Edition Features:\n\nAutodefeated (3:30) problem solved (experimental)\nUber fast installation (install The Battle for Middle Earth II in 25 seconds)\nThe game loads amazingly faster and runs smoother (because fewer files, but with no mismatching if played vs/with Standart Edition.) Also the game starts up faster than the standard version.\nSize of the game is reduced. (Size of standard BfME2 is around 5.7 GB, but BfME2 Special Editon is only 3.0 GB.)\nIncluded all patches (from 1.0 to latest 1.06, so you dont have to patch your game).\nStartup Logo movies deleted to open game faster (EA Games, THX, Geforce, Intel Logo).\nLanguage filter removed. The language filters purpose is to censor certain words. (for example; ****= fuck ****=hell). Now, you can easily say &quot;fuck you idiot&quot; to each other.\nNew game musics. To be honest its amazing gaming experience to play BfME2 with these new musics. There are 750MB (200 songs) in the BfME Special Edition.","torrent":{"xt":"urn:btih:10dc2eae86f632f3672903b9689deb8bb55e56b1","amp;dn":"Battle+For+Middle+Earth+II+Special+Edition+%28v1.00%2F1.06%2F1.08%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10dc2eae86f632f3672903b9689deb8bb55e56b1","infoHashBuffer":{"type":"Buffer","data":[16,220,46,174,134,246,50,243,103,41,3,185,104,157,235,139,181,94,86,177]},"announce":[],"urlList":[]}}