{"title":"Warcraft III: Reign of Chaos &amp; The Frozen Throne (with Keys) for","uid":4266780,"size":1141660386,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:11304a9b91aa8c8cc2c5c3d680f02c4b1434ca84&amp;dn=Warcraft+III%3A+Reign+of+Chaos+%26+The+Frozen+Throne+%28with+Keys%29+for&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tycoonalex","files":4,"time":1214733830,"description":"Warcraft III: Reign of Chaos is a real-time strategy computer game released by Blizzard Entertainment in July 2002. Warcraft III contains four playable races: Humans, Orcs, Night Elves and Undead, which are new to the Warcraft mythos.\n\nWarcraft III&amp;#039;s single-player campaign is laid out similarly to that of StarCraft, being told through all four of the game&amp;#039;s races in a progressive manner. \n\nWarcraft III takes place in the fictional world of Azeroth. Several years before the events of the games, a demon army known as the Burning Legion intent on Azeroth&amp;#039;s destruction corrupted a race called the Orcs, and sent them through a portal to attack Azeroth. After many years of fighting, the Orcs were defeated by a coalition of humans, dwarves and elves known as the Alliance; the surviving combatants were herded into internment camps, where they seemed to lose their lust for battle. With no common enemy, a period of peace followed, but the Alliance began to fracture.\n\nWarcraft III: The Frozen Throne is a real-time strategy computer game developed for Microsoft Windows, Mac OS and Mac OS X by Blizzard Entertainment. It is the official expansion pack to Warcraft III: Reign of Chaos.\n\nThis torrent includes both games, and several keys. You can download the official patches from Blizzard&amp;#039;s site to patch the game.\n\nI will continue seeding the torrent for the benefit of those downloading, and I would ask you to as well.\n\nThanks,\nTycoonalex","torrent":{"xt":"urn:btih:11304a9b91aa8c8cc2c5c3d680f02c4b1434ca84","amp;dn":"Warcraft+III%3A+Reign+of+Chaos+%26+The+Frozen+Throne+%28with+Keys%29+for","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11304a9b91aa8c8cc2c5c3d680f02c4b1434ca84","infoHashBuffer":{"type":"Buffer","data":[17,48,74,155,145,170,140,140,194,197,195,214,128,240,44,75,20,52,202,132]},"announce":[],"urlList":[]}}