{"title":"Barenaked Ladies - The Yellow Tape - 320kbps","uid":10970679,"size":42538303,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:115d8a5d23f8ee519f2134a585df06e41a616ac0&amp;dn=Barenaked+Ladies+-+The+Yellow+Tape+-+320kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rutherf0rd","files":-1,"time":1409788862,"description":"From wikipedia: \n&quot;The Yellow Tape is the Barenaked Ladies' fourth indie tape release. It was recorded in 1991 at Wellesley Sound in Toronto (except for &quot;Be My Yoko Ono&quot;, which had been recorded earlier at Number 9 Studios). It was the band's first release to feature drummer Tyler Stewart. The tape, as with Barenaked Lunch, was released on Page's father's label Page Publications.\n\nIt was originally recorded as a demo for the band's performance at South by Southwest. The Yellow Tape sold more than 85,000 copies and became the first independent release be certified platinum in Canada. Although officially self-titled, it is commonly referred to as The Yellow Tape, due to its yellow cover.&quot;\n\nTracklist:\n1. Be My Yoko Ono\n2. Brian Wilson\n3. Blame It On Me\n4. If I Had $1000000\n5. Fight The Power\n\nMP3s include album art.\n\n\nBeing the Barenaked Ladies fan I am, I decided to purchase this demo tape secondhand online. I noticed that there wasn't a very good rip online available, and that's why I chose to rip it my own way. I found a torrent here already, but it wouldn't download and very well might as well be in a low bitrate, given a filesize that's about half the size of mine. Then I found a 256kbps rip elsewhere, which just sounded bad. I ripped this tape using a Pioneer tape deck plugged straight into the computer, and I hope you will find the sound to be as good as I think it is.","torrent":{"xt":"urn:btih:115d8a5d23f8ee519f2134a585df06e41a616ac0","amp;dn":"Barenaked+Ladies+-+The+Yellow+Tape+-+320kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"115d8a5d23f8ee519f2134a585df06e41a616ac0","infoHashBuffer":{"type":"Buffer","data":[17,93,138,93,35,248,238,81,159,33,52,165,133,223,6,228,26,97,106,192]},"announce":[],"urlList":[]}}