{"title":"An American Werewolf in London [NTSC] [Retail - DVD5 Movie]","uid":8228382,"size":4403605973,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:1169898a9a3fa616a3720bbfcb3c68163d12da84&amp;dn=An+American+Werewolf+in+London+%5BNTSC%5D+%5BRetail+-+DVD5+Movie%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Big_dude","files":-1,"time":1362668657,"description":"An American Werewolf in London (DVD Movie)                        Rel. 08/21/1981\n\n\nFormat:        DVD5 Movie NTSC\nLang.:         English\nSubs:          English, Spanish, French\nImage:         ISO\nRated:         R\nSource:        Original DVD Movie Collector's Edition\nGene:          Horror\nQuality:       Perfect\nConversion:    DVD9 To DVD5\nRequirements:  DVD Player\n\n\n\nCompressed with 7Zip, Tested Working.\n\n\n\nRunning Time: 98 minutes\n\n\n\n- Movie Info -\n       &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0082010/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0082010/&lt;/a&gt;\n\n\n\n\nDescription:\n\nDirector - John Landis\n\nWriter - John Landis\n\nStars: David Naughton, Jenny Agutter, Joe Belcher.\n   \nWhile wandering the English moors on vacation, college yanks David (David Naughton) and Jack (Griffin Dunne) happen upon a quaint pub with a mysterious patronage who warn them not to leave the road when walking after dark. Irreverent of such advice as characters in horror films always are, the two decide to find a short cut....David wakes up in the hospital with a nasty bite wound to his shoulder; the freshly deceased, and rapidly decomposing, Jack arrives soon after to deliver the grim news that, unless he commits suicide, David will become a werewolf when the moon is full. \n\nDavid dismisses the encounter as a hallucination, but all indicators point to lycanthrope; evenings of barking and bloodletting follow closely behind. While the story is thin and much of the tongue-in-cheek humor is overdone, there are plenty of genuine jolts thanks to makeup guru Rick Baker's eye-popping special effects. The werewolf, resembling a cross between a bear and a wolverine, appears frighteningly real, and, given the fantastic premise, the gore is most convincing (although surprisingly and refreshingly scant). \n\nThe hospital dream sequences are creative, and the scenes in which the werewolf runs rampant through downtown London are particularly good. In all, An American Werewolf in London is an original, atmospheric film that manages both to scare and amuse. While dismissed by most American critics upon its release, the film managed to secure a place in the annals of American cinema when Baker won an Academy Award for his amazing effects and creature designs.\n\n\n\nBurn ISO to your DVD media watch in your DVD player, or Computer.\n\n(You can mount The iso to, to play on your computer).\n\n\nIf this is working fine for you write a comment let us know.\n\n\n\nPlease Seed This Torrent (I can't seed 24/7 do your part).\n\n\n\nEnjoy!\t\t\t\t","torrent":{"xt":"urn:btih:1169898a9a3fa616a3720bbfcb3c68163d12da84","amp;dn":"An+American+Werewolf+in+London+%5BNTSC%5D+%5BRetail+-+DVD5+Movie%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1169898a9a3fa616a3720bbfcb3c68163d12da84","infoHashBuffer":{"type":"Buffer","data":[17,105,137,138,154,63,166,22,163,114,11,191,203,60,104,22,61,18,218,132]},"announce":[],"urlList":[]}}