{"title":"Tides Of Truth Series - Robert Whitlow","uid":10022951,"size":1676258,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1191e80455567294f25ba8074e8784205f9e2a35&amp;dn=Tides+Of+Truth+Series+-+Robert+Whitlow&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1398225960,"description":"#1 - Deeper Water: (2008)\nThe Tides of Truth novels follow one lawyer's passionate pursuit of truth in matters of life and the law. In the murky waters of Savannah's shoreline, a young law student is under fire as she tries her first case at a prominent and established law firm. A complex mix of betrayal and deception quickly weaves its way through the case and her life, as she uncovers dark and confusing secrets about the man she's defending--and the senior partners of the firm. How deep will the conspiracy run? Will she have to abandon her true self to fulfill a higher calling? And how far will she have to go to discover the truth behind a tragic cold case?\n\n#2 - Higher Hope: (2009)\nThe Tides of Truth series follows one lawyer's passionate pursuit of truth--in matters of life and the law. Competition is tough at the Savannah law firm where Tami Taylor serves as a law clerk. But Tami's work sets her apart--and the firm's partners see something special in her. So they assign her to a libel case against an abrasive, outspoken preacher who is either a prophet or a lunatic. On the surface it appears to be an open and shut case; the preacher seems fully outside the bounds of law. And Tami's strict religious upbringing could be the firm's ace-in-the-hole. But as the investigation continues, Tami is troubled by the preacher's uncanny prophetic abilities. And their client seems to be hiding something. Tami returns to her hometown, struggling with several critical choices--as two very different men from the firm vie for her heart. Just when the challenges seem insurmountable, hope for Tami arrives from a surprising place. And it's a higher hope than she's ever imagined.\n\n#3 - Greater Love: (2010)\nThe Tides of Truth series follows one lawyer's passionate pursuit of truth--in matters of life and the law. As the storm clouds gather, Tami does her best to weather the growing turbulence in every area of her life. She's just accepted a job with a law firm but now wonders if she made the right decision. She has two strong men vying for her heart--and is about to lose them both if she can't determine which one is right for her. And Tami's new case is anything but simple. When she first meets her prospective client, she immediately knows the rough young teen is lying, guilty...and utterly terrified of something beyond the charges she's facing. What she doesn't realize is just how far reaching the effects of the case will go. Or how close to home the deadly results will hit. For by the time the storm breaks, someone close to Tami will have paid the ultimate price. Through it all, Tami will experience greater sacrifice, greater friendship, and greater love than she's ever known.","torrent":{"xt":"urn:btih:1191e80455567294f25ba8074e8784205f9e2a35","amp;dn":"Tides+Of+Truth+Series+-+Robert+Whitlow","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1191e80455567294f25ba8074e8784205f9e2a35","infoHashBuffer":{"type":"Buffer","data":[17,145,232,4,85,86,114,148,242,91,168,7,78,135,132,32,95,158,42,53]},"announce":[],"urlList":[]}}