{"title":"The Brigade: An Epic Story of Vengeance, Salvation, and WWII ","uid":9753651,"size":108351353,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:11c8e07ea253fbcfaa4962b94e37dbae7428b0fd&amp;dn=The+Brigade%3A+An+Epic+Story+of+Vengeance%2C+Salvation%2C+and+WWII+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sidmal","files":-1,"time":1394693067,"description":"\nThe Brigade: An Epic Story of Vengeance, Salvation, and WWII (Audiobook) By Howard Blum, read by John Bedford Lloyd \n 2001 | 6 hours | ISBN: 0694526584 | MP3 40 kbps | 108 MB\n\n\n\n\n Although the official history of the Jewish Brigade Group (a unit of some 5,000 Jews who fought with the British Eighth Army in Italy in the waning months of the conflict) has been written, Blum (Wanted! The Search for Nazis in America) breaks new ground by looking into the clandestine operations that occurred after the shooting had stopped. Once they learned the true extent of the holocaust, soldiers of the brigade began using intelligence reports to pinpoint the location of former SS officers and camp guards. The enraged Jewish troops took vengeance into their own hands, eventually slaying hundreds of Nazi death dealers. Blum follows the story of three men Israel Carmi, Johanan Peltz and Arie Pinchuk in detail, interviewed dozens of others, read unpublished personal memoirs and had Hebrew-language documents translated for him. During the war, the more daring Jewish soldiers formed a secret unit that appropriated British supplies trucks, weapons and food and diverted them to ships heading illegally for Palestine The plan included the &quot;repatriation&quot; of thousands of war orphans, who were clandestinely taken from displaced person camps and smuggled to Palestine. The underground Jewish Haganah figured prominently in these operations, which contributed directly to the creation of Israel. Blum, twice nominated for a Pulitzer as a New York Times investigative reporter, and now a Vanity Fair contributing editor, presents the material masterfully, building suspense and carefully documenting all the action. \n\n","torrent":{"xt":"urn:btih:11c8e07ea253fbcfaa4962b94e37dbae7428b0fd","amp;dn":"The+Brigade%3A+An+Epic+Story+of+Vengeance%2C+Salvation%2C+and+WWII+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11c8e07ea253fbcfaa4962b94e37dbae7428b0fd","infoHashBuffer":{"type":"Buffer","data":[17,200,224,126,162,83,251,207,170,73,98,185,78,55,219,174,116,40,176,253]},"announce":[],"urlList":[]}}