{"title":"4 Rare 80s Albums [Part 40] Your Requests","uid":4633909,"size":323992447,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:11d497bcc94431ce8dc32a3841912d1462b880ee&amp;dn=4+Rare+80s+Albums+%5BPart+40%5D+Your+Requests&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"80zforever","files":-1,"time":1231489017,"description":"Four records you guys requested. More to come. Leave a note if you want a record posted here. Now what do we have here?\n\n\n*Hazel O'Connor - Cover Plus [1981]\n\nCover Plus displays marked improvement in songwriting skills over Hazel O'Connor's two previous albums, Breaking Glass and Sons and Lovers. Whereas previously her lyrics often consisted of social commentary which was frequently marred by sloganeering and cliches, O'Connor here began to write from personal experience, with greatly improved results. Although still basic rock in nature, the textures of the music are more complex than on earlier releases. Shortly after this album's release legal problems with her record company would temporarily derail O'Connor's career, and she didn't emerge again until three years later with the now deleted Smile album,. Cover Plus remains the most satisfying recording of O'Connor's new wave years. \n\n\n\n*Miracle Legion - Surprise Surprise Surprise [1987]\n\nA great indie/jangle pop album. I find myself skipping a few tracks here and there, and some of the songs are a bit too similar, but I generally like the band's over all sound on this album. The harmonica parts really add a lot to some of the songs too. Mark Mulcahy's voice is tinged with nostalgia and the lyrics are pleasently matter-of-factly yet still somewhat cryptic.  If you're looking for some late 80s jangle pop, give this album a listen.\n\n\n*Pink Military - Do Animals Believe In God [1980]\n\nOn this record I was kind of surprised to notice Jayne Casey the vocalist tends to be rather harsh and the other projects I've heard from her seem to be closer to synth-punk than this is. The real surprise was the actual songs themselves, most seem well though-out and well played and produced. It's actually rather subdued and minimal most of the time also which lends itself nicely to the abilities of the musicians here. &quot;Did You See Her&quot;, &quot;Degenerated Man&quot; and &quot;Do Animals Believe In God&quot; were my favorites, but most of this was a hit rather than a miss. The album sounds sort of magical with the way the keyboards are used in places and the post-punky drums which turn up ever so often are quite welcome as it does add a bit of an edge.  \n\n\n*Scars - Author! Author! [1981]\n\nThe Scars were a top notch band, it's a shame that they never even had the modest success that a lot of similar bands enjoyed. This is one of those rare 'lost classics' that actually live up to the hype, a highly recommended release for fans of bands like the Comsat Angels or Josef K. \n\n&quot;Leave Me In The Autumn&quot; is a perfect song to start with. The single &quot;All About You&quot; has a sweet and summery feel to it. Only after listening to the lyric a bit do you realise that it's about rejection, and may even be written from the point of view of a stalker. \n\n\n\n\n","torrent":{"xt":"urn:btih:11d497bcc94431ce8dc32a3841912d1462b880ee","amp;dn":"4+Rare+80s+Albums+%5BPart+40%5D+Your+Requests","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11d497bcc94431ce8dc32a3841912d1462b880ee","infoHashBuffer":{"type":"Buffer","data":[17,212,151,188,201,68,49,206,141,195,42,56,65,145,45,20,98,184,128,238]},"announce":[],"urlList":[]}}