{"title":"The Troggs - The Best of The Troggs (1994)","uid":8644642,"size":152332693,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1257b0fb29b2e8a775ab6eb94be1d7945a0a5f90&amp;dn=The+Troggs+-+The+Best+of+The+Troggs+%281994%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":22,"time":1372958127,"description":"This is the same torrent that was uploaded to Demonoid in May 2008\n\n\nThe Troggs - The Best of The Troggs [Fontana/Chronicles] (1994)\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nTracks have full tags (including embedded thumbnail).\nAll artwork in jpgs at 300 d.p.i. Rotated and cropped losslessly with jpegcrop.\nAMG Review.txt\nNotes.txt (which is simply these notes included in the torrent)\n\nBio Excerpt from All Music:\n\nRemembered chiefly as proto-punkers who reached the top of the charts with the &quot;caveman rock&quot; of &quot;Wild Thing&quot; (1966), the Troggs were also adept at crafting power pop and ballads. Hearkening back to a somewhat simpler, more basic British Invasion approach as psychedelia began to explode in the late '60s, the group also reached the Top Five with their flower-power ballad &quot;Love Is All Around&quot; in 1968. While more popular in their native England than the U.S., the band also fashioned memorable, insistently riffing hit singles like &quot;With a Girl Like You,&quot; &quot;Night of the Long Grass,&quot; and the notoriously salacious &quot;I Can't Control Myself&quot; between 1966 and 1968. Paced by Reg Presley's lusting vocals, the group -- which composed most of their own material -- could crunch with the best of them, but were also capable of quite a bit more range and melodic invention than they've been given credit for.\n\nTo read the entire bio: &lt;a href=&quot;\nhttp://wc05.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:difpxqr5ldde~T1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://wc05.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:difpxqr5ldde~T1&lt;/a&gt;\n\nAlbum Review:\n\nby Tim Sendra\nThe Best of the Troggs on Fontana/Chronicles is one of the better single-disc Troggs collections you are likely to find. The 12 tracks cover the band's best work from the initial period of their career in the mid-'60s. Of course, the set leads off with their biggest hit, the wild and nasty &quot;Wild Thing,&quot; but the rest of the tunes show the band to be even wilder with a raft of frantic stompers like &quot;From Home,&quot; the pleading &quot;I Can't Control Myself,&quot; &quot;I Want You,&quot; and &quot;Gonna Make You.&quot; The group also made some of the most sensitive and pretty music of the British Invasion. Tunes like &quot;Love Is All Around,&quot; &quot;Anyway That You Want Me,&quot; &quot;With a Girl Like You,&quot; and the impossibly tender &quot;You Can Cry if You Want To&quot; are the work of a band with a delicate mastery of emotion and dynamics. Hard to believe it's the same louts who bashed out &quot;Wild Thing.&quot; Apart from a few minor cuts like &quot;I Just Sing&quot; and &quot;Jingle Jangle,&quot; this collection delivers all the Troggs a casual fan would ever need and is a fine first purchase. \n\nTrack List:\n\n01. Wild Thing\n02. From Home\n03. With a Girl Like You\n04. I Want You\n05. I Can't Control Myself\n06. Gonna Make You\n07. Any Way That You Want Me\n08. Give It to Me\n09. Night of the Long Grass\n10. Love is All Around\n11. You Can Cry if You Want to\n12. Surprise, Surprise (I Need You)\n\nMore album detail at: &lt;a href=&quot;\nhttp://wc05.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:kxfyxq8hldde&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://wc05.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:kxfyxq8hldde&lt;/a&gt;\n","torrent":{"xt":"urn:btih:1257b0fb29b2e8a775ab6eb94be1d7945a0a5f90","amp;dn":"The+Troggs+-+The+Best+of+The+Troggs+%281994%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1257b0fb29b2e8a775ab6eb94be1d7945a0a5f90","infoHashBuffer":{"type":"Buffer","data":[18,87,176,251,41,178,232,167,117,171,110,185,75,225,215,148,90,10,95,144]},"announce":[],"urlList":[]}}