{"title":"Earl Scruggs - I Saw The Light With Some Help From My Friends (1","uid":9726754,"size":102679954,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1284267ff0d290e20f0514591b65983ef1d1437d&amp;dn=Earl+Scruggs+-+I+Saw+The+Light+With+Some+Help+From+My+Friends+%281&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AaronVincent","files":16,"time":1394305617,"description":"Album from 1972.\n\n\nWhen Earl Scruggs split with longtime collaborator and fellow Foggy Mountain Boy \nLester Flatt in 1969, it was evident who of the pair had the more commercial aspirations. While Flatt remained firmly rooted in the bluegrass tradition, Scruggs, much like similar-minded artists such as the Nitty Gritty Dirt Band, Johnny Darrell, and the Dillards, sought to bridge the gap between pop, folk, and the old-timey sounds of yesteryear. I Saw the Light With Some Help from My Friends may sound like it was culled from the buckle of the &quot;Bible Belt&quot; (there are indeed a few spirituals), but the &quot;friends&quot; referenced in the title are merely saviors of the late-'60s/early-'70s country-folk movement. Scruggs gathered both family -- sons Gary, Randy, and Steve -- and contemporaries like Linda Ronstadt, Arlo Guthrie, Vassar Clements, Tracy Nelson, Norman Blake, and the aforementioned Dirt Band, to flesh out an album of covers both sublime (Merle Haggard's &quot;Silver Wings&quot;) and surprising (Monkee Michael Nesmith's &quot;Some of Shelley's Blues&quot;). The musicianship is top-notch and the vocals, especially Ronstadt and Nelson -- Arlo Guthrie will always be an acquired taste for some -- are warm and soulful, resulting in one of the more lucid and enjoyable examples of the crossover genre. [In 2005, Columbia/Legacy reissued the record with extensive liner notes and three bonus tracks: &quot;Fireball Mail,&quot; &quot;Tramp on the Street,&quot; and &quot;The Cure.&quot;]","torrent":{"xt":"urn:btih:1284267ff0d290e20f0514591b65983ef1d1437d","amp;dn":"Earl+Scruggs+-+I+Saw+The+Light+With+Some+Help+From+My+Friends+%281","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1284267ff0d290e20f0514591b65983ef1d1437d","infoHashBuffer":{"type":"Buffer","data":[18,132,38,127,240,210,144,226,15,5,20,89,27,101,152,62,241,209,67,125]},"announce":[],"urlList":[]}}