{"title":"[Michael_Barrier]Hollywood Cartoons American Animation in Its Go","uid":11034415,"size":43405023,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1373d9976a18d3da8f088e9825ec876552ba2a62&amp;dn=%5BMichael_Barrier%5DHollywood+Cartoons+American+Animation+in+Its+Go&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":2,"time":1410770324,"description":"In Hollywood Cartoons, Michael Barrier takes us on a glorious guided tour of American animation in the 1930s, '40s, and '50s, to meet the legendary artists and entrepreneurs who created Bugs Bunny, Betty Boop, Mickey Mouse, Wile E. Coyote, Donald Duck, Tom and Jerry, and many other cartoon favorites.\nBeginning with black-and-white silent cartoons, Barrier offers an insightful account, taking us inside early New York studios and such Hollywood giants as Disney, Warner Bros., and MGM. Barrier excels at illuminating the creative side of animation--revealing how stories are put together, how animators develop a character, how technical innovations enhance the &quot;realism&quot; of cartoons. Here too are colorful portraits of the giants of the field, from Walt and Roy Disney and their animators, to Bill Hanna and Joe Barbera.\nBased on hundreds of interviews with veteran animators, Hollywood Cartoons gives us the definitive inside look at this colorful era and at the creative process behind these marvelous cartoons.\n\nLanguage: English\nISBN-10: 0195167295\nISBN-13: 978-0195167290\n\nEditorial Reviews\nFrom Publishers Weekly\nThe fruit of exhaustive research, from interviews with more than 200 cartoon creators to the unearthing of piles of personal papers, dusty artwork and even hectographed memos from the 1930s, this long-awaited survey of American animation has taken Barrier (during the 1960s, the editor and publisher of Funnyworld, a periodical devoted to animation) more than 25 years to write. Barrier has screened thousands of films, including hundreds of silent pictures and &quot;almost all the short sound cartoons produced for theatrical release by the Disney, Harmon-Ising, Schlesinger, Warner Bros., MGM, UPA, and Iwerks studios,&quot; and his command of the material is astounding. He covers everything from creative character development to artistic influences, budget limitations, box office returns and technological advances such as the introduction of Xerox copiers to transfer pencil drawings directly as black lines, eliminating the inking stage. In addition to profiles of major talents, Barrier presents glimpses of Disney's earliest sketches, the insights of film critics, studio accountants and even psychologist Bruno Bettelheim, as well as countless anecdotes, such as one artist's memory of Disney's new 1939 air-conditioned Burbank studio, where &quot;any animator could pick up his phone and call the coffee shop and have a soda delivered, or hot coffee, hot chocolate, ice creamAanything. And a waiter would come running down the hall, with service right to your room.&quot; This cartoon cornucopia is both a delightful entertainment and a serious study, easily ranking as the definitive overview of the animation industry's accomplishments. In addition to the archival art and rare photos is a nice bonus of several flip-book sequences written into the page corners.\nCopyright 1999 Reed Business Information, Inc. --This text refers to an out of print or unavailable edition of this title.\nFrom Library Journal\nBased on archival research and hundreds of interviews, this volume provides a comprehensive survey of American animation up to the late 1960s. An authority on film cartoons, Barrier traces the development of such studios as Disney, Warner Brothers, and MGM. His cast of characters includes animators like Max Fleischer, Tex Avery, Chuck Jones, and Bill Hanna and Joe Barbera. By extension, it includes Bugs Bunny, Mickey Mouse, Porky Pig, Gerald McBoing Boing, and a host of other wondrous creations. Barriers account reveals the interplay between studio politics, technical innovation, and the business side of Hollywood. The highly readable result is neither weighted down with scholarly discourse nor demeaned by trivial anecdotes. In much the same way that David A. Cooks A History of Narrative Film (Norton, 1996) covers cinema as a whole, Hollywood Cartoons might well become the standard survey in its area. All libraries should consider for purchase.Neal Baker, Earlham Coll., Richmond, IN\nCopyright 1999 Reed Business Information, Inc. --This text refers to an out of print or unavailable edition of this title.\n\n","torrent":{"xt":"urn:btih:1373d9976a18d3da8f088e9825ec876552ba2a62","amp;dn":"%5BMichael_Barrier%5DHollywood+Cartoons+American+Animation+in+Its+Go","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1373d9976a18d3da8f088e9825ec876552ba2a62","infoHashBuffer":{"type":"Buffer","data":[19,115,217,151,106,24,211,218,143,8,142,152,37,236,135,101,82,186,42,98]},"announce":[],"urlList":[]}}