{"title":"Is There Anything Good About Men.pdf","uid":7547701,"size":1168778,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:13e2fe4bec2bf6cd629b211be9f4c862765cb2d2&amp;dn=Is+There+Anything+Good+About+Men.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"cowboy1966","files":-1,"time":1345399605,"description":"Roy F. Baumeister, \n\n&quot;Is There Anything Good About Men?: How Cultures Flourish by Exploiting Men&quot;\n\nEnglish | 2010-08-12 | ISBN: 019537410X | 320 pages | PDF | 1,1 MB\n\nHave men really been engaged in a centuries-old conspiracy to exploit and oppress women? Have the essential differences between men and women really been erased? Have men now become unnecessary? Are they good for anything at all?\n\nIn Is There Anything Good About Men?, Roy Baumeister offers provocative answers to these and many other questions about the current state of manhood in America. Baumeister argues that relations between men and women are now and have always been more cooperative than antagonistic, that men and women are different in basic ways, and that successful cultures capitalize on these differences to outperform rival cultures. Amongst our ancestors---as with many other species--only the alpha males were able to reproduce, leading them to take more risks and to exhibit more aggressive and protective behaviors than women, whose evolutionary strategies required a different set of behaviors. Whereas women favor and excel at one-to-one intimate relationships, men compete with one another and build larger organizations and social networks from which culture grows. But cultures in turn exploit men by insisting that their role is to achieve and produce, to provide for others, and if necessary to sacrifice themselves. Baumeister shows that while men have greatly benefited from the culture they have created, they have also suffered because of it.\n\n\n","torrent":{"xt":"urn:btih:13e2fe4bec2bf6cd629b211be9f4c862765cb2d2","amp;dn":"Is+There+Anything+Good+About+Men.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13e2fe4bec2bf6cd629b211be9f4c862765cb2d2","infoHashBuffer":{"type":"Buffer","data":[19,226,254,75,236,43,246,205,98,155,33,27,233,244,200,98,118,92,178,210]},"announce":[],"urlList":[]}}