{"title":"Sound_Of_Guns-What_Came_From_Fire-2010-SiRE","uid":5655351,"size":65242542,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:14605a607c4d01931fc1a85c7939d5add54cc848&amp;dn=Sound_Of_Guns-What_Came_From_Fire-2010-SiRE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HalfEvil333","files":14,"time":1277777223,"description":"Artist:   Sound Of Guns\nTitle:    What Came From Fire\nLabel:    Distiller\nGenre:    Rock\nBitrate:  209kbit av.\nTime:     00:41:37\nSize:     65.23 mb\nRip Date: 2010-06-28\nStr Date: 2010-06-28\n\n01. Intro                                                         0:40\n02. Architects                                                    2:59\n03. Alcatraz                                                      3:40\n04. Elementary Of Youth                                           3:15\n05. Collisions                                                    4:14\n06. 106 (Still The Words)                                         6:23\n07. Lightspeed                                                    3:39\n08. My White Noise                                                4:18\n09. Bullets In The Bloodstream                                    3:37\n10. Backs Of Butterflies                                          4:55\n11. Starts With An End                                            3:57\n\nRelease Notes:\n\nThere's something vaguely Snow Patrol-esque about the general aura of\nearnestness and feeling that enshrouds Sound of Guns' debut\nfull-length. 'What Came From Fire' is an album of big, heartfelt\nindie-rock ballads with stadium-pleasing choruses but, while it's easy\nto imagine their glossy, sleek anthems clogging up the mainstream radio\nwaves, Sound of Guns always throw a spanner in the works. Whether it's\nan under-produced crackle or an unusual riff, Sound of Guns manage to\nsound accessible and instantly likeable, without being buffeted to a\nsterile shine.\n\nPrevious single 'Architects' is a gleaming howl of mainstream rock,\nunderpinned by that aforementioned crackle, while some unusual riffing\nis on the cards for 'Elementary of Youth' and 'Bullets In The\nBloodstream.'\n\nSound of Guns churn out a bristling riff that rises and falls and\ngrumbles like a chainsaw beneath 'Bullets In The Bloodstream's sleek\nsurface, while frontman Andy labours to ensure every line is bursting\nwith hooks. But, it's in the closing moments where 'Bullets In The\nBloodstream' really comes into its own, cherry-picking this song's most\nurgent lyrics, sticking that aforementioned grating riff on a loop, and\ncranking the volume up to maximum. A majestic ending to an already\ndramatic song.\n\nMeanwhile, on 'Elementary of Youth,' the vocals and the guitars team\nup, jagging to the exact same, back-and-forth rhythm, amidst lashings\nof your atypically dramatic, rock-ballad riffing. Impressively, Andy\nnavigates those knife-edge vocal turns, whilst still managing to sound\nmelodic.\n\nLead-off single 'Alcatraz' makes good use of Andy's vocal prowess,\nreplacing the usual two-storey-high chorus with a lively\ncall-and-response vocal ricochet that's pretty much irresistible.\nExpect to be singing along, halfway through your very first experience\nof 'Alcatraz.'\n\n'Collisions' and 'My White Noise' are a little bit different. On\n'Collisions,' Sound of Guns take a breather from bellowing their hearts\nout, and concentrate on having a good time. 'Collisions' has an\ninfectious groove, and Andy even test-drives a very stylish,\nhard-rock-infused holler, which adds to this song's jazzy cool.\nMeanwhile, on 'My White Noise' it's the easy-on-the-ear melodies which\nare given the elbow. After rattling your teeth with a barrage of\npointed drumbeats, this spiny track lurches into a chorus of\ngunshot-drumming and spiky vocals that'll needle you into submission.\n'My White Noise' is big, shiny, melodic rock, with neat little hooky\nbarbs you won't be expecting.\n\nIt's difficult to pick favourites when it comes to 'What Came From\nFire,' not just because of the consistent high quality, but because 90%\nof this album is cut from the same musical cloth. 'What Came From Fire'\nis as samey as any one album can sound, without losing the listener's\ninterest. But, by a fraction, album highlights are 'Backs of\nButterflies' and the aptly-named 'Lightspeed.' The latter kicks off\nwith a ferocious drum-roll and escalates from there into a cinematic\nswirl of mammoth vocals and wave upon wave of guitars, where every\nchink of white space is crammed full of urgent backing vocals.\n'Lightspeed' is a blast of three dimensional musical drama with a storm\nof a chorus.\n\nOther highpoint 'Backs of Butterflies' can boast this album's best\nchorus, serving up a wonderfully no-nonsense, rabble-raising stomp that\nwas designed to rattle stadium rafters. 'Backs of Butterflies' is a\nlife-affirming tidal wave of big, fat, juicy vocals and a drumline\nthat'll get your head nodding and your feet stamping in no time.\n\nAlbum low point is the pretty, languid, six-minute-plus snooze-fest of\n'106 (Still The Words).' The synth-encrusted guitars drift along and,\nif it wasn't for the vaguely tribal rumble of the drums, the entire\nverse would be a completely pointless outing. Sound of Guns do finally\nkick it into second gear for the chorus. Despite the awkward\nverse-to-chorus transition, the choruses do have a swing to their step,\nand after so many pointless, sparkling riffs, this just might just feel\nlike the edgiest thing you've ever heard. The overriding impression of\n'101 (Still The Words)' is that this song doesn't have nearly enough\nideas to justify its six and a half minute running time: nowhere is\nthis more apparent than the draggingly dull closing minutes.\n\nSound of Guns end on a surprisingly sedate note, with the long, steady,\neasy-on-the-ears sway of 'Starts With an End.' The rise and fall of\nAndy's voice is lulling. This isn't a particularly strong Sound of Guns\nsong, but it's sweetly melodic and undemanding, and eases you out of\nthis album of wall-to-wall anthems nicely.\n\n'What Came From Fire' is a big, heartfelt rock album abounding with\noverwrought, emotionally-charged choruses. Sound of Guns wisely add a\nfew individual quirks to each anthem, successfully avoiding the strange\npitfall of being too accessible and too instantly likeable (i.e\nboring.) This is about as polished as an album can get, without\nbeginning to sound overproduced, plastic and dull. Sound of Guns might\njust be the band to reaffirm your faith in the stadium-sized\nrock-ballad.\n","torrent":{"xt":"urn:btih:14605a607c4d01931fc1a85c7939d5add54cc848","amp;dn":"Sound_Of_Guns-What_Came_From_Fire-2010-SiRE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14605a607c4d01931fc1a85c7939d5add54cc848","infoHashBuffer":{"type":"Buffer","data":[20,96,90,96,124,77,1,147,31,193,168,92,121,57,213,173,213,76,200,72]},"announce":[],"urlList":[]}}