{"title":"Girl in the Woods - Aspen Matis","uid":12833582,"size":6010482,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:14cd0cff5b3a9002d4904ef7b5f75e84fd7a38fb&amp;dn=Girl+in+the+Woods+-+Aspen+Matis&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1448415835,"description":"Girl in the Woods is Aspen Matis's exhilarating true-life adventure of hiking from Mexico to Canada—a coming of age story, a survival story, and a triumphant story of overcoming emotional devastation. On her second night of college, Aspen was raped by a fellow student. Overprotected by her parents who discouraged her from telling of the attack, Aspen was confused and ashamed. Dealing with a problem that has sadly become all too common on college campuses around the country, she stumbled through her first semester—a challenging time made even harder by the coldness of her college's &quot;conflict mediation&quot; process. Her desperation growing, she made a bold decision: She would seek healing in the freedom of the wild, on the 2,650-mile Pacific Crest Trail leading from Mexico to Canada.\r\n\r\nIn this inspiring memoir, Aspen chronicles her journey, a five-month trek that was ambitious, dangerous, and transformative. A nineteen-year-old girl alone and lost, she conquered desolate mountain passes and met rattlesnakes, bears, and fellow desert pilgrims. Exhausted after each thirty-mile day, at times on the verge of starvation, Aspen was forced to confront her numbness, coming to terms with the sexual assault and her parents' disappointing reaction. On the trail and on her own, she found that survival is predicated on persistent self-reliance. She found her strength. After a thousand miles of solitude, she found a man who helped her learn to love and trust again—and heal.\r\n\r\nTold with elegance and suspense, Girl in the Woods is a beautifully rendered story of eroding emotional and physical boundaries to reveal the truths that lie beyond the edges of the map","torrent":{"xt":"urn:btih:14cd0cff5b3a9002d4904ef7b5f75e84fd7a38fb","amp;dn":"Girl+in+the+Woods+-+Aspen+Matis","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14cd0cff5b3a9002d4904ef7b5f75e84fd7a38fb","infoHashBuffer":{"type":"Buffer","data":[20,205,12,255,91,58,144,2,212,144,78,247,181,247,94,132,253,122,56,251]},"announce":[],"urlList":[]}}