{"title":"Nancy Bush - Knitting Vintage Socks","uid":9195043,"size":146956347,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:151f2cd65ed41d875c4d5d6d46d81885c32245f3&amp;dn=Nancy+Bush+-+Knitting+Vintage+Socks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KnitLady","files":-1,"time":1384470742,"description":"Everything old is new again, and this collection of vintage sock patterns mines Weldon's Practical Needlework, a compilation of newsletters published more than 100 years ago, for some of the best. Twenty-four classic patterns are updated here for modern knitters with the inclusion of gauges, contemporary yarns, modern methods, and modern sizes. Filled with fascinating household and historic tidbits from the era, along with little-known tips such as an unconventional way to shape a heel, this historical and gracefully written book evokes a more genteel time while presenting a bevy of colorful socks not seen for nearly a hundred years. After an introduction to a few techniques from the original Weldon's, the patterns begin with an 1887 pair of Gentleman's Shooting Stockings with Fluted Pattern and end with a pair of Ladies' Silk Stockings with Clocks from 1914. Intended for knitters of all levels, this walk down memory lane revives some very classic patterns that may have been gone but are not forgotten.","torrent":{"xt":"urn:btih:151f2cd65ed41d875c4d5d6d46d81885c32245f3","amp;dn":"Nancy+Bush+-+Knitting+Vintage+Socks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"151f2cd65ed41d875c4d5d6d46d81885c32245f3","infoHashBuffer":{"type":"Buffer","data":[21,31,44,214,94,212,29,135,92,77,93,109,70,216,24,133,195,34,69,243]},"announce":[],"urlList":[]}}