{"title":"Medieval Islamic Civilization: An Encyclopedia, 2 Vol.","uid":5497905,"size":31404650,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:15537199fb753aceecdd49412f082ccf8a4ecf72&amp;dn=Medieval+Islamic+Civilization%3A+An+Encyclopedia%2C+2+Vol.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"artpepper","files":-1,"time":1271372219,"description":"Medieval Islamic Civilization: An Encyclopedia\nJosef W. Meri\n\nRoutledge (2006) | English | ISBN:0415966906 | 980 pages | PDF | 29.7 MB\n\n\n\n\n\n\n\nIslamic civilization flourished in the Middle Ages across a vast geographical area that spans today's Middle and Near East. Islamic civilization during that era was a thriving society whose contributions in diverse fields as science, medicine, mathematics, literature, and philosophy left an indelible mark on Europe.\n\n\nMedieval Islamic Civilization examines the socio-cultural history of the regions where Islam took hold between the 7th and 16th century. This important two-volume work contains over 700 alphabetically arranged entries, contributed and signed by international scholars and experts in fields such as Arabic languages, Arabic literature, architecture, art history, history, history of science, Islamic arts, Islamic studies, Middle Eastern studies, Near Eastern studies, politics, religion, Semitic studies, theology, and more. \n\n\nThis reference provides an exhaustive and vivid portrait of Islamic civilization including the many scientific, artistic, and religious developments as well as all aspects of daily life and culture. Entries also explore the importance of interfaith relations and the permeation of persons, ideas, and objects across geographical and intellectual boundaries between Europe and the Islamic world.\n\n\nFrom the Umayyad Mosque in Damascus to Christian merchants and the Qur'an to Fatima bint Muhammad, Medieval Islamic Civilization brings together in one authoritative resource all aspects of Islamic civilization during the Middle Ages. Accessible to the non-specialist, this resource will be of great use in research and to understand the roots of today's Islamic society as well as to explore the rich and vivid culture of medieval Islamic civilization.\n\n\n","torrent":{"xt":"urn:btih:15537199fb753aceecdd49412f082ccf8a4ecf72","amp;dn":"Medieval+Islamic+Civilization%3A+An+Encyclopedia%2C+2+Vol.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15537199fb753aceecdd49412f082ccf8a4ecf72","infoHashBuffer":{"type":"Buffer","data":[21,83,113,153,251,117,58,206,236,221,73,65,47,8,44,207,138,78,207,114]},"announce":[],"urlList":[]}}