{"title":"Comedy - Shel Silverstein collection","uid":4321059,"size":117192169,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:15c75cb3ff125ec23b9b2c32396bffec03068383&amp;dn=Comedy+-+Shel+Silverstein+collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rambam1776","files":54,"time":1217463954,"description":"SHEL SILVERSTEIN ? COLLECTION\n\nRambam1776 note ? There are several other Shel Silverstein albums ? I would be grateful if anyone with others would torrent them and/or link to them here.\n\n\nBiography by Bruce Eder\nShel Silverstein was one of those rare &quot;multi-threat&quot; artists ? composer, singer, cartoonist, illustrator, author ? with popular successes in all of those areas. Born in Chicago in 1930, Sheldon Alan Silverstein first attracted notice during his army service, in Japan and Korea, when he became a cartoonist for the U.S. Army publication Stars &amp; Stripes. After returning to civilian life, he made a part of his living selling hot dogs at Chicago&amp;#039;s two ballparks, and, according to a 1961 publisher&amp;#039;s biography, set a record for the number of hot dogs sold at Thursday night games. He also began drawing cartoons for magazines such as Look, Sports Illustrated, and This Week, but it was when he joined Playboy magazine in mid-&amp;#039;50s that his name started getting known nationally. The magazine was then on the cutting edge of popular culture, and Silverstein&amp;#039;s cartoons, which appeared in every issue from 1957 through the mid-&amp;#039;70s, with their satirical and provocative content, were some of the sharpest work in there. \n\nDuring the late &amp;#039;50s, Silverstein also began exploring other areas of creativity, including writing and music. He recorded an LP, Hairy Jazz, for Elektra Records, which featured two original songs as well as his interpretations, as a singer, of a brace of jazz standards. It was the first of a dozen albums that Silverstein would cut in the course of an active career of more than two decades in music, cutting across all genres ? his next album, Inside Folk Songs, was a sharply comedic look at the early-&amp;#039;60s folk music boom and all of its attendant absurdities, which included the original version of &quot;The Unicorn Song,&quot; and he followed that up with a trio of LPs for Chess Records&amp;#039; progressive label, Cadet Records. During this period, apart from his work as a magazine illustrator, Silverstein was busy as an author ? his cartoons appeared in book form, including Now Here&amp;#039;s My Plan (Simon &amp; Schuster) and Grab Your Socks (Ballantine), and he wrote a successful children&amp;#039;s book, The Lion Book. Additionally, he appeared regularly on radio as a musician and actor on The Jean Shephard Show and as a regular with Roger Price on television. He also performed, as a singer and banjo player, as part of Papa Bue&amp;#039;s Danish Viking New Orleans Jazz Band and as a solo act. \n\nAmid his literary successes, which included Uncle Shelby ABZ Book, Uncle Shelby&amp;#039;s Zoo, and Giraffe and a Half, all of which were aimed at children, Silverstein also established himself as a songwriter. A pair of his compositions, &quot;The First Battalion&quot; and &quot;You&amp;#039;re Wasting Your Time Trying to Make Me Settle Down,&quot; were recorded by Bob Gibson and Hamilton Camp, during the early &amp;#039;60s, but &quot;The Unicorn Song,&quot; from his own Inside Folk Songs album, quickly achieved a life of its own when the Irish Rovers turned it into a huge international hit. The Brothers Four also found success recording Silverstein&amp;#039;s &quot;25 Minutes to Go,&quot; but it was in 1967, when Johnny Cash enjoyed massive success with his version of Silverstein&amp;#039;s &quot;A Boy Named Sue,&quot; that he achieved stardom as a songwriter. RCA Records subsequently issued an album of Silverstein&amp;#039;s music using that song as the title track. Silverstein&amp;#039;s most important album from this period, however, and his most successful was Freakin&amp;#039; at the Freakers Ball, released in 1973, in which he turned his jaundiced, satirical eyes toward the counterculture, hippies, and radicals of all stripes. A year before that, however, he saw a new round of success begin as a songwriter with &quot;Sylvia&amp;#039;s Mother,&quot; an over-the-top romantic lament that reached number five on the charts and turned its artists, Dr. Hook &amp; the Medicine Show, into stars; the group, who played on Freakin&amp;#039; at the Freaker&amp;#039;s Ball, subsequently hit even bigger with the satiric &quot;The Cover of the Rolling Stone,&quot; also written by Silverstein, and the group was the major vehicle for Silverstein&amp;#039;s music for the rest of the 1970s. His song &quot;Don&amp;#039;t Give a Dose to the One You Love Most,&quot; from Freakin&amp;#039; at the Freakers Ball, was later adopted as a theme in different anti-venereal disease campaigns. \n\nEven as he was celebrated in sophisticated musical circles for his satirical and adult-oriented songs, however, Silverstein was a best-selling author of children&amp;#039;s books, including Falling Up (1996), The Missing Piece (1982), Where the Sidewalk Ends (1981), A Light in the Attic (1981), and most enduring of all, The Giving Tree (1964), which has remained in print almost continuously for close to 40 years. He also wrote a play, Wild Life, that had its off-Broadway debut in 1983 to rave reviews, and he earned an Oscar nomination as a songwriter for &quot;I&amp;#039;m Checking Out,&quot; which he wrote for the 1990 Mike Nichols film Postcards from the Edge. His songs were also used in such movies as Ned Kelly, Coal Miner&amp;#039;s Daughter, Hearts of Fire, and Things Change. The world lost a unique and talented artist when Silverstein died of a heart attack at his home in Key West in May 1999. \n &lt;a href=&quot;\nhttp://allmusic.com/cg/amg.dll?p=amg&amp;sql=11:aifexqq5ldhe~T1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://allmusic.com/cg/amg.dll?p=amg&amp;sql=11:aifexqq5ldhe~T1&lt;/a&gt;\n\n\nBoy Named Sue and His Other Country Songs\n\n1. Alimoney \n2. Dirty Ol&amp;#039; Me \n3. Cloudy Sky \n4. Kick It Again \n5. Someday&amp;#039;s Here \n6. Time \n7. Boy Named Sue \n8. Pathetic Way Of Getting Over Me \n9. Somebody Stole My Rig \n10. Comin&amp;#039; After Jinny \n11. Daylight Dreamer \n12. Bigtime \n\nThe Best of Shel Silverstein: His Words His Songs His Friends\n\n1. A Light In The Attic Shel Silverstein 0:26 \n2. A Front Row Seat To Hear Ole Johnny Sing Shel Silverstein 3:55 \n3. Freakin&amp;#039; At The Freakers&amp;#039; Ball Dr. Hook &amp; The Medicine Show 2:48 \n4. Monsters I&amp;#039;ve Met Shel Silverstein 0:35 \n5. The Unicorn The Irish Rovers 3:16 Album Only \n6. The Dragon Of Grindly Grun Shel Silverstein 1:01 \n7. Marie Lavaux Bobby Bare 3:11 \n8. Sarah Cynthia Sylvia Stout Would Not Take the Garbage Out Shel Silverstein 2:36 \n9. Sylvia&amp;#039;s Mother Dr. Hook &amp; The Medicine Show 3:52 \n10. The Taker Kris Kristofferson 3:16 \n11. Homework Machine Shel Silverstein 0:47 \n12. Ickle Me, Pickle Me, Tickle Me Too Shel Silverstein 1:52 \n13. Crowded Tub Shel Silverstein 0:18 \n14. Rock &amp;#039;N&amp;#039; Roll Band Shel Silverstein 1:14 \n15. The Cover Of &quot;Rolling Stone&quot; Dr. Hook &amp; The Medicine Show 2:55 \n16. Daddy What If Bobby Bare 2:42 \n17. Zebra Question Shel Silverstein 0:44 \n18. Plastic Shel Silverstein 2:29 Album Only \n19. A Couple More Years Willie Nelson 4:05 \n20. Peanut-Butter Sandwich Shel Silverstein 3:34 \n21. Queen Of The Silver Dollar Dr. Hook &amp; The Medicine Show 4:46 \n22. The Generals Shel Silverstein 1:51 \n23. I Got Stoned And I Missed It Shel Silverstein 3:10 \n24. A Boy Named Sue Johnny Cash 3:46 \n25. Boa Constrictor Shel Silverstein 1:13 \n26. 26 Second Song Shel Silverstein 0:30 \n\nI&amp;#039;m So Good That I Don&amp;#039;t Have to Brag!\n\n1. Modern Talk \n2. I Once Knew a Woman \n3. Ever Lovin&amp;#039; Machine \n4. Lookin&amp;#039; for Myself \n5. Ugliest Man in Town \n6. I&amp;#039;m So Good That I Don&amp;#039;t Have to Brag \n7. Mermaid \n8. I Can&amp;#039;t Touch the Sun \n9. Plastic \n10. Better Not Ask Me \n11. Yowsah! \n12. Lemmebesomethin&amp;#039; \n13. Testing the Bomb \n","torrent":{"xt":"urn:btih:15c75cb3ff125ec23b9b2c32396bffec03068383","amp;dn":"Comedy+-+Shel+Silverstein+collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15c75cb3ff125ec23b9b2c32396bffec03068383","infoHashBuffer":{"type":"Buffer","data":[21,199,92,179,255,18,94,194,59,155,44,50,57,107,255,236,3,6,131,131]},"announce":[],"urlList":[]}}