{"title":"Pickman's Model","uid":8653615,"size":75232943,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:16add09fc84fc794913d8eb24c455c9d9ed362fb&amp;dn=Pickman%27s+Model&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1373161338,"description":"'Pickman's Model'\n\nDen Ung Herr Holms Tegnede Tjenster, 2012, 89 pages\n\nOriginal text by H.P. Lovecraft\n\nAdapted, Edited and Illustrated by Kim Holm\n\nRevolutionSF review...\n\nJust in time for the Halloween season comes an adaptation of one of horror legend H.P. Lovecraft's classic tales, Pickman's Model., in the form of a nifty little graphic novel. Norwegian artist Kim Holm has done an interesting thing: depicted a fairly florid chiller of a short story in a spare, lean graphic style that leaves a lot to the reader's imagination.\n\nPickman's Model tells the story of a narrator who is friends with macabre painter and artist Richard Upton Pickman. Pickman has been ejected from the Boston Art Club because of the content of his work. The narrator visits the artist in his studio only to make a startling and horrible discovery. Very short and to the point.\n\nHolm captures the nervous pacing feeling of the narrator as he relays his story. Drawn in blacks and whites and grays, the subjects of the story have a sharp and jagged feel to them.\n\nPickman himself comes across as a large, dark Mephistophelean figure who seems quite joyous in his ghoulish surroundings.\n\nThe chiaroscuro look in some frames only adds to the edgy tension of what is, in my opinion, one of Lovecraft's best short stories, and certainly one of his most well known.","torrent":{"xt":"urn:btih:16add09fc84fc794913d8eb24c455c9d9ed362fb","amp;dn":"Pickman%27s+Model","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16add09fc84fc794913d8eb24c455c9d9ed362fb","infoHashBuffer":{"type":"Buffer","data":[22,173,208,159,200,79,199,148,145,61,142,178,76,69,92,157,158,211,98,251]},"announce":[],"urlList":[]}}