{"title":"MilfHunter - Kacey Jordan, Cory Chase (Dick For Two) NEW 02 May","uid":14501409,"size":336791807,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:16d25714601703640e1da7ce20d87ed6d55fa9f3&amp;dn=MilfHunter+-+Kacey+Jordan%2C+Cory+Chase+%28Dick+For+Two%29+NEW+02+May+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1462188488,"description":"Cory has not been getting along with her step daughter Kacey lately. She asked her husband for some advice before he went to work and he suggested she take her out for a girls day out. While she was talking outside , Kacey's man Bruce was hiding in the bushes checking her out with his camera lusting over her. Corey went back inside to see if she could get Kacey to go out with her. She was on the phone with bruce the whole time and flat out said no to her. Cory took off to run some errands and thats when Bruce came right in to fuck Kacey. They were not going at it for long before Cory returned unexpectedly to see them fucking right in the living room. She hid behind a corner and checked them out while she started playing with herself. This hot ass MILF Cory then barged in on them and proposed she suck and fuck Bruce while Kacey ate her pussy or she would tell her dad on her. Bruce was all about it but Kacey was a little hesitant. It did not matter cause Cory was too busy getting her way. Dont miss this smoking hot MILF show her step daughter and boyfriend what a real pro can do in the sack.\r\nTags: straight, blonde, big tits, shaved, white, threesome, mature porn, 18 plus teen porn, blow jobs, masturbation\r\n \nhttp://imgdone.com/viewer.php?file=69883716424620830754.jpg\r\n \nhttp://imgdone.com/viewer.php?file=31870073183943727143.jpg","torrent":{"xt":"urn:btih:16d25714601703640e1da7ce20d87ed6d55fa9f3","amp;dn":"MilfHunter+-+Kacey+Jordan%2C+Cory+Chase+%28Dick+For+Two%29+NEW+02+May+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16d25714601703640e1da7ce20d87ed6d55fa9f3","infoHashBuffer":{"type":"Buffer","data":[22,210,87,20,96,23,3,100,14,29,167,206,32,216,126,214,213,95,169,243]},"announce":[],"urlList":[]}}