{"title":"Guide to UNIX Using Linux (4th Edition) by Michael Palmer","uid":7553335,"size":42466659,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:16ef0fa9f5a1b523f0352625ee59a027c702abb8&amp;dn=Guide+to+UNIX+Using+Linux+%284th+Edition%29+by+Michael+Palmer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"N00bun2","files":-1,"time":1345535385,"description":"ISBN: 9781418837235\nGuide to UNIX Using Linux, 4th Edition by Michael Palmer\n\nWritten with a clear, straightforward writing style and packed with step-by-step projects for direct, hands-on learning, Guide to UNIX Using Linux, 4E is the perfect resource for learning UNIX and Linux from the ground up. Through the use of practical examples, end-of-chapter reviews, and interactive exercises, novice users are transformed into confident UNIX/Linux users who can employ utilities, master files, manage and query data, create scripts, access a network or the Internet, and navigate popular user interfaces and software. The updated 4th edition incorporates coverage of the latest versions of UNIX and Linux, including new versions of Red Hat, Fedora, SUSE, and Uuntu Linux. A new chapter has also been added to cover basic networking utilities, and several other chapters have been expanded to include additional information on the KDE and GNOME desktops, as well as coverage of the popular OpenOffice.org office suite. With a strong focus on universal UNIX and Linux commands that are transferable to all versions of Linux, this book is a &quot;must-have&quot; for anyone seeking to develop their knowledge of these systems.\n\nreupped with searchable PDF and overall file size reduced.","torrent":{"xt":"urn:btih:16ef0fa9f5a1b523f0352625ee59a027c702abb8","amp;dn":"Guide+to+UNIX+Using+Linux+%284th+Edition%29+by+Michael+Palmer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16ef0fa9f5a1b523f0352625ee59a027c702abb8","infoHashBuffer":{"type":"Buffer","data":[22,239,15,169,245,161,181,35,240,53,38,37,238,89,160,39,199,2,171,184]},"announce":[],"urlList":[]}}