{"title":"National Geographic Tales of the Weird: Unbelievable True Storie","uid":8350498,"size":19335173,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:170732b942be312958d095f664f2762ff73f3731&amp;dn=National+Geographic+Tales+of+the+Weird%3A+Unbelievable+True+Storie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1365328218,"description":" David Braun, &quot;National Geographic Tales of the Weird: Unbelievable True Stories&quot;\nEnglish | ISBN: 1426209657 | 2012 | EPUB | 544 pages | 18,4 MB\n\nWhen a farmer in Spain captured a two-headed snake in 2002, scientists wanted to study it. When National Geographic Daily News published a story about the discovery, people wanted to read all about it. More than a million people clicked on the site and kept coming back for more unbelievably true stories. An Internet sensation was born.\nSince then, more than 100 million individuals have clicked on stories put together by David Braun and his crack team of editors for National Geographic Daily News. And readers cannot get enough information about the often weird, sometimes miraculous things being discovered by scientists every day--incredible flying sharks, the strange sex lives of ducks, mind-controlling fungus that turns ants into zombies, and the darkest planet in the universe.\nThis reader features the most wildly popular, incredibly weird, and totally true stories from National Geographic's Daily News site presented in a compact, fact-filled reader. It will be a must-have for fans of Braun's website and for fans of &quot;fun fact&quot; books like the Uncle Johns Bathroom Reader series. The millions of fans who follow David Braun's National Geographic Daily News will be thrilled with this incredible reader filled with their favorites from the website. The most popular ones are all here presented in a lively, engaging format that is entertaining for the mind and easy on the wallet.","torrent":{"xt":"urn:btih:170732b942be312958d095f664f2762ff73f3731","amp;dn":"National+Geographic+Tales+of+the+Weird%3A+Unbelievable+True+Storie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"170732b942be312958d095f664f2762ff73f3731","infoHashBuffer":{"type":"Buffer","data":[23,7,50,185,66,190,49,41,88,208,149,246,100,242,118,47,247,63,55,49]},"announce":[],"urlList":[]}}