{"title":"Run Bitch Run - Sexploitation Movie with rape scene","uid":8877365,"size":1519033158,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:1731e9d05331f073c782c2620fc08d6b76ae99ea&amp;dn=Run+Bitch+Run+-+Sexploitation+Movie+with+rape+scene&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"KidAtomic","files":1,"time":1378244444,"description":"\nRun Bitch Run\n\nSynopsis: After she is brutally raped and left for dead, Catholic schoolgirl Catherine awakes with one thing on her mind, REVENGE.\n\nStarring: Cheryl Lyone, Christina DeRosa\nSupporting actors: Peter Tahoe, Ivet Corvea, Johnny Winscher\nDirected by: Joseph Guzman\nGenre: Horror, Thriller\nRuntime: 1 hour 27 minutes\nStudio: Vicious Circle Films\n\nREVIEW: \n\nIf I can describe my feelings regarding this movie in one word, it would be &quot;meh&quot;. While others may find it shocking at some points, overall I found it a bit too over the top to even illicit much of a response.\n\nThe plot is very basic: Two Catholic school girls are selling Bibles door to door when they witness a murder within a rundown house that happens to be a drug/prostitution den. The girls are captured, and one is immediately raped and killed while the other is taken to a wooded area and sexually assaulted. She manages to escape, and then exacts her revenge.\n\nIt's a very standard and gruesome rape/revenge plot, although to be frank there is more rape than revenge. Out of the nearly 90s minutes of video, the revenge part comprises about 20 minutes. While the content may not be as cringe-inducing as some horror movies, it is still very, very graphic. Do not watch if you are adverse to nudity, murder, rape, or necrophilia. Really, just don't. Personally, I found much of it so over the top that at points it seemed an almost satire of the 70s faux-snuff films. I'd have stopped watching the first 5 minutes in, but I have to admit, the subpar acting, horrible wanna-be porn music, grainy film and gratuitous violence had a deer-in-the-headlight effect on me. I continued watching (fast forwarding in many areas) simply because, like a nasty car crash, you just can't look away.\n\nIf you're interested in the cinematography, the film is shot on moderate quality film and then filtered to give it a grainy, retro feel. I have to admit, the director did a good job in this regard. As far as the shots and angles are concerned, it's competent, but lacks that slick professionalism you'd associate with &quot;real&quot; movies. In this regard it had the feel of a very well directed student film.\n\nIf you're expecting a fulfilling movie, skip this.\nIf you are disturbed by graphic violence and (simulated) sexual assault, skip this.\nIf you can stomach the questionable content and like laughing at so-so movies a la Mystery Science Theater, then this might work. \n\n\n[img]http://picturestack.com/303/101/1dVRunBitchRuN96.jpg[/img] .. [img]http://picturestack.com/303/101/S3tRunBitchRupUp.jpg[/img] .. [img]http://picturestack.com/303/102/LxoRunBitchRuh5t.jpg[/img]\n\n\n\n[img]http://picturestack.com/303/102/AkQRunBitchRue84.jpg[/img] .. [img]http://picturestack.com/303/102/jFMRunBitchRuPxW.jpg[/img] .. [img]http://picturestack.com/303/102/3zBRunBitchRu4Fq.jpg[/img]\n\n\n\n[img]http://picturestack.com/303/102/7GBRunBitchRumvo.jpg[/img] .. [img]http://picturestack.com/303/102/gwKRunBitchRul88.jpg[/img] .. [img]http://picturestack.com/303/102/WcsRunBitchRuXDD.jpg[/img]\n\n\n\n[img]http://picturestack.com/303/192/fI7RunBitchRungu.jpg[/img] .. [img]http://picturestack.com/303/192/YJzRunBitchRuUMs.jpg[/img] .. [img]http://picturestack.com/303/192/9ETRunBitchRuidb.jpg[/img]\n\n","torrent":{"xt":"urn:btih:1731e9d05331f073c782c2620fc08d6b76ae99ea","amp;dn":"Run+Bitch+Run+-+Sexploitation+Movie+with+rape+scene","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1731e9d05331f073c782c2620fc08d6b76ae99ea","infoHashBuffer":{"type":"Buffer","data":[23,49,233,208,83,49,240,115,199,130,194,98,15,192,141,107,118,174,153,234]},"announce":[],"urlList":[]}}