{"title":"Gowan - Best of [FLAC] [h33t] - Kitlope","uid":4372272,"size":501111479,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1764ea4e09209ab474661d8b9fd75c5a72b89f8f&amp;dn=Gowan+-+Best+of+%5BFLAC%5D+%5Bh33t%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Kitlope","files":20,"time":1220224499,"description":"File Type: FLAC Compression 6\nCd recorder: Plextor PX-716SA\nCd Ripper: Exact Audio Copy V0.99 prebeta 4\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s):http://tpb.tracker.thepiratebay.se:80/announce;\nTorrent Hash: 1764EA4E09209AB474661D8B9FD75C5A72B89F8F\nFile Size: 478 Mb\nYear: 1997\nLabel: Sony\n\nPlease help seed these FLACs! \n\n\nFrom Wiki:\n\n\n\nLawrence Gowan (born November 22, 1956) is a Canadian musician. Gowan has been both a solo artist and the current keyboardist and vocalist of the band Styx. His musical style is usually classified in the category of progressive rock. In 2006 Lawrence Gowan&amp;#039;s home was featured on MTV&amp;#039;s Cribs.\n\nAt the age of nineteen, he earned an ARCT in classical piano performance from the Royal Conservatory of Music, in Toronto. Upon graduation, he enjoyed modest local success with the band Rhinegold in 1976.\n\nAfter the band broke up five years later, Gowan began what was to become a very long and successful solo career under the stage name Gowan, releasing his first album under that name in 1982, which was produced by Kim Mitchell of Max Webster fame, who also played guitar on the album. This album contained the singles &quot;Victory&quot;, &quot;Give In&quot; and &quot;Keep Up The Fight&quot;. His 1985 album Strange Animal was his commercial breakthrough in Canada, produced by British producer David Tickle and featuring a more &amp;#039;theatrical&amp;#039; Gowan, backed by Peter Gabriel&amp;#039;s rhythm section players Tony Levin and Jerry Marotta. The album spawned the hit singles &quot;A Criminal Mind&quot;, &quot;(You&amp;#039;re A) Strange Animal&quot;, &quot;Guerilla Soldier&quot; and &quot;Cosmetics&quot;. His 1987 follow up Great Dirty World gave him another hit single with &quot;Moonlight Desires,&quot; featuring Jon Anderson (from Yes) on backing vocals as well as the fan favourite &quot;Dedication&quot;.\n\nHe released the more acoustic, adult contemporary ...but you can call me Larry in 1993 under his full name, returning to the Canadian pop charts with &quot;When There&amp;#039;s Time For Love&quot;, &quot;Soul&amp;#039;s Road&quot; and &quot;Dancing On My Own Ground&quot;. He subsequently released The Good Catches Up in 1995, which featured the single &quot;Guns And God&quot;, which received moderate airplay in Canada. Also that same year, Gowan was part of an all-star lineup at Toronto&amp;#039;s Massey Hall to celebrate Ronnie Hawkins&amp;#039; 60th birthday, sharing the stage with veteran rockers Jerry Lee Lewis, Carl Perkins and The Band. In 1997, Gowan released two live CDs: Sololive - No Kilt Tonight containing an amazing rendition of Ragtime&amp;#039;s classic &quot;King Chanteclerc Rag&quot;, and Au QuÃƒÂ©bec with a cover of Harmonium&amp;#039;s &quot;Pour un instant&quot; as well as his first composition in French, &quot;StÃƒÂ©phanie&quot;, for his dedicated fan base in the province of Quebec.\n\nIn 1997, Gowan released &quot;Healing Waters&quot; as a tribute to Diana, Princess of Wales after her death. However, despite what many believe, this song was not originally written for this purpose. It was, in fact, used in its original form in the movie When the Bullet Hits the Bone (starring Jeff Wincott) from 1995, two years prior to the accident that killed Diana. This song is not listed in the credits for the movie, however, it is very prominent in the film. After her death, the lyrics were modified into the version that Gowan fans have come to know.\n\nHis classic &quot;A Criminal Mind&quot; was covered in 2005 by Canadian hip-hop artist Maestro; Gowan appears in the video and his vocals are sampled on the track.\n\nHe also guest starred on the Canadian animated comedy series Chilly Beach.\n\nIn February 2006, Lawrence did four orchestra accompanied concerts in London, Ontario and Kitchener, Ontario.\n\nDuring the late 1980s and early 1990s, many of Gowan&amp;#039;s popular singles, like Moonlight Desires, were prominantly featured in the groundbreaking Canadian teen series Degrassi Junior High and Degrassi High. Later, Gowan&amp;#039;s music would also be featured in the made for TV movie from the Degrassi franchise entitled School&amp;#039;s Out. After the movie aired in Canada in 1992, there were numerous requests to radio stations from excited fans for Gowan&amp;#039;s music, in addition to the music of another new Canadian band, Harem Scarem, as well.[/quote]\n\n\n\n\n\nTracks: \n\n\nA Criminal Mind \nYou&amp;#039;re A Strange Animal \nGuerrilla Soldier \nCosmetics \nMoonlight Desires \nAwake The Giant \nAll The Lovers In The World \nLost Brotherhood \nOut Of A Deeper Hunger \nWhen There&amp;#039;s Time For Love \nDancing On My Own Ground \nSoul&amp;#039;s Road \nYour Stone Walls \nDedication\nThese Eyes (by Burton Cummings)\nHealing Waters...For Diana: Queen of Hearts\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:1764ea4e09209ab474661d8b9fd75c5a72b89f8f","amp;dn":"Gowan+-+Best+of+%5BFLAC%5D+%5Bh33t%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1764ea4e09209ab474661d8b9fd75c5a72b89f8f","infoHashBuffer":{"type":"Buffer","data":[23,100,234,78,9,32,154,180,116,102,29,139,159,215,92,90,114,184,159,143]},"announce":[],"urlList":[]}}