{"title":"Thomas Ott - Greetings From Hellville","uid":7585817,"size":20065059,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:18ddc283dc93b98ce793a990b116adb5085a194c&amp;dn=Thomas+Ott+-+Greetings+From+Hellville&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1346405221,"description":"'Greetings From Hellville'\n\nFantagraphics Books, 2002, 53 pages\n\nSwiss cartoonist Ott is well known in Europe, but outside of a few anthologies, this is the first collection of his work to be published in the U.S. Ott's wordless short stories synthesize two nearly forgotten comics traditions - the evocative, text-free 'woodcut' narrative style invented by Lynd Ward in the 1920s and '30s in books like Gods' Man, and the compact horror stories with a twist ending popularized by 1950s EC comics such as Shock Suspense Stories. Ott's stories tend to slip into easy irony or B-movie dopiness. In one, a man tries unsuccessfully to kill himself by increasingly violent means, then opens his window and is blown away by a nuclear bomb. In another, a murderous Klansman turns his violence on himself, while it turns out a shoeshine boy has taken revenge by casting a voodoo spell on him. What salvages this collection is Ott's spectacular artwork, done on scratchboard (each page starts out totally black, and he scrapes down to the white pigment underneath). Every panel is composed of a frantic mass of tiny lines, and the characters alternately stand out from the backgrounds or melt into them. Ott's composition is powerful and dramatic, and (as with Ward's work) the form makes it look ageless, with masterful light and shadow effects. ","torrent":{"xt":"urn:btih:18ddc283dc93b98ce793a990b116adb5085a194c","amp;dn":"Thomas+Ott+-+Greetings+From+Hellville","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18ddc283dc93b98ce793a990b116adb5085a194c","infoHashBuffer":{"type":"Buffer","data":[24,221,194,131,220,147,185,140,231,147,169,144,177,22,173,181,8,90,25,76]},"announce":[],"urlList":[]}}