{"title":"Discovery of Freedom - Libertarianism (MOBI)","uid":7369505,"size":672555,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:199e45cbeabfb06ae87354959aa63ff1de5183c5&amp;dn=Discovery+of+Freedom+-+Libertarianism+%28MOBI%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anenome5","files":2,"time":1340198009,"description":"Discovery of Freedom by Rose Wilder Lane.\n\nMobi version, Kindle ready.\n-------------------------\n\nIn the early 1940s, despite continuing requests from editors for both fiction and non-fiction material, Lane turned away from commercial writing and became known as one of the most influential American libertarians of the middle 20th century.\n\nShe vehemently opposed the New Deal, perceived &quot;creeping socialism,&quot; Social Security, wartime rationing and all forms of taxation, claiming she ceased writing highly paid commercial fiction to protest paying income taxes.\n\nA staunch opponent of communism after experiencing it first hand in the Soviet Union during her Red Cross travels, Lane wrote the seminal The Discovery of Freedom (1943), and tirelessly promoted and wrote about individual freedom, and its impact on humanity.\n\nThe same year also saw the publication of Paterson's The God of the Machine and Ayn Rand's novel The Fountainhead, and the three women have been referred to as the founding mothers of the American libertarian movement with the publication of these works.\n\nWriter Albert Jay Nock wrote that Lane's and Paterson's nonfiction works were &quot;the only intelligible books on the philosophy of individualism that have been written in America this century.&quot; The two women had &quot;shown the male world of this period how to think fundamentally ... They don't fumble and fiddle around--every shot goes straight to the centre.&quot; Journalist John Chamberlain credits Rand, Paterson and Lane with his final &quot;conversion&quot; from socialism to what he called &quot;an older American philosophy&quot; of libertarian and conservative ideas.\n\nAs Lane grew older, her political opinions solidified as a fundamentalist libertarian.","torrent":{"xt":"urn:btih:199e45cbeabfb06ae87354959aa63ff1de5183c5","amp;dn":"Discovery+of+Freedom+-+Libertarianism+%28MOBI%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"199e45cbeabfb06ae87354959aa63ff1de5183c5","infoHashBuffer":{"type":"Buffer","data":[25,158,69,203,234,191,176,106,232,115,84,149,154,166,63,241,222,81,131,197]},"announce":[],"urlList":[]}}