{"title":"The Secret Lore of Magic (gnv64)","uid":7517753,"size":16361843,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:19a982e51f102a8e32ee8e5b4d7a716baf4d5a6d&amp;dn=The+Secret+Lore+of+Magic+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gnv65","files":-1,"time":1344527860,"description":"The Secret Lore of Magic : Books of the Sorcerers \nBy Sayed Idries Shah\nFrederick Muller Ltd | 1957 | 314 pages | PDF | 15.6 mb\n\nBlack Magic and sorcery have been practised through the ages with the aid of certain writings which were jealously guarded for uncounted centuries.\nSuch works are the Black Books-the Books of the Magicians. They contain spells, charms and the methods of making powerful talismans; the rituals of raising spirits through the Magical Circle-the whole gamut of supernatural power\nand its attaining.\nTo this very day, copies of these Grimoircs (the 'Grammars' of Sorcery) are rare indeed. While books by occultist writers based to some extent upon parts of certain grimoires continue to appear, yet the actual sources have never\nbeen made available for study and comparison.\nThis present work contains not one, but all the major source-books of magical arts: in most cases translated from French, Latin, Hebrew and other tongues, annotated and commentated upon-and fully illustrated by numerous diagrams, signs and characters.\nThe Secret Lore of Magic includes the entirc text of the four books of the Secrets of Albertus Magnus, the Book of the Spirits, the Almadel, the Book of Power, the Clavicle and the Testament, the Grimoire of Honorius the Great, and the processes of the Black Pact as given by the True Grimoire and the Great Grimoire.\nNothing even approaching such a survey of the fundamental magical literature has ever before been made, in any language.","torrent":{"xt":"urn:btih:19a982e51f102a8e32ee8e5b4d7a716baf4d5a6d","amp;dn":"The+Secret+Lore+of+Magic+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19a982e51f102a8e32ee8e5b4d7a716baf4d5a6d","infoHashBuffer":{"type":"Buffer","data":[25,169,130,229,31,16,42,142,50,238,142,91,77,122,113,107,175,77,90,109]},"announce":[],"urlList":[]}}