{"title":"The Koran With Commentary - Rodwell, Adams","uid":10409008,"size":10873832,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1afab36edf96093e507861552619695a65e67db7&amp;dn=The+Koran+With+Commentary+-+Rodwell%2C+Adams&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"starxteel","files":1,"time":1403502176,"description":"The Koran with Commentary\n\nTranslated from the Arabic by J. M. Rodwell, first published in 1861, was the first attempt by any translator to put the surahs (chapters) into some sort of chronological order. It has proven its popularity through the years, remaining as one of the top selling English translations and one of the most dependable.\n&quot;It scores in its choice of words to convey the meaning of the original Arabic. It is this writer's opinion that Rodwell's translation is one of the best to come from an English author.&quot; (Zwemer, &quot;Translations of the Koran&quot;, The Muslim World, Vol. 5, p.251).\n\nTopical Commentary by Moody Adams\nMoody Adams, an American religious writer, prepared this commentary after nine years of study. He interviewed Islamic clergymen, including an expert who taught at the University of Cairo. He traveled in Iraq, Jordan, Israel, Egypt, Kuwait, Turkey, Uganda and India to talk with people in countries with large Islamic populations. After intense study of 8 translations of the Koran and an Islamic commentary he prepared this Koran with commentary in the hope of clarifying exactly what Islam's holy book teaches. The extremist Muslims in the Middle East will find the interpretation far too liberal. The secular Muslims in the West will find it far to conservative. Hopefully, the reader will find that it captures the truths of the text.\n\nA complete English copy of the Koran with a clear Christian commentary. The great themes of the Koran are arranged by topics to give readers a clear understanding of what Islam's holy book teaches on major subjects.","torrent":{"xt":"urn:btih:1afab36edf96093e507861552619695a65e67db7","amp;dn":"The+Koran+With+Commentary+-+Rodwell%2C+Adams","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1afab36edf96093e507861552619695a65e67db7","infoHashBuffer":{"type":"Buffer","data":[26,250,179,110,223,150,9,62,80,120,97,85,38,25,105,90,101,230,125,183]},"announce":[],"urlList":[]}}