{"title":"Slam - April 2014","uid":9659939,"size":23143817,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1c932dc0a54d78e11905b6d840b8071439a9aced&amp;dn=Slam+-+April+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sidmal","files":-1,"time":1393256844,"description":"Slam - April 2014\nEnglish | 88 pages | True PDF | 22.00 Mb\n\n\n\n\nSLAM was launched in 1994 as a basketball magazine that combined the sport with hip hop culture at a time when the genre was becoming increasingly popular. It was founded by publisher Dennis Page at Harris Publications, and he hired Cory Johnson to be the first Editor in Chief. Its first issue had a cover story on Larry Johnson of the Charlotte Hornets (written by future Fortune editor Andrew Serwer) and a feature on University of California freshman Jason Kidd. Many of the magazine's lasting features, such as In Your Face, Slam-a-da-month, and Last Shot all began with that first issue.\n\nSLAM's ownership has changed several times. Peterson Publishing bought SLAM in 1998. The next year, Peterson was acquired by British publisher EMAP. In 2001, EMAP sold its US division to Primedia. When Primedia left the magazine business in 2007, current owner Source Interlink acquired a majority of the company, including SLAM.\n\nThe magazine carries advertising for basketball related products, street-wear clothing and hip hop music, and has been credited with helping to market hip hop culture and basketball as one.\n\nSLAM has published 166 issues in its history, and has featured the biggest names in basketball on its cover, in articles, and on its famous SLAMups posters. To date, only one female athlete has ever appeared on the SLAM cover - Chamique Holdsclaw in October 1998. Kobe Bryant and LeBron James have appeared on a record seventeen covers. &quot;A Basketball On Fire&quot; was the 1st SLAM Mag cover without a player in February 2012.\n","torrent":{"xt":"urn:btih:1c932dc0a54d78e11905b6d840b8071439a9aced","amp;dn":"Slam+-+April+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c932dc0a54d78e11905b6d840b8071439a9aced","infoHashBuffer":{"type":"Buffer","data":[28,147,45,192,165,77,120,225,25,5,182,216,64,184,7,20,57,169,172,237]},"announce":[],"urlList":[]}}