{"title":"The Graduate - Charles Webb","uid":12008736,"size":2320830,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1cadba3d033fd4d440050328488d04dd71de2ebf&amp;dn=The+Graduate+-+Charles+Webb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1434042921,"description":"Published in 1963, Charles Webb's The Graduate was a sly and provocative first novel that is often overshadowed by the success of Mike Nichol's sensational 1967 film. \n\nThe Graduate is a novel that speaks to its time: a time when young Americans were beginning to question, for perhaps the first time, the materialistic values that the postwar culture had taught them. Its hero is at once worldly and naive, a dichotomy that won't last for very long as Benjamin Braddock, the appealing young man of great promise who seems to have everything going for him, sets out to explore his world. \n\nAfter returning to his parent's home after graduation, Braddock ponders his future and finds himself in a state of confusion and depression. It seems the only thing that really rallies him is the attention of Mrs. Robinson, the bored attractive wife of his father's law partner, who makes a play for Benjamin who responds in kind. What the affair lacks in passion, it makes up for in intensity. \n\nThe affair with Mrs. Robinson continues until Benjamin discovers the Robinsons' beautiful daughter Elaine, with whom he falls promptly in love. Driven to a fit of jealousy, Mrs. Robinson will have none of it, and she tells her daughter of her affair with Benjamin in an attempt to separate the two. Undeterred however, Benjamin pursues Elaine, even though she becomes involved with somebody else. He pursues her all the way to the altar, in fact. \n\nThe Graduate takes a hard look at contemporary society and social mores, and while it does so with panache and humor, the underlying message is not lost on the reader. It is a scathing look at how vacuous and materialistic middle-class American life had become in the mid-20th century. The Chicago Sunday Review wrote that The Graduate &quot;moves with the speed and drive of a runaway locomotive.&quot;","torrent":{"xt":"urn:btih:1cadba3d033fd4d440050328488d04dd71de2ebf","amp;dn":"The+Graduate+-+Charles+Webb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cadba3d033fd4d440050328488d04dd71de2ebf","infoHashBuffer":{"type":"Buffer","data":[28,173,186,61,3,63,212,212,64,5,3,40,72,141,4,221,113,222,46,191]},"announce":[],"urlList":[]}}