{"title":"The Trials of Darryl Hunt (2006)","uid":4608046,"size":724300260,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1dc434755dcb165420371ef7838c17d737a3d66f&amp;dn=The+Trials+of+Darryl+Hunt+%282006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"finding_hope","files":3,"time":1230538770,"description":"--This is my own TV capture of this doc--\n\nThe Trials of Darryl Hunt (2006)\n\n\nProgram Info:\nDirectors: Ricki Stern &amp; Anne Sundberg\n\nIn 1984, Deborah Sykes, a young white newspaper reporter, \nwas assaulted, raped, sodomized and stabbed to death just \nblocks from where she worked in Winston-Salem, North \nCarolina. Though no physical evidence implicated him, \nDarryl Hunt, a 19-year-old black man, was ultimately \nconvicted of the crime and sentenced to life in prison.\n\nTen years later, DNA testing proved that Hunt did not rape \nSykes, and cast serious doubts on his involvement in her \nmurder, but he spent another decade behind bars for a crime \nhe did not commit. The eye-opening HBO documentary THE \nTRIALS OF DARRYL HUNT tells his riveting story - and the \nstory of those who fought to clear his name.\n\nMore than a decade in the making, Ricki Stern and Annie \nSundberg's THE TRIALS OF DARRYL HUNT examines a community \nand criminal justice system subject to racial bias and \ntainted by fear. Hunt was charged with Deborah Sykes' \nmurder largely on the strength of an eyewitness identification \nby a former Ku Klux Klan member, and convicted by a jury \nof 11 whites and one black. It wasn't until 2004, through \nthe help of an investigative series by Winston-Salem \njournalist Phoebe Zerwick, that he was finally cleared. \nOver that 20-year span, his defense attorneys and public \nsupporters never stopped fighting for him. In February \n2007, the city of Winston-Salem compensated Hunt $1.65 \nmillion for his wrongful conviction and incarceration, and \nhe also received $358,545 in compensation from the state \nof North Carolina.\n\nTold from the point of view of the principal subjects - Mark \nRabil, the unyielding defense attorney, and Hunt, the \nwrongfully convicted man - the film challenges the assumption \nthat all Americans have access to unbiased justice. Hunt's \nreal-life courtroom drama reflects systemic issues of broad \nnational concern: the liabilities of cross-racial eyewitness \nidentification, prosecutorial misconduct, inexperienced \ndefense attorneys assigned to capital cases, racial bias \nin death penalty cases, and errors in police procedure.\n\nFeaturing extensive personal narratives and exclusive footage \nfrom the two decades of the case, THE TRIALS OF DARRYL HUNT \ngoes behind the scenes with Hunt, Rabil and their ever-increasing \nlegion of allies, as the years pass and their hopes rise \nand fall with numbing frequency. The cameras reveal poignant \nmoments between Hunt and Rabil at the prison, and capture \nthe scene when a visibly distraught Rabil and community activist \nLarry Little learn that their second appeal has been denied, \nand then must tell Hunt the news.\n\nAs Hunt's story unfolds, it becomes a textbook example of \nhow the presumption of innocence can be subverted when a \ncity's need to solve a gruesome crime, fed by sensational \nmedia coverage, leads to a rush to judgment that validates \na flimsy case. In addition to clearing their own client, \nthe defense team is ultimately instrumental in identifying \nthe real killer, who is now behind bars.\n\nAn official selection of the 2006 Sundance film Festival, \nTHE TRIALS OF DARRYL HUNT won the Documentary Jury Prize \nand Audience Award at the Newport International Film Festival, \nthe Audience Award and Director's Choice Best Documentary \nat the Sedona International film Festival, the Audience Award \nat the Full Frame Documentary Film Festival, the Golden Space \nNeedle Award at the Seattle International Film Festival, Best \nFeature at the Nantucket Film Festival, Best Documentary at \nthe Galway Film Fleadh, and Best of Show and Audience at \nthe Bend Film Festival.\n\nRicki Stern's TV credits include directing and co-producing \n&quot;In My Corner,&quot; and directing and producing the EmmyÃ‚Â®-nominated \n&quot;Neglect Not the Children,&quot; hosted by Morgan Freeman. Her \nHBO producing credits include the &quot;Autopsy&quot; specials and the \ndocumentary &quot;Murder 9 to 5.&quot; Stern is the author of the children's \nbook series &quot;Beryl Bean: Mighty Adventurer of the Planet&quot; and \nfounded Break Thru Films, Inc. in 1990. The company is currently \nworking on the feature film version of Darryl Hunt's story.\n\nAnnie Sundberg produced the independent feature film &quot;Tully,&quot; \nnominated for four 2003 IFP Spirit Awards (Best Film, Best \nScreenplay, Best Debut Performance, Best Supporting Actor). \nHer TV directing credits include &quot;Trailer Fabulous&quot; and \n&quot;Behind the Bash with Giada De Laurentiis.&quot; Sundberg's TV \nproducing credits include 1995's OscarÃ‚Â®- winning &quot;One Survivor \nRemembers,&quot; a co-production of HBO and the U.S. Holocaust Memorial \nMuseum, as well as &quot;Family Plots&quot; and &quot;In My Corner.&quot;\n\nSundberg and Stern most recently co-directed and co-produced \nthe feature documentary &quot;The Devil Came on Horseback,&quot; which \npremiered at the 2007 Sundance Film Festival.\n\nTHE TRIALS OF DARRYL HUNT is executive produced and directed \nby Ricki Stern &amp; Annie Sundberg; producers, Katie Brown and \nWilliam Rexer II, Ricki Stern and Annie Sundberg; editor, \nShannon Kennedy; 16mm cinematography, William Rexer II; \nadditional cinematography, John Foster, Alan Jacobsen and \nShannon Kennedy; original score, Paul Brill; sound editor, \nBrad Bergbom. For HBO: consulting editor, Geof Bartz, A.C.E.; \nsupervising producer, Nancy Abraham; executive producer, Sheila \nNevins. &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0446055/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0446055/&lt;/a&gt;\n\nFilm's Site: http://www.breakthrufilms.org\nBuy The DVD: http://www.amazon.com/o/ASIN/B000S0SYHI/105-5338634-1402831?SubscriptionId=0XYC6RPMBTE1GHZ4AQ02\n\n\nVideo Info:\nThe.Trials.of.Darryl.Hunt.2006.704x352.xvid.mp3-snach.avi\n\nFormat                           : AVI\nFormat/Info                      : Audio Video Interleave\nFile size                        : 691 MiB\nDuration                         : 1h 46mn\nOveral bit rate                  : 908 Kbps\nWriting application              : MediaCoder 0.6\n\nVideo\nFormat                           : MPEG-4 Visual\nFormat profile                   : Streaming Video@L1\nFormat settings, BVOP            : No\nFormat settings, QPel            : No\nFormat settings, GMC             : 3 warppoints\nFormat settings, Matrix          : Default\nCodec ID                         : XVID\nCodec ID/Hint                    : XviD\nDuration                         : 1h 46mn\nBit rate                         : 798 Kbps\nWidth                            : 704 pixels\nHeight                           : 352 pixels\nDisplay aspect ratio             : 16/9\nFrame rate                       : 29.970 fps\nResolution                       : 8 bits\nColorimetry                      : 4:2:0\nScan type                        : Progressive\nBits/(Pixel*Frame)               : 0.107\nStream size                      : 607 MiB\nWriting library                  : XviD 1.2.0.dev47 (UTC 2006-11-01)\n\nAudio\nFormat                           : MPEG Audio\nFormat version                   : Version 1\nFormat profile                   : Layer 3\nCodec ID                         : 55\nCodec ID/Hint                    : MP3\nDuration                         : 1h 46mn\nBit rate mode                    : Constant\nBit rate                         : 96.0 Kbps\nChannel(s)                       : 2 channels\nSampling rate                    : 48.0 KHz\nResolution                       : 16 bits\nStream size                      : 73.1 MiB\n\n\nTrackers:\nhttp://tracker.conspiracycentral.net/announce\nhttp://tracker.thepiratebay.se:80/announce\nhttp://denis.stalker.h3q.com:6969/announce\nhttp://open.tracker.thepiratebay.se/announce\nhttp://torrent-downloads.to:5869/announce\n\nVisit us at:\nhttp://tracker.ConspiracyCentral.net\n\nEnjoy &amp; Seed!","torrent":{"xt":"urn:btih:1dc434755dcb165420371ef7838c17d737a3d66f","amp;dn":"The+Trials+of+Darryl+Hunt+%282006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1dc434755dcb165420371ef7838c17d737a3d66f","infoHashBuffer":{"type":"Buffer","data":[29,196,52,117,93,203,22,84,32,55,30,247,131,140,23,215,55,163,214,111]},"announce":[],"urlList":[]}}