{"title":"Stanley Hauerwas - War and the American Difference (pdf)","uid":8866359,"size":2111908,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1e51bf22df46ce2983069b408faf50be84d3c322&amp;dn=Stanley+Hauerwas+-+War+and+the+American+Difference+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1377918822,"description":"Stanley Hauerwas - War and the American Difference: Theological Reflections on Violence and National Identity (Baker, 2011). 188 pages.\n\nHigh quality pdf file from a retail source.\n\n\ndescription:\n\nHow are American identity and America's presence in the world shaped by war, and what does God have to do with it?\n\nIn War and the American Difference, Stanley Hauerwas reflects theologically on war, church, justice, and nonviolence. He explores such issues as how America depends on war for its identity, how war affects the soul of a nation, the sacrifices that war entails, and why war is considered &quot;necessary,&quot; especially in America. He also examines the views of nonviolence held by Martin Luther King Jr. and C. S. Lewis, how Jesus constitutes the justice of God, and the relationship between congregational ministry and Christian formation in America.\n\n&quot;Disenthralling Americans from war will require an authentic realism that displaces the illusions commonly passing for realism. In this luminous volume, Stanley Hauerwas continues the vital work of planting the signposts that show us the way.&quot;--Andrew J. Bacevich, Boston University; author of Washington Rules: America's Path to Permanent War\n\n&quot;Beginning from the startling claim that war defines American political identity, these essays should interest both religious and secular readers. Hauerwas defends a Christian pacifism that allows no compromises with war, including that most common form of compromise--just war theory. Christians will be powerfully challenged by his claim that nonviolence is a necessary condition of a church that is a living witness to Christ. Secular readers will be forced to rethink the ground of their own commitment to a politics built on violent sacrifice. Hauerwas demands of all of us that we think through the character of our faith and the sources of ultimate meaning in our lives.&quot;--Paul W. Kahn, Robert W. Winner Professor of Law and the Humanities, Yale Law School\n\n\nabout the author:\n\nStanley Hauerwas (born July 24, 1940) is an American theologian, ethicist, and public intellectual. Hauerwas currently teaches at Duke University, serving as the Gilbert T. Rowe Professor of Theological Ethics at Duke Divinity School with a joint appointment at the Duke University School of Law. Before coming to Duke, Hauerwas was a longtime professor at the University of Notre Dame. He is considered by many to be one of the world's most influential living theologians and was named &quot;America's Best Theologian&quot; by Time Magazine in 2001. He was also the first American to deliver the prestigious Gifford Lectures in over forty years. His work is frequently read and debated by scholars in fields outside of religion, theology, or ethics, such as political philosophy, sociology, history, and literary theory. Hauerwas has achieved notability outside of academia as a public intellectual, even appearing on The Oprah Winfrey Show.\n\nThough Hauerwas is most well known for his work related to Christian ethics, the relationship between Christianity and politics, and ecclesiology, Hauerwas has written widely on a diverse range of subjects, such as systematic theology, philosophical theology, political philosophy, the philosophy of social science, law, education, bioethics, and medical ethics. Hauerwas is known for his outspoken advocacy of pacifism, as well of his fierce criticism of liberal democracy, capitalism, militarism, American civil religion and both Christian fundamentalism and liberal Christianity. Among his most important contributions to modern theology are his advocacy of and work related to virtue ethics and postliberal theology.\n\nHauerwas's work draws from a number of theological perspectives, including Methodism, Anabaptism, Anglicanism, and Catholicism. He is commonly cited as a member of the evangelical left. Hauerwas's book, A Community of Character: Toward a Constructive Christian Social Ethic, was named as one of the one hundred most important books on religion in the 20th century by Christianity Today. His most widely known book, however, is likely Resident Aliens: Life in the Christian Colony, which was co-written with William Willimon.","torrent":{"xt":"urn:btih:1e51bf22df46ce2983069b408faf50be84d3c322","amp;dn":"Stanley+Hauerwas+-+War+and+the+American+Difference+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e51bf22df46ce2983069b408faf50be84d3c322","infoHashBuffer":{"type":"Buffer","data":[30,81,191,34,223,70,206,41,131,6,155,64,143,175,80,190,132,211,195,34]},"announce":[],"urlList":[]}}