{"title":"Stephen Barry Band - Blues Under A Full Moon (1990)Mp3[CR-Bt]","uid":4645154,"size":57988689,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1f7b365705abfe54b0921b2cca9c1b4facb76e6f&amp;dn=Stephen+Barry+Band+-+Blues+Under+A+Full+Moon+%281990%29Mp3%5BCR-Bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"CR-Bt","files":15,"time":1231855988,"description":"Stephen Barry, dal 1975, ÃƒÂ¨ a capo della Stephen Barry Band, il miglior gruppo di MontrÃƒÂ©al e probabilmente di tutto il Canada. \nCon 6 albums alle spalle, il bluesman ha anche registrato degli albums con numerosi artisti quali: Steve Hill, Ray Bonneville, Penny Lang et Michael Jerome Browne.  \nVa detto che l'artista ha avuto il grande privilegio di conoscere e approfondire le radici del  blues per merito dei membri della prima generazione di bluesmen : Big Mama Thornton, John Lee Hooker, Hubert Sumlin, Pinetop Perkins, Bo Diddley ed altri.\nE' stato anche nominato il miglior bassista Blues nel 2002 al Maple Blues Awards di Toronto.  \nIl suo gruppo ha anche vinto il premio per il miglior gruppo blues in Canada presso la Jazz Report Awards 1996, e il loro album &quot;Happy Man&quot; ha vinto il titolo di miglior disco nella stessa cerimonia. \nInoltre, la Stephen Barry Band ÃƒÂ¨ stata nominata due volte per il FÃƒÂ©lix (1995 e 1996).\nStefano e il suo gruppo hanno fatto molti tour ed apparizioni in QuÃƒÂ©bec e all'estero. Francia, Brasile e Stati Uniti sono le loro mete preferite.\nDurante la sua lunga carriera musicale, Stephen Barry ha creato un catalogo di trenta composizioni originali e arrangiamenti di un repertorio con oltre 300 titoli, principalmente blues. ","torrent":{"xt":"urn:btih:1f7b365705abfe54b0921b2cca9c1b4facb76e6f","amp;dn":"Stephen+Barry+Band+-+Blues+Under+A+Full+Moon+%281990%29Mp3%5BCR-Bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f7b365705abfe54b0921b2cca9c1b4facb76e6f","infoHashBuffer":{"type":"Buffer","data":[31,123,54,87,5,171,254,84,176,146,27,44,202,156,27,79,172,183,110,111]},"announce":[],"urlList":[]}}