{"title":"Pennsylvania Omnibus - Michael Bunker","uid":10281273,"size":680209,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1ffc5841d0cb21f9eac9187fe080ef3b0181d018&amp;dn=Pennsylvania+Omnibus+-+Michael+Bunker&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1401707793,"description":"Young Amishman Jedidiah Troyer signed up for an emigration\nprogram designed to colonize the planet of New Pennsylvania with plain farmers\nwho won't make any trouble. But Jed and his new friend Dawn arrive on New\nPennsylvania in the middle of a rebel uprising, and TRACE, a resistance group intent\non rising up against the government, has taken on the mission of getting Jed safely\nfrom the City to the Amish Zone. Being a stranger in the old world doesn't even\ncompare to being a stranger in a brand new world... a world steeped in secrets\nand deep in the midst of a war stretching across time and space.\n\nReview\n\n&quot;Pennsylvania* is a brilliant tale of extra-planetary colonization. With parallels to the European settlement of the America's, Michael Bunker draws on his Amish roots and lifestyle to portray that tenuous balance between mankind and its machines. He also knows better than most the difficulty of surviving on civilization's frontier. I daresay the wait for the next great Amish science fiction author may be finally at an end.&quot; ~ HUGH HOWEY, New York Times Bestselling Author of Wool, Sand, and Peace in Amber.*","torrent":{"xt":"urn:btih:1ffc5841d0cb21f9eac9187fe080ef3b0181d018","amp;dn":"Pennsylvania+Omnibus+-+Michael+Bunker","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ffc5841d0cb21f9eac9187fe080ef3b0181d018","infoHashBuffer":{"type":"Buffer","data":[31,252,88,65,208,203,33,249,234,201,24,127,224,128,239,59,1,129,208,24]},"announce":[],"urlList":[]}}