{"title":"Miles Davis - Steamin' With The Miles Davis Quintet (1961","uid":4636216,"size":97802562,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2017e1c0f99344fba1f9635297484a0d24f78920&amp;dn=Miles+Davis+-+Steamin%5C%27+With+The+Miles+Davis+Quintet+%281961&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"schon55","files":10,"time":1231561267,"description":"Miles Davis - Steamin' With The Miles Davis Quintet (1961)\nOriginal Release Date: 1961 \nAudio CD: (July 1, 1991 \nLabel: Ojc \nBitrate: mp3 320 kbps\n\nAmazon.com\nSteamin' is the last of the classic albums Prestige Records released from various sessions trumpeter Miles Davis recorded between November 1955 and October 1956 with his historic &quot;first&quot; quintet, including tenor saxophonist John Coltrane, pianist Red Garland, bassist Paul Chambers, and drummer Philly Joe Jones. Together with Cookin' ( also available in an audiophile format), Relaxin' (also available in an audiophile format), and Workin' (also available in an audiophile format ), Steamin' completes a series of memorable recordings masterfully engineered by Rudy Van Gelder that remains a definitive manifesto from the hard-bop era. One dynamic that gave this quintet its distinctive edge is the contrast between Davis's introspective playing on ballads (&quot;When I Fall In Love,&quot; &quot;Something I Dreamed Last Night&quot;) and Coltrane's hard-blowing passion ( &quot;Salt Peanuts,&quot; &quot;Well You Needn't&quot; ). Another is the interplay between Garland, Chambers, and Jones, who are not only consummate accompanists, but all-star soloists as well. The version of &quot;Surrey with the Fringe on Top&quot; here is a quintessential performance by this remarkable quintet. ~ Mitchell Feldman \n\nProduct Description\nThis classic Prestige session (one of four cut for the label by Davis' first permanent group) has been reissued many times. Davis is heard with his classic quintet of 1956 ( which featured tenor-saxophonist John Coltrane, pianist Red Garland, bassist Paul Chambers and drummer Philly Joe Jones ) performing six numbers, all of which are somewhat memorable. Highpoints are Surrey with the Fringe on Top, Diane and When I Fall in Love; Davis's muted tone rarely sounded more beautiful. \n\nOut of that quartet of LPs ( Cookin'..., Workin'..., Relaxin'..., Steamin'... ) culled from the 1956 Hackensack sessions with that absolutely *definitive* lineup of John Coltrane, Red Garland, Paul Chambers, and &quot;Philly&quot; Joe Jones, this is my favorite. That swing, that joyous *oomph* they collectively create, is not just outrageously foot-tapping, it's almost enough to get me out of my seat and MOVE (and that takes a lot, me being an assiduous non-dancer)! One of my favorite Miles Davis albums out of the almost limitless catalog. What words can express my appreciation that music this good has been preserved for all time on a CD I'll enjoy for the rest of my life? ~ Micah Newman\n\nFor many years I have nursed a belief that My Funny Valentine on Cookin' was the single best piece of jazz music ever recorded on CD. Some crises of faith-- Lester Young's This Year's Kisses, Dave Brubeck's Take Five, etc.-- had challenged this conviction, but for the first time I think I may have a conversion. \n\nMiles Davis's trumpet on Surrey With The Fringe on Top on this CD is the best that I have ever heard. It is physically impossible for anybody with a soul to be upset while listening to the first 35 seconds of this song. ~ William Baude\n\nThe Personnel:\nMiles Davis - Trumpet\nJohn Coltrane - Tenor saxophone\nPhilly Joe Jones - Drums\nRed Garland - Piano\nPaul Chambers - Bass\n\nMiles Davis - Steamin' With The Miles Davis Quintet Tracks:\n01 The Surrey With the Fringe On Top 9:08\n02 Salt Peanuts 6:11\n03 Something I Dreamed Last Night 6:18\n04 Diane 7:53\n05 Well You Needn't 6:23\n06 When I Fall In Love 4:27","torrent":{"xt":"urn:btih:2017e1c0f99344fba1f9635297484a0d24f78920","amp;dn":"Miles+Davis+-+Steamin%5C%27+With+The+Miles+Davis+Quintet+%281961","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2017e1c0f99344fba1f9635297484a0d24f78920","infoHashBuffer":{"type":"Buffer","data":[32,23,225,192,249,147,68,251,161,249,99,82,151,72,74,13,36,247,137,32]},"announce":[],"urlList":[]}}