{"title":"Dietrich Bonhoeffer - Letters and Papers from Prison (pdf)","uid":8498208,"size":6178999,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2017da7f62739db9b827dc353720e45a0ea6bff8&amp;dn=Dietrich+Bonhoeffer+-+Letters+and+Papers+from+Prison+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1369196444,"description":"Dietrich Bonhoeffer (Eberhard Bethge, ed.) - Letters and Papers from Prison (SCM Press, 1971). 437 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nOne of the most moving pieces of twentieth-century religious writing by the revolutionary theologian executed by the Nazis.\n\n\nReview\n\nLetters and Papers from Prison is a collection of notes and correspondence covering the period from Dietrich Bonhoeffer's arrest in 1943 to his execution by the Gestapo in 1945. The book is probably most famous, and most important, for its idea of &quot;religionless Christianity&quot;--an idea Bonhoeffer did not live long enough fully to develop, but whose timeliness only increases as the lines between secular and ecclesial life blur. Bonhoeffer's first mention of &quot;religionless Christianity&quot; came in a letter in 1944:\n\n&quot;What is bothering me incessantly is the question what Christianity really is, or indeed who Christ really is, for us today. The time when people could be told everything by means of words, whether theological or pious, is over, and so is the time of inwardness and conscience--and that means the time of religion in general. We are moving towards a completely religionless time; people as they are now simply cannot be religious any more. Even those who honestly describe themselves as &quot;religious&quot; do not in the least act up to it, and so they presumably mean something quite different by 'religious.' &quot;\n\nThe pleasures of Letters and Papers from Prison, however are not all so profound. Occasionally, Bonhoeffer's letters burst into song--sometimes with actual musical notations, other times with unforgettable phrases. Looking forward to seeing his best friend, Bonhoeffer writes, &quot;To meet again is a God.&quot;\n","torrent":{"xt":"urn:btih:2017da7f62739db9b827dc353720e45a0ea6bff8","amp;dn":"Dietrich+Bonhoeffer+-+Letters+and+Papers+from+Prison+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2017da7f62739db9b827dc353720e45a0ea6bff8","infoHashBuffer":{"type":"Buffer","data":[32,23,218,127,98,115,157,185,184,39,220,53,55,32,228,90,14,166,191,248]},"announce":[],"urlList":[]}}