{"title":"Esbjorn Svensson Trio - Tuesday Wonderland 2006","uid":6658850,"size":376162297,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:203a645913e63fef32e420adabcc8b0a7593384b&amp;dn=Esbjorn+Svensson+Trio+-+Tuesday+Wonderland+2006&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"barber9","files":-1,"time":1315430715,"description":"E.S.T. like to play with expectations, and they begin Tuesday Wonderland as you might assume, with a spare solo piano line hinting at a delicate baroque counterpoint. It's the kind of feather-stroked chamber jazz they've been working for a few years now. But just as you settle in, crushing drums and fuzzed arco bass drop in a groove from the apocalypse. This ominous track, Fading Maid Preludium, and its second half, Fading Maid Postludium, frame Tuesday Wonderland, setting in bas-relief an album of careening, intuitive improvisation. E.S.T. are frighteningly varied in their technique and deep in their understanding of jazz lore. You can hear echoes of Keith Jarrett and Ahmad Jamal in pianist EsbjÃƒÂ¶rn Svensson, from whom the trio take their name, but he also embraces a more modern vocabulary, hinting at Cecil Taylor while dancing gospel vamps and dropping rock power-chords. Drummer Magnus OstrÃƒÂ¶m can lay down the shuffling brush strokes of The Goldhearted Miner, pour out a progressive rock fusillade, or do a ballet of polyrhythmic shadings and colors that recall the late Steve McCall. The real chameleon of the group is bassist Dan Berglund. He plays soulful, muscular double bass lines, but he also triggers a synthesizer for both subtle shading and the hellion roar heard on that opening track. E.S.T. remain a group exploring the edges of jazz improvisation, managing to be free and intuitive while also maintaining melodic and rhythmic touchstones. Tracks like Brewery of Beggars are multipart journeys shifting from gentle lyricism to electric storms. E.S.T. have evolved from being the most ECM-like band that wasn't on ECM into their own natural and thoroughly modern hybrid.  (amazon.com)\n\n- - -\n\nEsbjÃƒÂ¶rn Svensson Trio - Tuesday wonderland 2006\n(MÃƒÂ¼nchen Act)\n\n 1. Fading maid preludium \n 2. Tuesday wonderland \n 3. The goldhearted miner  \n 4. Brewery of beggars \n 5. Beggar's blanket \n 6. Dolores in a shoestand \n 7. Where we used to live \n 8. Eighthundred streets by feet  \n 9. Goldwrap \n10. Sipping on the solid ground  \n11. Fading maid postludium\n\n\nEsbjÃƒÂ¶rn Svensson, piano\nDan Berglund, bas \nMagnus OstrÃƒÂ¶m, trummor\n","torrent":{"xt":"urn:btih:203a645913e63fef32e420adabcc8b0a7593384b","amp;dn":"Esbjorn+Svensson+Trio+-+Tuesday+Wonderland+2006","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"203a645913e63fef32e420adabcc8b0a7593384b","infoHashBuffer":{"type":"Buffer","data":[32,58,100,89,19,230,63,239,50,228,32,173,171,204,139,10,117,147,56,75]},"announce":[],"urlList":[]}}