{"title":"Colleen Hoover - Slammed &amp; Point of Retreat","uid":7565347,"size":5558198,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2117f55d42f60d07cee35c6cacd752cb197d4d96&amp;dn=Colleen+Hoover+-+Slammed+%26amp%3B+Point+of+Retreat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Ssmud","files":10,"time":1345847634,"description":"Both books in .mobi, .epub, and .pdf\n\n\n\nSLAMMED is Colleen Hoover's New York Times best selling debut novel.    \nAmazon's #1 United States Drama and a Top Rated e-book in Romance.  \nFollowing the unexpected death of her father, 18-year-old Layken is forced to be the rock for both her mother and younger brother. Outwardly, she appears resilient and tenacious, but inwardly, she's losing hope. \nEnter Will Cooper: The attractive, 21-year-old new neighbor with an intriguing passion for slams. Within days of their introduction, Will and Layken form an intense emotional connection, leaving Layken with a renewed sense of hope.\nNot long after a heart-stopping first date, they are slammed to the core when a shocking revelation forces their new relationship to a sudden halt. Daily interactions become impossibly painful as they struggle to find a balance between the feelings that pull them together, and the forces that tear them apart. \n\n\n\n\n\n\n\nThe second part to the two-book New York Times bestselling SLAMMED series, POINT OF RETREAT delivers just as much emotional punch, if not more. \n \nLayken and Will's relationship persevered through hardships, heartache and a cruel twist of fate, further solidifying that they belong together.  What they don't expect is that the very hardships which brought them together could ultimately be what tears them apart.  \n\n Layken is left questioning the foundation on which their relationship was built.  \n\nWill is left questioning how to further prove his love for the girl he's given up so much of his life for.\n\nAs if doubt isn't enough, the couple find themselves facing an even greater challenge.  One that could change not only their lives, but the lives of everyone who depend on them.   \n ","torrent":{"xt":"urn:btih:2117f55d42f60d07cee35c6cacd752cb197d4d96","amp;dn":"Colleen+Hoover+-+Slammed+%26amp%3B+Point+of+Retreat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2117f55d42f60d07cee35c6cacd752cb197d4d96","infoHashBuffer":{"type":"Buffer","data":[33,23,245,93,66,246,13,7,206,227,92,108,172,215,82,203,25,125,77,150]},"announce":[],"urlList":[]}}