{"title":"Cisco anyconnect-all-2.4.1012-k9","uid":5274938,"size":41878039,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:216d9301ce03bbbfc63328a24036549ec4d06303&amp;dn=Cisco+anyconnect-all-2.4.1012-k9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Buck.Nasty","files":1,"time":1263342938,"description":"The Cisco AnyConnect VPN Client provides remote users with secure VPN connections to the Cisco ASA 5500 Series Adaptive Security Appliance using the Secure Socket Layer (SSL) protocol and the Datagram TLS (DTLS) protocol. \n\nAnyConnect provides remote end users with the benefits of a Cisco SSL VPN client, and supports applications and functions unavailable to a clientless, browser-based SSL VPN connection. It runs on Microsoft Windows, Windows Mobile, Linux, and Mac OS X, and supports connections to IPv6 resources over an IPv4 network tunnel. You can upload the client to the security appliance to automatically download to remote users when they log in, or you can download and install it on the endpoint. You can configure the security appliance to uninstall AnyConnect from the endpoint after the connection terminates, or it can remain on the remote PC for future SSL VPN connections. \n\nIn addition to the Cisco Adaptive Security Appliance 5500 Series, Cisco IOS supports AnyConnect. For more information, see the Cisco IOS SSL VPN Data Sheet. \n","torrent":{"xt":"urn:btih:216d9301ce03bbbfc63328a24036549ec4d06303","amp;dn":"Cisco+anyconnect-all-2.4.1012-k9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"216d9301ce03bbbfc63328a24036549ec4d06303","infoHashBuffer":{"type":"Buffer","data":[33,109,147,1,206,3,187,191,198,51,40,162,64,54,84,158,196,208,99,3]},"announce":[],"urlList":[]}}