{"title":"Doctor Who - Season 18 - (1980-81) - 28 Episodes","uid":9156905,"size":4932073509,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:22635b1c4f744cedf5b0a1019f25bc1938035237&amp;dn=Doctor+Who+-+Season+18+-+%281980-81%29+-+28+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bnaron","files":28,"time":1383791887,"description":"The eighteenth season of British science fiction television series Doctor Who began on 30 August 1980 with the serial 'The Leisure Hive', and ended with Tom Baker's swan song 'Logopolis'. The entire season was broadcast from 30 August 1980 to 21 March 1981.\n\nSeason 18 saw the swan song of Tom Baker as The Fourth Doctor, ending his time after seven years on the program. New companions Tegan Jovanka (Janet Fielding), Nyssa (Sarah Sutton) and Adric (Matthew Waterhouse) made their introduction in 'Logopolis', 'The Keeper of Traken' and 'Full Circle', respectively. Romana played by Lalla Ward departs from the series in 'Warriors' Gate', along with John Leeson who returned to voice the robot K9. By the end of the season, it marks the first time the Doctor has had three companions travelling with him in the TARDIS since his second incarnation.\n\nThe Master returns this time played by Geoffrey Beevers in 'The Keeper of Traken'. After the events of 'Traken the Master' is played by Anthony Ainley who would continue to play the Master for the rest of the classic series run.\n\nJacqueline Hill who plays the First Doctor's companion Barbara Wright returns in 'Meglos', although this time playing Lexa. She is one of only two companions to return to play a different role, the other being Jean Marsh, who had played companion Sara Kingdom in 'The Daleks' Master Plan', and later returned as Morgaine in 'Battlefield'.\n\nIn a return to the format of early seasons, virtually all serials from Seasons 18 through 20 are linked together, often running directly into each other. Three serials; 'Full Circle', 'State of Decay' and 'Warriors' Gate' are part of a trilogy within the season. These three serials include the arrival of Adric and the departure of Romana and K9. The season took a short transmission break of two weeks over the Christmas 1980 period, between the broadcasts of 'State of Decay' and 'Warriors' Gate'.\n\nEpisode List\n\n01 - The Leisure Hive - 4 Episodes\n\n     Synopsis: Finding out-of-season Brighton Beach somewhat lacking, the Doctor\n     and Romana travel to the leisure planet Argolis - but there strange\n     experiments are taking place. NOTE: The Randomiser is removed in this\n     episode, which ends the Doctor's running from the Black Guardian.\n\n02 - Meglos - 4 Episodes\n\n     Synopsis: On Tigella, two opposing faction are irrevocably divided over one\n     fundamental issue: the Dodecahedron, a mysterious object which provides the\n     entire planet's energy. Note: Gallifrey sends a summons to recall Romana at\n     the end of the episode.\n\n03 - Full Circle - 4 Episodes\n\n     Synopsis: En route to Gallifrey to return Romana to the High Council of Time\n     Lords, the TARDIS passes through a strange phenomenon (a CVE or Charged\n     Vacuum Emboidment) and ends up in an alternative universe called E-Space.\n\n04 - State of Decay - 4 Episodes\n\n     Synopsis: After the events of Full Circle, the Doctor's adventures in E-Space\n     arriving on a planet. The villagers live under the thrall of three lords who\n     dwell in a shadowy Tower.\n\n05 - Warriors' Gate - 4 Episodes\n\n     Synopsis: Time Winds strike the TARDIS, damaging it and K-9. Strangest of\n     all, it allows Biroc, to enter, phased in time, sending the TARDIS into a\n     milk-white void.\n\n06 - The Keeper of Traken - 4 Episodes\n\n     Synopsis: The Doctor and Adric arrive back in N-Space in an empire of peace\n     and harmony. They are surprised when the elderly Keeper of Traken appears in\n     the TARDIS to ask for their help in rescuing the Union from a secret evil\n     growing in its midst.\n\n07 - Logopolis - 4 Episodes\n\n     Synopsis: The Doctor goes to Earth to take fresh measurements of a police box\n     to repair the TARDIS. A figure in white observes. All the while, the Master\n     lurks in the shadows, but what could he be planning?\n","torrent":{"xt":"urn:btih:22635b1c4f744cedf5b0a1019f25bc1938035237","amp;dn":"Doctor+Who+-+Season+18+-+%281980-81%29+-+28+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22635b1c4f744cedf5b0a1019f25bc1938035237","infoHashBuffer":{"type":"Buffer","data":[34,99,91,28,79,116,76,237,245,176,161,1,159,37,188,25,56,3,82,55]},"announce":[],"urlList":[]}}