{"title":"Shintaro Kago: Fraction","uid":8724254,"size":79696234,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:230a0e6740809cee1f544890c2f531d61e12d63f&amp;dn=Shintaro+Kago%3A+Fraction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"fudoh101","files":1,"time":1374480608,"description":"This is one of the few books by Shintaro Kago that actually has a legit release in the western world! But only in french though, so this scanlation still have to do for us less cultivated!\n\nIt's partly auto-biographical, and with the case of Shintaro Kago that should prove interesting!\n\n208 pages\n\nThe first half of the book is made up by the titular story, a serial killer thriller that gets all kinds of meta and crazy as it progresses. The second half of the book consists of a short interview with Kago (and Ryuichi Kasumi, a Japanese crime fiction writer) and a number of short stories\n\nWho could imagine that Kotaro Higashino, a friendly waiter without any problems, can be the bloodthirsty serial killer who terrorize the city of Tokyo? Nicknamed choper, Kotaro takes pleasure in slicing in two the girls he meets on his way ... sadistic murderer during the night, he becomes a gentle and caring boy during the day without arousing the suspicions of anyone. But now, strange events begin to disturb the quiet life of Kotaro. Gradually the chopped corpses are growing in the streets of Tokyo without involving Kotaro at all. Is there a second slayer? Who imitates his murders? Functioning as a thriller, Fraction plunges us into a bloody investigation that combines suspense and shocking scenes. A surprising story both for its history and its graphical style which multiplies the sham and endless mirror effect","torrent":{"xt":"urn:btih:230a0e6740809cee1f544890c2f531d61e12d63f","amp;dn":"Shintaro+Kago%3A+Fraction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"230a0e6740809cee1f544890c2f531d61e12d63f","infoHashBuffer":{"type":"Buffer","data":[35,10,14,103,64,128,156,238,31,84,72,144,194,245,49,214,30,18,214,63]},"announce":[],"urlList":[]}}