{"title":"Nanomaterials - Design and Simulation","uid":15519280,"size":16438377,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:243c03dc88eba08b6e0793d3f115397003da7c6f&amp;dn=Nanomaterials+-+Design+and+Simulation&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1470729469,"description":"Nanomaterials - Design and Simulation - Perla B. Balbuena, Jorge M. Seminario (Elsevier, 2007).pdf\r\n\r\nOver the past few decades, several approaches have been developed for designing nano-structured or molecularly-structured materials. These advances have revolutionized practically all fields of science and engineering, providing an additional design variable, the feature size of the nano-structures, which can be tailored to provide new materials with very special characteristics. Nanomaterials: Design and Simulation explores the role that such advances have made toward a rational design of nanostructures and covers a variety of methods from ab initio electronic structure techniques, ab initio molecular dynamics, to classical molecular dynamics, also being complemented by coarse-graining and continuum methods. Also included is an overview of how the development of these computational tools has enabled the possibility of exploring nanoscopic details and using such information for the prediction of physical and chemical properties that are not always possible to be obtained experimentally.\r\n\r\n* Provides an overview of approaches that have been developed for designing nano-structured or molecularly-structured materials.\r\n* This volume covers several aspects of the simulation and design of nanomaterials analyzed by a selected group of active researchers in the field. \r\n* Looks at how the advancement of computational tools have enabled nanoscopic prediction of physical and chemical properties","torrent":{"xt":"urn:btih:243c03dc88eba08b6e0793d3f115397003da7c6f","amp;dn":"Nanomaterials+-+Design+and+Simulation","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"243c03dc88eba08b6e0793d3f115397003da7c6f","infoHashBuffer":{"type":"Buffer","data":[36,60,3,220,136,235,160,139,110,7,147,211,241,21,57,112,3,218,124,111]},"announce":[],"urlList":[]}}