{"title":"Bizarre ER 1-4","uid":11079732,"size":9877981600,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:28657f6cb52e168a6aaeeea837a75508a14c01e5&amp;dn=Bizarre+ER+1-4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"claudiatannahill","files":40,"time":1411347074,"description":"Bizarre ER seasons 1-4 \n\n\nBizarre ER is a BBC Three television show that deals with accidents and mishaps that people come to the Emergency Room to. It was narrated by Freema Agyeman from series one to three and by Sheridan Smith in series four.\n\nEvery episode shows a miraculous survival story and strange facts, like the woman who fell out of a plane at 35,000 ft and survived. Series 2 began airing on 21 April 2009 and consists of ten 30 minute episodes. Series 1 and 2 were filmed at the Norfolk and Norwich University Hospital.\n\nFollowing the first five episodes, the show's animal counterpart Bizarre Animal ER, narrated by Kevin Bishop, aired for eight episodes on BBC Three in Bizarre ER's Tuesday slot. Bizarre ER returned after for five more episodes.\n\nBizarre ER returned for a twelve-part third series from 10 May 2010[3] and finished on 19 July 2010. The series was filmed at the Northampton General Hospital.\n\nThe series returned for a ten-part fourth series on 28 March 2011, now narrated by Sheridan Smith. Filming takes place at Northampton General Hospital as well as Bradford Royal Infirmary. The series also features bizarre operations that have happened around the world.","torrent":{"xt":"urn:btih:28657f6cb52e168a6aaeeea837a75508a14c01e5","amp;dn":"Bizarre+ER+1-4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28657f6cb52e168a6aaeeea837a75508a14c01e5","infoHashBuffer":{"type":"Buffer","data":[40,101,127,108,181,46,22,138,106,174,238,168,55,167,85,8,161,76,1,229]},"announce":[],"urlList":[]}}