{"title":"Lucidity-TiNYiSO","uid":5484595,"size":461171380,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2891747c563754ce76912b04370d09e1c1ca7071&amp;dn=Lucidity-TiNYiSO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"thenoobish","files":-1,"time":1270638086,"description":"-- Proudly Presents --\n\nLucidity (c) LucasArts\n\n\n\nRelease On   : 6 April 2010            Disk Amount/Format : 1 CD ISO\nType of Game : Platformer/Puzzle       Media Protection   : Steam + Custom\n\n\n\nRelease Information:\n\nFrom the team that re-imagined The Secret of Monkey Island, comes Lucidity,\nan addictive puzzle platformer set in the surreal childlike dreamscapes of\nthe little girl Sofi. In this challenging puzzler, its your task to keep\nSofi safe as she drifts deeper into the strange new world of her dreams.\nFeaturing stunning hand-illustrated visuals, a spell-binding original score\nand unique puzzle platformer gameplay, Lucidity will challenge your wits,\ntest your reflexes and mesmerize your senses.\n\nTake a trip into the surreal childlike dreamscapes of Sofi, a little girl\nfilled with a persistent desire to explore new worlds and overcome all\nobstacles in her way. Test your skills in this addictive puzzle platformer\nwhere through quick reactions and placement of unique puzzle pieces, you\ncreate a path to help Sofi traverse safely through 27 visually stunning,\nhand-illustrated dreamscapes.\n\nA Surreal Fantasy - Take a fantastic journey with little Sofi as she\ndrifts into a vivid dream world where, beckoned by the kind words of her\ngrandmother, she learns to overcome her fears.\n\nMesmerizing Dreamscapes - Like a childrens storybook come to life, get\nlost in mesmerizing dreamscapes detailed with beautiful hand-drawn\ncontemporary art.\n\nSpell-binding Original Score - Featuring a lush original score that will\ndraw you into Sofis dream world.\n\nAddictive Puzzle-Platformer Gameplay - Skillfully place unique puzzle\npieces designed to propel Sofi to and from suspended platforms, or over\nand under obstacles, in an effort to maintain her state of perpetual\nmotion.\n\nUnlockable Steam Achievements - Collect fireflies on your adventures to\nunlock additional bonus levels and achievements to make it to the top of\nthe leaderboards.\n\n\n\nBurn/mount, install, copy content from TiNYiSO dir to installation dir, play\n\nNOTE: We discovered that this game had a few issues on certain of a few of\nour test machines. If you get an error about .NET 3.5 not installed or\noutdated, even if you have it installed, then it has nothing to do\nwith the crack.\n\nMake sure you got all things updated to latest versions or install\nthose additional NEEDED programs at the end of our installer!\n\nYou can read more about the issue here:\n &lt;a href=&quot;\nhttp://forums.steampowered.com/forums/showthread.php?t984011&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.steampowered.com/forums/showthread.php?t984011&lt;/a&gt;\n\nGreetz: LARGEiSO and MEDIUMiSO\n\n\n\n(C) E/dfs\nSIZE DOES NOT MATTER!","torrent":{"xt":"urn:btih:2891747c563754ce76912b04370d09e1c1ca7071","amp;dn":"Lucidity-TiNYiSO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2891747c563754ce76912b04370d09e1c1ca7071","infoHashBuffer":{"type":"Buffer","data":[40,145,116,124,86,55,84,206,118,145,43,4,55,13,9,225,193,202,112,113]},"announce":[],"urlList":[]}}