{"title":"Motorola MTS2000 CPS R02.00.01 + Tuner (RVN4776S)","uid":5304362,"size":126757830,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:294756e5ad841a6491718e047e978fd6b2d9c364&amp;dn=Motorola+MTS2000+CPS+R02.00.01+%2B+Tuner+%28RVN4776S%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ziki","files":-1,"time":1264339243,"description":"===================================================================\nMTS2000 Customer Programming Software R02.00.01\n===================================================================\n\nWARNING:\n--------\nDOS RSS VERSION R06.08.00 and LATER WON'T SUPPORT RADIO WITH MODEL\nNUMBER H01xxxxPWxxx. \nALL DOS RSS VERSION WILL NOT SUPPORT RADIO WITH MODEL NUMBER \nH01XXXXPWXXX ONCE PROGRAMMED WITH CPS R01.13.00 OR SERVICED \nAT MOTOROLA DEPOT AFTER JULY 10, 2005. \n\nIntroduction:\n------------\n\nWelcome to the Windows MTS2000 Customer Programming Software (CPS) \nby Motorola.  The notes below serve to introduce you to the software\nyou are about to install.  Please read these notes in their entirety\n before installing and using the MTS2000 CPS R02.00.01 Release.\n\nNew Radio Features Supported:\n--------------------------------\n\n- Support for 800 MHz Rebanding\n\n\nCPS Enhancements in this Release:\n---------------------------------\n- The Clone Wizard feature is now supported by the CPS.  This feature\n  groups all fields needed to be updated when cloning to one or many \n  radios, or to one or many archive codeplug files.\n\n- The Clone Express is now supported by the CPS.  This feature significantly\n  reduces the time required to clone a radio when you want to preserve\n  the ID's within the radio.  This feature provides the Clone Wizard\n  functionality, including &quot;Read Radio ID's&quot; with one mouse click. Please\n  refer to the help for further information.\n\n- The Advanced System Key feature is now supported.  This feature can\n  be used to produce system keys that have limited functionality and/or\n  have an expiration date.\n  This feature also supports obsolescing the older keys if desired, by\n  providing an option to only honor the new keys for radio programming.\n  Multiple keys can be attached in the CPS provided that all system IDs\n  are unique.\n\n- Drag and drop between MTS2000, and the ASTRO and ASTRO 25 products is\n  now supported by the CPS.\n\n- Top Node Drag and Drop for copying complete codeplug data from one radio \n  to another, including MTS2000 to ASTRO and/or ASTRO 25 products and vice\n  versa.\n\n- Auto Display of the Drag &amp; Drop Report is now supported by the CPS.\n\n- Across-band Drag and Drop for copying non-frequency-related information \n  from 800 radios to UHF and VHF radios and vice versa is now supported\n  by the CPS.\n\n- Drag and Drop Personality to Zone feature allows you to drag a Conventional \n  Personality or a Trunking Personality and drop it on top of any Zone \n  Channel Assignment zone for easily addition of channels to existing zones.\n\n- The tables now support Fill Up/Down for copying the same value across\n  multiple rows. To change the value for a field on all records, switch\n  to the alternate table view, change the value in the first record and\n  select 'Fill Down' to copy the value to all records.\n\n- Saving Invalid Archives allows you to save a codeplug that has unresolved\n  invalid fields to a file with the extension &quot;.inv,&quot; which can be read\n  back into the CPS at a later time to resolve the invalid fields and\n  complete codeplug setup. Invalid (.inv) files cannot be written to a\n  radio; they must be read into the CPS and all invalidities must be\n  resolved prior to programming. Certain fields cannot be saved when\n  invalid, and the CPS will not allow you to save a .inv file until these\n  fields have been resolved. Fields that cannot be saved when invalid will\n  be denoted by a red dot next to the field name in the Invalid Fields\n  dialog. Please see the Known Issues section below for information on\n  unresolved issues with this feature.\n\nPlease refer to the CPS Online Help for more information on these features.\n\n\nSystem Requirements:\n--------------------\nOperating Systems:   Windows 98 Second Edition,\n                     Windows NT 4.0 (SP 6a or higher),\n                     Windows 2000\n                     Windows XP Home Edition (See Note)\n                     Windows XP Professional (See Note)\n                     Note: XP upgrade from other operating systems\n                     is not supported if the CPS was previously installed\n                     on the old operating system. Windows ME, Windows 95\n\t\t     and Windows 98 First Edition are no longer supported.\n                     You may choose to proceed with the installation, but\n                     some features might not be functioning properly.\n                     Upgrading the operating system is highly recommended.\n\nHardware Requirements:      \nProcessor            400 MHz or higher Pentium grade Processor\nMemory               128 MB RAM minimum for Windows 98 Second Edition, NT\n\t\t     and 2000\n                     256 MB RAM minimum for Windows XP (Home or\n                     Professional)\nHard Disk Space      1 Gigabyte Drive with 450 MB minimum free space (for a\n                     Typical Installation, including Help Audio-Visual\n                     Tutorials) or 60 MB minimum free space (for a Compact\n                     Installation)\n\nPeripherals          Microsoft Windows supported Mouse or Trackball\n                     Microsoft Windows supported Serial Port \n                     for radio communication\n                     Microsoft Windows supported Printer Port \n                     for report printing\n                     CD-ROM for software installation\n\n\nKnown Issues With the MTS2000 CPS R02.00.01 Release:\n---------------------------------------------------\n\n1)  Drop down items in table fields cannot be accessed when using Windows XP\n    Professional &quot;Windows XP Style&quot; display.  If this issue is encountered,\n    change the display setting to &quot;Windows Classic Style&quot; for proper\n    functionality.\n\n2)  Attempting to Read from or Write to a radio with the CPS while the Tuner\n    is open will cause a communication failure.\n\n3)  Due to French import laws, the Microsoft encryption support used to\n    create archive (.cpg) files with the CPS (Customer Programming Software)\n    is not available on the French version of the Windows Operating Systems.\n    Therefore, there is no way to save archive files when the CPS is\n    installed on the French version of Windows. Until import laws are\n    changed such that Microsoft can provide encryption support, this feature\n    can not be addressed.\n\n4)  If you attempt to close a dialog box by pressing the 'X' in the upper \n    right of the dialog while the application is still busy (the cursor \n    is shaped like an hourglass), the application may terminate.\n\n5)  Reading two radios simultaneously results in an error message.  \n    Computers equipped with two Communication Ports can potentially read\n    two radios at a time.  This is not recommended at present, as error \n    messages have been observed during simultaneous reading of radios on \n    different COM ports.\n\n6)  The CPS will display the error message &quot;Unable to write header&quot; if you \n    try to save a codeplug file that has been marked as read-only.  To \n    circumvent this problem, either save the codeplug under a different name\n    or remove the read-only setting from the codeplug file.\n\n7)  The CPS does not warn users when they have opened a codeplug in more \n    than one application.  Information saved in one application will be \n    overwritten by subsequent saves of the same codeplug in the second \n    CPS application.\n\n8) In the unlikely event that a FLASHport operation fails, disconnect and \n    power off the SRIB and radio, and reconnect them again.  Retry the \n    FLASHport operation.\n\n\nInstallation:\n------------\n\n1)  Before installing the MTS2000 CPS, you must uninstall any previously\n    installed versions of the MTS2000 CPS, and reboot your machine.  You\n    can uninstall the CPS by going to the Windows Control Panel,\n    double-clicking on Add/Remove Programs, selecting the CPS in the list of\n    installed programs, and clicking the Add/Remove button. If you insert the\n    installation CD for the new CPS before uninstalling the old CPS, you will\n    be presented with a screen containing three buttons: Remove, Modify, and\n    Repair. You must select Remove to uninstall the old CPS, then reboot your\n    machine, then install the new CPS.\n\n2)  When you insert the Installation CD into the CD-ROM drive, the \n    installation will start automatically. You may select to install the CPS\n    or the Tuner or both applications. Follow the on-screen instructions to \n    install the software.\n\n3)  Before uninstalling the CPS, disable the CPS Password if you have \n    enabled this feature.\n\n4)  If a file installed by the CPS later becomes corrupted, the Repair\n    option on the Installation CD may be used to restore it. It is very\n    important that the Installation CD for the same version that is\n    installed on the computer is used for Repair. Use of a different\n    version in an attempt to Repair an installation will result in further\n    corruption.\n\n5)  Windows NT Installation: If the Install does not find the shlwapi.dll in\n    *WINNTSystem32 directory, you will need to install Internet\n    Explorer 4.1 or above to facilitate the XML installation, which is \n    required for the FLASHport feature of the CPS.\n\n\nProgramming Hints:\n------------------\n1)  You can use your DOS archive files in the MTS2000 CPS without the need \n    for any conversion process. There is no CPS Archive Converter; you simply \n    read your DOS archives directly into the CPS. To open a DOS codeplug in\n    the MTS2000 CPS, select File-&gt;Open from the Menu, and change the setting\n    in the &quot;Files of type&quot; drop-down to &quot;All Files (*.*)&quot;.  You will then be\n    able to select any DOS archive and click the &quot;Open&quot; button. When you are\n    ready to save the archive, select File-&gt;Save As from the Menu, and save\n    your archive as a .cpg (Windows archive) file.  The DOS RSS cannot read \n    archive files saved with this or later versions of Windows CPS.\n\n2)  If your DOS archive ends in an extension that Windows recognizes as a\n    particular file type (*.xls, which Windows recognizes as an Excel file, \n    for example), you may need to enter the .cpg extension in the Save As \n    dialog.\n\n3)  The first time you start the CPS, you should go to the User Settings\n    Dialog under the Tools menu and set up the directories where you will \n    store your system keys.\n\n4)  Several user-configurable view items are available under the \n    View-&gt;Options Menu. You can set a color for invalid fields, so that\n    these fields are more visible.  You can also configure whether or not\n    you wish to confirm deletion of records with a popup window.  PLEASE \n    NOTE that the default for Confirm on Deletion is NO. If you wish to \n    see a popup menu every time you delete a record, please change this\n    setting.\n\n5)  To get help on a field, press F1 or 'right click' and select 'What's \n    this?' while you are on the field, or click on the Help button on the\n    tool bar (an arrow with a question mark) and then click on the field \n    for which you want to view help.\n\n6)  For more information on the features available in the Windows CPS, we\n    suggest you view our audio-visual help tutorials. They can be accessed \n    from the CPS menu by selecting Help-&gt;CPS Help Topics, and then \n    double-clicking on CPS Tutorials, then The Tutorials Menu. Then select\n    the tutorial you wish to view.\n\n\nScope:\n-----\n\nThe MTS2000 CPS R02.00.01 replaces the DOS RSS in all respects except in the \nfollowing.\n\n   *  The CPS does not support Service Mode Tuning (F2 from the Main Menu in \n      the DOS RSS). Service Mode Tuning functionality is provided in the Tuner\n      application on this CD.\n   *  The CPS does not support reading or importing the TCMS file format.\n\nFor the above two functions, please continue to use the DOS RSS.","torrent":{"xt":"urn:btih:294756e5ad841a6491718e047e978fd6b2d9c364","amp;dn":"Motorola+MTS2000+CPS+R02.00.01+%2B+Tuner+%28RVN4776S%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"294756e5ad841a6491718e047e978fd6b2d9c364","infoHashBuffer":{"type":"Buffer","data":[41,71,86,229,173,132,26,100,145,113,142,4,126,151,143,214,178,217,195,100]},"announce":[],"urlList":[]}}