{"title":"Aerosmith - Toys In The Attic (1975) WMA320","uid":6165036,"size":93017755,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:297f14f4f5afc436fb6b19885a1b463ddcb3e3d3&amp;dn=Aerosmith+-+Toys+In+The+Attic+%281975%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1297356450,"description":"I was recently saying to my wife, while watching clips of some recent Aerosmith live shows that, in spite of the direction they've gone in from the late 80s to the present, I'd like to go see them again. (I also asked her if she thought it would be possible to go for around $20. I must have paid somewhere between 10 and 20 bucks when I saw them during their glory days in the late 70s at Madison Square Garden, back when they were playing music like this. My wife was pretty sure that a ticket now costs quite a bit more.) \n\nI got into these guys during my 1st two years in high school (1975-77), and I have loved high energy, heavy guitar driven, blues based rock bands ever since. And really, what can I say about this era of the Aerosmith story, and this particular recording, other than that it sounds now as good as it did way back then. And while Walk This Way, Toys in the Attic, &amp; Sweet Emotion are the big hits from this (and have been covered by everyone from REM, Tommy Shaw, Tracii Guns, and Run DMC to the much more obscure Wolfie, and the Butchers, among others) and are excellent, they should not obscure the power of such less acknowledged rockers as Uncle Salty (featuring some tasteful guitar playing courtesy of Joe Perry and the underrated Brad Whitford) and Adam's Apple, in which Steven Tyler shows what a 70s rock god he was. Other songs here are fine. For example, No More No More has that kind of Rolling Stones boogie sound that Aerosmith do very well. Round and Round is very heavy, and kind of anticipates ths early 90s grunge era (a link one can hear through later bands like Die Kreuzen, Mother Love Bone, Alice in Chains, Screaming Trees, etc). You See Me Crying is what a power ballad should be. And their delivery of the cover song here, Big Ten Inch Record, is still funny, albeit it an adolescent sort of way.Kudos also to the solid, non flashy rhythm section of Joey Kramer and Tom Hamilton for their playing throughout. \n\nIt's no wonder that Aerosmith were so beloved, by Wayne and Garth, by the characters in the film Dazed and Confused, and by the kids in my high school and neigborhood, not to mention by me. Listening to this 70s hard rock classic brings out my inner 15 year old. \n\nby Ludwig J. Pluralist &quot;avantepopgospeler&quot;\n\nTRACKLIST:\n\n01 - Toys In The Attic.wma                             \n02 - Uncle Salty.wma                                   \n03 - Adam's Apple.wma                                  \n04 - Walk This Way.wma                                 \n05 - Big Ten Inch Record.wma                           \n06 - Sweet Emotion.wma                                 \n07 - No More No More.wma                               \n08 - Round And Round.wma                               \n09 - You See Me Crying.wma    \n\nWMA 320Kbps 44100Hz STEREO\n\nMARCELODRGZ","torrent":{"xt":"urn:btih:297f14f4f5afc436fb6b19885a1b463ddcb3e3d3","amp;dn":"Aerosmith+-+Toys+In+The+Attic+%281975%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"297f14f4f5afc436fb6b19885a1b463ddcb3e3d3","infoHashBuffer":{"type":"Buffer","data":[41,127,20,244,245,175,196,54,251,107,25,136,90,27,70,61,220,179,227,211]},"announce":[],"urlList":[]}}