{"title":"[FSX] Kosrae PTSA Pacific Islands Simulations","uid":7003172,"size":109665359,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:299cbe2cdd553e77689e1bd994ae8a8d9881b176&amp;dn=%5BFSX%5D+Kosrae+PTSA+Pacific+Islands+Simulations&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"aarque","files":-1,"time":1328183885,"description":"Well it was a bumpy ride, but I think The Ship has found a new safe harbor. Let's celebrate.\n\nKeep on with the requests, guys. Not that I am going to fulfill them necessarily, but, put it this way; I got so much crap, like literally a terabyte (1000 gigabytes) of FSX stuff that I don't know what to share and I want ideas. Figure I should get it out there while I can. Speaking of requests, I'd be into Tonga Domestic by these guys, Pacific Islands Simulations...\n\nWith a population of nearly 8000, Kosrae is the most eastern of the Caroline Islands, Federated States of Micronesia. The island is located 370 mi (590 km) north of the equator, between Guam and the Hawaiian Islands. Its land area is 42 miÃ‚Â² (110 kmÃ‚Â²). Kosrae has high mountains that is largely unspoiled and rarely visited. Kosrae is fast becoming a destination for scuba divers, hikers and tourists. Dense vegetation and steep mountains keep the island largely undeveloped. Viewed from the sea, the island's distinct shape resembles a female body. This has led to the island being called &quot;the island of the sleeping lady.&quot;\n\nKosrae International airport, located on the northwestern coast of the island, is served by Continental Micronesia Airline's &quot;Island Hopper&quot; flights (three times a week in each direction) between Hawaii and Guam, stopping at other FSM and Marshallese destinations on the way. Specifically, the &quot;island hopper&quot; employs the venerable B737-800 (and the occassional B767-300) which usually begins in each direction (from Honolulu and Guam) via Majuro and Kwajelain atolls (Republic of Marshall Islands), Kosrae, Pohnpei and Chuuk (Federated States of Micronesia). Once a month tourists also arrive on an chartered B727 including weekly freight runs by DHL and Fedex.\n\nThe product features include:\n\n    Accurate terminal building;\n    Re-arranged airport terrain;\n    Custom ground/tarmac polygons with textures;\n    Custom vegetation and objects;\n    Upgraded terrain mesh reflecting actual contours of the island;\n    Complete texture coloration of land and waterclass;\n    Night lighting and effects;\n    30cm/pixel photoreal terrain;\n    Animation;\n    Ambient sounds;\n    Very framerate-friendly (including full autogen enhancements for framerate fluidity using SDK annotator - buildings and vegetation). This means all sliders to the right with very minimal fps impact; apron markings;\n    Wave crash effects notable at coral/reef outlines as in real-world. Radio navigation enhanced for instrument approaches (ILS/DME, VOR and NDB)\n    ....and more.\n\n\n\n\n\n\n\nPlease visit my thread in the Suprbay forums. There you can see the latest news, drop a comment and use the private message system to contact me directly. That forum has a rating system similar to the quality field found at the top of all torrents. Perhaps you'd like to say hi or show your support.\n  &lt;a href=&quot;\nhttps://forum.suprbay.org/showthread.php?tid=113113&amp;pid=709028#pid709028&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/showthread.php?tid=113113&amp;pid=709028#pid709028&lt;/a&gt;","torrent":{"xt":"urn:btih:299cbe2cdd553e77689e1bd994ae8a8d9881b176","amp;dn":"%5BFSX%5D+Kosrae+PTSA+Pacific+Islands+Simulations","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"299cbe2cdd553e77689e1bd994ae8a8d9881b176","infoHashBuffer":{"type":"Buffer","data":[41,156,190,44,221,85,62,119,104,158,27,217,148,174,138,141,152,129,177,118]},"announce":[],"urlList":[]}}