{"title":"David Kahn - The Reader of Gentlemens Mail. Herbert O. Yardley a","uid":10221594,"size":4327391,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:29bc7c5544194c2d610e3020536b6682bd5e2b83&amp;dn=David+Kahn+-+The+Reader+of+Gentlemens+Mail.+Herbert+O.+Yardley+a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1401048584,"description":"Description\nProduct Details\nBook Title: The Reader of Gentlemen's Mail: Herbert O. Yardley and the Birth of American Codebreaking\t\nBook Author: David Kahn\nHardcover: 368 pages\nPublisher: Yale University Press; 1ST edition (February 9, 2004)\nLanguage: English\nISBN-10: 0300098464\nISBN-13: 978-0300098464\n\n===================================================================================\nBook Description\nPublication Date: February 9, 2004 | ISBN-10: 0300098464 | ISBN-13: 978-0300098464 | Edition: 1ST\nOne of the most colourful and controversial figures in American intelligence, Herbert O. Yardley (1889-1958) gave America its best form of information, but his fame rests more on his indiscretions than on his achievements. In this highly readable biography, a premier historian of military intelligence tells Yardley's story and evaluates his impact on the American intelligence community. Yardley established the nation's first codebreaking agency in 1917, and his solutions helped the United States win a major diplomatic victory at the 1921 disarmament conference. But when his unit was closed in 1929 because &quot;gentlemen do not read each other's mail&quot;, Yardley wrote a best-selling memoir that introduced - and disclosed - codemaking and codebreaking to the public. David Kahn describes the vicissitudes of Yardley's career, including his work in China and Canada, offers a capsule history of American intelligence up to World War I, and gives a short course in classical codes and ciphers. He debunks the accusations that the publication of Yardley's book caused Japan to change its codes and ciphers and that Yardley traitorously sold his solutions to Japan.\n\n===================================================================================\nEditorial Review\nFrom Booklist\nInstantly recognizable to buffs of intelligence history, Herbert Yardley became infamous in 1931 for telling a tale out of school. His The American Black Chamber romped through the exploits of the State Department's Cipher Bureau, which Henry Stimson abruptly closed in 1929, fastidiously intoning, &quot;Gentlemen do not read each other's mail.&quot; Despite his notoriety-- Yardley's book ignited a furor in the halls of power, and he was blacklisted from further work in American intelligence--Yardley has not been the subject of a biography until now. Kahn tells Yardley's story with a cool eye for his reputation as a codebreaker (Kahn is the author of both general and technical works on cryptology). More important from the reading standpoint, Kahn has a decidedly interesting, angular personality to work with. Yardley was boastful and prone to exaggerating his accomplishments, a habit he accentuated in his projects to parlay his original expose into moneymaking entertainment schemes, including potboilers, Hollywood scripts, and radio dramas. Balanced and meticulous in its assessments, this biography will appeal to intelligence aficionados. Gilbert Taylor\nCopyright Â© American Library Association. All rights reserved\n\n===================================================================================\nReview\n&quot;. . . carefully crafted . . . meticulously researched . . . first to show Yardley as a living, breathing person with all the faults [of] humanness.&quot; -- Cipher A. Deavours, American Scientist\n\n===================================================================================\nAbout the Author\nDavid Kahn is author of the best-selling The Codebreakers: The Story of Secret Writing, Hitler's Spies: German Military Intelligence in World War II, Seizing the Enigma: The Race to Beat the German U-Boat Codes, and Kahn on Codes: Secrets of the New Cryptology.\n\n===================================================================================\nFrom The Washington Post\nHaving a somewhat unusual surname is a mixed blessing. It's nice to be a tiny bit different, to be asked to spell one's name by sales clerks and ticket agents, but it can be a bit of a nuisance if someone mildly famous has or had the same name. Thus during two decades' residence in Baltimore I was frequently asked by old-timers if I was any kin to Richard Q. &quot;Moko&quot; Yardley, who for centuries drew very strange editorial-page cartoons for the Sun, and for as long as I can remember people have wondered if I am related to Herbert O. Yardley, the celebrated (and notorious) codebreaker and poker player.\nThe answer in both cases is: probably, but distantly at best. If there is a familial tie to Moko, it remains a mystery, but David Kahn's first-rate biography of Herbert O. suggests that there is indeed a connection. Herbert O. &quot;could trace his family to a Thomas Yardley who had come from England to Pennsylvania in 1703&quot; and may have descended from someone who was present at the negotiations in 1215 that produced the Magna Carta; my own forebears came from England to Pennsylvania in 1682, and it has been claimed over the years that one &quot;William Yardley, L.M.&quot; was a witness to the Magna Carta, a claim best swallowed with large doses of salt.\nIn any event it is amusing to think that I, who have never been able to solve a cryptic puzzle, am kin in some fashion to the cryptographic whiz who was, in Kahn's judgment, &quot;the most colorful and controversial figure in American intelligence&quot; and, perhaps, its most influential, the man who in World War I &quot;foresaw that the United States needed the information that could come from signals intelligence, established America's first permanent agency to intercept foreign messages and break codes, and ran it well enough to prove its importance.&quot; When he died in 1958 at age 69, he left a decidedly mixed legacy, not to mention a great many enemies, but on balance there is, or so Kahn concludes, much to admire in his record.\nThat there has not previously been a biography of Yardley is puzzling, as Kahn notes, though there are a couple of plausible explanations: He didn't leave much of a paper trail, and he wasn't an especially savory character. Biographers prefer to write about people with whom they can sympathize, even empathize, and there was much about Yardley that was, or bordered on, repugnant. Yet Kahn has found human sides of him that are attractive, and as one of the most distinguished scholars of military intelligence, he is ideally suited to tell the tale.\nYardley was born in 1889 and grew up in Worthington, a grain terminal in southwest Indiana where his father was &quot;station agent and telegrapher&quot; for one of the two railroads that ran through town. He was a smart boy, &quot;fun to be around,&quot; who learned to play poker as a teenager and worked off and on at the train depot. After graduation from high school he &quot;took a job as a railroad telegrapher, building on the training and experience he had gained while working for his father.&quot; When he was in his early twenties, he became a government telegrapher and in 1914 he moved with his new bride, Hazel, to Washington, where he became a clerk at the State Department.\nHis work exposed him to diplomatic cables and the codes in which they were written. He wondered how well the codes actually protected the messages and asked himself why the United States didn't have &quot;an agency of its own to solve and read foreign messages.&quot; Later he wrote: &quot;As I asked myself this question I knew that I had the answer to my eager young mind which was searching for a purpose in life. I would devote my life to cryptography. Perhaps I too, like the foreign cryptographer, could open the secrets of the capitals of the world. I now began a methodical plan to prepare myself.&quot;\nBecause Yardley's loyalty to his country eventually came under fierce attack, it is useful to emphasize that at the time his motives seem to have been entirely patriotic. He saw that the United States was being sucked into the terrible European war, and he understood that with the rising use of radio, &quot;communications intelligence was making intelligence into a significant instrument of war, no longer mistrusted but accepted and even welcomed by admirals, generals, and statesmen.&quot; He &quot;faced a struggle against ignorance and inertia,&quot; but he was determined, and in April 1917 he went to the War College in Anacostia with &quot;the idea that would forever change American intelligence.&quot;\nHe proposed that the Army set up &quot;its own codebreaking agency in Washington,&quot; and the proposal was accepted. Within a couple of months he was made a lieutenant in the Signal Corps (he eventually reached the rank of major) &quot;and soon thereafter he established and, as its sole officer, took charge of MI-8 -- military intelligence, section 8.&quot; This quickly became &quot;the cradle of American cryptology,&quot; with Yardley on top:\n&quot;He was 28 years old, five feet five inches tall, 125 pounds. His head was round atop a short neck. His nose was straight and small; his hair was light brown, but his early baldness gave him a high forehead. He was convincing when he talked, tending to dominate a conversation, and he told stories well. He was bright. He had gained self-confidence and experience in organizing and running things. . . . He had broken some codes and believed he could crack others. He was ambitious. And now he had, via cryptology, a chance to be not an underling, but a boss. Sure that he could handle the opportunity, he seized it.&quot;\nMI-8's &quot;most spectacular achievement&quot; in World War I was breaking coded documents that identified a German secret agent who was subsequently executed for espionage, but MI-8's most important long-term accomplishment was, in Yardley's words, &quot;the large and constant stream of information it has provided in regard to the attitudes, purposes, and plans of our neighbors,&quot; friends as well as foes. He believed that the pursuit of intelligence should not be abandoned in peacetime, and persuaded the Army and State Department to underwrite &quot;what was officially called the Cipher Bureau but has become known as the American Black Chamber.&quot;\nIt operated on both sides of the thin line between the legal and the illegal, since its operatives read cables believed by those who sent and received them to be protected by confidentiality guarantees. Chief among its targets was Japan, which was acting aggressively around the Far East and prompting the American military to prepare for war. When the Washington Conference on the Limitation of Armament got under way in 1921, Yardley and his staff had already broken the very challenging Japanese code -- this, according to Kahn, &quot;secured the future of codebreaking in America&quot; -- and thus were able to provide information that helped the United States get a favorable outcome at the conference, &quot;the chief contribution of Yardley's Cipher Bureau.&quot;\nBut in 1929 Herbert Hoover's secretary of state, Henry L. Stimson, put an end to the bureau. &quot;Gentlemen,&quot; he famously said, &quot;do not read each other's mail,&quot; at least not in peacetime. The bureau was shut down, and Yardley was put out of work. During the 1920s he'd moonlighted in New York real estate to his considerable profit, but the Depression shut down that market. In desperation, he decided to write a book about the bureau. He &quot;had kept, illegally, many of its documents,&quot; and had a vast amount of inside information. Though doubts were expressed about the propriety of the enterprise, a contract was signed and the book was written. Entitled The American Black Chamber, it appeared in the spring of 1931, immediately causing a great furor.\nSome accused Yardley of treason, a charge Kahn emphatically rejects: &quot;He never sold information to Japan or to anybody else, and he never worked against the United States. He cheated by working for himself while being paid by the government. Later, he was indeed a hired gun, an opportunist, and he breached the trust his country had placed in him when he published his book. The action was despicable. It was rightly castigated by many people. But it cannot be characterized as treason. Yardley was a rotter, not a traitor.&quot;\nThe last three decades of Yardley's life were a never ending scramble. He sold cryptograms (&quot;Yardleygrams&quot;!) to magazines, he co-authored pulpy spy fiction, he got onto the Hollywood treadmill, he made and sold secret ink, he did a radio show called &quot;Stories of the Black Chamber.&quot; He was a codebreaker-for-hire, in China and then Canada, he ran a restaurant on H St., NW in Washington for a while, and he capped things off by writing The Education of a Poker Player (1957), which immediately established itself as a classic and remains one to this day. All in all he was a pretty weird guy, but he was neither the first Yardley nor the last to claim that distinction.\n===================================================================================","torrent":{"xt":"urn:btih:29bc7c5544194c2d610e3020536b6682bd5e2b83","amp;dn":"David+Kahn+-+The+Reader+of+Gentlemens+Mail.+Herbert+O.+Yardley+a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29bc7c5544194c2d610e3020536b6682bd5e2b83","infoHashBuffer":{"type":"Buffer","data":[41,188,124,85,68,25,76,45,97,14,48,32,83,107,102,130,189,94,43,131]},"announce":[],"urlList":[]}}