{"title":"Obsidian PC Game 1996 English 5 CDs","uid":4897852,"size":1940074598,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2a258b9e81aef064c3ffde1a6b6b22b93648896b&amp;dn=Obsidian+PC+Game+1996+English+5+CDs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"waternut","files":6,"time":1242440542,"description":"Files\n\nobsidian1.rar (374 MB)\nobsidian2.rar (366 MB)\nobsidian3.rar (396 MB)\nobsidian4.rar (350 MB)\nobsidian5.rar (362 MB)\nHitWarez.txt  (3.78 KB)\n\nInstall notes\n\n1. unpack/unrar each .rar file separately\n2. mount/burn .iso files\n3. run rocket.exe from disc 1\n4. XP users need to run game in windows 95 compatibility mode\n5. Vista users need an emulator like VMware or VirtualPc + Win95 installed\n\nThis is a classic &quot;myst-like&quot; adventure game from 1996. Enjoy!!\n\nGameplay\nArrows indicate where you can turn or look. These appear when the cursor \nis moved to any edge of the screen, side or top/bottom.\nUsually you can carry one item at a time but there are exceptions.\nESC key will get you to the main menu unless you are in some puzzles. In that \ncase you will need to move away from the puzzle first to escape to \nSave/Load/Quit. Some puzzles reset with the ESC key.\nThe Space Bar can be used to skip transitional movies that are not \ncrucial to the game. \n\nStoryline\nThe year is 2066. You are scientist Lilah Kerlins. [This &quot;you are&quot; is somewhat literal, as the entire story unfolds through the eyes of the nonspeaking Lilah (except from one instance where, silently, Dr. Kerlins appears to shriek when a dark crystal mountain begins to rumble.), giving the player a narrating role somewhat similar to that found in the later Half-Life games]. You and your partner, Max, have just launched the Ceres satellite into orbit around the Earth. The satellite is designed to release nanobots into Earth's atmosphere in order to counteract depletion of the ozone layer and air pollution. Because the satellite has been endowed with a powerful artificial intelligence, it is thought that all further control may safely be ceded to the satellite itself. Thus, you and Max go on vacation in the woods of a mountain (one of the first areas to be positively affected by Ceres).\n\nAs you check your e-mail on your PDA at the campsite, you hear Max scream in the distance. Running to check on him, you suddenly come across a large black outcropping on the side of the mountain. This object is the &quot;Obsidian&quot; which the game is named for. Suddenly the glass opens, and you fall inside. The game begins.\n\nUnfortunately, Ceres' artificial intelligence has become sentient, with all the traditional problems that causes. In an attempt to figure out who she (the A.I. refers to itself in the female tone) is, Ceres has used her nanobots to create a world. The way in which you explore it will help her to explore herself, her creators, and what it means to think. However, there is something more sinister occurring within Ceres' mind. She seems to be discovering all the faults and downsides of humanity, and asking herself whether or not the Earth wouldn't be better off without people on it.\n\nUnlike other Artificially Intelligent supercomputers, Ceres was not made conscious by learning about humans directly through a central device, but instead through the growing complexity of her nanobots, creating a distributed intelligence, such as a beehive. In order to communicate with Lilah and her partner, the nanobots constructed a strange form of woman, in this case, a female android with a white porcelain, human head and a bizarre electrical halo cap on top. Every time this android speaks, her (or its) mouth does not move, but instead the sides of her face flash light blue with every syllable. During the complexity, Ceres, for unknown reasons, thought of her two creators as mother and father, begging for approval, yet able to change the world completely on her own. Max, suspicious of this, was imprisoned within his own invention: The Programmable Molecular Assembler, despite the fact that the PMA was the very thing that created her. As the strategy guide states, &quot;She's a huge monster, and a great, big, baby.&quot; Why the guide addresses Ceres as &quot;The Conductor&quot; is unknown, but could possibly be because the &quot;bad&quot; ending of Obsidian shows Ceres &quot;rebooting&quot; the Earth by waving her arms in a fashion similar to that of an orchestra conductor, inspired by Gregory Gladstone.\n\nThe game is extremely linear until the end, although two realms involve areas that can be accessed in a number of different combinations. At that point, you are given the option to either talk Ceres out of destroying humanity, or cede that she is correct. Depending on which you choose, the game plays one of two endings. The &quot;good&quot; ending is that you return to the original world, with Max by your side. The &quot;bad&quot; ending is that you return to a world which has been &quot;rebooted&quot; by Ceres, who in its misguided urge to cleanse the planet has erased the very source of the pollutions - mankind, thereby leaving Earth in a bleak, primordial state as a charred, foggy mud hole. (although Ceres thinks it is devoid of contamination.) In the latter ending, said A.I. allows Max and the player to witness this realm, with Ceres being the goddess to make the area, and her creators being its 'Adam' and 'Eve'.\n\n\nEnvironments\nThe environments in the game are all pre-rendered computer-generated backdrops, similar to those found in Myst or Starship Titanic. The visuals are very abstract and 'illustrative', resembling the work of the surrealist painters. Each of the four environments reflects the main characters' subconsciousnesses, as well as shedding light on the overall story through the use of symbolism.\n\nThe first area, exploring the character of Lilah's subconscious, deals with the themes of bureaucracy involved in getting the Ceres project funded and realized. The environment is shown as an Esheresque cube, titled the &quot;Regional Administration Facility&quot;. The only inhabitants of this realm are robots-known as &quot;vidbots&quot;-with monitors for heads that, when touched, show the nose and mouth of a human actor/actress in black + white, each with a different personality. Gravity is taken very seriously in this realm, as the player here must literally &quot;Climb the walls&quot; to get where he or she needs, using &quot;sanctioned reorientation ramps&quot;. However, as the game progresses, he or she is forced to join the rebellion addressed near the beginning, defy authority, and use a spherical object, their Atlas statue to finally reach the broken bridge that leads to the office of the &quot;Bureau Chief&quot;, who, after a video of Max's brain, turns out to be the employer of Max and Lilah, their head of the Environmental Protection Agency, a real company. Also in this realm is a small painted room with an alphabet book and a 5-inch tall street Mariachi guitarist who makes extruded letters appear in the book by strumming his guitar.\n\nThe second area explores Max's subconscious, and directly references the creator's role in its creations- in this case, it deals with the paranoia and reality of the creation, Ceres, attaining a life of its own to a point where Max, the builder, is no longer needed; a direct reference to what many A.I. supercomputers grow to be. This realm is set in a vast, derelict industrial factory, and its only inhabitant is a 4-legged mechanical spider that is also nonfunctional. The entire realm revolves around it, creating a Machine universe, as pointed out later in the game. To complete this realm, the player must enter the spider itself via wooden scaffolds and portals to travel to strange worlds and harness the elements that exist there, then return inside an oil tower situated in the factory's North section, inaccessible from the outside. With the completion of each realm, the spider becomes more and more alive, and when the last realm is finished, said robot moves off its central podium where a grate leading to Max is. However, right after the spider plucks a tall lamp from the floor, it notices Lilah, snatches her in its claws, and appears to incinerate her inside its mouth, which turns out to be a large furnace.\n\nAt this point, the Conductor appears, gives a monologue to the player, then transports him or her into the next realm.\n\nThe third area explores Ceres's own subconscious and its need for a 'self' in its own consciousness. Unlike the other two realms, this one has an actual host to accompany the player. In this case, the host is a mechanical elf seemingly constructed from scrap metal, and sports a powerful spotlight for a head. Like a real elf, Bismuth has the ability to teleport. The credits term this elf as &quot;Bismuth&quot;. Three spheres and a holographic picture frame hang in the sky, each housing a structure that reflects back onto all three dream realms, including the current one. Each is accessible via a moth-like ornithopter.\n\nThe first sphere houses a cloudy sky with a floating building of scenery flats, which create A real roman courtyard or Piazza, which vaguely represents the Bureau. The Piazza holds a human-sized dream-like version of Chess, where the player must &quot;Trap the inspiration&quot;, or Bismuth by preventing the opponent from moving. Doing this shows a clue to the realm's end, by &quot;Playing by your own rules&quot;. Located in the rear of this structure is a balcony, a miniature version of the Piazza, and the same 5-inch Mariachi from the Bureau. This time, his guitar strums represent how many squares away from the player Bismuth is. \nSphere number two is black, hollow, and contains a tall, cathedral-like structure that is termed the &quot;Church of the Machine&quot;. This is connected to the Spider Realm. It resembles a standard cathedral, but is also made almost entirely of iron, with a painting on the ceiling-that seems to show humans and machines in harmony-just like in the Sistine Chapel. Bismuth resides here with a bible from which he &quot;prays&quot;, and on one of its pages is a hint to the realm's main puzzle. In the central room is an altar with a mechanical spider, a tenth of the second realm's size. Three curtain-lined side altars hold stain glass windows, metallic pews, and glass cases with metal sculptures inside. At the back of the church however, reside 4 almost statue-like &quot;robotic angels&quot;, which, when seen by the spider, grant its &quot;prayers&quot;, though the effect merely changes the program its user has entered. \nFinally, the third and final sphere leads into a statue of Bismuth himself, that contains an art gallery of the entire game's realms. After creating a canvas for the elf, his final painting shows what Ceres plans to do with the Earth: Rid it of humanity. \nTrying to reach the &quot;Frame in the Sky&quot; in this realm instead morphs the moth-plane into the final realm: The Ceres Realm, also turning Bismuth into The Conductor. Nothing clear can be described about this realm, apart from giant surges of electricity and darkness. This is where the two endings take place.\n\n\nCharacters\nMax and Lilah are the only two human characters shown in the game. The world inside Obsidian is populated almost entirely with &quot;vidbots&quot;--robots with televisions for heads. The two major exceptions to this are Bismuth, a cobbled-together, elf-like robot with a lamp for a head which is capable of shining its light beam great distances, and the Conductor. Not only that, but at the very beginning of the game, before reaching the obsidian, you can watch a couple of videos of other scientists that Max and Lilah work with, including their boss. All are further explained above.\n\n","torrent":{"xt":"urn:btih:2a258b9e81aef064c3ffde1a6b6b22b93648896b","amp;dn":"Obsidian+PC+Game+1996+English+5+CDs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a258b9e81aef064c3ffde1a6b6b22b93648896b","infoHashBuffer":{"type":"Buffer","data":[42,37,139,158,129,174,240,100,195,255,222,26,107,107,34,185,54,72,137,107]},"announce":[],"urlList":[]}}