{"title":"Bruno Verschuere - Memory Detection. Theory and Application of t","uid":10427698,"size":3143957,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2a5c5e17686e7f54db859bec2dee4446f724377c&amp;dn=Bruno+Verschuere+-+Memory+Detection.+Theory+and+Application+of+t&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1403726228,"description":"Description\nProduct Details\nBook Title: Memory Detection: Theory and Application of the Concealed Information Test\t\nBook Author: Bruno Verschuere (Editor), Gershon Ben-Shakhar (Editor), Ewout Meijer (Editor)\nPaperback: 338 pages\nPublisher: Cambridge University Press; 1 edition (March 28, 2011)\nLanguage: English\nISBN-10: 1107659361\nISBN-13: 978-0521136150\n\n===================================================================================\nBook Description\nPublication Date: March 28, 2011\nTraditional techniques for detecting deception, such as the 'lie-detector test' (or polygraph), are based upon the idea that lying is associated with stress. However, it is possible that people telling the truth will experience stress, whereas not all liars will. Because of this, the validity of such methods is questionable. As an alternative, a knowledge-based approach known as the 'Concealed Information Test' has been developed which investigates whether the examinee recognizes secret information - for example a crime suspect recognizing critical crime details that only the culprit could know. The Concealed Information Test has been supported by decades of research, and is used widely in Japan. This is the first book to focus on this exciting approach and will be of interest to law enforcement agencies and academics and professionals in psychology, criminology, policing and law.\n\n===================================================================================\nReview\n&quot;...I find Memory Detection outstanding. Unlike many edited volumes on the Way or Next Way forward, it fairly describes and critiques the extant research. In contrast to many edited volumes, all chapters are clearly written, without jarring changes in style....--Dr. Richard Bloom, Embry-Riddle Aeronautical University, Prescott, Arizona, PsycCRITIQUES\n\n===================================================================================\nBook Description II\nThe Concealed Information Test is a memory detection method developed to investigate whether examinees recognize secret information - such as a crime suspect recognizing critical crime details that only the culprit could know. This is the first book to focus on this exciting alternative to the controversial 'lie-detector tests'.\n\n===================================================================================\nAbout the Author\nBruno Verschuere is a Postdoctoral Fellow of the Research Foundation Flanders - FWO at the Psychology Department of Ghent University.\nGershon Ben-Shakhar is a Professor of Psychology at the Hebrew University of Jerusalem, and former President of the Open University of Israel.\nEwout Meijer is a Postdoctoral Researcher in the Psychology and Neuroscience Department of Maastricht University.\n===================================================================================","torrent":{"xt":"urn:btih:2a5c5e17686e7f54db859bec2dee4446f724377c","amp;dn":"Bruno+Verschuere+-+Memory+Detection.+Theory+and+Application+of+t","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a5c5e17686e7f54db859bec2dee4446f724377c","infoHashBuffer":{"type":"Buffer","data":[42,92,94,23,104,110,127,84,219,133,155,236,45,238,68,70,247,36,55,124]},"announce":[],"urlList":[]}}