{"title":"The 13th Hour - Richard Doetsch","uid":9118523,"size":388691,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2aae33cf961e59a61a29f9d175ce1fdaa86663d0&amp;dn=The+13th+Hour+-+Richard+Doetsch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1383078239,"description":"A mesmerizing thriller -- told in reverse &quot;The 13th Hour&quot; is the story of a man given the chance to go back in time in one-hour increments to prevent a vicious crime from destroying his life.Nick Quinn is being held in jail, accused of the murder of his beloved wife, Julia. He knows she's dead; he saw her bloody corpse, shot in the head at point-blank range. The police tell him they found the murder weapon with his fingerprints on it in the trunk of his car. Nick is confused, grief-stricken -- &quot;and completely innocent.&quot;\n\nAt 9 p.m. on July 28, a gray-haired gentleman visits Nick in the police interrogation room and asks him a simple question: &quot;&quot;If you could get out of here, if you could save her, would you?&quot;&quot; He hands Nick a golden talisman that allows Nick to go back in time, one hour at a time, for a total of twelve hours. With each hour that Nick travels back, he finds more clues to the identity of Julia's real killer, but he also discovers that his actions in the past may have unexpected repercussions in the future.\n\nIn his race against time to save the woman he loves most in the world, Nick will find that friends become enemies, old loyalties are tested, and Julia's murder is part of a larger scheme that has its roots in greed and vengeance. Nick has the ability to save Julia, the chance to put his own world in balance, but he is venturing down a precarious route. If he hasn't set things right by the thirteenth hour, his desperate attempts to save Julia's life may lead to a far greater catastrophe than he could have ever imagined.\n\nA surprising and utterly original thriller, &quot;The 13th Hour&quot; is pure page-turning suspense -- full of double crosses, cliffhangers, and shocking revelations.","torrent":{"xt":"urn:btih:2aae33cf961e59a61a29f9d175ce1fdaa86663d0","amp;dn":"The+13th+Hour+-+Richard+Doetsch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2aae33cf961e59a61a29f9d175ce1fdaa86663d0","infoHashBuffer":{"type":"Buffer","data":[42,174,51,207,150,30,89,166,26,41,249,209,117,206,31,218,168,102,99,208]},"announce":[],"urlList":[]}}