{"title":"Coast to Coast - Apr 04 2011 - HAARP &amp; Weather Control","uid":6296616,"size":55601672,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2b323569ea441ff32bfea3619aa27e02ae11aecc&amp;dn=Coast+to+Coast+-+Apr+04+2011+-+HAARP+%26+Weather+Control&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mscowlove","files":4,"time":1302018387,"description":"HAARP &amp; Weather Control\n\nDate: 04-04-11 \nHost: George Noory \nGuests: Brooks Agnew, Oliver Williams \n\nElectrical engineer and researcher Brooks Agnew talked about Project HAARP-styled technology, used by the U.S., China and Russia to artificially manipulate the ionosphere &amp; weather, and potentially control populations and armies. By using different frequencies, HAARP technology can cause structures in the ground to vibrate, bringing on geologic effects such as earthquakes, he explained. The recent quake in Japan might have been induced this way, he speculated, adding that of the countries that have this technology, China would have the most to gain by Japan's loss. There were also signs (a lavender colored sky) just before the quakes in Chile and Haiti that indicate possible involvement of the technology, he added. \n\nUsing HAARP technology to manipulate the weather is the &quot;perfect weapon&quot; that leaves no fingerprints-- &quot;It's [viewed as] an act of God that comes in and directs a hurricane into your path, or starves you out of rain for a couple years, or causes a summer of heat so bad that your wheat cooks into dust,&quot; Agnew commented (he demonstrated some of this technology on an episode of Conspiracy Theory with Jesse Ventura). HAARP techniques have also been applied as a non-lethal weapon/psychological operation during wartime, as well as possible experiments on civilians, he detailed. \n\nAgnew shared an update on his North Pole Inner Earth Expedition (NPIEE), which he hopes will take place in 2012. Traveling on a Russian icebreaker, the expedition will explore an area above the Arctic Circle, that no one has ever visited by sea before. According to ancient legend, it is here that an entrance to an inner earth is said to exist. \n\nJohn Titor Update\nFirst hour guest, Oliver Williams gave an update on alleged time traveler John Titor, who via computer bulletin boards made several accurate predictions about the last decade. In the last year or so, there's been some speculation that the whole exercise of the Titor posts was that someone was trying to send messages to specific individuals, &quot;whether it was to other versions of John that were time traveling, or to people that knew what they were reading and we didn't.&quot; The author(s) might have been tech savvy scientists, not time travelers, but people who had information they wanted to reveal, Williams suggested. \n\nNews segment guest: Jerome Corsi \n\nWebsite(s): \nrememberingthefuturebook.com \nnpiee.org \nx2-radio.com \njohntitor.com \nBook(s): \nRemembering the Future \n\nthanks to my sorce .... thanks for seeding. ","torrent":{"xt":"urn:btih:2b323569ea441ff32bfea3619aa27e02ae11aecc","amp;dn":"Coast+to+Coast+-+Apr+04+2011+-+HAARP+%26+Weather+Control","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b323569ea441ff32bfea3619aa27e02ae11aecc","infoHashBuffer":{"type":"Buffer","data":[43,50,53,105,234,68,31,243,43,254,163,97,154,162,126,2,174,17,174,204]},"announce":[],"urlList":[]}}