{"title":"Supertramp - Paris (resequenced &amp; expanded by }{eywood)","uid":9251366,"size":822401828,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2b9044c8095d498b9bec65bfc7e64663af1886ce&amp;dn=Supertramp+-+Paris+%28resequenced+%26amp%3B+expanded+by+%7D%7Beywood%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"}{eywood","files":33,"time":1385424813,"description":"Supertramp\nParis\nresequenced and expanded by }{eywood\n\nAah Paris.  A city that makes you think of love, romance...and Supertramp.  The fantastic live album they made there was unfortunately restricted by the time limitations of vinyl, and therefore does not contain the whole setlist of that tour.  It's also reordered to better fit album sides.  These days we have no restrictions.  CDs are longer, and nowadays most people don't even use them, resorting rather to personal music players that have no time limitations at all.  So I reworked the Paris album, returning it to the correct running order and restoring the missing songs from the Breakfast In America bonus disc.\n\nMy son turned me on to the Deluxe edition release of Breakfast In America almost the instant it came out. Since I have the MFSL version of this album I was not all that concerned with the 1st CD, but the part that I was interested in was the previously unreleased recordings from Paris that didn't make the album because of vinyl time limitations. Upon listening to these new live recordings I was very happy with them, but I was concerned that they were quite dry sounding compared to the mix on Paris.\n\nI had previously constructed this record a few years ago when the BIA Deluxe edition came out, but at the time I could not locate better than an mp3 source for the second disc.  Three years later I finally found a lossless version shared on Avax which I promptly migrated over here. This made me revisit my Paris reconstruction and remake it from the beginning.\n\nThe tracks from BIA have been carefully matched to the production for Paris:  reverb has been added to the music and a slap delay has been added to the spoken parts.  I even separated the dialogue from the music at the start of Downstream by phase manipulation so I could effect the music and the dialogue differently.  Everything was then sequenced into the order of the setlists for those shows, recreating a full show as heard in Paris in 1979.\n\n01 School\n02 Ain't Nobody But Me\n03 The Logical Song\n04 Goodbye Stranger\n05 Hide in Your Shell\n06 From Now On\n07 Child of Vision\n08 Even in the Quietest Moments\n09 You Started Laughing\n10 A Soapbox Opera\n11 Asylum\n12 Give a Little Bit\n13 Bloody Well Right\n14 Breakfast in America\n15 Downstream\n16 Dreamer\n17 Rusy\n18 Take the Long Way Home\n19 Another Man's Woman\n20 Fool's Overture\n21 Two of Us\n22 Crime of the Century\n\n\nI thank my son Nathanael a/k/a saygeddylee for the inspiration to make this.\n\n}{eywood 11/26/13","torrent":{"xt":"urn:btih:2b9044c8095d498b9bec65bfc7e64663af1886ce","amp;dn":"Supertramp+-+Paris+%28resequenced+%26amp%3B+expanded+by+%7D%7Beywood%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b9044c8095d498b9bec65bfc7e64663af1886ce","infoHashBuffer":{"type":"Buffer","data":[43,144,68,200,9,93,73,139,155,236,101,191,199,230,70,99,175,24,134,206]},"announce":[],"urlList":[]}}