{"title":"Sir Henry at Rawlinson End (1980) Full DVD","uid":7304736,"size":4229481029,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2bd2dcd3c8efd448955d232d38369985deb46aa4&amp;dn=Sir+Henry+at+Rawlinson+End+%281980%29+Full+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"sf22","files":20,"time":1338156323,"description":"Full DVD\n\nSir Henry at Rawlinson End is a 1980 British film based on the eponymous character created by Vivian Stanshall. It starred Trevor Howard as Sir Henry and Stanshall himself as Henry's brother Hubert. Unusually, the film was released in sepia-toned monochrome. After a long wait, while the film obtained cult status, Sir Henry at Rawlinson End was finally released on DVD in 2006.\n\nThe bonuses include a commentary track with the director, Steve Roberts, as well as Sheila Reid (Aunt Florrie) and Jeremy Child (Peregrine Maynard), as well as a picture gallery, synopsis, the script of unfilmed scenes, and actor biographies.\n\nAs complex as the mind of its creator, Vivian Stanshall, the plot of Sir Henry at Rawlinson End revolves around attempts to exorcise the ghost of Humbert, the brother of Sir Henry (Trevor Howard). Humbert was accidentally killed in a drunken duck-shooting incident whilst escaping from an illicit tryst. Amongst the eccentric family members, mad friends and grudgingly loyal servants involved are the eternally knitting Aunt Florrie, the tapeworm-obsessed Mrs. E, Lady Phillipa of Staines (Liz Smith), who enjoys the odd 'small' sherry and the ever-present Old Scrotum, Sir Henry's wrinkled retainer.\n\nSupplied by sparkyfish22.","torrent":{"xt":"urn:btih:2bd2dcd3c8efd448955d232d38369985deb46aa4","amp;dn":"Sir+Henry+at+Rawlinson+End+%281980%29+Full+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bd2dcd3c8efd448955d232d38369985deb46aa4","infoHashBuffer":{"type":"Buffer","data":[43,210,220,211,200,239,212,72,149,93,35,45,56,54,153,133,222,180,106,164]},"announce":[],"urlList":[]}}