{"title":"Discovering Orthodoxy","uid":15397674,"size":2621279830,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:2d25879c72e17801822f33385dc48788b7367dad&amp;dn=Discovering+Orthodoxy&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Psychodad149","files":145,"time":1469411636,"description":"This is a collection of works designed to help one unfamiliar with the Eastern Orthodox Church learn about it -- or them. Much as the American Episcopal Church is independent from the Church of England, yet they are &quot;in communion&quot; with one another, so too are the Greek Orthodox Church and Russian Orthodox Church independent but united in heart: as are the other Orthodox Churches in communion with the Archbishop of Constantinople, Orthodoxy's Patriarch. These include the Ukrainian, Bulgarian, Serbian, and Antiochian Orthodox Churches, as well as the Orthodox Church in America, and others. \r\n\r\nHowever, even &quot;cradle Orthodox&quot; may find in these pages deep wells of wisdom and spirituality, not to mention an inexhaustible resource of learning and history 2000 years old. \r\n\r\nThese folders are organized logically, and the titles, generally, show progressively deeper and more complex teachings and practices. I hope this is adequate for either the scholar looking for an &quot;insider's&quot; perspective on Orthodoxy or the spiritually lost or curious looking for meaning and answers. Some of these are more authoritative than others: generally the first and simplest. \r\n\r\nLike many things, however, Orthodoxy is not a faith of books, sermons, and catechisms. To understand Orthodoxy one must experience it at firsthand. Visit a church - visitors are always welcome! Just be aware that, as in a Roman Catholic Church, receiving communion in the Eucharist is restricted to Orthodox faithful. There will be prayerbooks to help one follow along. Depending on the parish, parts of the service (&quot;The Divine Liturgy&quot;) may be in Russian, Greek, Arabic, or some other language. It may be best, and easiest, to just listen and absorb what you can, and worry about the rest another time. There will be a lot of standing and kneeling, bowing and crossing. Again, don't worry too much. Generally, if in doubt, stand. \r\n\r\nAs for the rest -- you may notice that not everyone is doing the same thing at the same time, anyway. As long as you show respect and reverence, you won't draw any dirty looks. (See &quot;First Visit To An Orthodox Church&quot; in Folder 1 for more insight.)","torrent":{"xt":"urn:btih:2d25879c72e17801822f33385dc48788b7367dad","amp;dn":"Discovering+Orthodoxy","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d25879c72e17801822f33385dc48788b7367dad","infoHashBuffer":{"type":"Buffer","data":[45,37,135,156,114,225,120,1,130,47,51,56,93,196,135,136,183,54,125,173]},"announce":[],"urlList":[]}}