{"title":"Disturbed - Down With The Sickness (2nafish)","uid":6018330,"size":131450884,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2d589e456af38b9793392c263081e2143f7328dc&amp;dn=Disturbed+-+Down+With+The+Sickness+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"2nafish","files":-1,"time":1291720756,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Down with the Sickness&quot; is a song by American rock band Disturbed. The song was recorded in 1999 and was released as the second single from their debut studio album, The Sickness. The song is one of Disturbed's best-known songs and is a concert staple, usually played as the last song. This was their first single to be certified platinum in the United States by the Recording Industry Association of America.\n\nA music video composed of live concert footage was produced for the song. The music video excludes the &quot;abuse&quot; segment as does the radio edit of the song.\n\nIt also features an iconic staccato scream from singer David Draiman at the end of the intro, which reappears throughout the song.\n\nThe Sickness is the debut album by American heavy metal band Disturbed. The album was recorded in 1999 and released on March 7, 2000. The album peaked at number 29 on the Billboard 200 chart and it has spent a total of 103 weeks on that chart, as of June 2010. The Sickness has been certified 4x Platinum by the RIAA, with around 4,138,206 copies sold in the United States alone as of 2010, making it the band's most successful album. Unlike Disturbed's later albums, which are mixed in style, The Sickness consists primarily of heavier songs. It is the only studio album by Disturbed to exclude a title track of the exact same name, although the second single, &quot;Down with the Sickness&quot;, includes the album title as the last two words, so it can be considered the title track.\n\nOn March 23, 2010, a reissue of the album was released, which includes B-sides, new artwork, and exclusive online content. This reissue also celebrates the tenth anniversary of the release of the album and is available for the first time in vinyl format. Disturbed's guitarist, Dan Donegan, commented on the reissue: &quot;[...] it's the album that put us on the map and launched our career. So we went back into the studio and we remixed it, we're having it remastered, we're gonna put a couple of bonus tracks on there and touch up some of the packaging and the artwork. Just a little collector's item, a little tribute to that album for the fans&quot;.\n\nDisturbed is a heavy metal band from Chicago, Illinois, formed on October 24, 1995 when musicians Dan Donegan, Steve &quot;Fuzz&quot; Kmak, and Mike Wengren hired David Draiman as their singer. Since the band's formation, they have sold over 11 million albums worldwide, making them one of the largest grossing rock bands in recent years. The band has released five studio albums, four of which have consecutively debuted at number-one on the Billboard 200.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:2d589e456af38b9793392c263081e2143f7328dc","amp;dn":"Disturbed+-+Down+With+The+Sickness+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d589e456af38b9793392c263081e2143f7328dc","infoHashBuffer":{"type":"Buffer","data":[45,88,158,69,106,243,139,151,147,57,44,38,48,129,226,20,63,115,40,220]},"announce":[],"urlList":[]}}