{"title":"Colosseum...Those Who Are About to Die Salute You(1969)remastere","uid":5559609,"size":413124425,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2da26deffba877a51baf9f492d5e124ea6b65ba1&amp;dn=Colosseum...Those+Who+Are+About+to+Die+Salute+You%281969%29remastere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":17,"time":1273788317,"description":"THOSE WHO ARE ABOUT TO DIE SALUTE YOU is a 1969 album by the British jazz-rock band Colosseum.\n\nColosseum's debut album is a powerful one, unleashing each member's instrumental prowess at one point while consolidating each talent to form an explosive outpouring of progressive jazz/rock the next. Those Who Are About to Die Salute You is coated with the volatile saxophone playing of Dick Heckstall-Smith, the thunderous keyboard assault of Dave Greenslade, and the bewildering guitar craft of James Litherland. Together, Colosseum skitters and glides through brisk musical spectrums of freestyle ]jazz and British blues, sometimes held tightly in place by Greenslade's Hammond organ, while other times let loose by the brilliancy of the horn and string interplay. Each song sparks its own personality and its very own energy level, giving the band instant notoriety upon the album's release in 1969. Not only did Colosseum sound different from other jazz fusion bands of the era, but they could easily take the unconventional elements of their style and churn them into palatable and highly significant musical thoroughfares. Some of the more compelling tracks include &quot;Walking in the Park,&quot; led by its powerful trumpet segments, and &quot;Pretty Hard Luck,&quot; which embarks on a stylish blues excursion with colorful keyboard sections on the periphery. &quot;Beware the Ides of March&quot; borrows a page out of J.S. Bach's notebook and turns his classical poignancy inside out, while &quot;Mandarin&quot; and &quot;Backwater Blues&quot; are created with the perfect jazz and blues friendship in mind, representing Colosseum's fused sound spotlessly. Best of all, the album never strays from its intensity or its creativity, the very foundation that the band is built on. Their next album, Valentyne Suite, mirrors the same instrumental congruity as Those Who Are About to Die, and is equally entertaining. ~ Mike DeGagne\n\nUK reissue of the progressive rock act's 1969 release. Sanctuary. 2004.\n\nProduct Details\nAudio CD (October 26, 2004) \nOriginal Release Date: July 26, 2004 \nNumber of Discs: 1 \nFormat: Original recording remastered \nLabel: Sanctuary \nASIN: B0002YCUXY \n \n    \n1. Walking in the Park  \n2. Plenty Hard Luck  \n3. Mandarin  \n4. Debut  \n5. Beware the Ides of March   \n6. Road She Walked Before  \n7. Backwater Blues  \n8. Those About to Die  \n9. I Can't Live Without You [Studio Outtake][*]  \n10. Whiter Spade Than Mayall [*]  \n11. Walking in the Park [*] \n12. Beware the Ides of March [*] \n13. Plenty Hard Luck [*]  \n14. Walking in the Park [*]  \n\ncd ripped by dBpoweramp\n\nplease seed\n\n\n","torrent":{"xt":"urn:btih:2da26deffba877a51baf9f492d5e124ea6b65ba1","amp;dn":"Colosseum...Those+Who+Are+About+to+Die+Salute+You%281969%29remastere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2da26deffba877a51baf9f492d5e124ea6b65ba1","infoHashBuffer":{"type":"Buffer","data":[45,162,109,239,251,168,119,165,27,175,159,73,45,94,18,78,166,182,91,161]},"announce":[],"urlList":[]}}