{"title":"Lamb Of God and Ark Of The Covenant [VHS-rip][Verifire]","uid":5942561,"size":1567648029,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2ec2f3be78a6c77085cd71aa4f7ef00e8abb9e90&amp;dn=Lamb+Of+God+and+Ark+Of+The+Covenant+%5BVHS-rip%5D%5BVerifire%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"verifire","files":-1,"time":1289230428,"description":"Hi There..\n\n============\n\nLong time, no password..\n\nIt got &quot;lost in translation&quot; and I needed &quot;Neonrainbow&quot;s help to point me to &quot;Adapa&quot;, to retrieve it.\n\nWhich is why this edition/upload is dedicated to them. Thanks a bunch, mateys! :-)\n\n============\n\nWell, the upload:\n\nNo. This is not the band &quot;Lamb of God&quot;.\nIt's not the new record by &quot;Covenant&quot; either.\n\nI care about getting such stuff out to you all as best I can and as fast I can. And I've saved this one for this occasion.. There's a reason for that.\n\nI tell you: THIS is the best video from J. Gray's vaults. Without a doubt. I can't imagine what would be more spectacular than this.\nThat is a matter of one mans opinion, of course, but I think many will agree upon watching. To put it mildly.\nThe implications are huge though. On a personal level as well as globally speaking.\n\nWhat you are about to see will:\n\n1: Leave you in awe and wonder, or you\n2: may not believe in it, and therefore\n3: also fail to see it's significance. In which case I think it to be strange.\n\nI hope you are among the first.\nYou might end up a changed person after watching it. And you'll feel good about it eventually, although baffled and perhaps a bit challenged at first..\n\nThe archaeologist Jonathan Gray has made this video.\nThis was the first time I heard of Jonathan Gray videos, and the first time I'd seen anything like this.\nIn fact; the material revealed is of such a nature that it's hard to believe it, if it weren't for the fact that the details can be checked [except for parts that the government still keeps out of the public eye].\nAnd the pieces fit together too well to be easily dismissed.\n\nI found this at a friend's video collection and copied it.\nWhen I found it, it was adorned with nice, hard-coded Norwegian subtitles, well up on the bottom of the screen..\nI have cropped them as much I was able to without loosing too much of the picture for this edition, although some details located at the bottom of the screen still show little white spots. That's the tops of the t's and such, but I thought that those subs was a bit disturbing to people that doesn't understand Norwegian, so..\n\nA little loss of frame to gain some sharpened attention and at least a touch of professionalism? I went for it.\nBut if Scandinavians wants to see this with subs, or if there's details you'd like to see and you don't mind the subs, that version is uploaded here too.\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/3947789&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/3947789&lt;/a&gt;\n \nNow; the day after I saw this movie, I received a newsletter from Mr. Gray's website (it is located at:\n &lt;a href=&quot;\nhttp://beforeus.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://beforeus.com/&lt;/a&gt;\n \nwhich I enclose in this folder along with this comment. Amazing it should turn up in my mailbox the day after I saw this video..\nAs addendum to this video, it is highly recommended to read it. VERY relevant.\n\nJ. Gray has also written a book about it; &quot;The Ark Of The Covenant&quot;.\nThat is one of, perhaps THE, most exiting books I have EVER read [with the exception of one Book.. ;-) ], I kid you not.\nI bought the paperback hard-copy from J. Gray's site quite a while back though. The E-book would have been great to have, but the sales routines have changed, so it's off limits to me. Visa or Mastercard..?\n\nI have no credit card. [If someone has one, the url to the (27,-$US) E-book is here:\n &lt;a href=&quot;\nhttp://www.beforeus.com/abook.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.beforeus.com/abook.html&lt;/a&gt; (Psst; I wouldn't mind a copy.. :D )\n \nHave a nice shock and a pleasant experience!\nVerifire.","torrent":{"xt":"urn:btih:2ec2f3be78a6c77085cd71aa4f7ef00e8abb9e90","amp;dn":"Lamb+Of+God+and+Ark+Of+The+Covenant+%5BVHS-rip%5D%5BVerifire%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ec2f3be78a6c77085cd71aa4f7ef00e8abb9e90","infoHashBuffer":{"type":"Buffer","data":[46,194,243,190,120,166,199,112,133,205,113,170,79,126,240,14,138,187,158,144]},"announce":[],"urlList":[]}}