{"title":"Railworks TS2014 AP Class 20 Sound Pack (Pro)","uid":10079272,"size":61787852,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:30d222e8c8d4399093684414c28cdc36f794b73f&amp;dn=Railworks+TS2014+AP+Class+20+Sound+Pack+%28Pro%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tygn547","files":-1,"time":1398970423,"description":"How is a Pro sound pack different to a standard one?\n\nIf a sound pack is classed as being Pro, it means that most, if not all, of the sounds used have been recorded using state-of-the-art equipment at an especially organised recording session. This allows us to acquire the exact kind of sounds we require to create the best experience within the simulator. In the case of this pack, all sounds were recorded from 20087 at the East Lancashire Railway. As well as excellent audio quality, Pro packs include separate cab and exterior sounds because as anyone who's been in the cab of a locomotive knows, there is really quite a difference! Finally, all efforts have been made to make sure the sounds are as realistic as possible. One way we have achieved this is by employing realistic volume levels which means that the volume differential between idling and full power is prototypically large so as to make you really feel the power of the engine when it revs up.\n\nWhat is exactly featured?\n\nTicking spirax valve\n\nEngine start up/shut down\n\nVarying engine rev-up sounds depending on how much you move the power handle\n\nField divert sounds at a variety of power handle positions\n\nSubtle traction motor hum can be heard in the cab as you pick up speed\n\nIf the power handle is shut off sufficiently, the engine note will cut out as per reality with only the winding down turbocharger audible\n\nUser operable two-tone horn using the space-bar and 'B' key\n\nCompressor\n\nSeparate cab sounds\n\nBogie run sounds to give the sensation of movement\n\nBrake release/application sounds\n\nBrake rub\n\nBrake squeal\n\nFlange sound\n\nCab instrument sounds\n\nJointed track sounds (Bo-Bo 2-axles)\n\nRealistic sound fading effects\n\nAccurate volume levels. This means the quietest sounds are as quiet as they should be in relation to the loudest as per reality.\n\nAs well as the sounds, a 70 minute scenario is supplied for the London to Brighton route which sees you drive a speedlink service between Crawley New Yard &amp; Latchmere Junction (Clapham Junction) in 1988. To ensure the most realistic experience possible, it uses the timetable of the year it's based in which means you'll be in store for plenty of AI traffic as you weave between the busy south London traffic. The perfect way to test these sounds out.\n\nThis add-on is supplied in download format only.\n\nIf you have a problem with this product, please use the contact us button at the bottom of this page and we will try our best to fix it.\n\nEssential Requirements\n\nJust Trains Class 20 Collection - More Information\n\nAND/OR\n\nRS.com Class 20 - More Information\n\nScenario Requirements\n\nPlease note that these items are only required if you would like to use the scenario supplied with this pack. If you only want to make use of the sounds or perhaps use them in your own scenarios instead of the included one then these items are not required.\n\nRS.com London to Brighton \n\nRS.com Settle to Carlisle \n\nArmstrong Powerhouse Mk2E Coach Pack - More Information OR Digital Traction Mk2s - Discontinued\n\nDigital Traction Wagon Pack 1 - Discontinued OR Digital Traction British Railways Wagons - More Information\n\nJust Trains Cargowaggon IWB PlusPak \n\nJust Trains Class 20 Collection \n\nRS.com Class 33 \n\nRS.com Class 421 \n\nRS.com Class 423 \n\nRS.com European Community Asset Pack \n\nThomson Interactive Class 455 ","torrent":{"xt":"urn:btih:30d222e8c8d4399093684414c28cdc36f794b73f","amp;dn":"Railworks+TS2014+AP+Class+20+Sound+Pack+%28Pro%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30d222e8c8d4399093684414c28cdc36f794b73f","infoHashBuffer":{"type":"Buffer","data":[48,210,34,232,200,212,57,144,147,104,68,20,194,140,220,54,247,148,183,63]},"announce":[],"urlList":[]}}