{"title":"Hawaiian Slack Key Guitar Masters Collection, Vol. 2","uid":6403116,"size":68119300,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:325ea0db1ffb9560cdbc9ddd126419478ba6bfeb&amp;dn=Hawaiian+Slack+Key+Guitar+Masters+Collection%2C+Vol.+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bobbers602","files":16,"time":1305726050,"description":"This second album in Dancing Cat Records' Hawaiian Slack Key Guitar Masters Series produced by George Winston follows its successful Hawaiian Slack Key Guitar Masters. Again the masters of the genre are featured in several well-known tunes such as Lili'uokalani's &quot;Aloha 'Oe&quot; (played here by George Kahumoku) and &quot;'Ulili E&quot; (Dennis and David Kamakahi), as well as modern originals and two tracks that had not been available on CD before: &quot;Ulu Niu Ke'eke'e&quot; (George Kahumoku and Kekuhi Kanahele) and &quot;Slack Key Serenade&quot; (Leonard Kwan and Ozzie Kotani). The liner notes provide complete information on each song's original album.\nA balance of instrumental and vocal tracks, the compilation is a terrific starting point for exploring the artistic and stylistic diversity in modern slack key. Instruments on this album include everything from traditional mouth bow, 'ukulele, and percussion stones to 12-string slack key and modern acoustic guitars. Elder statesman Ray Kane lullabies us with his simple instrumental &quot;Popoki Slack Key&quot; (popoki means &quot;little cat&quot;); renowned improviser Cyril Pahinui and Sol Hoopii-influenced Bob Brozman combine 12-string slack key and acoustic steel guitar interpreting &quot;Hilo E&quot; and &quot;Lili'u E&quot; in a style evocative of the 1920s. Showing off how slack key works solo, in duets, or with mixed accompaniment, this is one of the most beautiful slack key compilations out there.\n\n","torrent":{"xt":"urn:btih:325ea0db1ffb9560cdbc9ddd126419478ba6bfeb","amp;dn":"Hawaiian+Slack+Key+Guitar+Masters+Collection%2C+Vol.+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"325ea0db1ffb9560cdbc9ddd126419478ba6bfeb","infoHashBuffer":{"type":"Buffer","data":[50,94,160,219,31,251,149,96,205,188,157,221,18,100,25,71,139,166,191,235]},"announce":[],"urlList":[]}}