{"title":"The Anthony Cumia Show 2015-02-10 MP4 MP3 combo","uid":11694647,"size":404295034,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:32657314b225dec2e399a7e5ac65fe592cdad6b5&amp;dn=The+Anthony+Cumia+Show+2015-02-10+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"mothergoose58","files":2,"time":1423666062,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest(s): John Melendez, Layton Benton\n\nEpisode 108: Today Stuttering John and Anthony sit at the poker table to talk about drinking, relationships, and their shared love of Columbo reruns and old timey TV shows. John tells us a few Jackie Martling stories, we find out his son gave him lice, the guys chat about their love of Artie Lange, and adult film star Layton Benton arrives and they rapid fire question her about gangbangs, fart porn, dick size, dating habits, and her Amazon wish list. We hear about the Samsung TV possibly taping your every word, Layton changes in to a PajamaGram set and the guys ask her about feet, her sexual fetishes, John offers to buy Ant dinner if he lets Layton fart on him, and we get a little insight on Layton's (wild) family history. Layton treats the guys to a stripped down dance, teases them with a &quot;sex with a NBA star&quot; story, they get back into fart chat, and talk about celebrity sex. Layton tells us about accidently shitting on a guy's dick, how she was accidently peed on, and tells us about her new DVD and where you can find her on social media before leaving. The guys discuss Charles Manson calling off his marriage, OJ Simpson, Bruce Jenner, John tells us his daughter came out as transgender, mentions that he spoke with Bruce Jenner after his divorce, and they address a few Howard Stern quirks. TACS wraps up with John questioning Ant about his relationship with Opie, Ant turning the tables on John by questioning him on his relationship with Stern, dating (or lack thereof) out of their race, and they indulge in a little more beloved old TV show chatter.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nNew ups at:\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:32657314b225dec2e399a7e5ac65fe592cdad6b5","amp;dn":"The+Anthony+Cumia+Show+2015-02-10+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32657314b225dec2e399a7e5ac65fe592cdad6b5","infoHashBuffer":{"type":"Buffer","data":[50,101,115,20,178,37,222,194,227,153,167,229,172,101,254,89,44,218,214,181]},"announce":[],"urlList":[]}}