{"title":"Oz and James Drink to Britain - S01E08 (24th February 2009)[PDTV","uid":4741415,"size":243998720,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3316c79e1ed7ee4d0a7a25ff0ad7f374a437b466&amp;dn=Oz+and+James+Drink+to+Britain+-+S01E08+%2824th+February+2009%29%5BPDTV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"questar","files":1,"time":1235581519,"description":"Oz and James Drink to Britain DOCUMENTARY: Oz and James Drink to Britain On: BBC 2 Date: Tuesday 24th February 2009 Time: 20:00 to 20:30 For the final programme in the series, Oz Clarke and James May return to the Southeast to investigate the future of British drink. Is this where they will find the drink which speaks for modern Britain? First, Oz gives James a geology lesson. The chalky soil of Sussex has many of the characteristics of the Champagne region of France. The pair head for Breaky Bottom, home of one of the pioneers of English sparkling wine - Peter Hall. Peter planted a vineyard on the Sussex downs back in the seventies, and now his vintages are even served in the British embassy in Paris. He and Oz set a sparkling wine challenge for James. Will he pick out the English sparkling wine? Next, they travel to meet a local beer brewer with a difference. Robert Wicks has gone back to the archives of an extinct local brewery to recreate the beer which was Churchill's favourite, and which cheered the troops after the Normandy landings. There is another invasion on Oz's mind, however, as he tells James about the rumours that French winemakers have been buying up countryside in the area to plant grapes. This does not go down well. Finally Oz and James visit a winemaker who has his eyes set firmly on the future. Dermot Sugrue is a young Irishman who is establishing a new winery on the Wiston Estate using amazing equipment he has imported from France, including a vintage Champagne press that is unique in the country. On the last day of the trip, Oz and James find themselves back on the White Cliffs again, surrounded by the bottles and barrels that tell the story of the journey. But have they come to a conclusion after their three thousand mile expedition? Which is the drink that, according to Mssrs Clarke and May, speaks for modern Britain?","torrent":{"xt":"urn:btih:3316c79e1ed7ee4d0a7a25ff0ad7f374a437b466","amp;dn":"Oz+and+James+Drink+to+Britain+-+S01E08+%2824th+February+2009%29%5BPDTV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3316c79e1ed7ee4d0a7a25ff0ad7f374a437b466","infoHashBuffer":{"type":"Buffer","data":[51,22,199,158,30,215,238,77,10,122,37,255,10,215,243,116,164,55,180,102]},"announce":[],"urlList":[]}}