{"title":"Modernizing Legacy Applications PHP - Paul M Jones","uid":10660138,"size":14638459,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:332481fbcc055d8c3f1c3d2e89e139fce85dda5e&amp;dn=Modernizing+Legacy+Applications+PHP+-+Paul+M+Jones&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"pagafant","files":1,"time":1406713510,"description":"Is your legacy PHP application composed of page scripts placed directly in the document root of the web server? Do your page scripts, along with any other classes and functions, combine the concerns of model, view, and controller into the same scope? Is the majority of the logical flow incorporated as include files and global functions rather than class methods? If so, you already know that the wide use of global variables means that making a change in one place leads to unexpected consequences somewhere else. These and other factors make it overly difficult and expensive for you to add features and fix bugs. Working with this legacy application feels like dragging your feet through mud.\n\nBut it doesn't have to be that way! This book will show you how to modernize your application by extracting and replacing its legacy artifacts. We will use a step-by-step approach, moving slowly and methodically, to improve your application from the ground up. Moreover, we will keep your application running the whole time. Each completed step in the process will keep your codebase fully operational with higher quality. When we are done, you will be able to breeze through your code like the wind. Your code will be autoloaded, dependency-injected, unit-tested, layer-separated, and front-controlled.\n\n &lt;a href=&quot;\nhttps://leanpub.com/mlaphp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://leanpub.com/mlaphp&lt;/a&gt;\n\n\nRegards from Palestine","torrent":{"xt":"urn:btih:332481fbcc055d8c3f1c3d2e89e139fce85dda5e","amp;dn":"Modernizing+Legacy+Applications+PHP+-+Paul+M+Jones","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"332481fbcc055d8c3f1c3d2e89e139fce85dda5e","infoHashBuffer":{"type":"Buffer","data":[51,36,129,251,204,5,93,140,63,28,61,46,137,225,57,252,232,93,218,94]},"announce":[],"urlList":[]}}