{"title":"Johann Johannsson - The Miners' Hymns 2011","uid":7011362,"size":219037876,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:33a904c9794dc55e03f95a931c2ab77aae7dfcac&amp;dn=Johann+Johannsson+-+The+Miners%5C%27+Hymns+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"barber9","files":-1,"time":1328480125,"description":"Few could deny the inherent, unmistakable grandeur of Johann Johannsson's compositions, and 'The Miners' Hymns' might just be his grandest statement to date. The record finds our Icelandic protagonist tackling characteristically difficult subject matter -  the plight of the Durham miners as their industry was brought down to rubble over the last hundred or so years. Notable too is the fact that Johannsson's score is a companion piece to a new film from celebrated artist Bill Morrison (he of 'Decasia' fame), so already there is a feeling that a certain air of substance surrounds the album. Play this against Johannsson's clever use of instrumentation as he tackles brass for the first time since 2004's genre defying 'Virthulegu Forsetar' and we're left with a mesmerizing record, and one that could stand as the finest addition to Johannsson's canon thus far. The subject matter lends a distinct weight to the already emotive songs, but the truth is that the music stands alone without this kind of contextualization. While it is definitely cinematic, those chilling brass tones (influenced in part by Durham's rich history of brass bands) stand strong as part of Johannsson's singular musical vocabulary, and the narrative he tells needs little imagery to enhance its appeal. 'The Miners' Hymns' might be his most subtle work to date, and I get the feeling that he has allowed far more space and much more time in each piece on the record. These are slow moving, slow burning, brooding epics, and while they share stylistic traits with 'classic' soundtracks of the past there is a sense that Johannsson is more willing to allow his pieces to dwell in the darker recesses of the mind. You can almost hear the cavernous mineshafts and their ominous heritage in the brutal electronic treatments, and hear the creaking, crumbling landscapes beneath the haunting brass. I'm reminded of Gavin Bryars's seminal 'The Sinking of the Titanic', and if any body of work compares favorably to that classic composition then it has to be a good thing. 'The Miners' Hymns', simply put, is a crowning achievement for Johannsson. Highly Recommended. (boomkat.com)\n\n- - -\n\nJohann Johannsson - The Miners' Hymns 2011 -\nmusic by Johann Johannsson - from the film by Bill Morrison\n(New York  Fat Cat)\n\n1. They being dead yet speaketh \n2. An injury to one is the concern of all \n3. Freedom from want and fear \n4. There is no safe side but the side of truth\n5. Industrial and provident, we unite to assist each other \n6. The cause of labour is the hope of the world\n\nThe Miners' Hymns is performed by a 16-piece brass ensemble led by noted Icelandic conductor Gudni Franzson and features the Durham Cathedral organ and organist Robert Houssart.\n","torrent":{"xt":"urn:btih:33a904c9794dc55e03f95a931c2ab77aae7dfcac","amp;dn":"Johann+Johannsson+-+The+Miners%5C%27+Hymns+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33a904c9794dc55e03f95a931c2ab77aae7dfcac","infoHashBuffer":{"type":"Buffer","data":[51,169,4,201,121,77,197,94,3,249,90,147,28,42,183,122,174,125,252,172]},"announce":[],"urlList":[]}}