{"title":"The Court Martial of Billy Mitchell (1955) Xvid 1cd - Gary Coope","uid":10781230,"size":734500864,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3427cf1ea7433c9d855ac67ad7c8678d9f3e3196&amp;dn=The+Court+Martial+of+Billy+Mitchell+%281955%29+Xvid+1cd+-+Gary+Coope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"SaM","files":1,"time":1408164329,"description":"The Court Martial of Billy Mitchell (1955) Xvid 1cd - Gary Cooper, Elizabeth Montgomery [DDR]\n\nThe Court-Martial of Billy Mitchell is a 1955 film directed by Otto Preminger. It stars Gary Cooper as Billy Mitchell, Charles Bickford, Ralph Bellamy, Rod Steiger and Elizabeth Montgomery in her film debut.\n\n    CAST:-\n    Gary Cooper - Col. Billy Mitchell\n    Charles Bickford - Maj. Gen. Jimmy Guthrie\n    Ralph Bellamy - Congressman Frank R. Reid\n    Rod Steiger - Maj. Allan Guillion\n    Elizabeth Montgomery - Mrs. Margaret Lansdowne (Film Debut)\n    Jack Lord - Lt. Cmdr. Zachary Lansdowne\n    Fred Clark - Col. Sherman Moreland\n    Darren McGavin - Capt. Russ Peters\n    James Daly - Lt. Col. Herbert White\n    Peter Graves - Capt. Bob Elliott\n\nDirected by Otto Preminger\nProduced by Milton Sperling\nMusic by\tDimitri Tiomkin\nRunning time 100 min.\n\nMOVIE PLOT:- \nBrigadier General William Mitchell tries to prove the worth of the Air Service as an independent service by sinking a battleship under restrictive conditions agreed to by Army and Navy. He disobeys their orders to limit the attack to bombs under 1,000 pounds and instead loads 2,000 pounders. With these, he proves his aircraft can sink the ex-German World War I battleship Ostfriesland, previously considered unsinkable. But his superiors are outraged.\n\nPolitically vocal, he is demoted to colonel and sent to a ground unit in Texas. A high-profile air disaster occurs in which his close friend Zachary Lansdowne is killed, the crash of the dirigible USS Shenandoah. This is followed by a second disaster in which six planes, poorly maintained because of lack of funds, flying from a base on the California coast to Fort Huachuca, Arizona, crash.\nMitchell at this points calls a press conference in which he makes harsh criticisms of the Army.\nHe is then court-martialed.\nIt goes slowly for Mitchell's attorney and friend, Congressman Reed of Mitchell's home state Wisconsin, who tries everything, until he subpoenas President Calvin Coolidge. At this point the court decides to adjourn.\nClearly the military wants out of this limelight, but Mitchell refuses to sign a paper Reed has presented him in which he withdraws his criticisms in return for saving his career as an Army officer. Margaret Lansdowne, widow of Mitchell's dead friend from the Shenandoah, then appears in court. The previous barring of evidence demonstrating a justification for Mitchell's criticisms of his superiors failure to develop air power is repealed and many witnesses are then called forward to corroborate Mitchell's criticisms, including Eddie Rickenbacker and Fiorello LaGuardia.\nFinally Mitchell testifies and is cross-examined by a prosecutor specially brought in for the job (played by Rod Steiger) who stresses his having disobeyed his superior officers and who ridicules his attempts at foresight, even that accurately describing, in 1941, both Philippines and Hawaii were attacked by Japan.\n\nThe court finds Mitchell guilty, but he has presented his case to the public, which is somewhat of a win considering he wanted to raise awareness about the state of the Air Service. As his pilots salute him Mitchell steps out and looks up and sees a squadron of four biplanes in flight; the biplanes are replaced with a squadron of jets, demonstrating what Billy Mitchell's actions will result in for the future of the United States and its Air Force.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Bitrate: 1295 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: English\nRunTime: 100 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]   \nDuration: 100 mins","torrent":{"xt":"urn:btih:3427cf1ea7433c9d855ac67ad7c8678d9f3e3196","amp;dn":"The+Court+Martial+of+Billy+Mitchell+%281955%29+Xvid+1cd+-+Gary+Coope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3427cf1ea7433c9d855ac67ad7c8678d9f3e3196","infoHashBuffer":{"type":"Buffer","data":[52,39,207,30,167,67,60,157,133,90,198,122,215,200,103,141,159,62,49,150]},"announce":[],"urlList":[]}}