{"title":"Conjunto Primavera - Perdoname Mi Amor - Complete CD  - MP3","uid":4441392,"size":35326822,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:343811828931102ecbe1615e69fbc52eb23d7e44&amp;dn=Conjunto+Primavera+-+Perdoname+Mi+Amor+-+Complete+CD++-+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TheLabMan","files":12,"time":1223832100,"description":"                           - Primavera - \n\n                          Perdoname Mi Amor\n\n\n\nPERDONAME MI AMOR was nominated for the Latin Grammy Award for Best Norteno Album. &quot;Perdoname Mi Amor&quot; was nominated for Best Regional Mexican Song.\n\n\nBottom Line...\nPerdoname Mi Amor is a solid album that can appeal to listeners who would maybe not normally tune in to norteno music. With it&amp;#039;s mix of romantic, pop-oriented ballads blended with some strong rancheras and a scant handful of strong cumbias, it&amp;#039;s really an interesting blend of sounds and moods. I like this album and think it will appeal to a lot of Latin music fans who are far from the group&amp;#039;s normal fan base. Give it a listen!\n\n\n\n1.Perdoname Mi Amor\n\n2.Una Vez Mas\n\n3.Nueva Vida\n\n4.No Vuelvas a Hacerlo\n\n5.Nunca Mas\n\n6.Ilusiones Muertas\n\n7.Quien Como Tu\n\n8.Con una Copa de Vino\n\n9.Actos de un Tonto\n\n10.Que Habra Sucedido con Ella\n\n11.Perdoname Mi Amor - (pop version)\n\n\n                              Review\n\nNorteÃƒÂ±o music is hot these days -- sizzling hot! Norteno has been the dominant genre on the Latin music sales charts for at least the past year, and the trend shows no sign of abating. And that&amp;#039;s good news for a solid, reliable, hard-working norteno act like Conjunto Primavera. Conjunto Primavera has done a string of very solid albums over the last couple years, and their release of Perdoname Mi Amor is interesting because it bends the rules a bit and makes us rethink our preconceived ideas of what northern music really represents.\n\nStylistically, the music backs off the conjunto model a bit, and it&amp;#039;s a radically different sound from some of the more controversial envelope pushers (yeah, I&amp;#039;m talking guys like Lupillo Rivera or even Los Tigres del Norte). Conjunto Primavera isn&amp;#039;t as pure conjunto as groups like Los Traileros del Norte or even tejano powerhouse Intocable, but their sound is also not going to offend conservative sensibilities. In some ways, their sound strikes me as closer to tejano than norteno, in other ways, it strikes me as closer to ranchera. Call it what you want, I call it carving a niche for yourself and showing some innovation.\n\nBut enough widi widi. Let&amp;#039;s slide this disc into the CD player and listen to it for what it is...\n\nStandouts On Perdoname Mi Amor...\nThe big news to the ears of Conjunto Primavera&amp;#039;s adoring fan base is the hit title track, Perdoname Mi Amor, which is a classic ranchera style heart string puller that&amp;#039;s just born to be the theme song of big telenovela series. Listening to this track just calls up images of guys like Joan Sebastian and the way he belts out some of his big blockbusters like Tatuajes. That&amp;#039;s no faint praise since Sebastian is indisputably one of Mexico&amp;#039;s biggest name masters of this genre. If you&amp;#039;re going to have a role model, might as well make it a master...\n\nPerdoname Mi Amor works its aural spellcasting right from the first note of its rolling keyboard solo, which does nothing if not set a lonesome, winsome, gently reflective mood. It&amp;#039;s a mood that&amp;#039;s perfectly complemented by the humble lyrics of pleading contrition. I&amp;#039;m not usually a sucker for romantic type songs, and that&amp;#039;s really what Perdoname Mi Amor is, but I am a sucker for a well executed piece of music, and that&amp;#039;s what this song represents to me. All the pieces work together in total harmony to create a mood and to create sympathy for the poor guy who just really wants his love to give him a second chance. Not a particularly new concept, but one that&amp;#039;s always played well to audiences, and not just in Latin genres, but across the musical spectrum.\n\nI&amp;#039;m not really sure why they felt the need to include a second version of Perdoname Mi Amor, mixed as a pop song, on this disc. To my ears, the two tracks are not significantly different. There&amp;#039;s a little bit of tingly bell-like percussions on the pop track, and a little bit of violin that sounds suspiciously synthesized. Yeah, they&amp;#039;re a little different, but to me, the differences are subtle and fleeting and they really do nothing to create a new mood or to change the magic of the melody. It&amp;#039;s still a solid tune, but it&amp;#039;s a throwaway track that does nothing new or interesting.\n\nMore interesting, and also following along the pop-tinged ranchera side of the equation is Quien Como Tu, which also seems to be picking up a fair amount of airplay on tejano/norteno radio. It&amp;#039;s a pretty cool song of devotion and adoration -- a song whose sentiments and soft sentimentality reminds me of Carly Simon&amp;#039;s Nobody Does It Better.\n\nIf you&amp;#039;re really into boleros and big, romantic love songs, check out Que Habra Secedido con Ella. It shares a lot in common with Perdoname Mi Amor, including eminent suitability for the soap opera set, and it doesn&amp;#039;t really do a lot for me, but d&amp;#039;frent strokes for d&amp;#039;frent folks...\n\nExitos romanticos are all fine and good, but my own tastes tend to favor big, bold, fast cumbias with lots of accordians, and there&amp;#039;s some strong tracks on this disc that head closer to the &quot;get yer butt out on the dance floor&quot; ideal. No Vuelvas a Hacerlo is the kind of tune I&amp;#039;m talking about. Strong accordians, a strong fast cumbia beat, and powerful vocals. Ditto on Ilusiones Muertas, though this one throws in the added complexity of deep brass and a more polka flavor.\n\nThere&amp;#039;s also a couple tunes that seem like they&amp;#039;re heading that way, but that just tease me up onto my feet, only to drop me back down again as they waltz their way into slow-dance nirvana. Una Vez Mas heads that way, though it&amp;#039;s also a song that very much serves as a vocalist&amp;#039;s dream showcase, which isn&amp;#039;t surprising since the song was written by Juan Gabriel. Nueva Vida heads that way too, but it&amp;#039;s even more interesting to me because the swaying accordian opening with the catchy hooks reminds me stylistically of groups like Intocable. But it&amp;#039;s really just the opening that&amp;#039;s got the sharp catchiness -- the rest of the song slows down the tempo. That Intocable-tinged opening teaser shows up again on tracks like Nunca Mas. I think I&amp;#039;m detecting a bona-fide influence happening here...\n\n\nAbout Conjunto Primavera...\n25 years together -- that&amp;#039;s a silver anniversary if you&amp;#039;re talking matrimony. I&amp;#039;m not sure what you call it when a band stays together that long, but I call it quite an accomplishment.\n\nConjunto Primavera first played together in March of 1978. For many years, they were a small, purely local act known only in Chihuahua -- the arid, wide open northern state just across the border from southwest Texas. They released a string of CDs throughout the 1980s and early 1990s, always on the Joey label out of San Antonio (a label that caused lots of headaches for tejano crooner Michael Salgado, and a label that never did anything for Conjunto Primavera). It wasn&amp;#039;t until they jumped labels to AFG Sigma that the group started getting noticed and started to generate big numbers in the sales ledger. Their first bona fide success was the 1995 release of Me Nortie. Over the last five years or so, they&amp;#039;ve started to really build up momentum -- their newer CDs have been on the Fonovisa label (the biggest label for Mexican genres) and their discs have all done time on Billboard Magazine&amp;#039;s Top 25 Latin Album list, with some of their notable hits (including Perdoname Mi Amor from this disc) also landing on Billboard&amp;#039;s Hot Latin Tracks list. (See www.billboard.com).\n\n25 years together. That&amp;#039;s what it&amp;#039;s taken for Conjunto Primavera to hit the big time, but that&amp;#039;s pretty much where they are today. In the money and heading upwards.\n\nConjunto Primavera is lead vocalist Tony Melendez, Juan Dominguez on sax, Oscar Ochoa on bass, Felix Antonio Contreras on accordian, Rolando Perez on bajo sexto, and Daniel Martinez on drums. Official info about the group is on the web at: www.fonovisa.com/conjuntoprimavera.html\n\n\nTale of the Tracks... ","torrent":{"xt":"urn:btih:343811828931102ecbe1615e69fbc52eb23d7e44","amp;dn":"Conjunto+Primavera+-+Perdoname+Mi+Amor+-+Complete+CD++-+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"343811828931102ecbe1615e69fbc52eb23d7e44","infoHashBuffer":{"type":"Buffer","data":[52,56,17,130,137,49,16,46,203,225,97,94,105,251,197,46,178,61,126,68]},"announce":[],"urlList":[]}}