{"title":"Top Gear S11E05 WS PDTV XviD-RiVER","uid":4306729,"size":733241344,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3468c6799dd3d5531db28813b7e3676991ab95aa&amp;dn=Top+Gear+S11E05+WS+PDTV+XviD-RiVER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"circlensess","files":1,"time":1216592612,"description":"Just back from the studio show where the telly boys do their magic, and we&amp;#039;re armed with news of this Sunday&amp;#039;s antiques-roadshow-whupping programme.\n\nIt turns out that Clarkson wasn&amp;#039;t entirely happy with last week&amp;#039;s factory limited GT-R, because even though it beat the bullet train it didn&amp;#039;t exactly destroy whole sections of the Japanese countryside, or spray power stations with deadly fire breath.\n\nLike we&amp;#039;d expected it to.\n\nSo Jeremy takes it out for another spin on this week&amp;#039;s show, this time however he is taking it to a place with no traffic, no speed cameras, no police and most importantly no speed limiter!\n\nWhere could that be? And no, it&amp;#039;s not the M6 toll road.\n\nA not very little known fact is that Jeremy and James are two men divided in their opinions on almost everything.\n\nPolitics, religion, cars and cheese are just a few of the things that they argue about in the rehearsals alone.\n\nWhat they do agree on though is that they both want to drive some old school luxury, and unbeknown to each other, while they were off air, they both bought a couple of classic luxury cars.\n\nUpon hearing this, the show producers decided that it would be a good idea to send the two of them off to compare their purchases.\n\nOh, and did we mention that they don&amp;#039;t often agree...?\n\nContinuing the theme of luxury cars this week&amp;#039;s guests both own Maybachs (they also own mansions, luxury yachts and some Reggae Reggae sauce). They are two of the Dragons from BBC Two&amp;#039;s Dragons Den - Theo Paphitis and Peter Jones.\n\nRenowned for being competitive with each other in the Den, this week&amp;#039;s Star in a Reasonably Priced Car challenge is no different.\n\nNot that we are ones to get political but most of the time banning stuff doesn&amp;#039;t really lead to much fun (unless it&amp;#039;s banning crocodile Dundee style hunting knives). This time however the banning of Fox Hunting and the curtailing of countryside off-roading gets turned into a brilliant new sport...\n\nAnd don&amp;#039;t forget The Stig, who&amp;#039;s dried off from last week, but unfortunately forgot to wash so now he stinks of mold.\n\nBut that didn&amp;#039;t stop him from diving into the GT-R; a car that has been a giant killer around the Nurburgring, but will it cut the mustard on the only track that actually matters?\n\nJeremy and James recently bought themselves a couple of classic luxury limos. Jeremy plumped for a Mercedes 600 &amp;#039;Grosse&amp;#039;, the preferred transportation of the world&amp;#039;s most discerning despots. James, on the other hand, went for the full &amp;#039;Tarbuck&amp;#039; and filled his driveway with a Rolls-Royce Corniche Coupe.\n\nTo see if buying either of these cars was a good idea, we&amp;#039;ve set the presenters a couple challenges that&amp;#039;ll see them take to both the track and the streets of London.\n\nAlso, as Jeremy found out in last week&amp;#039;s show, it&amp;#039;s almost impossible to discover the Nissan GT-R&amp;#039;s limits on the road. So this week Clarkson will be unleashing the big Datsun on a Japanese race circuit.\n\nAnd, a pair of dragons get their claws on our reasonably priced car.\n\n","torrent":{"xt":"urn:btih:3468c6799dd3d5531db28813b7e3676991ab95aa","amp;dn":"Top+Gear+S11E05+WS+PDTV+XviD-RiVER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3468c6799dd3d5531db28813b7e3676991ab95aa","infoHashBuffer":{"type":"Buffer","data":[52,104,198,121,157,211,213,83,29,178,136,19,183,227,103,105,145,171,149,170]},"announce":[],"urlList":[]}}