{"title":"American Icons - Transatlantic Perspectives on XVIII and XIX Cen","uid":10043703,"size":93841371,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:34a78438f3b158f9389f5ffd0fa8fdd1b1884cc7&amp;dn=American+Icons+-+Transatlantic+Perspectives+on+XVIII+and+XIX+Cen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"STBGD","files":-1,"time":1398504746,"description":"T.W. Gaehtgens, H. Ickstadt, &quot;American Icons: Transatlantic Perspectives on Eighteenth- and Nineteenth-Century American Art&quot;\n1992 | ISBN: 0892362472 | English | PDF | 372 pages | 89.49 Mb\n\nAmerican Icons explores American self-definition through the creation of a national art. Like their writer counterparts, American artists of the eighteenth and nineteenth centuries yearned to create their art in terms of a uniquely American experience of history and nature. Paradoxically, however, when they insisted upon American originality and uniqueness, they could not but mediate these qualities through European conventions. European methods and motifs were, nonetheless, used differently in the social, economic, and communicative contexts of the New World. For American artists, Europe was an ensemble, not to say a warehouse, of traditions and styles from which they could choose according to their interests and preferences. Innovation was therefore not necessarily a matter of breaking new ground but a matter of how established means were used in new circumstances and for different purposes. The present essays explore the construction of an American sublime, of a mythology of the frontier, of a democratic style of common people and common objects, all expressed through the language of European art, while changing that language in the process of coining a new usage.","torrent":{"xt":"urn:btih:34a78438f3b158f9389f5ffd0fa8fdd1b1884cc7","amp;dn":"American+Icons+-+Transatlantic+Perspectives+on+XVIII+and+XIX+Cen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34a78438f3b158f9389f5ffd0fa8fdd1b1884cc7","infoHashBuffer":{"type":"Buffer","data":[52,167,132,56,243,177,88,249,56,159,95,253,15,168,253,209,177,136,76,199]},"announce":[],"urlList":[]}}