{"title":"Homeworld 2","uid":3221562,"size":743725726,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:34c64c368fca9992a8196fb56414a20a13d36d67&amp;dn=Homeworld+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"raidendk","files":3,"time":1088476187,"description":"Combining elements of real-time strategy and space combat, Homeworld 2\n  delivers the next evolutionary step in gameplay and technology.\n  Cinematic-quality graphics, special effects, rendered ships and an\n  innovative interface combine to create an immersive 3-D space combat\n  experience.\n  \n  Totally New 3D Engine\n  An innovative 3D engine generates cinematic-quality graphics, stunning\n  special effects, and beautifully rendered ships. The sublime vistas and\n  otherworldly splendor of Homeworld 2 are in the award-winning tradition of\n  the original. In-game cinematics flow seamlessly in and out of gameplay as\n  players command their armada around eerily beautiful phenomena of deep\n  space, including giant asteroids, massive derelicts, gas clouds, and nebulae\n  light years across.\n  \n  Steamlined Interface\n  A streamlined interface lets players take total control of their ships and\n  explore the universe. And all-new camera panning makes maneuvering fleets in\n  the thick of battle easier than ever. Zoom in to see objects in intricate\n  detail, zoom out to get a panoramic view, or rotate your view of deep space\n  a full 360 degrees.\n  \n  Stunning Deep-Space Phenomena\n  In the dynamic 3D universe of Homeworld 2 the awe-inspiring phenomena of\n  deep space - giant asteroids, huge derelicts, murky gas clouds, and vast\n  nebulae - pulse with the energy that permeates the cosmos. These fully\n  interactive phenomena - some strategically helpful and others fraught with\n  danger - add another dimension to gameplay.\n  \n  All-New Battle Fleets\n  Two all-new customizable battle fleets, each with unique capabilities and\n  spacecraft, enhance Homeworld 2's strategic complexity and tactical\n  flexibility. Players can now group ships in strike formations that move\n  together into combat. New ships such as the flak corvette and the marine\n  frigate offer innovative tactical choices, while capital ships have\n  subsystems like engines and weaponry that can be crippled while leaving the\n  ship ready for capture.\n  \n  Multiplayer Mode\n  New multiplayer modes and features allow up to six players to wage war via a\n  LAN or over the Internet. Additional tools and modules enable the community\n  to develop new missions and mods.\n","torrent":{"xt":"urn:btih:34c64c368fca9992a8196fb56414a20a13d36d67","amp;dn":"Homeworld+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34c64c368fca9992a8196fb56414a20a13d36d67","infoHashBuffer":{"type":"Buffer","data":[52,198,76,54,143,202,153,146,168,25,111,181,100,20,162,10,19,211,109,103]},"announce":[],"urlList":[]}}