{"title":"John Shuttleworth's lounge Music 4/4","uid":10689321,"size":31567896,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:3566a60396e1b98965129a45a6dd6c447f650d35&amp;dn=John+Shuttleworth%27s+lounge+Music+4%2F4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"shardlow","files":1,"time":1407100284,"description":"Aspiring singer/songwriter John Shuttleworth has been posting audio cassettes of his &quot;finest songs to date&quot; to pop stars throughout the land, in the hope that someone would record his material. But all to no avail.\n\nHowever, the BBC has very kindly given John a series and asked him to invite pop stars to bring their music to his Sheffield home. So it is that Chas and Dave, Heaven 17, Toyah Willcox and Leee John find themselves in John's lounge having tea with wife Mary, being flirted with by Mary's friend Joan and hassled by John's agent Ken Worthington, as they try and perform not only one their greatest hits but more importantly, one of John's.\n\nIt's the last show in the series this week but John is feeling a little stressed despite the fact all the jingles are recorded. John's final guest is Leee John from Imagination who's a very busy man involved with charity work, singing, acting and making a documentary - and John is worried that Leee is doing too much and should take things a bit easy. Maybe they could take a trip to the reservoir to check the levels as that's a very relaxing thing to do?\n\nBut Leee has been working since the age of 13 and is still full of energy so he's ready to sing one of John's songs, and indeed one of his own. As Leee prepares to sing Body Talk, John settles down to listen and by the end of it feels quite relaxed. But things get tense once more as Ken tries one last desperate attempt to woo a star to his stable. Will Leee be interested? And will Ken finally get to present the item Ken in the Konservatory?\n\nAlso, there are top tips on the telephone from Anita Harris.\n\nWritten and Performed by Graham Fellows with special guests Leee John and Anita Harris. Episode 4 of 4","torrent":{"xt":"urn:btih:3566a60396e1b98965129a45a6dd6c447f650d35","amp;dn":"John+Shuttleworth%27s+lounge+Music+4%2F4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3566a60396e1b98965129a45a6dd6c447f650d35","infoHashBuffer":{"type":"Buffer","data":[53,102,166,3,150,225,185,137,101,18,154,69,166,221,108,68,127,101,13,53]},"announce":[],"urlList":[]}}