{"title":"Final Voyage: The World's Worst Maritime Disasters","uid":11820844,"size":2233683,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3566b9167737d9346f6625b56bf52152dfed59c3&amp;dn=Final+Voyage%3A+The+World%27s+Worst+Maritime+Disasters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1429250811,"description":"Everyone knows the story of the Titanic, but in terms of loss of life that catastrophe doesn't even figure as one of the 50 worst maritime disasters of the last three hundred years. The twentieth century was the age of the great ocean vessels, capable of carrying thousands of passengers, but it also became the age of unprecedented losses at sea. The causes of disaster are legion: besides icebergs and enemy torpedoes, ships have been sunk by fire, explosions, flooding, capsizing, storms, collisions and human error. Many of these disasters have been almost forgotten, such as the loss of the Wilhelm Gustloff, the deadliest maritime disaster in history. 10,000 people died when the ship sank in the freezing Baltic, many of them trapped below decks in total darkness. Had they not been German civilians, and had the ship not sunk in January 1945, maybe history would not have largely overlooked the catastrophe. This book tells the stories of the worst maritime disasters in history, not simply in terms of lives lost, but in how far reaching the effects of the disasters were. With disasters from all over the world, these are stories of the people (whether they lived or died) as well as the ships. They are stories of tragedy, war, heroism and cowardice, greed and sacrifice. Only for the lucky few were they also stories of rescue and survival","torrent":{"xt":"urn:btih:3566b9167737d9346f6625b56bf52152dfed59c3","amp;dn":"Final+Voyage%3A+The+World%27s+Worst+Maritime+Disasters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3566b9167737d9346f6625b56bf52152dfed59c3","infoHashBuffer":{"type":"Buffer","data":[53,102,185,22,119,55,217,52,111,102,37,181,107,245,33,82,223,237,89,195]},"announce":[],"urlList":[]}}