{"title":"Mass Casualties: Death, Deception and Dishonor in Iraq","uid":9056569,"size":3363735,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:35bcce2896f3358b0e6850ef5cce6194f48e2356&amp;dn=Mass+Casualties%3A+Death%2C+Deception+and+Dishonor+in+Iraq&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Robin1966","files":4,"time":1381962796,"description":"Books : History : English\n\nMichael Anthony - Mass Casualties: A Young Medic's True Story of Death, Deception, and Dishonor in Iraq\nPublished: 2009-10-18 | ISBN: 1440501831 | EPUB + MOBI | 256 pages | 3 MB\n\n\n&quot;Look around,&quot; the drill sergeant said. &quot;In a few years, or even a few months, several of you will be dead. Some of you will be severely wounded or so badly mutilated that your own mother can't stand the sight of you. And for the real unlucky ones, you will come home so emotionally disfigured that you wish you had died over there.&quot; It was Week 7 of Basic Training ...18 years old and I was preparing myself to die. They say the Army makes a man out of you-but for 18-year-old SPC Michael Anthony, that fabled rite of passage proved a very dark journey. After soliciting his parents' approval to enlist at only 17, Anthony began his journey with an unshakeable faith in the military born of his family's long tradition of service. But when thrust into a medical unit of misfits as lost as he was, SPC Anthony not only witnessed the unspeakable horror of war-but the undeniable misconduct of the military-firsthand. Everything he ever believed in dissolved, forcing Anthony to rethink his loyalties, and ultimately risk his career-and his freedom-to challenge the military he had so firmly believed in. This searing memoir chronicles the iconic experiences that changed one young soldier forever. A seasoned veteran before the age of twenty-one, he faced the truth about the war-and himself-in this shocking and unprecedented eyewitness account.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:35bcce2896f3358b0e6850ef5cce6194f48e2356","amp;dn":"Mass+Casualties%3A+Death%2C+Deception+and+Dishonor+in+Iraq","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35bcce2896f3358b0e6850ef5cce6194f48e2356","infoHashBuffer":{"type":"Buffer","data":[53,188,206,40,150,243,53,139,14,104,80,239,92,206,97,148,244,142,35,86]},"announce":[],"urlList":[]}}