{"title":"elton John: To russia with elton John and ray cooper","uid":4034353,"size":721609414,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3613bdc2e88bf523354dad3a99674d6855716675&amp;dn=elton+John%3A+To+russia+with+elton+John+and+ray+cooper&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"antil0ck","files":1,"time":1203355904,"description":"Big-time Elton fans -- you already have this tape. For anyone else, this is a great filmed documentary of an amazing live performer, at an artistic peak. \nBy 1977, Elton John had broken every record in the music business there was to break, played almost every city and venue there was to play. It&amp;#039;s easy to forget that Elton-mania swept the US though the early and mid seventies to an extent that only Elvis and The Beatles have approached or exceeded, before or since. He was at that time, simply stated, the world&amp;#039;s best known and most commercially successful performer. \n\nThe performances on this tape were captured in early 1979 at the end of a self-imposed &quot;retirement&quot; that began in 1977. This short tour of Russia and Eastern Europe so inspired Elton and percussionist Ray Cooper that it blossomed into a worldwide tour, culminating in US stops at relatively intimate venues in the fall of 1979. \n\nThis tour is legendary among long time Elton fans, and this tape gives you a taste of why. It&amp;#039;s simply the songs, his extraordinary musicianship, and an added element of drama provided by Ray Cooper -- unforgettable to those who were there. The backdrop of the Iron Curtain era USSR -- beautiful, officially unforgiving to outsiders, unofficially curious about the Western World -- is quite interesting; viewed today the film higlights the radical changes that have taken place, and how fragile they must be.\n\nYou can&amp;#039;t watch this without realizing that his is an enormous talent, and that many of his songs are already timeless classics. This is an &quot;A&amp;E&quot; type docu (but not &amp;#039;hosted&amp;#039;) with heavy concert footage, filmed with 1979 technology. The soundtrack quality is okay but not sensational; that is my only quibble with what is otherwise a gem of a film: you witness a huge talent at peak performance, artistically sparking. \n\n\nenjoy! \n\nAntil0ck\n\n","torrent":{"xt":"urn:btih:3613bdc2e88bf523354dad3a99674d6855716675","amp;dn":"elton+John%3A+To+russia+with+elton+John+and+ray+cooper","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3613bdc2e88bf523354dad3a99674d6855716675","infoHashBuffer":{"type":"Buffer","data":[54,19,189,194,232,139,245,35,53,77,173,58,153,103,77,104,85,113,102,117]},"announce":[],"urlList":[]}}