{"title":"Joomla! 1.5: Beginner's Guide","uid":11533624,"size":14381809,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:36131f8a1d63a2b753443444bab2348c9c26bc0d&amp;dn=Joomla%21+1.5%3A+Beginner%27s+Guide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"elissa.swansi009","files":-1,"time":1416603705,"description":"\n\nEnglish | 2010 | ISBN: 1847199909 | 380 pages | PDF | 13,6 MB\n\n \n\nBuild and maintain impressive user-friendly web sites the fast and easy way with Joomla! 1.5\nCreate a web site that meets real-life requirements by following the creation of an example site with the help of easy-to-follow steps and ample screenshots.\nPractice all the Joomla! skills from organizing your content to completely changing the site's looks and feel.\n\nGo beyond a typical Joomla! site to make the site meet your specific needs\nGet to grips with inspiring examples and best practices and implement them to enhance your Joomla! site\n\nIn Detail\nJoomla! is one of the most popular open-source Content Management Systems, actively developed and supported by a world-wide user community. Although it's a fun and feature-rich tool, it can be challenging to get beyond the basics and build a site that meets your needs perfectly. Using this book you can create dynamic, interactive web sites that perfectly fit your needs.\nThis practical guide gives you a head start in using Joomla! 1.5, helping you to create professional and good-looking web sites, whether you want to create a full-featured company or club web site or build a personal blog site.\n\nThe Joomla! 1.5 Beginner's Guide helps beginners to get started quickly and to get beyond the basics to take full advantage of Joomla!'s powerful features. Real-life examples and tutorials will spark your imagination and show you what kind of professional, contemporary, feature-rich web sites any developer can achieve with Joomla!. It gives you a head start and explains what's good and useful about Joomla! features and what's not. The focus is on clear instructions and easy-to-understand tutorials, with minimum of jargon. This book provides clear definitions, thoroughly covering the concepts behind the software and creating a coherent picture of how the software works. This book is not about what Joomla! can do--it's about what you can do using Joomla","torrent":{"xt":"urn:btih:36131f8a1d63a2b753443444bab2348c9c26bc0d","amp;dn":"Joomla%21+1.5%3A+Beginner%27s+Guide","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36131f8a1d63a2b753443444bab2348c9c26bc0d","infoHashBuffer":{"type":"Buffer","data":[54,19,31,138,29,99,162,183,83,68,52,68,186,178,52,140,156,38,188,13]},"announce":[],"urlList":[]}}