{"title":"Ultimatum Alla Terra [XviD-Ita Ac3 Eng Mp3-Sub Ita Eng ] Fantasc","uid":5125925,"size":1172365303,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:362bac94ddd5a2cfde9dda8de3286898f54269fa&amp;dn=Ultimatum+Alla+Terra+%5BXviD-Ita+Ac3+Eng+Mp3-Sub+Ita+Eng+%5D+Fantasc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Duracell72","files":5,"time":1255620714,"description":"The Day The Earth Stood Still (1951)\n\nGenere: Drama | Sci-Fi | Thriller \nDurata: 92 min | Germany:85 min \nRiconoscimenti:  Won Golden Globe. Another 1 win &amp; 1 nomination \nRegia: Robert Wise \nSceneggiatura: Edmund H. North Harry Bates \nFotografia: Leo Tover \nCast: Michael Rennie Patricia Neal Hugh Marlowe Sam Jaffe Billy Gray Frances Bavier Lock Martin Patrick Aherne Holly \n\nBane Oscar Blanke Marshall Bradford John Brown John Burton Wheaton Chambers Jean Charney Beulah Christian John \n\nClose Louise Colombet James Conaty Frank Conroy Eric Corrie John Costello James Craven Marjorie Crossland Jack \n\nDaly Elmer Davis Lawrence Dobkin Jim Doyle Roy Engel Charles Evans Edith Evanson Franklyn Farnum Michael Ferris \n\nElizabeth Flournoy Grady Galloway Bill Gentry Paul Gerrits Glenn Hardy Sam Harris Harry Harvey Gabriel Heatter Gil \n\nHerman John Hiestand H.V. Kaltenborn Hassan Khayyam Harry Lauter Freeman Lusk George Lynn Herbert Lytton Michael \n\nMahoney Sandee Marriott David McMahon Tyler McVey Harold Miller Ralph Montgomery Bruce Morgan Howard Negley \n\nDorothy Neumann Sammy Ogg Robert Osterloh Gayle Pace Drew Pearson Ted Pearson House Peters Jr. 'Snub' Pollard \n\nJohn M. Reed Barry Regan Fay Roope Pola Russ James Seay Charles Sherlock Peter Similuk Bob Simpson Marc Snow \n\nOlan Soule Kim Spalding Murray Steckler Harmon Stevens Charles Tannen Harlan Warde Gil Warren Kipp Whitman Rush \n\nWilliams Wilson Wood Carleton Young \nProduzione: Julian Blaustein \nColonna Sonora: Bernard Herrmann \nMontaggio: William Reynolds \n\nProveniente da un pianeta remoto, un disco volante arriva sulla Terra. L'alieno che lo guida, aiutato da un robot, dimostra il \n\nsuo potere intellettuale e fisico, avverte i terrestri dei pericoli della guerra e riparte. Un piccolo classico della SF al cinema. \n\nIl suo discorso di rispetto per gli alieni lo distingue dall'isteria di quel periodo di guerra fredda. Bravi attori, solida \n\nsceneggiatura, pochi trucchi, molta sobrietÃƒÂ . \n\nDal racconto Farewell to the Master (Addio al padrone, 1940) di Harry Bates.\n\nNel 1995 ÃƒÂ¨ stato scelto per essere conservato nel National Film Registry della Biblioteca del Congresso degli Stati Uniti. La \n\nTwentieth Century Fox ha girato il film Ultimatum alla Terra, remake del film con Keanu Reeves nella parte di Klaatu.\n\nKlaatu, Barada, Nikto!\nLa famosa frase di una ipotetica lingua aliena ÃƒÂ¨ entrata nell'immaginario collettivo, tant'ÃƒÂ¨ che molti altri artisti l'hanno citata \n\nin svariate opere. Ne L'armata delle tenebre viene usata dal protagonista come formula magica. George Lucas padre di \n\nGuerre Stellari, ne Il ritorno dello Jedi del 1983, utilizza le singole parole per dare il nome a tre alieni della corte del signore \n\ndel crimine Jabba the Hutt. Ma vi sono anche citazioni in svariati film (Tron), telefilm ( X-Files, Genitori in blue jeans, I \n\nSimpson, Farscape, Johnny Bravo), in alcuni romanzi (The Armageddon Rag di George R. R. Martin e Mucho Mojo di Joe R. \n\nLansdale) e anche nel mondo dei videogiochi (SimCity 2000, Grand Prix 2, Sam &amp; Max Hit the Road, Sacrifice, World of \n\nWarcraft).\n\nDati tecnici del file\n================\nNome: Ultimatum alla Terra - The day the earth stood still (Wise, 1951) ITA AC3 - ENG MP3 -.avi\nDimensione: 1,117 MB \nDurata: 01:28:24\nVideo Codec: XviD\nVideo Bitrate: 1344 kb/s\nRisoluzione.: 592x432 (1.37:1) [=37:27]\nFPS: 25.000\nQF: 0.210 bits/pixel\nAudio Codec1: ac3 [0x2000] Dolby Laboratories, Inc\nAudio Bitrate1: 192 kb/s total [2 chnls] CBR\nFreq Audio1: 48000 Hz\nAudio Codec2: mp3 [0x0055] Mp3\nAudio Bitrate2: 125 kb/s total [5 chnls]\nFreq Audio2: 48000 Hz\nAudio Codec3: mp3 [0x0055] Mp3\nAudio Bitrate3: 94 kb/s total [2 chnls]\nFreq Audio3: 32000 Hz","torrent":{"xt":"urn:btih:362bac94ddd5a2cfde9dda8de3286898f54269fa","amp;dn":"Ultimatum+Alla+Terra+%5BXviD-Ita+Ac3+Eng+Mp3-Sub+Ita+Eng+%5D+Fantasc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"362bac94ddd5a2cfde9dda8de3286898f54269fa","infoHashBuffer":{"type":"Buffer","data":[54,43,172,148,221,213,162,207,222,157,218,141,227,40,104,152,245,66,105,250]},"announce":[],"urlList":[]}}