{"title":"Hossam Ramzy Discography","uid":5995040,"size":2764738675,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:3639524904687e9e64501d6d7d214e939c661e0e&amp;dn=Hossam+Ramzy+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"e1r9i7k6","files":299,"time":1291007714,"description":"Hossam Ramzi was born in Cairo, Egypt to a prominent Egyptian family which emphasized education and art. Ramzy\\'s musical career began at the age of three when he was given his first drum, an Egyptian traditional tabla. Hossam was encouraged by his artistic family to master his craft and studied under leading Cairo music teachers. When he moved to Saudi Arabia he joined several Bedouin tribes which gave him a rich insight into the cultural origins of Middle Eastern music and became the inspiration for many of his later rhythmic directions.\n\nIn the mid-1970s Ramzi moved to London, England and enjoyed a lot of success as a jazz drummer, working with many respected jazz musicians including Andy Sheppard and Geoff Williams. As he began looking for new dimensions of percussive sounds, he turned back to Egyptian Drums, and traditional dance rhythms of the Middle East.\n\nRamzi also creates many new sounds from the old traditional grooves and Arabian &amp; North African samples and loops using his state-of-the-art digital studio in London.\n\nRamzy\\'s No. 1 hit \\&quot;Edony\\&quot; topped the dance charts worldwide in 2001. His percussion, North African string arrangements and exciting rhythms caught the attention of Peter Gabriel who invited Hossam to perform on the albums Passion and later Us. Hossam has collaborated on eleven albums with Peter Gabriel since 2001.\n\nHossam Ramzy, is a Scientologist,[1] has worked with many musicians including Joan Armatrading and Mary Wilson. Hossam creates string arrangements and percussion, and produces many songs for \\&quot;world music\\&quot; artists such as: Yesim Salkim, Celik Erisci, Khaled, Tarkan, Rachid Taha, Faudel, The Gipsy Kings Youssou N\\'dour and lately with Shakira on her 2009 album, Shewolf.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Hossam_Ramzy&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Hossam_Ramzy&lt;/a&gt;\n\nHossam Ramzy &amp; Pablo Carcamo - Latin American Hits For Bellydance\nHossam Ramzy -  Best Of Om Kolthoum\nHossam Ramzy - Baladi Plus\nHossam Ramzy - Bedouin Tribal Dance\nHossam Ramzy - Best of Abdul Halim Hafiz\nHossam Ramzy - EL Amar\nHossam Ramzy - Faddah\nHossam Ramzy - Gypsies of the Nile ( Rahhal)\nHossam Ramzy - Introduction to Egyptian Dance Rhythms\nHossam Ramzy - Masters_of_Percussion\nHossam Ramzy - Sabla Tolo II, Further Journeys into Pure Egyptian Percussion\nHossam Ramzy - Sabla Tolo, Journeys into Pure Egyptian Percussion\nHossam Ramzy - Secrets Of The Eye\nHossam Ramzy - Source of Fire\nHossam Ramzy - Tribute to Samy El Bably\nHossam Ramzy -En4anted_Egypt\nHossam Ramzy -Re-Orient - Baluji Shrivastav &amp; Re-Orient\nHossam Ramzy Classical - Egyptian_Dance\nHossam Ramzy feat  Rafa Tachuela - Flamenco Arabe CD 1 CD2\nHossam Ramzy Zaina - The Best Of Mohammed Abdul Wahab\nHossam Ramzy_ER-_RO-HE\nHossam Ramzy_MS-Qanun_El_Tarab\nPhil Thornton &amp; Hossam Ramzy - Eternal Egypt\nPhil Thornton &amp; Hossam Ramzy - Immortal Egypt (1998)\n","torrent":{"xt":"urn:btih:3639524904687e9e64501d6d7d214e939c661e0e","amp;dn":"Hossam+Ramzy+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3639524904687e9e64501d6d7d214e939c661e0e","infoHashBuffer":{"type":"Buffer","data":[54,57,82,73,4,104,126,158,100,80,29,109,125,33,78,147,156,102,30,14]},"announce":[],"urlList":[]}}