{"title":"Parliament - The 12 inch Collection and More .flac files","uid":6221354,"size":620680320,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3786773e70d6abd26f86557ba7cef50d9934e88a&amp;dn=Parliament+-+The+12+inch+Collection+and+More+.flac+files&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ulikes","files":14,"time":1299340839,"description":"Track 1: Aqua Boogie was a rare treat even when it was released as a 12&quot; in 1978, it has an instrumental 2nd half, which was and is still thrilling to hear. One didn't get to hear very many P-Funk instrumentals done in the studio, especially a hit record. \nTrack 2: The classic &quot;Flash Light&quot; gets a new lease on life in a 10 minute-plus version here \nTrack 3: Agony of Defeet promo was heard only through a local Detroit DJ called The Electrifying Mojo in 1980.  Excellent choice for this compilation. \nTrack 4: Ridin' High is a funkateer collectable, it gave you more of what you're funkin' for. Cause the album version was long in itself. \nTrack 5: Oh I is one of those tunes that could've been on either a Parliament or Funkadelic album. The guitar oriented edited version ends up on the Electric Spanking of War Babies album. This Parliament version is a lot cleaner sounding because of the digital re-mastering. Another welcomed reissue gem from the P-Funk vaults. \nTrack 6: Up for the Down Stroke is one of those live Bootsy jams turned into a party record (Ex: Parliament-Funkadelic Live 4 CD set 1972-1993, 7th song 4th CD).  Another funkateer collectable worthy of this compilation. \nTrack 7: Testify. Go through you're older uncles or cousins P-Funk record collection and you might find that original Up For the Down Stroke pressing with this version on it (I did! Hint: the Casablanca blue label.)\nTrack 8: Atomic Dog-The Atomic Mix. An addition not found on this CD but added because it does belong. It is the most popular song ever done by Clinton and I know many would like to have this 10 minute version.\n\nIf I can ever get the club mix for &quot;One Nation Under A Groove&quot; I will add it to the collection.\n\nThese files come with the original artwork and are recorded in the .flac format so you can get the funk and nothing but the funk!\n\nMp3 is dead! Long live Flac!!!","torrent":{"xt":"urn:btih:3786773e70d6abd26f86557ba7cef50d9934e88a","amp;dn":"Parliament+-+The+12+inch+Collection+and+More+.flac+files","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3786773e70d6abd26f86557ba7cef50d9934e88a","infoHashBuffer":{"type":"Buffer","data":[55,134,119,62,112,214,171,210,111,134,85,123,167,206,245,13,153,52,232,138]},"announce":[],"urlList":[]}}