{"title":"David Mamet - The Secret Knowledge","uid":10095135,"size":293099808,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:37be7933343e8d009b95901834238d67f8da177d&amp;dn=David+Mamet+-+The+Secret+Knowledge&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ut1880h","files":-1,"time":1399271558,"description":"David Mamet has been a controversial, defining force in nearly every creative endeavor-now he turns his attention to politics.\n\nIn recent years, David Mamet realized that the so-called mainstream media outlets he relied on were irredeemably biased, peddling a hypocritical and deeply flawed worldview.\n\nIn 2008 Mamet wrote a hugely controversial op-ed for the Village Voice, &quot;Why I Am No Longer a 'Brain-Dead Liberal'&quot;, in which he methodically attacked liberal beliefs, eviscerating them as efficiently as he did Method acting in his bestselling book True and False.\n\nNow Mamet employs his trademark intellectual force and vigor to take on all the key political issues of our times, from religion to political correctness to global warming. The legendary playwright, author, director, and filmmaker pulls no punches in his art or in his politics. And as a former liberal who woke up, Mamet will win over an entirely new audience of others who have grown irate over America's current direction. \n\nDavid Mamet made a stir in 2008 with his Village Voice essay, &quot;Why I Am No Longer a Brain-Dead Liberal.&quot; This book is a fuller, wittier, and more scathing treatment of the same subject--a liberal screenwriter who has &quot;seen the light.&quot;\n\nLike other big media apostates, Andrew Breitbart, Tom Wolfe, John Stossel, Ben Stein, and Dennis Miller, Mamet realized the liberal assumptions that capitalism was evil and that Republicans were corporate lackeys had serious holes. When he began to investigate the logic behind free markets, he realized that it actually made sense. As Mamet puts it, modern liberalism is nothing more than a religion that its practitioners preach blindly on faith.\n\nTo examine the inanity of modern liberals, Mamet offers 39 entertaining essays that cover the gamut of modern living, including &quot;Adventure Slumming,&quot; &quot;Cabinet Spiritualism and the Car Czar,&quot; and, my favorite, &quot;Oakton Manor and Camp Kawaga.&quot; Throughout the expose, Mamet makes use of his excellent perspective in the arts. With examples from his theater class, he shows exactly how absurd political correctness and the liberal agenda can be.\n","torrent":{"xt":"urn:btih:37be7933343e8d009b95901834238d67f8da177d","amp;dn":"David+Mamet+-+The+Secret+Knowledge","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37be7933343e8d009b95901834238d67f8da177d","infoHashBuffer":{"type":"Buffer","data":[55,190,121,51,52,62,141,0,155,149,144,24,52,35,141,103,248,218,23,125]},"announce":[],"urlList":[]}}