{"title":"Need for Speed Most Wanted","uid":8068669,"size":12523906,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:38260df69a84cdddcf2f690207e2282f2dfd5907&amp;dn=Need+for+Speed+Most+Wanted&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"JusticeBanana","files":1,"time":1359228590,"description":"100% No virus!\n\nI am sure that it works on the Sony Ericsson Live With Walkman, (my phone)\n\nprocessor: 1GHz\n\nalso you need an SD card\n\nin the game you can change some basic options, (sound intensity, language...)\n\n\nThe only thing you have to do is:\n\n1Âº- download de APK file, (this download);\n\n2Âº- while the game is downloading, grab your Android Phone or Tablet and download \n\nan app on Play Store called ASTRO, (its free);\n\n3Âº- after you download the game on the computer and the app (astro) on the \n\nphone/tablet, plug your Android on the computer, open it, and create a folder and \n\nname it GAMES, then drag/cut/copy the APK file (game) into that folder;\n\n4Âº- close everything, unplug everything, grab your Android again and click on the \n\nASTRO app, and then click on Local Storage or SD card and search for the folder \n\nnamed GAMES, when you find it, click on it, and inside it will be the game, click \n\non the game and then will appear something saying &quot;install&quot;, click it;\n\n5Âº- you don't need to download anything more \n\nmanually, so after the game is installed, (you can close ASTRO), go to your menu \n\nand click on the game icon, and when you open it, it will download automatically \n\nthe DATA;\n\n6Âº- (you need internet connection), it may take some time to download the DATA,  \n\nprobably half an hour, (depends on your internet capacity), after the DATA is \n\ndownloaded, the game will start, and it will ask you if you want to login on \n\nOrigin, (there is no problem, login if you want, so you can play online) ... have \n\nfun!\n\n\nNote: when you open the game, it may take a while loading\n\nAfter you download the game you can &quot;move it to SD card&quot;          !ENJOY!\n\nBy: PitadorBoy","torrent":{"xt":"urn:btih:38260df69a84cdddcf2f690207e2282f2dfd5907","amp;dn":"Need+for+Speed+Most+Wanted","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38260df69a84cdddcf2f690207e2282f2dfd5907","infoHashBuffer":{"type":"Buffer","data":[56,38,13,246,154,132,205,221,207,47,105,2,7,226,40,47,45,253,89,7]},"announce":[],"urlList":[]}}