{"title":"Field &amp; Stream - September 2014","uid":10737451,"size":85237569,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:38375db69ad9f5e0cd4bb34835a0634ee3affe57&amp;dn=Field+%26amp%3B+Stream+-+September+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sidmal","files":-1,"time":1407707185,"description":"\n\nField &amp; Stream - September 2014\nEnglish | HQ PDF | 132 pages | 81.29 Mb\n\nField &amp; Stream (F&amp;S for short) is a magazine featuring hunting, fishing, and other outdoor activities in the United States. Together with Sports Afield and Outdoor Life, it is considered[clarification needed] one of the Big Three of American outdoor publishing.\n\nFounded in 1895 by John P. Burkhard and Henry Wellington Wack, the magazine has a readership of approximately 1 million. Depending on the season and the availability of information, the magazine may offer advice on deer, bass, birds, trout, shotguns and rifles. The magazine absorbed its chief competitor, Forest and Stream, in 1930.[2]\n\nThe magazine also offers tricks, survival tips, miscellaneous facts and sometimes a recipe. In addition to those departments, each issue contains a few featured articles. Field &amp; Stream once worked with Sierra On-Line and Dynamix to create hunting and fishing video games, the Trophy Bass and the Trophy Hunting series.\n\nHenry Holt and Company purchased the magazine in 1951. Holt eventually ended up being owned by CBS, who sold their magazines in a leveraged buyout led by division head Peter Diamandis. It was sold by Diamandis to the Times-Mirror Company, which sold their magazines to Time Inc. in 2001. It was one of 18 magazines sold to Bonnier Group in February 2007. While Field &amp; Stream magazine belongs to Bonnier, the right to use the Field &amp; Stream name on goods and services belongs to a private investment group unrelated to Bonnier and the magazine, while Dick's Sporting Goods owns the rights to the name for retail stores.\n","torrent":{"xt":"urn:btih:38375db69ad9f5e0cd4bb34835a0634ee3affe57","amp;dn":"Field+%26amp%3B+Stream+-+September+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38375db69ad9f5e0cd4bb34835a0634ee3affe57","infoHashBuffer":{"type":"Buffer","data":[56,55,93,182,154,217,245,224,205,75,179,72,53,160,99,78,227,175,254,87]},"announce":[],"urlList":[]}}