{"title":"The Unforgiven 1960","uid":4834622,"size":1566707759,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:38563bcd0c5109dd14a1d62c2416d059cc047ac3&amp;dn=The+Unforgiven+1960&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":null,"files":2,"time":1239271745,"description":"The Unforgiven (1960)\n\nJohn Huston's The Unforgiven is essentially John Ford's The Searchers with the \nplot reversed -- instead of a white family seeking to recover a young member kidnapped by Native Americans, it tells of Native Americans trying to get back a member of their tribe, taken and adopted years earlier by a white family. The parallels are no accident, since both films were based on books by the same author, Alan LeMay, and the similarities don't end there. Both movies tell tales of families seeking to restore their wholeness or to protect it, led by defiant quasi-outsiders who are fully capable of violating any law, social bond, or moral taboo in defense of those families. Burt Lancaster's Ben Zachary is one of the actor's towering portrayals and a bracing performance, as a bold, powerful, lusty male presence, almost the embodiment of the gradually civilized frontier -- Audie Murphy gives a similarly impressive performance in one of his most difficult roles, as the embittered, racist brother of the would-be hero, torn between the love of his family and his disgust for the Kiowa and anything to do with them; and Doug McClure, at the outset of his career, gives one of the best portrayals of his career as the callow youngest Zachary son, a wild but good-natured boy who could go the way of either of his two brothers. Played against them is Audrey Hepburn's Rachel, who is like a frontier version of Cathy from Wuthering Heights, irresistable in her portrayal of a vibrant, coltishly innocent girl blossoming into womanhood. Those performances are enhanced by the boldness of the overall shoot, which contains barely a false note anywhere in its 121 minutes. Huston brought the same verisimilitude to The Unforgiven, including the dust storm, the vast open spaces with their promise and threat, and the siege of the homestead, that he utilized in movies like The African Queen and The Roots Of Heaven. The overall effect is a spellbinding western drama, filled with boldly constructed shots, powerful, charismatic performances, and spread along a beautifully devised story arc, embodying the mythos of the west and such fiercely topical issues as racism. And binding the whole package together in the actual viewing was Dimitri Tiomkin's score, perhaps the most passionate and romantic of his career, recalling elements of Duel In The Sun but possessing greater sophistication.\nCast:\nBurt Lancaster - Ben Zachary \nAudrey Hepburn - Rachel Zachary \nAudie Murphy - Cash Zachary \nJohn Saxon - Johnny Portugal \nCharles Bickford - Zeb Rawlins \nLillian Gish - Matilda Zachary \nAlbert Salmi - Charlie Rawlins \nJoseph Wiseman - Abe Kelsey \nJune Walker - Hagar Rawlins \nKipp Hamilton - Georgia Rawlins \nArnold Merritt - Jude Rawlins \nCarlos Rivas - Lost Bird \nDoug McClure - Andy Zachary \n\n\nPlease keep It SEED so others can have it. :)","torrent":{"xt":"urn:btih:38563bcd0c5109dd14a1d62c2416d059cc047ac3","amp;dn":"The+Unforgiven+1960","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38563bcd0c5109dd14a1d62c2416d059cc047ac3","infoHashBuffer":{"type":"Buffer","data":[56,86,59,205,12,81,9,221,20,161,214,44,36,22,208,89,204,4,122,195]},"announce":[],"urlList":[]}}