{"title":"SocietySM : Redux  SR - Feb 14, 2015 - Calico Slave","uid":11966008,"size":818398019,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:386110b435e763003e7edfcaa9dfbfd351b670d8&amp;dn=SocietySM+%3A+Redux++SR+-+Feb+14%2C+2015+-+Calico+Slave&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"merzedes","files":269,"time":1432667777,"description":"&quot;Pain, Control and Submission&quot; \n SocietySM : Redux Calico Slave.\n\n\n\nMaking her debut to the site this week is the lovely Calico. Calico as you may know, has recently been on some of our other sites and enjoys bondage in her everyday life... Gagged and kneeling on the warehouse floor, Calico watches as The Pope ties her tightly to the board. Next, The Pope gives her a spanking and binds Calico's hands behind her back and gets back to work groping, pawing and peppering her luscious body with open handed slaps. Wielding the whip, The Pope reddens Calico's flesh before he ties off her pierced nipples and brings her to a sopping, multiple orgasm with the magic wand. After she cums, Calico is crotch roped and left in the room... Calico now is positioned on the table as she is tied tightly, restricting her range of motion. With his slave positioned to his liking, The Pope then runs Calico through her paces. First he whips her torso and fingers her pussy. Then, Calico endures as her stomach, pussy lips and breasts are pinned. Once again, Calico's nipples are tied off, only this time, they are stretched tightly as her Master ties them overhead. As the pins are removed from her flesh, Calico squeals in pained pleasure, and then, The Pope buries a glass dildo deep in her snatch. Once again, the magic wand is pressed against her clit and as The Pope works the dildo in and out of his slave, Calico once again submits to the sensations and orgasms convulsively. Next, Calico is seated atop the box as the suction tubes are applied to her breasts, torso and thighs. Covered in the suction devices, Calico now feels the riding crop greet her flesh as The Pope introduces her body to it. Calico whimpers at the sound of the torch and her whimpers turn to yelps as The Pope lets the molten wax rain down on her flesh. It doesn't take Calico long to beg to cum when the wand is smashed against her pussy this time, and kindly her Master allows sending Calico into an orgasmic fit... With her legs in a spreader bar and her hands tied overhead, Calico glances nervously around the room as her Master enters. Her tender tits are groped then, to add fuel to the fire, The Pope gets his slave up on her tippy toes before he gives her a lengthy lashing her from behind. With her skin aglow, Calico stands at attention as her pussy is clamped and weighted. As saliva flows freely from his slave's mouth, The Pope removes the pussy clamps and replaces them with the vibrator and Calico cums once again for her Master. Calico is then lashed from behind once more before The Pope exits the room... Fully bound now, Calico is lifted into the air by The Pope. Grabbing her hair and pussy, The Pope swings his slave freely and then reaches for a pole mounted dildo. With the dong firmly in hand, The Pope slides it into Calico's soaking wet, sensitive pussy and plugs away. Next, he grabs the magic wand again and takes a two pronged approach to his bound slave's pussy as she squirms in pleasure. Calico gives way to a final multi-orgasmic episode that drains her mind and body and then, she is left in suspension \n\n\n Wmv 480p and Mov 240p + Pics \n\n\n\n Screens &lt;a href=&quot;\nhttp://www.dungeoncorp.com/u...s15/RED/CAL_072408/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dungeoncorp.com/u...s15/RED/CAL_072408/index.php&lt;/a&gt;\n\n Uploaded by Merzedes and Shallow2 \n\n 17 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\n\n Just keep on leaving us the nice comments below and we are happy :)\n\n Any Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttps://yuq.me/users/23/079/W2kwa6hEeP.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://yuq.me/users/23/079/W2kwa6hEeP.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://s16.postimg.org/rxyfm...llow2_FAQ_The_Pirate_Bay.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s16.postimg.org/rxyfm...llow2_FAQ_The_Pirate_Bay.jpg&lt;/a&gt;\n\n\nCheers :-)","torrent":{"xt":"urn:btih:386110b435e763003e7edfcaa9dfbfd351b670d8","amp;dn":"SocietySM+%3A+Redux++SR+-+Feb+14%2C+2015+-+Calico+Slave","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"386110b435e763003e7edfcaa9dfbfd351b670d8","infoHashBuffer":{"type":"Buffer","data":[56,97,16,180,53,231,99,0,62,126,223,202,169,223,191,211,81,182,112,216]},"announce":[],"urlList":[]}}