{"title":"The Legend of Zelda - Parallel Worlds 1.1 pre-hacked","uid":4825641,"size":1596275,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:387e64ec257c528c347097d91d3a62d4d2c62dc9&amp;dn=The+Legend+of+Zelda+-+Parallel+Worlds+1.1+pre-hacked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"d0XX0b","files":-1,"time":1238936698,"description":"This is a pre-hacked ROM of The Legend of Zelda - A Link to the Past, hacked to The Legend of Zelda - Parallel Worlds 1.1.\n\nThe Legend of Zelda - Parallel Worlds is a fan overhaul of A Link to the Past using new graphics, new music, new overworld and underworld, new dungeon maps, new items, new characters and a completely new storyline, which makes this more like a full-on sequel than a simple sprite hack. As of 2008, this game has been in production for 4-5 years and has had a demo release, a 1.0 release and a 1.1 patch to fix many bugs as well as minor changes in dialogue. A 2.0 release is planned and has been officially announced.\n\nTo play it you'll need a SNES emulator, I recommend ZSNES: http://www.zsnes.com/\n\nPlease note that the game is rather difficult, especially the first part of it, since you'll need to go a much longer way without getting any weapon (besides pots you can pick up and throw at enemies) and there will be various enemies, some of which can outrun you. Therefore it is crucial to use save states as often as possible with the emulator (in ZSNES, default keys for this are F2 for saving and F4 for loading, F3 for choosing state slot).\n\nAlso an important thing to note is that there is no longer single Big Key per castle, but each castle now has two separate Big Keys - one for opening doors and one for the Big Chest.\n\nThere is also a lot more back-tracking involved than there was in A Link to the Past. For example, you'll need to go through a door opened with the Big Key just to get an ordinary key and then go back, etc.\n\nDespite all this, the game is very good, fun, innovative and relaxing. But use save states often.","torrent":{"xt":"urn:btih:387e64ec257c528c347097d91d3a62d4d2c62dc9","amp;dn":"The+Legend+of+Zelda+-+Parallel+Worlds+1.1+pre-hacked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"387e64ec257c528c347097d91d3a62d4d2c62dc9","infoHashBuffer":{"type":"Buffer","data":[56,126,100,236,37,124,82,140,52,112,151,217,29,58,98,212,210,198,45,201]},"announce":[],"urlList":[]}}