{"title":"James Burke - Connections [epub]","uid":9028919,"size":12399275,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3883f026d9d7e43ba139d21e9f95f5e145ec97f0&amp;dn=James+Burke+-+Connections+%5Bepub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"epub_888","files":-1,"time":1381419504,"description":"In this highly acclaimed and bestselling book, James Burke brilliantly examines the ideas, inventions, and coincidences that have culminated in the major technological advances of today. With dazzling insight, he untangles the pattern of interconnecting events: the accidents of time, circumstance, and place that gave rise to the major inventions of the world.\n\nSays Burke, &quot;My purpose is to acquaint the reader with some of the forces that have caused change in the past, looking in particular at eight innovations -- the computer, the production line, telecommunications, the airplane, the atomic bomb, plastics, the guided rocket, and television -- which may be most influential in structuring our own futures....Each one of these is part of a family of similar devices, and is the result of a sequence of closely connected events extending from the ancient world until the present day. Each has enormous potential for humankind's benefit -- or destruction.&quot;\n\nBased on a popular TV documentary series, Connections is a fascinating scientific detective story of the inventions that changed history -- and the surprising links that connect them.\n\nAmazon.com Review\n\nYou can make all the plans you will, plot to make a fortune in the commodities market, speculate on developing trends: all will likely come to naught, for &quot;however carefully you plan for the future, someone else's actions will inevitably modify the way your plans turn out.&quot; So writes the English scholar and documentary producer James Burke in his sparkling book Connections, a favorite of historically minded readers ever since its first publication in 1978. Taking a hint from Jacob Bronowski's Ascent of Man, Burke charts the course of technological innovation from ancient times to the present, but always with a subversive eye for things happening in spite of, and not because of, their inventors' intentions. Burke gives careful attention to the role of accident in human history. In his opening pages, for instance, he writes of the invention of uniform coinage, an invention that hinged on some unknown Anatolian prospector's discovering that a fleck of gold rubbed against a piece of schist--a &quot;touchstone&quot;--would leave a mark indicating its quality. Just so, we owe the invention of modern printing to Johann Gutenberg's training as a goldsmith, for his knowledge of the properties of metals enabled him to develop a press whose letterforms would not easily wear down. With Gutenberg's invention, Burke notes, came a massive revolution in the European economy, for, as he writes, &quot;the easier it is to communicate, the faster change happens.&quot; Burke's book is a splendid and educational entertainment for our fast-changing time. --Gregory McNamee","torrent":{"xt":"urn:btih:3883f026d9d7e43ba139d21e9f95f5e145ec97f0","amp;dn":"James+Burke+-+Connections+%5Bepub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3883f026d9d7e43ba139d21e9f95f5e145ec97f0","infoHashBuffer":{"type":"Buffer","data":[56,131,240,38,217,215,228,59,161,57,210,30,159,149,245,225,69,236,151,240]},"announce":[],"urlList":[]}}