{"title":"Waterworld-Extended Version(Dvd 2008)","uid":4491048,"size":1551699217,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:38f3bda3f9b7847f572d8c6c0cb5cdee5685f866&amp;dn=Waterworld-Extended+Version%28Dvd+2008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"jazz3","files":2,"time":1225985870,"description":"Movie Description\nIn a flooded future Earth, people cling to man-made floating islands for survival. When a tyrannical madman driving a supertanker over the world in search of &quot;dry land&quot; invades one of these islands a mysterious wanderer named the &quot;Mariner&quot; rescues a woman and her adopted daughter from the slaughter and they embark on a quest that could save mankind. Academy Award Nomination: Best Sound.\n\nCredits \nCast: Kevin Costner \nDirector: Kevin Reynolds \nProducer: Charles Gordon \n\nSynopsis\nThe future has arrived, and it brings a world composed entirely of water, due to the melting of the polar ice caps. In this desperate society one must distill one&amp;#039;s own urine for drinking water, and land is only a myth people dream of. Roaming the high seas is the Mariner, a surly, selfish man/fish mutant with no name. But his loner existence changes when a woman named Helen and an orphaned girl named Enola save his life, and the Mariner reluctantly agrees to take them along with him. At first the Mariner has a rocky relationship with his two passengers; then he realizes that the tattoo on Enola&amp;#039;s back is a map leading to the never-seen &quot;Dryland&quot;. But as the trio struggles to decipher the map, they must also try to escape a band of filthy, reckless thugs known as &quot;Smokers&quot;, led by the maniacal, one-eyed Deacon. Then the Smokers kidnap Enola, turning the Mariner into a one-man killing machine desperate to rescue his human map.\n\nAnd only if he succeeds will they ever know the feel of solid ground beneath their feet.\n\nIndustry Reviews\n&quot;...A 2 1/4-hour aquatic pursuit pic with bruising stunts, fun-to-watch performances, a dozen good chortles and imposing Panavision renderings of post-apocalyptic crud....[WATERWORLD] clearly has the makings of a cult movie...&quot; -- 3 out of 4 stars\nUSA Today - p.1D - Mike Clark \n\n&quot;...The Existential Raft Drama....Exciting and even funny...&quot;\nEntertainment Weekly - pp.66-8 - Ty Burr \n\n&quot;Highlighted by some action scenes unlike anything seen before and effective in creating a unique landless universe in a perilous future...&quot;\nVariety - Todd McCarthy \n\n&quot;...The world the Mariner inhabits ranks with Costner&amp;#039;s performance as one of the film&amp;#039;s most successful creations....WATERWORLD has some haunting underwater visual moments...&quot;\nLos Angeles Times - Kevin Thomas (07/28/1995)\n\n&quot;...WATERWORLD is a decent futuristic action picture with some great stunts...&quot;\nChicago Sun-Times - Roger Ebert (07/28/1995)\n","torrent":{"xt":"urn:btih:38f3bda3f9b7847f572d8c6c0cb5cdee5685f866","amp;dn":"Waterworld-Extended+Version%28Dvd+2008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38f3bda3f9b7847f572d8c6c0cb5cdee5685f866","infoHashBuffer":{"type":"Buffer","data":[56,243,189,163,249,183,132,127,87,45,140,108,12,181,205,238,86,133,248,102]},"announce":[],"urlList":[]}}