{"title":"Rosie Thomas...When We Were Small(2002)[FLAC]","uid":6934814,"size":203868956,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3940e61bf352fd90125c0f4cd017be8f3003de1e&amp;dn=Rosie+Thomas...When+We+Were+Small%282002%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":15,"time":1325786388,"description":"\n[color=Orange]When We Were Small [2002]Sub Pop Records / SPCD 566[/color]\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n1. 2 Dollar Shoes (3:11)\n2. Farewell (3:12)\n3. Wedding Day (5:27)\n4. Lorraine (3:25)\n5. Finish Line (2:40)\n6. October (2:22)\n7. I Run (4:08)\n8. Charlotte (3:20)\n9. Have You Seen My Love? (2:57)\n10. Bicycle Tricycle (6:04)\n\nEvery review I've read of Rosie Thomas-- of anything she does-- makes sure to mention her stand-up alter-ego, Sheila, an extremely self-conscious social outcast who wears coke-bottle glasses and a neckbrace. Some are thrown off by the comedy act, especially juxtaposed with Rosie's otherwise earnest and passionate stage show. But me, I find it adorable. In all honesty, I find Rosie Thomas adorable. I get a tingle just thinking of her. Rosie, if you're out there, I love you. Now make me babies.\n\nHave I said too much? Okay, since the cat's out of the bag, I'll just admit it. At 25 years of age, I have a crush on someone I've never met (although Rosie must share my affections: I also have a non-sexual man-crush on Brad Pitt). Rosie won me over at a concert last fall, when all I knew of the young songstress was that she'd made a cameo appearance on Damien Jurado's &quot;Parking Lot&quot; (off Ghost of David). I didn't like the tune that much, but recognizing her association with Jurado's low-key, honest folk-pop, I felt I couldn't lose.\n\nIn the final analysis, I lost two things: jack and shit. The show was amazing, really, a reminder that some indie rockers can actually sing. Rosie's voice is stunning-- a delicate timbre, a beautiful hushed passion, with the requisite lung-power when she needs to drive home a melody. If singing range were a climbing rope, Rosie would ring the bell, and ring it often. To hit the high notes, Thomas employs a gorgeous (and apparent) transition to falsetto. You can tell she likes that shift, and the falsetto itself, as a number of the tunes on her album make that vocal acrobatic a prominent part of the melody (e.g. &quot;Lorraine&quot;). Moreover, in concert, Thomas obviously had a keen sense of dynamics-- during the quieter moments it became clear that, except for Thomas, the venue was in utter silence, captivated.\n\nUntil she releases another album, however, I must romanticize my love for Rosie. The soundtrack to my dreams will encompass only a few of the songs on When We Were Small, notably &quot;Farewell&quot; and &quot;Bicycle Tricycle,&quot; the most sparse and fragile. I like to imagine Rosie alone on stage with a piano, a guitar, and otherwise utter silence. Her sparse compositions reveal a stunning vulnerability, her voice allowed the full measure of its expressiveness. An album with ten tracks of that sort of pure, barren indie-folk would be spellbinding.\n\nIt's not unfortunate so much as it is just a fact, but much of the rest of the album is more pedestrian, weighing in with melodies and compositions that tend towards the &quot;pop&quot; end of the folk-pop spectrum. Like &quot;Finish Line,&quot; for example, which harks of Sarah McLachlan, or the darker &quot;I Run,&quot; which features a hackneyed melody and orchestration that fails to sell the mood (not to mention that the repeated lyrics &quot;I run far from you&quot; are a tad weak). None of it ramps up the tempo much, or adds density to the mix-- it's not bad stuff, just somewhat unexceptional.\n\nThere are some who will fall in love with this album. Others will fall asleep to it. Both will agree that it's a solid debut, long on talent but maybe a bit short on melody or lacking in appropriate production. I had big expectations, some of which were met, but others of which were disappointed. Nonetheless, I remain devoted. \n\ncd ripped by EAC\n\nplease seed\n\n[url]http://dickthespic.org/2011/12/26/rosie-thomas/[/url]","torrent":{"xt":"urn:btih:3940e61bf352fd90125c0f4cd017be8f3003de1e","amp;dn":"Rosie+Thomas...When+We+Were+Small%282002%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3940e61bf352fd90125c0f4cd017be8f3003de1e","infoHashBuffer":{"type":"Buffer","data":[57,64,230,27,243,82,253,144,18,92,15,76,208,23,190,143,48,3,222,30]},"announce":[],"urlList":[]}}