{"title":"Fantastic Conspiracy Youtube Collection 5","uid":9017642,"size":1150871961,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:39471931cc448d57fc3ca6eb19e5c589d69ba23d&amp;dn=Fantastic+Conspiracy+Youtube+Collection+5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Obadia","files":42,"time":1381219336,"description":"I started working on Movies That Want Your Soul 2.  At first, the clips were going to be all 720 quality.  Then I realized I had to download 500 clips to start.  And a lot of the 720p didn't look like that quality, judging by the eye, the bitrate was lower.\n\nThe quality chosen was 854 * 480 FLV.  Little did I realize that the bitrate was at or around 600kbs.  Now going back and getting the 720 MP4s would be an option.  Trust me, lower video quality isn't something to go for.  The 500 clips only ended up taking up little space.  I feel like going back, though I'm not going to because it would be way too much work.  It just some of hte clips might not look the best for some of that have a 27 inch monitor.  They look ok on my 21.5 inch monitor.  I tested to see how the clips looked on a 23 inch monitor.  Some of the clips look blocky up close.  Sitting a few feet away from the monitor helps.  I'm Giving you this information so you know where I'm at if I don't upload for awhile.\n\nMy hard drive still needs to be reformatted.  A message just popped up that there is no disk drive and to please insert a disk drive.\n\nThis youtube video collection is about cymatics.  Basically with certain sound vibrations shapes are formed.  These videos will show the science and how you can do the same.  This makes me want to swear less because saying certain words probably causes a vibration effect that can have an impact on the mind and body.","torrent":{"xt":"urn:btih:39471931cc448d57fc3ca6eb19e5c589d69ba23d","amp;dn":"Fantastic+Conspiracy+Youtube+Collection+5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39471931cc448d57fc3ca6eb19e5c589d69ba23d","infoHashBuffer":{"type":"Buffer","data":[57,71,25,49,204,68,141,87,252,60,166,235,25,229,197,137,214,155,162,61]},"announce":[],"urlList":[]}}