{"title":"MobTime Cell Phone Manager v6.3.1 Portable","uid":4398887,"size":18526243,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:399cd47b244432a49cdcbf8cc7e8972c333e410e&amp;dn=MobTime+Cell+Phone+Manager+v6.3.1+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"NoExcuses","files":1,"time":1221581136,"description":"MobTime Cell Phone Manager v6.3.1 made Portable\n\nNo need to install it.\n\nMobTime Cell Phone Manager is easy-to-use pc software that helps you manage the content of your mobile phone via data cable, IrDA or Bluetooth dongle. The software supports most famous mobile phones of Nokia, Samsung, SonyEricsson, and Motorola, LG, Siemens and so on.\n\nBenefits from MobTime Cell Phone Manager\n# You might input phonebook or contacts by computer, copy contacts from Outlook or Notes to your cell phone, even exchange phonebook or contacts between two or more handsets, which supports a large number of mobile phones.\n# You won&amp;#039;t have to be worried of phone lost, because you can backup your phonebook or contacts to computer with MobTime Cell Phone Manager.\n# You might sync your handset&amp;#039;s contacts with Outlook or Notes to exchange modified data of each other. The software supports data sync for phones, which do not support sync protocol.\n# You have 3 ways to send group short messages: Input several phone numbers (Partitioned by comma or semicolon); Select multi-card in sendee choosing window; Run &quot;send message&quot; popup menu item after select multi-card in address list frame.\n# You might input short message without length limit, MobTime Cell Phone Manager can split the message to multi-messages automatically.\n# You might chat with your friends with the feature of SMS chat in MobTime Cell Phone Manager, just like ICQ / MSN.\n# You might capture pictures from screen then transfer them to your mobile phone just by mouse clicking lightly.\n# Totally 23 languages are supported by now: Arabic, Catalan, Chinese Simplified, Chinese Traditional, Czech, Dutch, English, French, German, Greek, Hungarian, Indonesian, Italian, Japanese, Malay, Polish, Portuguese, Romanian, Russian, Serbian, Spanish, Swedish, Ukrainian.\n# You might have three ways to connect your phone with PC: Data cable (RS232 or USB) / IrDA / Bluetooth.\n# You might change the skin you like from one to another.\n# You might click one button to dialup Internet by your phone as a modem without setting any options or configuration.\n# LiveUpdate allows end users to enjoy newest version timely. Multi-thread and beginning from the interrupted point are supported.\n# Backup and restore important phone data including phonebook, calendar, multimedia files via simple operation.\n\n\nfor compatibility\n &lt;a href=&quot;\nhttp://www.mobtime.com/en/cpm/compatibility.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.mobtime.com/en/cpm/compatibility.php&lt;/a&gt;\n\nOfficial website:  &lt;a href=&quot;\nhttp://www.mobtime.com/en/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.mobtime.com/en/index.php&lt;/a&gt;\n\n\nThe Portable SFX EXE file is built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It&amp;#039;s always better to run all downloaded programs using Sandboxie or a similar virtual machine.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it&amp;#039;s so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, Instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://suprbay.org/forumdisplay.php?f=34&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://suprbay.org/forumdisplay.php?f=34&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat&amp;#039;s the only way to keep TPB and its uploads fresh and clean.\n\n\nThat&amp;#039;s for what is regarding security. If after testing it you see that you like it and need this program, show your support by buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:399cd47b244432a49cdcbf8cc7e8972c333e410e","amp;dn":"MobTime+Cell+Phone+Manager+v6.3.1+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"399cd47b244432a49cdcbf8cc7e8972c333e410e","infoHashBuffer":{"type":"Buffer","data":[57,156,212,123,36,68,50,164,156,220,191,140,199,232,151,44,51,62,65,14]},"announce":[],"urlList":[]}}