{"title":"PetiteBallerinasFucked - Rebel Lynn (Ballet Beauty) NEW 15 Decem","uid":12998945,"size":287870781,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:39eafff4cfbb437b6ba93e534426fd68d0ef7514&amp;dn=PetiteBallerinasFucked+-+Rebel+Lynn+%28Ballet+Beauty%29+NEW+15+Decem&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"xxxlavalxxx","files":2,"time":1450183316,"description":"Rebel Lynn is getting warmed up for ballet practice when her partner Damon Dice greets her and starts peeling off her clothes. Finding his teen dream already wet and ready when he pulls her sheer leotard to the side, Damon gives her snatch a nice rubdown and then urges her down onto her knees to lap and lick at his cock until he is standing at attention for a good fuck.Using the ballet bar for support, Rebel bends over and parts her thighs to give Damon all the room he needs to slam into her needy twat. Although her moans are a clear sign that Rebel is enjoying herself on her back, Damon adjust her so that she is leaning over the bar with her ass in the air for a proper pussy pounding.Rebel's snatch is pulsing with ecstasy as she sinks onto the ground with Damon beneath her so that she can give him a lusty cowgirl stiffie ride. When he has finally brought Rebel to her final climax of the afternoon, Damon pulls out of her hot twat and jizzes all over her face boobs and belly so that Rebel can enjoy the feeling of being covered in her man's love.\r\nTags: Small Boobs, Puffy Nipples, Shaved Pussy, Brunette, Long hair, Hardcore, Petite, Girl-Boy, Blowjob, Deep Throat, Pussy Licking, Ballerina\r\n \nhttp://imgdone.com/viewer.php?file=90766659703471077489.jpg\r\n \nhttp://imgdone.com/viewer.php?file=29656691587271477075.jpg","torrent":{"xt":"urn:btih:39eafff4cfbb437b6ba93e534426fd68d0ef7514","amp;dn":"PetiteBallerinasFucked+-+Rebel+Lynn+%28Ballet+Beauty%29+NEW+15+Decem","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39eafff4cfbb437b6ba93e534426fd68d0ef7514","infoHashBuffer":{"type":"Buffer","data":[57,234,255,244,207,187,67,123,107,169,62,83,68,38,253,104,208,239,117,20]},"announce":[],"urlList":[]}}