{"title":"The Care Bears Adventure in Wonderland (1987)","uid":4035901,"size":896841585,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3a9f5dff7652577dc3cbcf6a75c5696efd017445&amp;dn=The+Care+Bears+Adventure+in+Wonderland+%281987%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"caralarminstall","files":2,"time":1203437362,"description":"The Care Bears Adventure in Wonderland (1987)\n &lt;a href=&quot;\nhttp://us.imdb.com/title/tt0092723/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://us.imdb.com/title/tt0092723/&lt;/a&gt;\n\nDuration:\n1:15:19\n\nResolution:\n640x480\n\nType:\nVHS rip\n\nVideo compression:\n3ivx D4 4.5.1\n\nAudio:\nIMA ADPCM\n\nReview:\n&amp;#039;Care Bears&amp;#039; Adventure in Wonderland&amp;#039;\nBy Hal Hinson\nWashington Post Staff Writer\nAugust 10, 1987  &lt;a href=&quot;\nhttp://www.washingtonpost.com/wp-srv/style/longterm/movies/videos/carebearsadventureinwonderlandghinson_a0c942.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.washingtonpost.com/wp-srv/style/longterm/movies/videos/carebearsadventureinwonderlandghinson_a0c942.htm&lt;/a&gt;\n\nWatching the &quot;Care Bears&amp;#039; Adventure in Wonderland,&quot; the latest of the teddy superstars&amp;#039; animated movie escapades, is like being pelted mercilessly for 75 minutes with Lucky Charms. It&amp;#039;s nonfatal (unless you have a sugar problem, in which case you&amp;#039;re likely to lapse into a coma), but it&amp;#039;s not exactly my idea of fun either.\n\nRight off, though, it should be said that, until yesterday, I&amp;#039;d never laid eyes on a Care Bear, don&amp;#039;t have kids, and am known the world over for having a heart as hard as tungsten steel. So what kind of judge am I? If these creatures reminded me of cereal, it&amp;#039;s because I&amp;#039;d like to have them for breakfast.\n\nIf you&amp;#039;re like me and, instead of sitting in front of the television set, spend your Saturday mornings packed in ice, trying desperately to reconstruct the events of the previous night, then some basic Care Bears data may come in handy.\n\nEssentially, a Care Bear is a social worker with fur. There are three of them, each a different intolerably vibrant day-glo color, and each with a little button-heart nose, hearts at its hips, and for some reason hearts on the soles of its feet. They have superpowers, if you want to call being able to conjure up rainbows or four-leaf clovers on command a superpower, and they, like most superheroes, go around sticking their cute little noses into everybody else&amp;#039;s business.\n\nThe fundamental difference between a Care Bear and a real bear -- this falls under the heading of &quot;Woodland Tips&quot; -- is that a real bear will not sit around for hours listening to you go on endlessly about your problems with your boss, your wife, your boss&amp;#039; wife. A real bear will take your head off. A Care Bear will be there for you; a Care Bear will understand. I prefer real bears.\n\nThe task at hand for these pint-size buttinskies and their pals, a bright orange lion and pink elephant (just what I needed), is to save Wonderland -- this is sacred Lewis Carroll territory that the filmmakers have encroached on -- from an evil wizard who would like to see things toned down a bit. You know the sort, an efficiency freak. Neat desk. All that. To stop him, they enlist the aid of a whiny blond named Alice who, it just so happens, is a dead ringer for the Wonderland princess the bad wizard has kidnaped. She, however, has an inferiority complex -- she&amp;#039;s afraid she&amp;#039;s not &quot;special&quot; enough -- and needs constant attention from her ever-caring buddies, who slip her nifty pearls of wisdom like, &quot;You&amp;#039;re as special as you think you are.&quot; Or &quot;You never know what you can do until you try.&quot; And she buys it!\n\nNeedless to say, the bears prevail, order is restored, and Alice is returned home with a renewed sense of self-esteem. The audience, too, is uplifted, inspired and better able, for all this, to take on the evil meanies in their own lives. And they didn&amp;#039;t seem to mind the amateurishness of the filmmaking -- the movie was put together by a Canadian production group called Nelvana, which also created the two previous Care Bears features as well as the television series -- or the lack of pacing, drama or characterization. The little tyke in front of me, in particular, seemed to delight in the thing. But he was eating a napkin the whole time so I can&amp;#039;t vouch for his taste. As for myself, when the lights came up I pronounced, &quot;Sermon over,&quot; stubbed out my cigar on the seat back in front of me and staggered into what was left of the day.\n\nCare Bears&amp;#039; Adventure in Wonderland is rated G and contains nothing offensive.\n","torrent":{"xt":"urn:btih:3a9f5dff7652577dc3cbcf6a75c5696efd017445","amp;dn":"The+Care+Bears+Adventure+in+Wonderland+%281987%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a9f5dff7652577dc3cbcf6a75c5696efd017445","infoHashBuffer":{"type":"Buffer","data":[58,159,93,255,118,82,87,125,195,203,207,106,117,197,105,110,253,1,116,69]},"announce":[],"urlList":[]}}