{"title":"Ace Cannon - The Best Of Ace Cannon, The Hi Records Years (2001)","uid":8440345,"size":239495617,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3ab22f63db80752ada6fcf654abae8ff708a84fc&amp;dn=Ace+Cannon+-+The+Best+Of+Ace+Cannon%2C+The+Hi+Records+Years+%282001%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":25,"time":1367712643,"description":"This is the same torrent that was uploaded to Demonoid in September 2011.\n\n\nAce Cannon - The Best Of Ace Cannon, The Hi Records Years (2001)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/41XG6YP4R0L._SL500_AA300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/41XG6YP4R0L._SL500_AA300_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nDVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nAMG Bio.txt\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nBiography from All Music (by Sandra Brennan):\n\nOne of Nashville's premier session men from the late '50s through the early '70s, alto saxophonist Ace Cannon began playing at the age of ten and signed with Sun Records during the early days of rock &amp; roll. He performed with Billy Lee Riley and Brad Suggs but then in 1959 joined the original Bill Black Combo, recording for the Hi label. He stayed with the band until 1961, when he made his solo chart debut with the instrumental &quot;Tuff,&quot; which made it to the country Top 20. This in turn was followed by a Top 40 hit, &quot;Blues (Stay Away From Me),&quot; and a minor hit for the Santos label, &quot;Sugar Blues.&quot; He had two more hits in the mid-'60s with &quot;Cotton Fields&quot; and &quot;Searchin',&quot; both recorded for Hi. A decade later, he became the subject of the 1974 documentary film, Ace's High. After moving to Nashville in the mid-'70s, Cannon's version of &quot;Blue Eyes Crying in the Rain&quot; became a minor hit and was nominated for the Best Country Instrumental Performance Grammy that year. Cannon continued to perform into the '90s and frequently toured with such legends of early rock &amp; roll as Carl Perkins.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/artist/ace-cannon-p16279/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/artist/ace-cannon-p16279/biography&lt;/a&gt;\n\nAll Music Album Review (by Richie Unterberger):\n\nOn this 18-song best-of, the chronological and stylistic breadth is a little -- not much -- greater than you'd suspect, starting with his biggest single, 1961's &quot;Tuff,&quot; and going all the way up to 1971. Most of the time, the saxophonist was content to grind out slow to medium shuffles with repetitive riffs and simple R&amp;B-pop hooks, occasionally using organ, much in the style of his labelmates Bill Black's Combo (with whom Cannon sometimes played sax). Like Black, Cannon's singles were good jukebox fare, sometimes selling a lot to the specific jukebox market even when they didn't chart. (And often they didn't chart; only three singles besides &quot;Tuff&quot; made the Top 100, all of them included here.) The formula was simplistic and sometimes monotonous, especially when piled right after the other. However, his grooves were tight, and in the unavoidable Cannon-Black comparisons, Cannon comes out on top, simply because his instrumentals were more soulful and just a bit grittier. Toward the end of the 1960s, too, he unexpectedly got into a tougher bag that was explicitly derivative of fellow Memphians Booker T. &amp; the MG's, but was actually pretty well done. It made for an improved sound, anyway, on cuts like &quot;Funny (How Time Slips Away),&quot; the downright funky &quot;Soul for Sale,&quot; and &quot;If I Had a Hammer&quot; (yes, the old Peter, Paul &amp; Mary folk hit). The 1971 cover of Joe Liggins' &quot;Drunk&quot; is, again unexpectedly, quite creditable funk, and only number here to feature vocals, done in a suitably phlegmy manner.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/album/the-best-of-ace-cannon-the-hi-records-years-r527154/review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/album/the-best-of-ace-cannon-the-hi-records-years-r527154/review&lt;/a&gt;\n\nAmazon.com's page: &lt;a href=&quot; http://www.amazon.com/dp/B00005AVLK&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B00005AVLK&lt;/a&gt;\n\nTrack List:\n\n01. Tuff\n02. Sittin' Tight\n03. Looking Back\n04. Kansas City\n05. Empty Arms\n06. The Prisoner's Song\n07. Cottonfields\n08. Sunday Blues\n09. Searchin'\n10. Blues Stay Away From Me\n11. Heartbreak Hotel\n12. I Walk The Line\n13. Funny (How Time Slips Away)\n14. Soul For Sale\n15. Memory\n16. Moanin'\n17. If I Had A Hammer\n18. Drunk\n","torrent":{"xt":"urn:btih:3ab22f63db80752ada6fcf654abae8ff708a84fc","amp;dn":"Ace+Cannon+-+The+Best+Of+Ace+Cannon%2C+The+Hi+Records+Years+%282001%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ab22f63db80752ada6fcf654abae8ff708a84fc","infoHashBuffer":{"type":"Buffer","data":[58,178,47,99,219,128,117,42,218,111,207,101,74,186,232,255,112,138,132,252]},"announce":[],"urlList":[]}}