{"title":"Mind/Body Techniques for Asperger's Syndrome: The Way of the Pat","uid":8436277,"size":1837086,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3ab71fdabde220a22c16c6656483a5995923a70a&amp;dn=Mind%2FBody+Techniques+for+Asperger%27s+Syndrome%3A+The+Way+of+the+Pat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ariane_c","files":1,"time":1367643961,"description":"Publisher: Jessica Kingsley Pub; 1 edition (April 15, 2008 PDF 151 pages\n\nPeople with Asperger's Syndrome typically experience difficulty with balance, coordination and sensory awareness. The mind/body exercises in this book help young people with Asperger's Syndrome (AS) improve these skills, leading to greater self-confidence, and independence.Easy to use, with photographs to show how exercises are done correctly, these techniques can have an immediate effect on how an individual stands, sits, moves, thinks of him- or herself, and relates to others. The author's approach integrates ideas and practices from disciplines including martial arts, Eastern principles of mindfulness, techniques of visualization, breathing, posture, and movement, and the practice of mentoring.&quot;Mind/Body Techniques for Asperger's Syndrome&quot; is an introduction to Pathfinder training techniques for both parents of adolescents with Asperger's syndrome and professionals including physical therapists, pediatricians, and special education teachers who work with them.\n\nAbout the Author\nRon Rubio is Director of the Pathfinder Mentoring Services and the High Point Mountain Aikikai and BodyKi Centre in New York state, and works with males aged 8 to 33 years who have Asperger's syndrome. He has a Yondan (4th degree) black belt in aikido and has practiced the martial arts for over 20 years and has been a professional martial artist and instructor in aikido (Japanese), capoeira (Brazilian) and close combat. He also had a long career as a professional dancer, choreographer and teacher.","torrent":{"xt":"urn:btih:3ab71fdabde220a22c16c6656483a5995923a70a","amp;dn":"Mind%2FBody+Techniques+for+Asperger%27s+Syndrome%3A+The+Way+of+the+Pat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ab71fdabde220a22c16c6656483a5995923a70a","infoHashBuffer":{"type":"Buffer","data":[58,183,31,218,189,226,32,162,44,22,198,101,100,131,165,153,89,35,167,10]},"announce":[],"urlList":[]}}