{"title":"eDatingDoc Academy","uid":10506293,"size":814593541,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:3b8ca2f1a78cb06a0508ce2dc45464b7a6538e5a&amp;dn=eDatingDoc+Academy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"RedBaroness","files":1,"time":1404775582,"description":"eDatingDoc Academy\n\nYou get the training you need to boost your online dating results and get the girl you want.\nEvery area of online dating is covered with laser-like focus with the On-Demand quick-action video training &amp; quick-action worksheets.\n\n\nOnline dating vs. PUA (Pick Up Artist) training:\nCost:\nA pick-up artist can literally cost nothing; however with internet dating you at least need to pay for internet access.\nTime:\nWhile internet dating may require fair amount of time to send out messages and go on dates, learning pick-up is like training a martial arts.\nQuality:\nOn dating sites, attractive women are bombarded by messages, whereas in real life men rarely have the balls to hit on women. So by a long shot PUAs have a wider selection and considerably less competition.\nCompatibility:\nTrying to find a geeky, vegetarian redhead who enjoys the work of Chuck Palahniuk, in your local bar is hard work. Online; however, they are just click away. Online dating wins.\n\nTo sum up:\nOnline dating is very much centred on finding someone who is a good match for you and in this case is an immensely effective tool.\nAlternatively, pick-up concentrates more on guys learning how to be attractive to women and teaches them how to act in the real world.\nThus, both areas should be combined to create maximum benefit.\n","torrent":{"xt":"urn:btih:3b8ca2f1a78cb06a0508ce2dc45464b7a6538e5a","amp;dn":"eDatingDoc+Academy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b8ca2f1a78cb06a0508ce2dc45464b7a6538e5a","infoHashBuffer":{"type":"Buffer","data":[59,140,162,241,167,140,176,106,5,8,206,45,196,84,100,183,166,83,142,90]},"announce":[],"urlList":[]}}