{"title":"Asking Alexandria - Stand Up And Scream (2009) WMA320","uid":6267430,"size":122223717,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3c1e8a10663bcf7e183d975afa4ae0c730a3df81&amp;dn=Asking+Alexandria+-+Stand+Up+And+Scream+%282009%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1300956901,"description":"Sorry for the caps, it's just that this CD is filled with awesomeness. I recently purchased the new Used CD, Saosin CD, and Muse CD. Since I enjoyed all of their previous albums, I have been disappointed by each one, especially the new Used CD - Artwork, since they are my favorite band. \n\nAnyways, I thought I would try something new. After reviewing this month's AP magazine featuring Paramore, I stumbled upon this new CD Asking Alexandria, I heard a few samples on Amazon, then I decided to pick up the CD at Hot Topic. \n\nMan...I haven't been happy with a CD purchase in months! This whole album is amazing, it's so unique, I haven't heard anyone like them. \n\nWhat makes them unique is their vocals, and they add a lot of different sounds to their tracks, it's not some repetitive sound like many emo/screamo/metal bands. \n\nFor instance, their songs may have the deep demonic sounding gurgling vocals, then will jump to the scream at the top of your lungs vocals, then the song will jump into the harmonious emo soft vocals, then jump back into the screams. \n\nThey even have tracks that include a lot of techno/electronica! Techno mixed with screamo, that is an amazing combo, I love it! I wish more bands did this...on second thought...no I don't, because then other bands would just be copying Asking Alexandria, that is why they are unique. \n\nTrack 1 has an example of the techno/guitar riffs. Then track 6 is a electronic type of song; tracks 11, 12 and 13 also includes some electronica. There are probably more, I am still listening to the CD as I am typing this review! \n\nTracks 6,7,8,9 and 11 are my favorites. The bass hits are incredible on my 2 10&quot; subs. Buy this CD now!\n\nby Gabe L.\n\nTRACKLIST:\n\n01 - Alerion.wma                                                                     \n02 - Final Episode (Let's Change The Channel).wma                                    \n03 - A Candlelit Dinner With Inamorta.wma                                            \n04 - Nobody Don't Dance No More.wma                                                  \n05 - Hey There Mr. Brooks (Featuring Shawn Milke Of Alesana).wma                     \n06 - Hiatus.wma                                                                      \n07 - If You Can't Ride Two Horses At Once... You Should Get Out Of The Circus.wma    \n08 - A Single Moment Of Sincerity.wma                                                \n09 - Not The American Average.wma                                                    \n10 - I Used To Have A Best Friend (But Then He Gave Me An STD).wma                   \n11 - A Prophecy.wma                                                                  \n12 - I Was Once, Possibly, Maybe, Perhaps A Cowboy King.wma                          \n13 - When Everyday's The Weekend.wma \n\nWMA 320Kbps 44100Hz STEREO\n\nFollow me On Facebook Pages: MarcelodrgzTPB\n","torrent":{"xt":"urn:btih:3c1e8a10663bcf7e183d975afa4ae0c730a3df81","amp;dn":"Asking+Alexandria+-+Stand+Up+And+Scream+%282009%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c1e8a10663bcf7e183d975afa4ae0c730a3df81","infoHashBuffer":{"type":"Buffer","data":[60,30,138,16,102,59,207,126,24,61,151,90,250,74,224,199,48,163,223,129]},"announce":[],"urlList":[]}}