{"title":"[Ebook-Ita-Pdf-Thriller]Marco Buticchi - Menorah[survivalofmisa]","uid":5135148,"size":607817,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c5c9297ca55664f215dc42ffd91b7eb3c1f1fff&amp;dn=%5BEbook-Ita-Pdf-Thriller%5DMarco+Buticchi+-+Menorah%5Bsurvivalofmisa%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mitimex","files":1,"time":1256418270,"description":"\n\nIl mito della Menorah ricorre nella tradizione leggendaria ebraica come il Graal in quella cristiana, ma con un'accezione ancor piÃƒÂ¹ mistica e simbolica. Candelabro a sette braccia, interamente d'oro, razziato dal tempio di Gerusalemme nel primo secolo d.C., ÃƒÂ¨ l'emblema stesso della religione ebraica, ÃƒÂ¨ l'immagine che rappresenta il destino di un popolo, un oggetto dalla storia travagliata come quella della gente che lo ama. Una delle leggende, detto per inciso, lo vorrebbe gettato nelle acque del Tevere e lÃƒÂ¬ rimasto da secoli, altre lo immaginano perso per sempre.\nQui l'autore segue una traccia e mette in moto una &quot;caccia al tesoro&quot; scatenata dal ritrovamento di un libretto scritto da un pittore veneziano, Antonio Fedeli, vissuto a Parigi durante la Rivoluzione Francese, dove sono indicate alcune coordinate per il ritrovamento del prezioso candelabro. La lettura del libretto, fatta da una giovane donna americana, Laura Joanson, una scrittrice impegnata in avvenimenti internazionali di rilievo, si intreccia con le vicende complesse dello spionaggio. Parallelamente si legge lo svolgersi degli intricati fatti contemporanei e l'altrettanto complessa storia svoltasi nel Settecento e che di quei fatti ÃƒÂ¨ preludio. Brevi flash tra Miami, Gerusalemme, Londra, Parigi... e la Venezia di fine Settecento in cui Fedeli narra le sue avventure, le sue amicizie, la vita mondana e i misteri di cui ÃƒÂ¨ venuto a conoscenza, assieme al mistico tibetano Namling, suo assistente, che prosegue nel racconto delle vicende quando Fedeli termina di scrivere il suo diario.\nEntrano a far parte della storia la Guerra del Golfo, due cosmonauti americani e la stazione orbitante Mir, satelliti spia, il Mossad, grandi alberghi internazionali, da Portofino a Gerusalemme, un panfilo dal nome evocatore di &quot;Rosa del deserto&quot;, un cadavere ritrovato ai margini del Tamigi, un parroco francese di campagna, il tesoro di Re Salomone, la mafia, una misteriosa cripta, l'autodromo di Monza, il capodanno ebraico, le catacombe di Parigi, Internet, un rapimento, le campagne del Piemonte, la costa adriatica, un monastero, un vascello mercantile in rotta verso l'Africa, una Mercedes speronata a Parigi che si schianta contro il guard-rail, il Tibet... Passato e presente strettamente intrecciati in una vicenda complessa e ricca di colpi di scena, sino al travolgente finale.\n","torrent":{"xt":"urn:btih:3c5c9297ca55664f215dc42ffd91b7eb3c1f1fff","amp;dn":"%5BEbook-Ita-Pdf-Thriller%5DMarco+Buticchi+-+Menorah%5Bsurvivalofmisa%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c5c9297ca55664f215dc42ffd91b7eb3c1f1fff","infoHashBuffer":{"type":"Buffer","data":[60,92,146,151,202,85,102,79,33,93,196,47,253,145,183,235,60,31,31,255]},"announce":[],"urlList":[]}}