{"title":"Flannery O'Connor - Mystery and Manners (pdf)","uid":8652597,"size":1656815,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3d55653206090a9cc9f50cf187fd565099601c5e&amp;dn=Flannery+O%27Connor+-+Mystery+and+Manners+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1373144473,"description":"Flannery O'Connor - Mystery and Manners: Occasional Prose (Farrar, Straus and Giroux, 1969). 237 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc. \n\n\nPosthumous collection of essays by the best American short story writer.\n\ndescription:\n\nAt her death in 1964, O'Connor left behind a body of unpublished essays and lectures as well as a number of critical articles that had appeared in scattered publications during her too-short lifetime. The keen writings comprising Mystery and Manners, selected and edited by O'Connor's lifelong friends Sally and Robert Fitzgerald, are characterized by the directness and simplicity of the author's style, a fine-tuned wit, understated perspicacity, and profound faith.\n\nThe book opens with &quot;The King of the Birds,&quot; her famous account of raising peacocks at her home in Milledgeville, Georgia. Also included are: three essays on regional writing, including &quot;The Fiction Writer and His Country&quot; and &quot;Some Aspects of the Grotesque in Southern Fiction&quot;; two pieces on teaching literature, including &quot;Total Effect and the 8th Grade&quot;; and four articles concerning the writer and religion, including &quot;The Catholic Novel in the Protestant South.&quot; Essays such as &quot;The Nature and Aim of Fiction&quot; and &quot;Writing Short Stories&quot; are widely seen as gems.\n\nThis bold and brilliant essay-collection is a must for all readers, writers, and students of contemporary American literature.","torrent":{"xt":"urn:btih:3d55653206090a9cc9f50cf187fd565099601c5e","amp;dn":"Flannery+O%27Connor+-+Mystery+and+Manners+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d55653206090a9cc9f50cf187fd565099601c5e","infoHashBuffer":{"type":"Buffer","data":[61,85,101,50,6,9,10,156,201,245,12,241,135,253,86,80,153,96,28,94]},"announce":[],"urlList":[]}}