{"title":"Rafael Nadal - Rafa: My Story (Autobiography)","uid":9602854,"size":22932528,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3d9a9c7ae229ab1f0de27e5562134a22e7df445e&amp;dn=Rafael+Nadal+-+Rafa%3A+My+Story+%28Autobiography%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ebooksports","files":1,"time":1392152384,"description":"PLEASE SEED!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\n\n\n                                     Book Description\n\n\n\n\nNo tennis player since Andre Agassi has captivated the world like Rafael Nadal. He's a rarity in today's sporting arena - a true sportsman who chooses to let his raw talent, dedication and humility define him. Rapidly closing in on his friend and rival Roger Federer's record haul of 16 grand slam victories, Nadal is an extraordinary competitor whose ferocity on court is made even more remarkable by his grace off it.\n\nThis book takes us to the heart of Nadal's childhood, his growth as a player, and his incredible career. It includes memorable highs and lows, from victory in the 2008 Wimbledon final - a match that John McEnroe called the 'greatest game of tennis ever played' - to the injury problems that have frequently threatened his dominance of the sport, to becoming the youngest player of the open era to complete a career Grand Slam in 2010. It transports us from Nadal's lifelong home on the island of Majorca to the locker room of Centre Court as he describes in detail the pressures of competing in the greatest tournament in the world. It offers a glimpse behind the racquet to learn what really makes this intensely private person - who has never before talked about his home life - tick. And it provides us with a story that is personal, revealing and every bit as exciting as Nadal himself.","torrent":{"xt":"urn:btih:3d9a9c7ae229ab1f0de27e5562134a22e7df445e","amp;dn":"Rafael+Nadal+-+Rafa%3A+My+Story+%28Autobiography%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d9a9c7ae229ab1f0de27e5562134a22e7df445e","infoHashBuffer":{"type":"Buffer","data":[61,154,156,122,226,41,171,31,13,226,126,85,98,19,74,34,231,223,68,94]},"announce":[],"urlList":[]}}