{"title":"Smoke (1985 Soundtrack) - Jerry Garcia Band &amp; Others [FLAC]","uid":9747493,"size":284138316,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3daae5db21015d96d1708653835b3d3c17b83af3&amp;dn=Smoke+%281985+Soundtrack%29+-+Jerry+Garcia+Band+%26amp%3B+Others+%5BFLAC%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"jayb","files":-1,"time":1394606674,"description":"Smoke - Original Soundtrack\n\nRelease Date:\tJune 6, 1995\nLabel:\t\tHollywood #2024\nDuration:\t46:32\nRecording:\tStudio\n\nTrack List:\n#  Title\t\t\tPerformer\t\tTime\n01 Brooklyn Boogie\t\tLouis Prima\t\t03:02\n02 Cigarettes and Coffee\tJerry Garcia Band\t05:37\n03 Downtown Train\t\tTom Waits\t\t03:51\n04 Augie's Photos\t\tRachel Portman\t\t02:28\n05 Baby Wants Kisses\t\tAnnabouboula\t\t04:20\n06 Supa Star\t\t\tGroup Home\t\t04:16\n07 Sexy Dumb Dumb\t\tSophia George\t\t04:00\n08 Hong Kong\t\t\tScreamin' Jay Hawkins\t02:21\n09 Prelude &amp; Fugue - Piano\tTatiana Nikolayeva\t05:33\n10 Snow Story\t\t\tRachel Portman\t\t02:23\n11 Innocent When You Dream\tTom Waits\t\t04:16\n12 Smoke Gets in Your Eyes\tJerry Garcia Band\t04:25\n\nAllMusic Review by Lindsay Planer:\n\nThis soundtrack to Wayne Wang's 1995 comedic drama Smoke is perhaps most notable for featuring two otherwise unavailable studio recordings from the Jerry Garcia Band. &quot;Cigarettes and Coffee,&quot; which was originally a soulful Otis Redding vehicle co-written by Jerry Butler, as well as the Jerome Kern pop standard &quot;Smoke Gets in Your Eyes&quot; are covered to great effect. Also included is some of the film's incidental score by Rachel Portman -- represented by the tracks &quot;Augie's Photo&quot; and &quot;Snow Story.&quot; There is also music derived from a wide variety of artists. Tom Waits contributes both &quot;Downtown Train&quot; as well as &quot;Innocent When You Dream&quot; and neo-classical Bulgarian musician Tatiana Koleva interprets Dmitri Shostakovich's &quot;Prelude and Fugue for Piano, Op. 87, No.1 In C Major.&quot; Also worked in is the Greek-influenced worldbeat of Annbouboula's &quot;Baby Wants Kisses.&quot; While only the Garcia Band numbers seem to bear a striking thematic resemblance to the film, Wang's eclectic choices contribute to the overall cinematic structure in the background as well as foreground. The final incarnation of the Garcia Band features Jerry (guitar/vocals), Melvin Seals (keyboards), John Kahn (bass), Donny Baldwin (drums), Gloria Jones (backing vocals), and Jackie LaBranch (backing vocals). &quot;Cigarettes and Coffee&quot; retains the lonesome blues funk of the more familiar version. Although any copious fretwork is conspicuous in its absence, Garcia's vocals range from withdrawn to robust as he knowingly animates the lyrics with a mature perspective. Seals' tasty Hammond organ and piano runs bob and weave throughout with an authentic gospel flavor that is filled by the sweet backing harmonies of Jones and LaBranch. By contrast, &quot;Smoke Gets in Your Eyes&quot; is given an upfront and aggressive blues workout that does feature some antagonistic guitar work, commencing with a fiery lead intro to the lightly syncopated and breezy arrangement. Again, the support vocalists lift a lilting countermelody to Garcia's amiable lead. Baldwin also asserts some tasty drum licks against Kahn's propulsive bass. There was a music video for the song that intercut clips of the film with shots of the band playing. It aired primarily on VH1 and was also given a heavier rotation when Garcia passed away two months after the soundtrack was issued. Enthusiasts of the guitarist are encouraged to seek out this title for these worthwhile performances.","torrent":{"xt":"urn:btih:3daae5db21015d96d1708653835b3d3c17b83af3","amp;dn":"Smoke+%281985+Soundtrack%29+-+Jerry+Garcia+Band+%26amp%3B+Others+%5BFLAC%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3daae5db21015d96d1708653835b3d3c17b83af3","infoHashBuffer":{"type":"Buffer","data":[61,170,229,219,33,1,93,150,209,112,134,83,131,91,61,60,23,184,58,243]},"announce":[],"urlList":[]}}