{"title":"The Peppers, Cracklings, and Knots of Wool Cookbook The Global M","uid":6559522,"size":2846448,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3dcb736db4498cc5aa939eebaac5fce620232e86&amp;dn=The+Peppers%2C+Cracklings%2C+and+Knots+of+Wool+Cookbook+The+Global+M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"lionzbay","files":1,"time":1311411681,"description":"\nAuthor(s): Diane M. Spivey\nPublisher: State University of New York Press\nDate: 1999-11\nFormat: pdf\nLanguage: English\nISBN10: 0791443752\nPages: 422\nISBN13: 9780791443750\n\nProduct Description: Fifteen years in the making, this book emerges as a new approach to presenting culinary information. It showcases a myriad of sumptuous, mouth-watering recipes comprising the many commonalities in ingredients and methods of food preparation of people of color from various parts of the globe. This powerful book traces and documents the continent's agricultural and mineral prosperity and the strong role played by ancient explorers, merchants, and travelers from Africa's east and west coasts in making lasting culinary and cultural marks on the United States, the Caribbean, Peru, Brazil, Mexico, India, and Southeast Asia.\n\nGroundbreaking in its treatment of heritage survival in African and African American cooking, this illuminating book broadens the scope of cuisine as it examines its historical relationship to a host of subjects--including music, advertising, sexual exploitation, and publishing. Provocative in its perspective, The Peppers, Cracklings, and Knots of Wool Cookbook dispels the long-standing misnomer that African cuisine is primitive, unsophisticated or simply non-existent, and serves as a reference in understanding how Africa's contributions continue to mark our cuisine and culture today.","torrent":{"xt":"urn:btih:3dcb736db4498cc5aa939eebaac5fce620232e86","amp;dn":"The+Peppers%2C+Cracklings%2C+and+Knots+of+Wool+Cookbook+The+Global+M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dcb736db4498cc5aa939eebaac5fce620232e86","infoHashBuffer":{"type":"Buffer","data":[61,203,115,109,180,73,140,197,170,147,158,235,170,197,252,230,32,35,46,134]},"announce":[],"urlList":[]}}