{"title":"Flogging Molly - Whiskey on a Sunday DVD","uid":3964990,"size":727237002,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3dfc8bc1ea5e702889bf74744842c08c5476658d&amp;dn=Flogging+Molly+-+Whiskey+on+a+Sunday+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"cheezymadman","files":1,"time":1199670033,"description":"Shot over two years and in seven countries, the feature-length documentary Whiskey on a Sunday is an intimate portrait of the Irish-infused rock band Flogging Molly. The film tracks the group of musicians from their bar-band roots to their current success, including footage of the band in the studio, on tour, at home and at their sold-out homecoming performance at the Wiltern Theater in Los Angeles Whiskey on a Sunday is an &quot;in-the-pocket&quot; experience with the candid and charismatic Flogging Molly family. Bound by intense passion, unwavering honesty and &quot;some weird juju,&quot; the seven members and their associates provide a good look at how things can be done against the grain. Bucking tradition, industry naysayers and inflexible business models, front man Dave King and crew illustrate their own formula for success: believing in oneself, refusing to be pigeonholed, and rising from humble beginnings to fulfill a dream, set to the driving folk beat of their vibrant live performances. Whiskey on a Sunday includes dozens of candid and rare photographs, archival footage, and several unreleased songs.\n\nRuntime:\nUSA:106 min\nCountry:\nUSA\nLanguage:\nEnglish","torrent":{"xt":"urn:btih:3dfc8bc1ea5e702889bf74744842c08c5476658d","amp;dn":"Flogging+Molly+-+Whiskey+on+a+Sunday+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dfc8bc1ea5e702889bf74744842c08c5476658d","infoHashBuffer":{"type":"Buffer","data":[61,252,139,193,234,94,112,40,137,191,116,116,72,66,192,140,84,118,101,141]},"announce":[],"urlList":[]}}