{"title":"Rag Doll Kung Fu - Fists of Plastic [PSN] with 2 DLC","uid":8892973,"size":687612693,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:3e1cd6e2cd6dc6cd85a2b4c0ce3e07e0887f9bcf&amp;dn=Rag+Doll+Kung+Fu+-+Fists+of+Plastic+%5BPSN%5D+with+2+DLC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dududus","files":8,"time":1378631048,"description":"A fast-paced combat game with an imaginative look and feel, Ragdoll Kung Fu: Fists of Plastic focuses on fun with exaggerated ragdoll physics action and charming High Definition (HD) visual effects. Featuring accessible and intuitive controls, even novice players can orchestrate impressive attacks with ninja-like precision. Additionally, hardcore players will appreciate the deep combat system, weapons use and strategy. Success depends mightily on the player mastering the basic Kung Fu moves and sharpening his acrobatic skills by swinging off platforms and somersaulting through the air. This action builds up Chi Power, which can be conjured to perform spectacular SIXAXIS wireless controller-triggered special attack moves and combat sequences. Furthermore, players can taunt their opponents with the Free Pose system, ensuring the battle is infused with lighthearted fun.\n\nPlayers can perfect their Kung Fu skills in the Solo Adventure and also take their characters online with a variety of addictive free-for-all and team-based multiplayer modes, including King of the Hill, Assassin and Capture the Fish. Perfect for any social occasion, Rag Doll Kung Fu: Fists of Plastic offers frantic multiplayer action with up to 4 players locally or online. ","torrent":{"xt":"urn:btih:3e1cd6e2cd6dc6cd85a2b4c0ce3e07e0887f9bcf","amp;dn":"Rag+Doll+Kung+Fu+-+Fists+of+Plastic+%5BPSN%5D+with+2+DLC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e1cd6e2cd6dc6cd85a2b4c0ce3e07e0887f9bcf","infoHashBuffer":{"type":"Buffer","data":[62,28,214,226,205,109,198,205,133,162,180,192,206,62,7,224,136,127,155,207]},"announce":[],"urlList":[]}}