{"title":"The Lost World of Old Europe - The Danube Valley, 5000-3500 BC","uid":14206770,"size":37967101,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3e60567d5ffbb4dafeb895d40fe0a92c50a03783&amp;dn=The+Lost+World+of+Old+Europe+-+The+Danube+Valley%2C+5000-3500+BC&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"STBGD","files":1,"time":1459976561,"description":"The Lost World of Old Europe - The Danube Valley, 5000-3500 BC (History Arts)\r\n\r\nPrinceton University | Pdf | Eng | 2009 | 247 p | 0691143889 | 36 MB\r\n\r\nIn the prehistoric Copper Age, long before cities, writing, or the invention of the wheel, Old Europe was among the most culturally rich regions in the world. Its inhabitants lived in prosperous agricultural towns. The ubiquitous goddess figurines found in their houses and shrines have triggered intense debates about women's roles. The Lost World of Old Europe is the accompanying catalog for an exhibition at New York University's Institute for the Study of the Ancient World. This superb volume features essays by leading archaeologists as well as breathtaking color photographs cataloguing the objects, some illustrated here for the first time.\r\n\r\nThe heart of Old Europe was in the lower Danube valley, in contemporary Bulgaria and Romania. Old European coppersmiths were the most advanced metal artisans in the world. Their intense interest in acquiring copper, Aegean shells, and other rare valuables gave rise to far-reaching trading networks. In their graves, the bodies of Old European chieftains were adorned with pounds of gold and copper ornaments. Their funerals were without parallel in the Near East or Egypt. The exhibition represents the first time these rare objects have appeared in the United States.\r\n\r\nAn unparalleled introduction to Old Europe's cultural, technological, and artistic legacy, The Lost World of Old Europe includes essays by Douglass Bailey, John Chapman, Cornelia-Magda Lazarovici, Ioan Opris and Catalin Bem, Ernst Pernicka, Dragomir Nicolae Popovici, Michel Séfériadès, and Vladimir Slavchev","torrent":{"xt":"urn:btih:3e60567d5ffbb4dafeb895d40fe0a92c50a03783","amp;dn":"The+Lost+World+of+Old+Europe+-+The+Danube+Valley%2C+5000-3500+BC","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e60567d5ffbb4dafeb895d40fe0a92c50a03783","infoHashBuffer":{"type":"Buffer","data":[62,96,86,125,95,251,180,218,254,184,149,212,15,224,169,44,80,160,55,131]},"announce":[],"urlList":[]}}