{"title":"The.Walking.Dead.S02E09.HDTV.Subtitulado.Esp.SC.avi","uid":7047458,"size":366929920,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3e6a56fff3e6ef0ced78c107cd2729ad78ebd7d1&amp;dn=The.Walking.Dead.S02E09.HDTV.Subtitulado.Esp.SC.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"seriecanal","files":-1,"time":1329796675,"description":"The Walking Dead es una serie de televisiÃƒÂ³n desarrollada por Frank Darabont y basada en la serie de cÃƒÂ³mics homÃƒÂ³nima creada por Robert Kirkman y Tony Moore y que actualmente se publica por la editorial Image Comics.1 Su episodio piloto, de sesenta minutos de duraciÃƒÂ³n, fue estrenado por la cadena AMC el 31 de octubre de 2010.2 En HispanoamÃƒÂ©rica se estrenÃƒÂ³ el 1 de noviembre y se emite los lunes en primetime por Fox LatinoamÃƒÂ©rica. La segunda temporada se estrenÃƒÂ³ el 16 de octubre de 20113 en los Estados Unidos, y el 18 de octubre para LatinoamÃƒÂ©rica.\n\nArgumento\n\nThe Walking Dead cuenta la historia de las secuelas de un apocalipsis zombi y sigue a un pequeÃƒÂ±o grupo de supervivientes que viajan a travÃƒÂ©s de Estados Unidos en busca de un nuevo hogar lejos de las hordas de zombis. DespuÃƒÂ©s de despertar de un coma en un hospital abandonado, el oficial de policÃƒÂ­a Rick Grimes se da cuenta de que el mundo que conocÃƒÂ­a no existe, devastado por una epidemia zombi de proporciones apocalÃƒÂ­pticas. En los alrededores, en las afueras de Atlanta, un pequeÃƒÂ±o campamento lucha por sobrevivir mientras que los no-muertos los acechan a cada momento.4 El grupo es guiado por Rick Grimes, quien era un oficial de policÃƒÂ­a en el viejo mundo. Mientras su situaciÃƒÂ³n se vuelve mÃƒÂ¡s y mÃƒÂ¡s sombrÃƒÂ­a, la desesperaciÃƒÂ³n del grupo por sobrevivir los obliga a hacer casi cualquier cosa para mantenerse con vida.5\n\nAudio:10\nVideo:10\nSub:10\nArchivo:The.Walking.Dead.S02E09.HDTV.Subtitulado.Esp.SC.avi\nFormato .avi\n\nSubtitulado por Serie Canal\n\nBuscanos en Facebook- Tus Series Subtituladas","torrent":{"xt":"urn:btih:3e6a56fff3e6ef0ced78c107cd2729ad78ebd7d1","amp;dn":"The.Walking.Dead.S02E09.HDTV.Subtitulado.Esp.SC.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e6a56fff3e6ef0ced78c107cd2729ad78ebd7d1","infoHashBuffer":{"type":"Buffer","data":[62,106,86,255,243,230,239,12,237,120,193,7,205,39,41,173,120,235,215,209]},"announce":[],"urlList":[]}}