{"title":"Pharsalus 48 BC: Caesar and Pompey - Clash of the Titans","uid":11774000,"size":20594474,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3e8c562db7fd887c753ddb63149dbd591d22f62b&amp;dn=Pharsalus+48+BC%3A+Caesar+and+Pompey+-+Clash+of+the+Titans&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1427195582,"description":"Increasing tension between Julius Caesar and Pompeius Magnus (Pompey the Great) after the death of Marcus Licinius Crassus soon degenerated into military conflict. With his hand considerably strengthened by his election as Dictator by the Senate in Rome, Caesar knew that power would only be a reality once he had militarily defeated Pompey. By August 49BC, Caesar had effectively destroyed Pompey's armies in Spain, but, by the time he had crossed the Adriatic pursuing him eastward, his forces were heavily outnumbered. Even with the reinforcements brought by Mark Antony, his attempt to crush Pompey by laying siege to Dyrrachium was unsuccessful and he eventually had to withdrew into Thessaly, with Pompey in pursuit.\n\nThe stage was set for the final clash of the two titans of the Roman world and the odds were heavily in Pompey's favour, with 45,000 men against Caesar's 22,000. However, the veteran legions loyal to Caesar were the best in the Roman army and the challenge he faced clearly stimulated Caesar's tactical genius for battle. Guessing that Pompey would attempt to overwhelm his right wing with his cavalry, he concealed elite cohorts of legionnaries behind his own heavily outnumbered horsemen with orders to fight at close quarters like pikemen. Caesar's predictions were correct and, far from overwhelming his exposed right flank, Pompey's left flank was routed, allowing Caesar to envelop and scatter the rest of his army.\n\nSimon Sheppard expertly charts the events leading up to the Pharsalus campaign, the course of the battle itself and the seismic implications of this decisive clash between the two greatest generals of their age","torrent":{"xt":"urn:btih:3e8c562db7fd887c753ddb63149dbd591d22f62b","amp;dn":"Pharsalus+48+BC%3A+Caesar+and+Pompey+-+Clash+of+the+Titans","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e8c562db7fd887c753ddb63149dbd591d22f62b","infoHashBuffer":{"type":"Buffer","data":[62,140,86,45,183,253,136,124,117,61,219,99,20,157,189,89,29,34,246,43]},"announce":[],"urlList":[]}}