{"title":"Apocalypse.Now.Redux.1979.1080p.BluRay.x264.DTS-SARTRE","uid":13446192,"size":7177787179,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:3eaca6a8a2e5ac5b33fce113f904e1034cc670ca&amp;dn=Apocalypse.Now.Redux.1979.1080p.BluRay.x264.DTS-SARTRE&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"sartre7","files":10,"time":1454751129,"description":"One of a cluster of late-1970s films about the Vietnam War, Francis Ford Coppola's Apocalypse Now adapts the Joseph Conrad novella Heart of Darkness to depict the war as a descent into primal madness. Capt. Willard (Martin Sheen), already on the edge, is assigned to find and deal with AWOL Col. Kurtz (Marlon Brando), rumored to have set himself up in the Cambodian jungle as a local, lethal godhead. \r\n\r\nAlong the way Willard encounters napalm and Wagner fan Col. Kilgore (Robert Duvall), draftees who prefer to surf and do drugs, a USO Playboy Bunny show turned into a riot by the raucous soldiers, and a jumpy photographer (Dennis Hopper) telling wild, reverent tales about Kurtz. By the time Willard sees the heads mounted on stakes near Kurtz's compound, he knows Kurtz has gone over the deep end, but it is uncertain whether Willard himself now agrees with Kurtz's insane dictum to &quot;Drop the Bomb. Exterminate them all.&quot; \r\n\r\nCoppola himself was not certain either, and he tried several different endings between the film's early rough-cut screenings for the press, the Palme d'Or-winning &quot;work-in-progress&quot; shown at Cannes, and the final 35 mm U.S. release (also the ending on the video cassette). The chaotic production also experienced shut-downs when a typhoon destroyed the set and star Sheen suffered a heart attack; the budget ballooned and Coppola covered the overages himself. These production headaches, which Coppola characterized as being like the Vietnam War itself, have been superbly captured in the documentary, Hearts of Darkness: A Filmmaker's Apocalypse. \r\n\r\nDespite the studio's fears and mixed reviews of the film's ending, Apocalypse Now became a substantial hit and was nominated for eight Academy Awards, including Best Picture, Best Director, Best Supporting Actor for Duvall's psychotic Kilgore, and Best Screenplay. It won Oscars for sound and for Vittorio Storaro's cinematography. This hallucinatory, Wagnerian project has produced admirers and detractors of equal ardor; it resembles no other film ever made, and its nightmarish aura and polarized reception aptly reflect the tensions and confusions of the Vietnam era.\r\n\r\nApocalypse Now Redux is a 2001 extended version which added 49 minutes of scenes that had been cut out of the original film. It represents a significant re-edit of the original version.\r\n\r\n\r\n\r\n\r\nSTARS.........: Martin Sheen, Marlon Brando, Robert Duvall\r\nDIRECTOR......: Francis Ford Coppola\r\nWRITERS.......: John Milius, Francis Ford Coppola\r\nGENRE.........: Drama | War\r\nRATING........: 8.5/10  430,193 votes\r\nMETASCORE.....: 90/100\r\nIMDB LINK.....: http://www.imdb.com/title/tt0099674\r\nRUNTIME.......: 3h 16mn\r\nSIZE..........: 6.66 GiB\r\nVIDEO CODEC...: x264 (  )\r\nRESOLUTION....: 1920x816\r\nBITRATE.......: 4000 Kbps (3-Pass)\r\nFRAMERATE.....: 23.976 fps\r\nAUDIO1........: English DTS 5.1 768kbps\r\nAUDIO2........: Director Commentary\r\nSOURCE........: Apocalypse Now.Redux.1979.BD.Remux.1080p.h264.4xRus.Eng.Commentary\r\nSUBTITLES.....: ENG, ENG-SDH\r\nCHAPTERS......: Yes\r\nENCODED BY....: Sartre\r\nENCODE DATE...: 2016-02-04\r\n\r\n\r\n\r\n\r\n \nhttp://i.imgur.com/5K8o64B.jpg \nhttp://i.imgur.com/Z3pCroT.jpg \nhttp://i.imgur.com/u8fYTA5.jpg","torrent":{"xt":"urn:btih:3eaca6a8a2e5ac5b33fce113f904e1034cc670ca","amp;dn":"Apocalypse.Now.Redux.1979.1080p.BluRay.x264.DTS-SARTRE","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3eaca6a8a2e5ac5b33fce113f904e1034cc670ca","infoHashBuffer":{"type":"Buffer","data":[62,172,166,168,162,229,172,91,51,252,225,19,249,4,225,3,76,198,112,202]},"announce":[],"urlList":[]}}