{"title":"A_CAIXA","uid":4338736,"size":1037275069,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3f5bf4e4deb5c59624d018681ab632dd1276475d&amp;dn=A_CAIXA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mfccorrea","files":3,"time":1218470766,"description":"Lisbon, a normal day in one of the typical narrow streets of the capital of Portugal. In a small house, in a dirty little street, in a dark corner of the city lives a poor blind beggar, which earns his living through the selling of useless trinkets such as buttons, erasers and other parafernalia. A situation not uncommon in most(if not all) the capitals in the world. The only curious situation is that the blind man keeps all his savings in a little black box donated to him by the government. It is through this box that the poor man proves his visual handicap. And it is this same BOX (a CAIXA)that is envied by all the blind manÃ‚Â´s lazy neighbours who are jealous of the little money that is given to the poor man. Curiously enough, even if all the neighbors have the gift of seeing, none of them have the guts to get a job, instead prefering to imagine schemes that will allow them to get their hands on the said BOX. As if this wasnÃ‚Â´t enough, the blind man is teased and abused by his only frustrated daughter and her husband, who live through the small earnings of his little BOX. The life on this (intentionally) excessive dramatic small world is suddenly turned upside down when someone steals the BOX of the blind man unleashing a chain of events that will have a surprising end. What starts as an history of miseries (like neo-realism gone really, really &quot;bad&quot;)and social frustration gets an aura of surrealism and nonsense that is rarely seen in most films out there who pretend to describe the horrors of this world and just end with a lot of excessive dramatism and cinematic self-pity which can only been described as phony and grotesque. The story of a blind man and his BOX who is despised because he is the only one who earns money (and the only one who really works to earn it) unveils some realities about human relations that are usually obscured by &quot;blinding&quot; moral principles.\n\nPortuguese audio, English subtitles","torrent":{"xt":"urn:btih:3f5bf4e4deb5c59624d018681ab632dd1276475d","amp;dn":"A_CAIXA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f5bf4e4deb5c59624d018681ab632dd1276475d","infoHashBuffer":{"type":"Buffer","data":[63,91,244,228,222,181,197,150,36,208,24,104,26,182,50,221,18,118,71,93]},"announce":[],"urlList":[]}}