{"title":"Kaiser Chiefs - Employment 2005 [EAC - FLAC] (oan)","uid":5618478,"size":504444736,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3f8570492864a675b6f768b560bb94ba97cddd82&amp;dn=Kaiser+Chiefs+-+Employment+2005+%5BEAC+-+FLAC%5D+%28oan%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"oneanight","files":-1,"time":1276162648,"description":" &lt;a href=&quot;http://leetleech.org/images/93460902677232400829.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://leetleech.org/images/93460902677232400829.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://leetleech.org/images/71979470127629452376.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://leetleech.org/images/71979470127629452376.jpg&lt;/a&gt;\n\nWhen Tears for Fears sang &quot;Kick out the Style/Bring back the Jam&quot; in &quot;Sowing\nthe Seeds of Love,&quot; one can imagine the lads in Kaiser Chiefs raising their\nmugs of ale in agreement. Comprised of vocalist Ricky Wilson, guitarist Andrew\nWhite, bassist Simon Rix, keyboardist Nick Baines, and drummer Nick\nHodgson, Kaiser Chiefs resurrected the mod spirit of the Jam in &quot;I Predict a\nRiot,&quot; supercharged class-of-1977 power pop that quickly electrified the British\npress when it was released in 2004. The song was inspired by Wilson's days\nas a club DJ in Leeds, England, where the group was also formed. The single\nand Kaiser Chiefs' pogo-inducing, boot-stomping live performances had them\npegged as rising stars in the neo-new wave revolution with Franz Ferdinand,\nDogs Die in Hot Cars, and the Futureheads. When Kaiser Chiefs' first 7&quot;, &quot;Oh\nMy God,&quot; reached number 66 on the U.K. charts -- a startling achievement for\nan unsigned band -- doors opened for the group to share the stage with larger\nacts, consequently grabbing the attention of A&amp;R scouts who wanted to sign\nthem. &quot;I Predict a Riot,&quot; on the other hand, reeled in U.S. modern rock radio\nprogrammers caught in a blooming new wave revival. Without an American\nlabel deal, Kaiser Chiefs (named after the South African football team) crashlanded\non some of the biggest U.S. alternative stations with the &quot;I Predict a\nRiot&quot; import single in late 2004. That same year they recorded their debut\nalbum, Employment, for the U.K. label B-Unique. The album was released\ndomestically in the U.S. in spring 2005. The group's follow-up, Yours Truly,\nAngry Mob, arrived in the spring of 2007, with Off with Their Heads arriving a\nyear later.\n\n\n  01. (03:38) - Everyday I Love You Less And Less\n  02. (03:53) - I Predict A Riot\n  03. (04:04) - Modern Way\n  04. (03:01) - Na Na Na Na Naa\n  05. (04:36) - You Can Have It All\n  06. (03:35) - Oh My God\n  07. (03:31) - Born To Be A Dancer\n  08. (03:28) - Saturday Night\n  09. (04:09) - What Did I Ever Give You?\n  10. (02:45) - Time Honoured Tradition\n  11. (04:13) - Caroline, Yes\n  12. (03:24) - Team Mate\n\n\nPlaying Time.........: 00:44:17\nTotal Size...........: 313.82 MB\n\n &lt;a href=&quot;\nhttp://leetleech.org/images/29153393283392515965.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://leetleech.org/images/29153393283392515965.jpg&lt;/a&gt;\n\nInspired by that moment sometime in the late '70s when punk gave birth to new\nwave (and looked back to the heyday of '60s mod for inspiration), the Kaiser\nChiefs' debut, Employment, expands on the sharp, sussed sound of their\nsingles in surprising ways. A look at London life and its discontents,\nEmployment is a remarkably ambitious debut album that aspires, right down to\nits cheeky liner notes and graphics, to be the Parklife or All Mod Cons of the\n2000s. While it doesn't quite reach those heights, it does have its fair share of\nmemorable songs. Chief among them is the one-two punch of &quot;Everyday I Love\nYou Less and Less,&quot; a tightly wound &quot;get lost&quot; song that seamlessly mixes the\nband's punky guitar-bass-drums attack with synths and drum machines, and\ntheir signature single, &quot;I Predict a Riot,&quot; another prime example of the band's\nbarbed, pissed-off pop. &quot;Saturday Night&quot; is another standout; with its brassy\nstomp and lyrics like &quot;watching the boys on their motorbikes/I want to be like\nthose guys,&quot; it's a Quadrophenia-like understanding of what it is to be lonely in\na crowd. On songs like moody-yet-stylish &quot;Modern Way&quot; and the cheeky,\ncontradictory &quot;Na Na Na Naa,&quot; the Kaiser Chiefs sound so effortlessly &quot;on&quot; that\nit's something of a surprise when Employment begins to lose momentum.\nDespite its pretty '60s pop melody, &quot;You Can Have It All&quot; drags a bit, while the\nvaudeville-tinged &quot;Time Honoured Tradition&quot; and &quot;Born to Be a Dancer&quot; are too\nprecious and theatrical for their own good. Although it's not among their best\nsongs musically, and its Beach Boys piss-take title is a little annoying,\n&quot;Caroline, Yes&quot; is one of the Kaiser Chiefs' more interesting bits of songwriting\non the surface, the narrator is upset because the other guy took Caroline away\nfrom him, but what really gets him is that the other guy is &quot;everything I want to\nbe in my life.&quot; Likewise, Employment ends with &quot;Team Mate,&quot; a tantalizingly\nshort character sketch that is also the band's best ballad. The Kaiser Chiefs'\nambition is a double-edged sword: it's admirable that they wanted to branch out\nin so many directions on their first full-length, but it might have been a better\nor safer, at least -- move to stick to the amazing rockers that made their name\nin the first place. Employment is an uneven but still very promising debut that\nsuggests that one day the Kaiser Chiefs will pull off something even more\nambitious. [The bonus CD version features six live tracks.]\n\n\n  01. (02:48) - Hard Times Send Me [live]\n  02. (03:56) - Modern Way [live]\n  03. (04:01) - I Predict A Riot [live]\n  04. (03:14) - Time Honoured Tradition [live]\n  05. (03:09) - Na Na Na Na Naa [live]\n  06. (03:41) - Oh My God [live]\n\n\nPlaying Time.........: 00:20:49\nTotal Size...........: 152.44 MB\n\n\n\nAll tracks accurately ripped\n\nNo errors occurred\n\nEnd of status report","torrent":{"xt":"urn:btih:3f8570492864a675b6f768b560bb94ba97cddd82","amp;dn":"Kaiser+Chiefs+-+Employment+2005+%5BEAC+-+FLAC%5D+%28oan%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f8570492864a675b6f768b560bb94ba97cddd82","infoHashBuffer":{"type":"Buffer","data":[63,133,112,73,40,100,166,117,182,247,104,181,96,187,148,186,151,205,221,130]},"announce":[],"urlList":[]}}