{"title":"Monster Rancher (PSX)","uid":4134704,"size":361065050,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:3ff5c0c1e6d6b184b23213d43ef5eedd023ac290&amp;dn=Monster+Rancher+%28PSX%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Gracek","files":2,"time":1208207337,"description":"From Wikipedia, the free encyclopedia\n\nMonster Rancher\n\nDeveloper(s) \tTecmo\nPublisher(s) \tTecmo\nSeries \tMonster Rancher\nPlatform(s) \tPlayStation\nRelease date \tApril, 1997 Japan\n                November 30th, 1997 (U.S.)\nGenre(s) \tLife simulation game\nMode(s) \tSingle player, or two players versus\nRating(s) \tESRB: Kids to Adults\nInput methods \tController, CD-ROM\n\nMonster Rancher is a console game released in North America November 30, 1997, for the Sony PlayStation system. It is the first game in Tecmo&amp;#039;s Monster Rancher series, featuring the raising, fighting, and breeding of monsters.\n\nGameplay\n\nAlthough it is possible to acquire a monster in-game, the series is known for the ability to acquire new monsters using Compact Discs (CDs). Players can use any readable CD, and the game creates a monster using the data stored on it. Certain CDs would result in unique monsters: for example, some Christmas music albums will give the player a monster of type &quot;Santa&quot;. Once the player has two or more monsters in reserve, they can be combined, creating a new monster with traits of both &amp;#039;parents.&amp;#039;\n\nOnce the player has a monster, it can then be raised to be a fighting machine. There are six stats that determine how the monster does in battle: Power fuels physical attacks, Intelligence fuels and defends against energy attacks, Life determines monster&amp;#039;s hit points, Skill affects accuracy, Speed helps evade opponents&amp;#039; attacks, and Defense reduces damage received from physical attacks. Monsters train either by doing chores near by, or can be sent to be trained by experts, where they have the chance to gain new attack techniques.\n\nThe primary way to advance through the game is through monster fighting tournaments.While in battle, each monster has attacks available to it, some moves are only available at close range, others from a distance. Players cannot control the monster directly in a fight, but can call for their monster to stay away or close in, and attack with whichever move is available at the current range.\n\n\nThis is my first upload and I know, that it can be not perfect.\nI&amp;#039;ll be seeding, when it&amp;#039;s available. Please be patient...\t\n\n\nThis is updated version of my previous torrent...","torrent":{"xt":"urn:btih:3ff5c0c1e6d6b184b23213d43ef5eedd023ac290","amp;dn":"Monster+Rancher+%28PSX%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ff5c0c1e6d6b184b23213d43ef5eedd023ac290","infoHashBuffer":{"type":"Buffer","data":[63,245,192,193,230,214,177,132,178,50,19,212,62,245,238,221,2,58,194,144]},"announce":[],"urlList":[]}}