{"title":"Rick James - Street Songs (1981) + Throwin' Down (1982)@flac","uid":6831651,"size":478508777,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:40022067225f088d5da91a05398a2aebcd2f5bf6&amp;dn=Rick+James+-+Street+Songs+%281981%29+%2B+Throwin%5C%27+Down+%281982%29%40flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"alekow1","files":27,"time":1321890802,"description":"\nIn the early days of the CD age, Motown released an astonishing number of CDs, including a whole line of single-disc sets that contained two original records on one CD. \nMotown's initial CD two-fers were criticized in many quarters for shoddy, unattractive packaging and indifferent remastering, but less discriminating consumers found them perfectly acceptable, since it offered a lot of music at a reasonable price. By the mid-'90s, Motown eventually phased these discs out of print, replacing them with remastered individual discs, but some of the records never were re-released on CD, which made this series valuable for Motown collectors. \nThis particular disc contained two of Rick James' most popular albums, Street Songs and Throwin' Down. They're uneven, containing a couple of great singles, a few solid album tracks, and some filler, but they're worth exploring by hardcore fans, especially in this context, since the highlights on both records tend to balance out the weaknesses. (AMG)\n\n\n &lt;a href=&quot;\nhttp://img851.imageshack.us/img851/1253/foldernv.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img851.imageshack.us/img851/1253/foldernv.jpg&lt;/a&gt;\n\n\n\n1. Street Songs (1981)\n\nDisappointed because 'Garden of Love' wasn't as well received as it should have been, Rick James made a triumphant return to defiant, in-your-face funk with the triple-platinum Street Songs. This was not only his best-selling album ever, it was also his best period, and certainly the most exciting album released in 1981. \nThe gloves came all the way off this time, and James is as loud and proud as ever on such arresting hits as &quot;Super Freak,&quot; &quot;Give It to Me Baby,&quot; and &quot;Ghetto Life.&quot; Ballads aren't a high priority, but those he does offer (including his stunning duet with Teena Marie, &quot;Fire and Desire&quot;) are first-rate. \nOne song that's questionable (to say the least) is the inflammatory &quot;Mr. Policeman,&quot; a commentary on police misconduct that condemns law enforcement in general instead of simply indicting those who abuse their authority. But then, the thing that makes this hot-headed diatribe extreme is what makes the album on the whole so arresting -- honest, gut-level emotion. James simply follows what's in his gut and lets it rip. \nEven the world's most casual funksters shouldn't be without this pearl of an album. (AMG)\n\n\n\n01. Give It To Me Baby    [4:10]\n02. Ghetto Life    [4:21]\n03. Make Love To Me    [4:49]\n04. Mr. Policeman    [4:18]\n05. Super Freak    [3:25]\n06. Fire And Desire    [7:20]\n07. Call Me Up    [3:53]\n08. Below The Funk (Pass The J)    [2:39]\n\n\n\n\n\n2. Throwin' Down (1982)\n\nRick James fans generally agree that 1981's 'Street Songs' is his finest album -- in fact, 'Street Songs' is essential listening for anyone with even a casual interest in hardcore funk. Unfortunately, James tried to recycle the album's formula on many of his subsequent albums, and by the mid-'80s, he had become a very predictable and redundant caricature of himself. But in 1982, James was still exciting. \nThat year's 'Throwin' Down', the album that followed 'Street Songs', falls short of essential but is still rewarding. Many of the songs are excellent, including the cynical &quot;Money Talks&quot; and the major hits &quot;Standing on the Top&quot; (which features the Temptations) and &quot;Dance Wit' Me.&quot; \nNot surprisingly, hardcore funk dominates the record, although 'Throwin' Down' contains a few pleasing soul ballads as well. &quot;Happy,&quot; a duet with Teena Marie, and &quot;Teardrops&quot; point to the fact that James can be a very expressive ballad singer even though he is best known for his up-tempo material. \nThis album does sound like recycled Street Songs at times, but in 1982, James had yet to run the formula into the ground. All things considered, Throwin' Down was an enjoyable, if imperfect and slightly uneven, addition to the funkster's catalog. (AMG)\n\n\n\n09. Dance Wit' Me    [4:03]\n10. Money Talks    [4:49]\n11. Teardrops    [4:49]\n12. Throwdown    [3:16]\n13. Standing On The Top    [3:51]\n14. Hard To Get    [4:07]\n15. Happy    [5:29]\n16. 69 Times    [4:12]\n17. My Love    [2:54]\n\n\n\n\n\nLabel: Motown\nReleased: 1986\n\n\n\n\nCodec: Flac\nCompression Level: 5\nQuality: High\n\n\nCD-rip by alekow (EAC and Flac)\nCovers Included (400dpi)\n\n\n\n\n\n\n\nEnjoy, Seed and Share","torrent":{"xt":"urn:btih:40022067225f088d5da91a05398a2aebcd2f5bf6","amp;dn":"Rick+James+-+Street+Songs+%281981%29+%2B+Throwin%5C%27+Down+%281982%29%40flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40022067225f088d5da91a05398a2aebcd2f5bf6","infoHashBuffer":{"type":"Buffer","data":[64,2,32,103,34,95,8,141,93,169,26,5,57,138,42,235,205,47,91,246]},"announce":[],"urlList":[]}}