{"title":"RiffTrax - Viva Knievel!","uid":8346174,"size":1230030910,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4033b7b5dab6c51dc6a865b504a13abafa847a76&amp;dn=RiffTrax+-+Viva+Knievel%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"saybis","files":1,"time":1365208083,"description":"Evel Knievel was a 70s icon most known for the &quot;stunt&quot; of flying across the country to beat his former promoter, an executive at 20th Century Fox, outside the studio commissary with an aluminum baseball bat, shattering the man's arm while shouting &quot;I'm going to kill you!&quot; Okay, that's not what he's most known for, but it's what he should be most known for. I mean, did you know that? We didn't know that. But it just might come up once or twice in our new Rifftrax of Viva Knievel!\n\nThe cast of this movie is basically a list of names designed to make you go &quot;whoa, all those people are in this movie?&quot; Screen legend Gene Kelly! Red Buttons! Lauren Hutton! Frank Gifford! Space Mutiny's Cameron Mitchell! Dabney Coleman! The inexplicably-named Marjoe Gortner! And, perhaps best of all, the diabolical druglord villain played by none other than Leslie Nielsen! If you've seen him in The Naked Gun or Airplane! every line he says will sound like a joke to you, and trust us friends, that is a very good thing.\n\nFrom Evel waking up orphans late at night to give them his own shoddy action figure merchandise, to, oh right, the occasional motorcycle jump, there's almost too much to like about this one. So grab your baseball bat and join Mike, Kevin, and Bill as they spectacularly fail to jump Snake River Canyon and see Viva Knievel!","torrent":{"xt":"urn:btih:4033b7b5dab6c51dc6a865b504a13abafa847a76","amp;dn":"RiffTrax+-+Viva+Knievel%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4033b7b5dab6c51dc6a865b504a13abafa847a76","infoHashBuffer":{"type":"Buffer","data":[64,51,183,181,218,182,197,29,198,168,101,181,4,161,58,186,250,132,122,118]},"announce":[],"urlList":[]}}