{"title":"Crush It ! Why NOW Is the Time to Cash In on Your Passion","uid":5154074,"size":9495121,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:40cfaa64241906998c802278ab64a994ef9f052d&amp;dn=Crush+It+%21+Why+NOW+Is+the+Time+to+Cash+In+on+Your+Passion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":-1,"time":1257738620,"description":"Crush It!: Why NOW Is the Time to Cash In on Your Passion\n\n~ Gary Vaynerchuk\n\n\nEditorial Reviews\n\nReview\n\n&quot;Gary Vaynerchuk is one of those entrepreneurs who has discovered the secret to combining passion with business. He is always an inspiration and always entertaining. You owe it to yourself to read this book!&quot; (Tony Hsieh, CEO of Zappos.com )\n\n&quot;Gary Vaynerchuk has become a walking, talking (and oh, such talking!), webbing and Tweeting example of how believing in what you do and keeping it fun can step up your life in all ways. There is nobody I would rather talk sports with-or wine or life.&quot; (Scott Simon, host of Weekend Edition Saturday on NPR )\n\n&quot;Gary is a force of nature. His authentic, raw passion and caring touches everyone. His insights into social media &amp; his message of opportunity could not be more timely.&quot; (Tony Robbins )\n\n&quot;Gary was the first person to push me on the importance of personalbrand and transparency - this was months before anyone was talkingabout it, he's always two steps ahead of anyone else.&quot; (Kevin Rose, Founder of)\n\n&quot;Anyone looking to supercharge their career should beg, borrow, and steal to learn Gary Vee's techniques. He reinvented the rules to build a $60-million business from scratch-on his own terms.&quot; (Tim Ferriss, #1 NY Times bestselling author of The 4-Hour Workweek )\n\n\nProduct Description\n\nDo you have a hobby you wish you could indulge in all day? An obsession that keeps you up at night? Now is the perfect time to take that passion and make a living doing what you love. In Crush It! Why NOW Is the Time to Cash In on Your Passion, Gary Vaynerchuk shows you how to use the power of the Internet to turn your real interests into real businesses. Gary spent years building his family business from a local wine shop into a national industry leader. Then one day he turned on a video camera, and by using the secrets revealed here, transformed his entire life and earning potential by building his personal brand. By the end of this book, readers will have learned how to harness the power of the Internet to make their entrepreneurial dreams come true. Step by step, Crush It! is the ultimate driver's manual for modern business.\n\nProduct Details\n\n    * Hardcover: 160 pages\n    * Publisher: HarperStudio (October 13, 2009)\n    * Language: English\n    * ISBN-10: 0061914177\n    * ISBN-13: 978-0061914171","torrent":{"xt":"urn:btih:40cfaa64241906998c802278ab64a994ef9f052d","amp;dn":"Crush+It+%21+Why+NOW+Is+the+Time+to+Cash+In+on+Your+Passion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40cfaa64241906998c802278ab64a994ef9f052d","infoHashBuffer":{"type":"Buffer","data":[64,207,170,100,36,25,6,153,140,128,34,120,171,100,169,148,239,159,5,45]},"announce":[],"urlList":[]}}