{"title":"Beach Boys - Smiley Smile and Wild Honey  FLAC","uid":5559595,"size":310618434,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:415f4df4fe8c6886e645757d5a21b72c01073c4d&amp;dn=Beach+Boys+-+Smiley+Smile+and+Wild+Honey++FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"keeybee","files":44,"time":1273787829,"description":"Please seed!\n\nThe Beach Boys are an American rock band, formed in 1961, who gained popularity for their close vocal harmonies and lyrics reflecting a Southern California youth culture of cars, surfing, and romance. Brian Wilson's growing creative ambitions later transformed them into a more artistically innovative group that earned critical praise and influenced many later musicians.\nThe group was initially composed of singer-musician-composer Brian Wilson, his brothers, Carl and Dennis, their cousin Mike Love, and friend Al Jardine. This core quintet was inducted into the Rock and Roll Hall of Fame Class of 1988. &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Beach_Boys&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Beach_Boys&lt;/a&gt;\n\nTrying to collect a complete, and I mean complete, discography with all Beach Boys releases seems to be almost impossible. According to Wiki there are 28 studio albums (32 with the live albums). According to AMG there are 38 albums (including live albums). The compilations seems to be countless/innumerable. And I don't even want to think of all unofficial releases.\n\nBut here's one more contribution to your collection. Enjoy!\n\n\nThe Beach Boys\nSmiley Smile originally released 1967\nWild Honey originally released 1967\nThis CD 2001 (Capitol)\nAll tracks mono except #28\nTracks 23 - 28 bonus tracks on this release\n\n01  The Beach Boys - Smiley Smile - Heroes And Villains  \n02  The Beach Boys - Smiley Smile - Vegetables  \n03  The Beach Boys - Smiley Smile - Fall Breaks And Back To Winter (Woody Woodpecker Symphony)  \n04  The Beach Boys - Smiley Smile - She's Goin' Bald  \n05  The Beach Boys - Smiley Smile - Little Pad  \n06  The Beach Boys - Smiley Smile - Good Vibrations  \n07  The Beach Boys - Smiley Smile - With Me Tonight  \n08  The Beach Boys - Smiley Smile - Wind Chimes  \n09  The Beach Boys - Smiley Smile - Gettin' Hungry  \n10  The Beach Boys - Smiley Smile - Wonderful  \n11  The Beach Boys - Smiley Smile - Whistle In  \n12  The Beach Boys - Wild Honey - Wild Honey  \n13  The Beach Boys - Wild Honey - Aren't You Glad  \n14  The Beach Boys - Wild Honey - I Was Made To Love Her  \n15  The Beach Boys - Wild Honey - Country Air  \n16  The Beach Boys - Wild Honey - A Thing Or Two  \n17  The Beach Boys - Wild Honey - Darlin'  \n18  The Beach Boys - Wild Honey - I'd Love Just Once To See You  \n19  The Beach Boys - Wild Honey - Here Comes The Night  \n20  The Beach Boys - Wild Honey - Let The Wind Blow  \n21  The Beach Boys - Wild Honey - How She Boogalooed It  \n22  The Beach Boys - Wild Honey - Mama Says  \n23  The Beach Boys - Smiley Smile / Wild Honey - Heroes And Villains (Alternate Take)  \n24  The Beach Boys - Smiley Smile / Wild Honey - Good Vibrations (Various Sessions)  \n25  The Beach Boys - Smiley Smile / Wild Honey - Good Vibrations (Early Take)  \n26  The Beach Boys - Smiley Smile / Wild Honey - You're Welcome  \n27  The Beach Boys - Smiley Smile / Wild Honey - Their Hearts Were Full Of Spring  \n28  The Beach Boys - Smiley Smile / Wild Honey - Can't Wait Too Long","torrent":{"xt":"urn:btih:415f4df4fe8c6886e645757d5a21b72c01073c4d","amp;dn":"Beach+Boys+-+Smiley+Smile+and+Wild+Honey++FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"415f4df4fe8c6886e645757d5a21b72c01073c4d","infoHashBuffer":{"type":"Buffer","data":[65,95,77,244,254,140,104,134,230,69,117,125,90,33,183,44,1,7,60,77]},"announce":[],"urlList":[]}}