{"title":"The Replacements - Beat Girl (bootleg)  [EAC] [FLAC]","uid":6856232,"size":395248273,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:417f96f00f6cd44e040db7b283e57d75ec295904&amp;dn=The+Replacements+-+Beat+Girl+%28bootleg%29++%5BEAC%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"er1975us","files":-1,"time":1322711862,"description":"\n***Remember, even though this is a FLAC file it STILL IS A BOOTLEG!***\n   \nI uploaded this onto a flac format in order to squeeze as much audio quality as possible from the original source.  This is as good as it will ever get.\nHowever, it does have its limitations.  So keep that in mind. Enjoy the Mats!\n     \n\nTrack Listing\n\n1 \t\tKissing In Action \t\t\n2 \t\tOught To Get Love \t\t\n3 \t\tSatellite \t\t\n4 \t\tLike A Rolling Pin \t\t\n5 \t\tCan't Hardly Wait \t\t\n6 \t\tDate To Church \t\t\n7 \t\tIf Only You Were Lonely \t\t\n8 \t\tNowhere Is My Home \t\t\n9 \t\tRoute 66 \t\t\n10 \t\tElection Day \t\t\n11 \t\tTossin' And Turnin' \t\t\n12 \t\tJungle Rock \t\t\n13 \t\tCool Water \t\t\n14 \t\tCruella DeVille \t\t\n15 \t\t20th Century Boy\n\n\nKEEP SEEDING!!!  THE ONLY WAY PIRATE BAY WORKS!!!  THANKS!!!\n\n\nReview from Allmusic.com\n\nby Bradley Torreano\n\nBoasting good sound quality and a great collection of rare songs, this is the strongest bootleg that has been released featuring the Replacements. Although much of this material is found on the 1998 collection All for Nothing, Nothing for All, it is the tracks that are not found on that album that make this essential. &quot;Ought to Get Love&quot; is a fine pop/rocker in the tradition of Westerberg's idol Alex Chilton, while &quot;Kissing in Action&quot; shows off their hard rock roots with a driving Kiss-style riff. Versions of &quot;Route 66,&quot; &quot;Tossin' and Turnin',&quot; and &quot;Twentieth Century Boy&quot; are all solid, if sloppy; but the fine cover of the Western classic &quot;Cool Water&quot; is the best non-Westerberg track. Tommy Stinson handles the vocals on the wonderful &quot;Satellite,&quot; while a guest appearance by Tom Waits livens up the bouncy &quot;Date to Church.&quot; But what makes this all worth it is &quot;If Only You Were Lonely,&quot; the first single released by the band and one of the finest ballads ever penned in the post-punk era. Westerberg strums an acoustic guitar and wails drunkenly about a hidden obsession with both an immature smugness and a sad optimism, hinting to the exact contrast that would make their music so essential only a few years later. Until Twin/Tone formally releases the material that did not make it to All for Nothing, Nothing for All, this is one of the best places to find some wonderful music by one of the greatest rock bands of the 1980s.\n\n\n\n","torrent":{"xt":"urn:btih:417f96f00f6cd44e040db7b283e57d75ec295904","amp;dn":"The+Replacements+-+Beat+Girl+%28bootleg%29++%5BEAC%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"417f96f00f6cd44e040db7b283e57d75ec295904","infoHashBuffer":{"type":"Buffer","data":[65,127,150,240,15,108,212,78,4,13,183,178,131,229,125,117,236,41,89,4]},"announce":[],"urlList":[]}}