{"title":"New History of Western Philosophy IV","uid":4850746,"size":6777187,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:41a0c7bc9b338fe0d422b776516cfe6d00f84ba4&amp;dn=New+History+of+Western+Philosophy+IV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Gorra09","files":1,"time":1239862362,"description":"Info from OUP:\n\nPhilosophy in the Modern World A New History of Western Philosophy, Volume 4\nby Anthony Kenny\n\nISBN13: 9780198752790 ISBN10: 0198752792\n\nDescription\nHere is the concluding volume of Sir Anthony Kenny's monumental four-volume history of philosophy, the first major single-author narrative history to appear for several decades. In this volume, Kenny tells the fascinating story of the development of philosophy in the modern world, from the early nineteenth century to the end of the millennium. Alongside (and intertwined with) extraordinary scientific advances, cultural changes, and political upheavals, the last two centuries have seen some of the most intriguing and original developments in philosophical thinking, which have transformed our understanding of ourselves and our world. In the first part of the book, Kenny offers a lively narrative introducing the major thinkers in their historical context. Among those we meet are the great figures of continental European philosophy, from Schopenhauer, Kierkegaard, and Nietzsche to Heidegger, Sartre, and Derrida; the Pragmatists such as C.S. Pierce and William James, who first developed a distinctively American philosophical tradition; Marx, Darwin, and Freud, the non-philosophers whose influence on philosophy was immense; and Wittgenstein and Russell, friends and colleagues who set the agenda for analytic philosophy in the twentieth century. Kenny then proceeds to guide the reader lucidly through the nine main areas of philosophical work in the period, offering a serious engagement with ideas and arguments about logic, language, epistemology, metaphysics, ethics, aesthetics, politics, and the existence of God. Graced with many beautiful illustrations, Philosophy in the Modern World concludes Kenny's stimulating history of the intellectual development of Western civilization, allowing readers to trace the birth and growth of philosophy from antiquity to the present day.\n\n- PDF - 364 pages\n\n---\n\nHere are the other three volumes:\n\nI -\nhttp://thepiratebay.se/torrent/4850737/New_History_of_Western_Philosophy_I.pdf\n\nII -\nhttp://thepiratebay.se/torrent/4832939/A_New_History_of_Western_Phil._-__Vol._II_Mediaeval_Philosophy\n\n\nIII -\nhttp://thepiratebay.se/torrent/4850741/New_History_of_Western_Philosophy_III.pdf\n","torrent":{"xt":"urn:btih:41a0c7bc9b338fe0d422b776516cfe6d00f84ba4","amp;dn":"New+History+of+Western+Philosophy+IV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41a0c7bc9b338fe0d422b776516cfe6d00f84ba4","infoHashBuffer":{"type":"Buffer","data":[65,160,199,188,155,51,143,224,212,34,183,118,81,108,254,109,0,248,75,164]},"announce":[],"urlList":[]}}