{"title":"The Adapted Mind (1992) edited by Jerome H. Barkow, et al.","uid":10155580,"size":19044658,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:420d060aacc451777524eb6bccaf890c44f7b4eb&amp;dn=The+Adapted+Mind+%281992%29+edited+by+Jerome+H.+Barkow%2C+et+al.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":null,"files":-1,"time":1400112235,"description":"The Adapted Mind - Evolutionary Psychology and the Generation of Culture (1992) edited by Jerome H. Barkow, Leda Cosmides &amp; John Tooby.pdf\n\nAlthough researchers have long been aware that the species-typical architecture of the human mind is the product of our evolutionary history, it has only been in the last three decades that advances in such fields as evolutionary biology, cognitive psychology, and paleoanthropology have made the fact of our evolution illuminating. Converging findings from a variety of disciplines are leading to the emergence of a fundamentally new view of the human mind, and with it a new framework for the behavioral and social sciences. First, with the advent of the cognitive revolution, human nature can finally be defined precisely as the set of universal, species-typical information-processing programs that operate beneath the surface of expressed cultural variability. Second, this collection of cognitive programs evolved in the Pleistocene to solve the adaptive problems regularly faced by our hunter-gatherer ancestors--problems such as mate selection, language acquisition, cooperation, and sexual infidelity. Consequently, the traditional view of the mind as a general-purpose computer, tabula rasa, or passive recipient of culture is being replaced by the view that the mind resembles an intricate network of functionally specialized computers, each of which imposes contentful structure on human mental organization and culture. The Adapted Mind explores this new approach--evolutionary psychology--and its implications for a new view of culture.\n\n688 pages\nPublisher: Oxford University Press (August 6, 1992)\nLanguage: English\nISBN-10: 0195060237\nISBN-13: 978-0195060232","torrent":{"xt":"urn:btih:420d060aacc451777524eb6bccaf890c44f7b4eb","amp;dn":"The+Adapted+Mind+%281992%29+edited+by+Jerome+H.+Barkow%2C+et+al.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"420d060aacc451777524eb6bccaf890c44f7b4eb","infoHashBuffer":{"type":"Buffer","data":[66,13,6,10,172,196,81,119,117,36,235,107,204,175,137,12,68,247,180,235]},"announce":[],"urlList":[]}}