{"title":"Sexually Broken--Lush newly MILFed Holly Heart throat trained Ma","uid":8832815,"size":948721639,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:4237e16f661414adfc5397c40d320484985e731d&amp;dn=Sexually+Broken--Lush+newly+MILFed+Holly+Heart+throat+trained+Ma&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"merzedes","files":-1,"time":1377032820,"description":"\nLush newly MILFed Holly Heart throat trained into next week by double cock! | Holly Heart | Matt Williams\n\nAugust 19, 2013 \n \n\nMP4 only.\n \n \nYou don't get a special pass around here just because you became a MILF. Tan, athletic big-titted Holly Heart has been out of the game for a little while, let's welcome her back by reminding her exactly what she is good for: sucking all the dick we want to throw at her.\n\nThe set-up is simplicity itself- a post and a set of shackles. Put your MILF on her knees, lock her in place and use her mouth hole as a pussy. Repeat as needed. What follows is an onslaught of cock. Holly Heart is bound and completely helpless. There is nothing she can do to escape her training, and school is in session. Today we bring not one but 2 cocks to the table. The 10 inches of BBC (big black cock) we have to reshape the back of Holly's throat isn't the sort of dick to take lightly, and we have no mercy.\n\nIn mere moments Holly is deconstructed by dick. Her eyes glaze over and drool spills down her hanging chin, coating her massive tits. One after the other the cocks attack, never giving her a chance to get on top of it, never letting her catch her breath. Her big mouth is filled up to the hilt and stretched to its limits. There is always another cock waiting for its turn to train, and there is nothing she can do to stop it. \n\nHolly is reduced to a cock sheath, her face hole has become a pussy for us to fuck. She take to her training well, doing her best accommodate the massive meat owning her airways. You can't bring in big boobs like that and think we are going to ignore them, and we throw on some nipple clamps to remind her of her place. Our athletic little MILF is now a moaning, quivering, drool-covered puddle of flesh that can't even remember her own name. That is what Sexuallybroken does. School is in session! \n\nScreens  &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/08_19hheart/SexuallyBroken-Holly-Heart-Matt-Williams-Lush-newly-MILFed-Holly-Heart-throat-trained-into-next-week-by-double-cock.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/08_19hheart/SexuallyBroken-Holly-Heart-Matt-Williams-Lush-newly-MILFed-Holly-Heart-throat-trained-into-next-week-by-double-cock.php&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:4237e16f661414adfc5397c40d320484985e731d","amp;dn":"Sexually+Broken--Lush+newly+MILFed+Holly+Heart+throat+trained+Ma","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4237e16f661414adfc5397c40d320484985e731d","infoHashBuffer":{"type":"Buffer","data":[66,55,225,111,102,20,20,173,252,83,151,196,13,50,4,132,152,94,115,29]},"announce":[],"urlList":[]}}