{"title":"Kriya -Learning To Relax-article","uid":4356917,"size":486689,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:424ca842e090d628d0bc1ff73ff4e074db82128b&amp;dn=Kriya+-Learning+To+Relax-article&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"welovesrisri","files":1,"time":1219452544,"description":"Just breathe. Forget about the past and the future. Shrug off\nyour stresses. Live in the present moment.\n\n\nEvery morning students wake up (some a bit more slowly\nthan others), jump into their clothes and fly out the door.\n\nThey may stop at Hillside for a morning coffee, or hungrily\nmunch on a Power Bar (who has time for breakfast?) as they\ntrek up the stairs to Gasson. Lunch is spent cramming for a\nquiz, dinner is shoved between two very important meetings,\nand afterward they fall into bed with Shakespeare, wanting\nnothing more than to sleep.\n\nSure, students may fit some smiles or actual conversations\ninto the course of a day, but do they take the time to enjoy\nthem? To concentrate on them? To really experience them?\nWhen did we last take the time to just breathe?\n\nThe Art of Living is a program that challenges people to\nconfront those very questions. Established in India 25 years\nago by spiritual leader Sri Sri Ravi Shankar, this program\ncombines spiritual elements, physical techniques, and social\nservice to help people slow down and truly explore life.\n\nFour years ago, a student brought this program to Boston\nCollege. Radhika Prabhu, BC '04, was exposed to the Art of\nLiving by her mother at a very early age. In college she\nnoticed how rushed everyone was, and decided that busy\nstudents and faculty could benefit from learning how to slow\ndown and relax.\n\n&quot;I was excited to share something new with the BC\ncommunity,&quot; Prabhu said. &quot;The program helps you realize\nthat there's so much more to life than we know.&quot;\nThe Art of Living program centers around a powerful breathing technique called Sudarshan Kriya. It is a means of detoxifying the body and bringing clarity to the mind by aligning one's own rhythm with that of nature, according to those who practice. \n\nSudarshan Kriya is the cornerstone technique that beginners will learn in the basic course, which consists of six three-hour sessions. The true focus of the program, however, is on the happiness of the whole person, and learning how to experience life in a more focused, positive way.\n\n&quot;We are never really taught how to deal with negative emotions,&quot; said Prabhu. &quot;We are told not to be stressed, to be happy, but we aren't given a chance to deal with these feelings.&quot;\n\nNow the director of Youth Art of Living Programs in Baltimore, Md., Prabhu is amazed at how the program has centered her and helped to relieve stress. She states her simple philosophy: &quot;Stress is nothing but the mind going from past to future. Being able to bring the mind to the present moment is how we find\nhappiness.&quot;\n\nHer presentation at a BC faculty health fair intrigued many educators. Nancy Baker, associate director of University Health Services, took the beginning set of classes and was amazed at what a difference it has made in her life.\n\nSpiritual leader Sri Sri Ravi Shankar sits before an audience of men and women\ndevoted to the calming power of the Art of Living. \n\nShe describes herself before discovering the Art of Living as &quot;feeling pressed for time, always anticipating what was coming next - it was like living on a treadmill.&quot;\n\nSince taking the classes she feels much more content, and has become very involved in the program. She\nemphasizes that it is very comprehensive: the courses that teach physical techniques are only a small part\nof the Art of Living program.\nShankar is a spiritual leader committed to service, and has turned his philosophy of peace and love into a\nglobal organization that does service work in many impoverished locations. In fact, the International\nAssociation for Human Values, a branch of Art of Living, works directly with the United Nations. The Art of\nLiving Foundation fundraises for the poor and conducts many specialized classes for marginalized members\nof society, such as one to rehabilitate inmates and another to relieve the stress of those with substance\nabuse problems.\nBaker feels that the values of the Art of Living coincide very well with those of BC. &quot;There is a great global\naspect to the program. It promotes diversity and acceptance. This is a similar message to that of Christianity\n- we are meant to help each other and to do service,&quot; she said.\nThe basic course is open to anyone ages 17-80 and there is at least one offered every month in the greater\nBoston area. Michelle Petty, R.N., who works at University Health Services, is a teacher of the class. She\nhas also been deeply affected by the Art of Living program.\n&quot;I feel more in touch with myself and at the same time a greater sense of belonging to the community,&quot; she\nsaid. &quot;I have the feeling that I want to give something back because I have received so much.&quot;\nAs a member of the medical community, Petty realizes the potential that the Art of Living has to positively\naffect health. &quot;When we do these practices, the mind becomes centered, the immune system is boosted,\nand every cell in the body becomes enlivened and filled with oxygen. Harmony is restored to all levels,&quot; she\nsaid.\nDespite the praise that this program, based on old sandscript teachings and ancient knowledge, receives,\nmany people confront it with cynicism.\n&quot;In our society it may be viewed with a skeptical eye because it is different from our own cultural\nexperience,&quot; said Baker.\nBut according to her, Americans could benefit immensely from the Art of Living. &quot;Living in the Western\nsociety we are extremely stressed because of work and responsibilities. This program helps us to be much\nmore content and to be able to be joyful about duties and activities,&quot; she said.\nThe Art of Living program has proved especially effective in the lives of those suffering from tragedy.\nBecause of this, BC is part of an initiative to bring the course to the displaced victims of Hurricane Katrina. It\nwill be offered in St. Williams Hall for the New Orleans students now attending BC. It is the hope of all\ninvolved that the program will help to alleviate the impressions of trauma. The classes will be open to all\ninterested students for a fee.\nThrough the enterprise of many dedicated individuals, the Art of Living will continue to grow. The Boston\nchapter is especially active, and this fall, Ugonma Fontaine, member of the chapter and A&amp;S '06, is\ncoordinating a 5K race to raise money for youths displaced by the Gulf hurricanes. It will take place in\nNewton on the morning of Oct. 29, and Fontaine hopes to have several hundred participants. The Art of\nLiving classes had a strong impact on her, and she wanted to become more involved with the program.\nBut she, like many others, can't put the experience into words, &quot;I can't fully describe the experience - just go\nand take the course.&quot; she said.\nFontaine sees the inherent value in the Art of Living, one that is becoming increasingly overlooked in the\nmad dash through life.\n&quot;It [Art of Living] is a necessity in the time that we live in, especially as a BC student with so much going one\n- school, relationships, other things. Life is going on, and we all need something to help ground us.&quot;\nInterested Students can contact Baker at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;9dfffcf6f8eff3fcddfffeb3f8f9e8&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; or Fontaine at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;ddbbb2b3a9bcb4b3a89dbfbef3b8b9a8&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; for more\ninformation. The next basic course begins October 19","torrent":{"xt":"urn:btih:424ca842e090d628d0bc1ff73ff4e074db82128b","amp;dn":"Kriya+-Learning+To+Relax-article","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"424ca842e090d628d0bc1ff73ff4e074db82128b","infoHashBuffer":{"type":"Buffer","data":[66,76,168,66,224,144,214,40,208,188,31,247,63,244,224,116,219,130,18,139]},"announce":[],"urlList":[]}}