{"title":"Blue Water by A. Manette Ansay","uid":9624112,"size":649383,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:428da2122e668834171ba920bde85cc3dc7a92e7&amp;dn=Blue+Water+by+A.+Manette+Ansay&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"PirateBook","files":2,"time":1392562564,"description":"\nNew York Times bestselling author A. Manette Ansay delivers the unforgettable story of two families united by tragedy -- and one woman's deeply emotional journey toward a choice she'd never thought possible\n\nOn an ordinary morning in Fox Harbor, Wisconsin, Meg and Rex Van Dorn's lives are irrevocably changed when a drunk driver slams into Meg's car, killing the couple's six-year-old son, Evan. In a town in which everyone knows everybody else, it's no surprise that Meg and the driver, Cindy Ann Kreisler, were once the best of friends. Now, as Meg recovers from her own injuries, she and Rex find themselves unable to cope with their anger and despair, especially after Cindy Ann returns -- with a mere slap on the wrist -- to the life she lived before the accident: living in a beautiful house, enjoying her own three daughters, all of whom walked away from the accident unharmed.\n\nMornings, we woke with an ache in our throats, a sourness in our stomachs, that had nothing to do with Evan. The truth was that, with each passing month, he was harder to remember, harder to see. I felt as if I were grasping at the color of water, the color of the wind or the sky. And this only made me angrier. My mind returned, again and again, to Cindy Ann, to what she'd done. When I passed Evan's room, the closed door like a fist, I thought about how Cindy Ann had destroyed us. When I saw other people's children, I promised myself that someday, Cindy Ann would pay.\n\nIn their rage and grief, Meg and Rex buy a boat to sail around the world, hoping to put as much distance between themselves and Cindy Ann Kreisler as possible. Adrift in the company of other live-board cruisers, Meg tries to believe that she and Rex have left their bitterness behind. But when she returns to Fox Harbor for her older brother's wedding, she is forced to face the complex ties that bind her to the woman who has wounded her so badly. For, as Meg knows better than anyone, Cindy Ann has secrets and sorrows of her own, dating back to the summer of their friendship.\n\nImpassioned, insightful, and beautifully written, Blue Water is the story of people learning to face the unthinkable -- a compelling affirmation of the human potential for forgiveness, redemption, and grace.\n\nGenre: General Fiction/Classics","torrent":{"xt":"urn:btih:428da2122e668834171ba920bde85cc3dc7a92e7","amp;dn":"Blue+Water+by+A.+Manette+Ansay","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"428da2122e668834171ba920bde85cc3dc7a92e7","infoHashBuffer":{"type":"Buffer","data":[66,141,162,18,46,102,136,52,23,27,169,32,189,232,92,195,220,122,146,231]},"announce":[],"urlList":[]}}