{"title":"Think_ Why You Should Question Everything - Harrison, Guy P_.epu","uid":9150001,"size":853830,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:434487e02927bc38523295e3ec37091dc5c595ea&amp;dn=Think_+Why+You+Should+Question+Everything+-+Harrison%2C+Guy+P_.epu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"420weedman","files":1,"time":1383672119,"description":"Think more critically, learn to question everything, and don't let your own brain trip you up.\n\nThis fresh and exciting approach to science, skepticism, and critical thinking will enlighten and inspire readers of all ages. With a mix of wit and wisdom, it challenges everyone to think like a scientist, embrace the skeptical life, and improve their critical thinking skills.\n\nThink shows you how to better navigate through the maze of biases and traps that are standard features of every human brain. These innate pitfalls threaten to trick us into seeing, hearing, thinking, remembering, and believing things that are not real or true. Guy Harrison's straightforward text will help you trim away the nonsense, deflect bad ideas, and keep both feet firmly planted in reality. \n\nWith an upbeat and friendly tone, Harrison shows how it's in everyone's best interest to question everything. He brands skepticism as a constructive and optimistic attitude--a way of life that anyone can embrace. An antidote to nonsense and delusion, this accessible guide to critical thinking is the perfect book for anyone seeking a jolt of inspiration.\nGenre: Non-Fiction, General","torrent":{"xt":"urn:btih:434487e02927bc38523295e3ec37091dc5c595ea","amp;dn":"Think_+Why+You+Should+Question+Everything+-+Harrison%2C+Guy+P_.epu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"434487e02927bc38523295e3ec37091dc5c595ea","infoHashBuffer":{"type":"Buffer","data":[67,68,135,224,41,39,188,56,82,50,149,227,236,55,9,29,197,197,149,234]},"announce":[],"urlList":[]}}