{"title":"Harry.Potter.y.el.misterio.del.principe.[TS-HQ][Castellano][Line","uid":5011240,"size":1468286976,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:44c0ff9da68ea6d04e0eb4c6391a0e2b6228c7cf&amp;dn=Harry.Potter.y.el.misterio.del.principe.%5BTS-HQ%5D%5BCastellano%5D%5BLine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Marxelosp","files":1,"time":1248011044,"description":"DirecciÃƒÂ³n: David Yates.\nPaÃƒÂ­s: Reino Unido.\nAÃƒÂ±o: 2009.\nDuraciÃƒÂ³n: 155 min.\nGÃƒÂ©nero: Aventuras, fantasÃƒÂ­a, misterio.\nInterpretaciÃƒÂ³n: Daniel Radcliffe (Harry Potter), Rupert Grint (Ron Weasley), Emma Watson (Hermione Granger), Helena Bonham Carter (Bellatrix Lestrange), Jim Broadbent (Horace Slughorn), David Bradley (Argus Filch), Robbie Coltrane (Rubeus Hagrid), Tom Felton (Draco Malfoy), Michael Gambon (Albus Dumbledore), Alan Rickman (Severus Snape), Maggie Smith (Minerva McGonagall), Bonnie Wright (Ginny Weasley), David Thewlis (Remus Lupin), Jessie Cave (Lavender Brown).\nGuiÃƒÂ³n: Steve Kloves; basado en la novela de J.K. Rowling.\nProducciÃƒÂ³n: David Heyman y David Barron.\nMÃƒÂºsica: Nicholas Hooper.\nFotografÃƒÂ­a: Bruno Delbonnel.\nMontaje: Mark Day.\nDiseÃƒÂ±o de producciÃƒÂ³n: Stuart Craig.\nVestuario: Jany Temime.\nEstreno en Reino Unido: 15 Julio 2009.\nEstreno en EspaÃƒÂ±a: 15 Julio 2009.\n\nVoldemort va tomando control tanto del mundo Muggle como del mundo de la magia, y Hogwarts ya no es el lugar seguro que solÃƒÂ­a ser. Harry (Daniel Radcliffe) sospecha que tal vez hasta el castillo sea peligroso. Dumbledore (Michael Gambon) sabe que la batalla final se aproxima rÃƒÂ¡pidamente, y por eso se preocupa mucho mÃƒÂ¡s por preparar a Harry para ello. Trabajan juntos para encontrar la clave para destruir las defensas de Voldemort. Con ese fin, Dumbledore busca la ayuda de su viejo amigo y colega, el profesor Horace Slughorn (Jim Broadbent). Entre tanto, los estudiantes se encuentran afectados por algo muy diferente que siempre ataca a los adolescentes: las hormonas. Harry cada vez se siente mÃƒÂ¡s atraÃƒÂ­do por Ginny (Bonnie Wright), pero eso tambiÃƒÂ©n le pasa a Dean Thomas (Alfred Enoch). Por su parte, Lavender Brown (Jessie Cave) ha decidido que Ron (Rupert Grint) tiene que ser para ella, Ã‚Â¡lÃƒÂ¡stima que no contÃƒÂ³ con los chocolates de Romilda Vane (Anna Shaffer)! Y tambiÃƒÂ©n estÃƒÂ¡ Hermione (Emma Watson), hirviendo de celos, pero decidida a no mostrar sus sentimientos. Los romances florecen, pero uno de los estudiantes no se deja afectar por todo ello; estÃƒÂ¡ decidido a llevar a cabo su tenebroso plan. El amor estÃƒÂ¡ por todos lados, pero la tragedia se cierne sobre Hogwarts.","torrent":{"xt":"urn:btih:44c0ff9da68ea6d04e0eb4c6391a0e2b6228c7cf","amp;dn":"Harry.Potter.y.el.misterio.del.principe.%5BTS-HQ%5D%5BCastellano%5D%5BLine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44c0ff9da68ea6d04e0eb4c6391a0e2b6228c7cf","infoHashBuffer":{"type":"Buffer","data":[68,192,255,157,166,142,166,208,78,14,180,198,57,26,14,43,98,40,199,207]},"announce":[],"urlList":[]}}