{"title":"Unspoken (The Woodlands) -Jen Frederick [ePub] - Traitor","uid":9530930,"size":660912,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:44df27693ad4bfd03d994c212dcf2505fafc2f3c&amp;dn=Unspoken+%28The+Woodlands%29+-Jen+Frederick+%5BePub%5D+-+Traitor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Xetron","files":1,"time":1390842943,"description":"***USA Today Bestseller***\nWhore. Slut. Typhoid Mary. \n\nI've been called all these at Central College. One drunken night, one act of irresponsible behavior, and my reputation was ruined. Guys labeled me as easy and girls shied away. To cope, I stayed away from Central social life and away from Central men, so why is it that my new biology lab partner is so irresistible to me?\n\nHe's everything I shouldn't want. A former Marine involved in illegal fighting with a quick trigger temper and an easy smile for all the women. His fists aren't the danger to me, though, it's his charm. He's sliding his way into my heart and I'm afraid that he's going to be the one to break me.\n\nImpulsive. Unthinking. Hot tempered. \n\nI allow instinct to rule my behavior. If it feels good, do it, has been my motto because if I spend too much time thinking, I'll begin to remember exactly where I came from. At Central College, I've got fighting and I've got women and I thought I was satisfied until I met her. \n\nShe's everything I didn't realize I wanted and the more time I spend with her, the more I want her. But she's been hurt too much in the past and I don't want to be the one to break her. I know I should walk away, but I just can't.\n\nBonus Content: Upon reaching the USA Today Bestselling milestone, I wrote a 10,000 word epilogue as a thank you to the readers who loved and supported Unspoken. I posted it for free on my blog but at the urging of readers, I have added it to the original version. \n\nNote: This is a New Adult Contemporary Romance with mature content and sexually explicit scenes. 91,000+ words. Standalone novel.\n\n&quot;A sexy and sinful new adult read you don't want to miss!&quot; - NYTimes Bestselling Author Katy Evans\n\n&quot;This is a lovely story of two damaged but strong individuals. Their union is an example of opposites attracting and at the same time, perfecting the other.&quot; - Gloria H\n\n&quot;I love these strong characters. There are no weak wimpy girls or stupid cruel idiot guys. There are strong damaged characters that heal themselves and the people who love them.&quot; Sizzling Pages Romance Reviews","torrent":{"xt":"urn:btih:44df27693ad4bfd03d994c212dcf2505fafc2f3c","amp;dn":"Unspoken+%28The+Woodlands%29+-Jen+Frederick+%5BePub%5D+-+Traitor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44df27693ad4bfd03d994c212dcf2505fafc2f3c","infoHashBuffer":{"type":"Buffer","data":[68,223,39,105,58,212,191,208,61,153,76,33,45,207,37,5,250,252,47,60]},"announce":[],"urlList":[]}}