{"title":"Gay - Vintage French Porn - Les Gamins de Paris","uid":6024503,"size":901923484,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:45ff89717ac0fdbc862654d840bdb791471ac5df&amp;dn=Gay+-+Vintage+French+Porn+-+Les+Gamins+de+Paris&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"lionelboy","files":1,"time":1291891865,"description":"Les Gamins de Paris (1992). 85 min. One of Jean-Michel Cadinot \\'s classics, this film tells the story of a French schoolboy who runs off to Paris. The story is set in the 1940\\'s, so there\\'s pretty high production value for a porn, even decent music.\n\nPlot: On his way to school one day, Victor gets caught spying on his classmate Rene\\'s well-built older brother Maurice while he undresses. Maurice gets angry and forces the twinkish Victor to take a good pounding. The younger brother Rene walks in on them and joins in. When the two brothers eventually get distracted banging each other, Victor steals a large amount of money from their house and runs off to catch a freight train to Paris. On the train, Victor runs into Marcel, a brash drifter who forces himself on Victor and later robs him. Penniless in Paris, Victor seeks out his sister, a prostitute living with Robert, her handsome gigolo boyfriend. Robert takes an interest in Victor. In addition to being seduced by his sister\\'s boyfriend, Victor will encounter strange characters in Paris, such as a painter who exploits his male models and a gang of street urchins eager to make a quick dollar.\n\nThe file isn\\'t hi quality but it\\'s perfectly viewable. I recommend using the VLC player, which easily lets you adjust the aspect ratio to 4:3, otherwise the picture may look a bit stretched out.\n\n\ncover: http://bayimg.com/HabeeAadE\n\nscreens: http://www.pornlinkpro.com/files/gamins_de_paris2_789.jpg","torrent":{"xt":"urn:btih:45ff89717ac0fdbc862654d840bdb791471ac5df","amp;dn":"Gay+-+Vintage+French+Porn+-+Les+Gamins+de+Paris","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45ff89717ac0fdbc862654d840bdb791471ac5df","infoHashBuffer":{"type":"Buffer","data":[69,255,137,113,122,192,253,188,134,38,84,216,64,189,183,145,71,26,197,223]},"announce":[],"urlList":[]}}