{"title":"Richard Thompson...Sweet Warrior(2007)[FLAC]","uid":6987321,"size":582234465,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:461c08db2ff214276c156167ea49754fc6a47bde&amp;dn=Richard+Thompson...Sweet+Warrior%282007%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":42,"time":1327609442,"description":"[img]http://image.allmusic.com/00/amg/cov200/dri700/i747/i74771cr6v8.jpg[/img]\n[color=Green]Sweet Warrior[2007] Proper Sales &amp; Dist. 032 [/color] \n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n  1  Needle and Thread -Thompson 4:43 \n  2  I'll Never Give It Up -Thompson 3:22 \n  3  Take Care the Road You Choose -Thompson 6:44 \n  4  Mr. Stupid -Thompson 3:53 \n  5  Dad's Gonna Kill Me -Thompson 5:16 \n  6  Poppy-Red Thompson 4:37 \n  7  Bad Monkey -Thompson 5:13 \n  8  Francesca -Thompson 5:17 \n  9  Too Late to Come Fishing -Thompson 4:36 \n  10  Sneaky Boy -Thompson 2:59 \n  11  She Sang Angels to Rest -Thompson 3:25 \n  12  Johnny's Far Away -Thompson 4:53 \n  13  Guns Are the Tongues -Thompson 7:27 \n  14  Sunset Song -Thompson 5:38 \n\nAfter being given his walking papers by Capitol Records in 2000, Richard Thompson has taken a modest approach to his subsequent studio releases, 2003's The Old Kit Bag (a purposefully spare trio set) and 2005's Front Parlour Ballads (an acoustic collection recorded in Thompson's home studio). But Thompson seems to have relaxed a bit with 2007's Sweet Warrior, which boasts a more expansive sound and ambitious reach than those two albums. Produced by Thompson with his longtime aide de camp Simon Tassano, Sweet Warrior more clearly recalls 1991's Rumor and Sigh than any of Thompson's other albums; it lacks the high gloss of Mitchell Froom's production on that disc, but the broad dynamic between upbeat and dour numbers and the thematic sweep of these 14 songs certainly suggest Thompson was thinking big while making this album, and it suits him. Thompson is able to play his traditional theme of romance on the rocks for laughs on this set with the witty &quot;Needle and Thread&quot; and the droll but pointed &quot;Mr. Stupid,&quot; while the sax-infused &quot;Bad Monkey&quot; is downright rollicking and the ska-influenced offbeat of &quot;Francesca&quot; is slinky and sensual. At the same time, Thompson digs deep into more serious themes, especially on the striking &quot;Dad's Gonna Kill Me,&quot; a tense first-person tale of a soldier on patrol in Iraq, and while a very different sort of combat frames &quot;Guns Are the Tongues,&quot; its story of a dull-witted boy turned against his own interests is equally compelling; both songs show Thompson's narrative skill and gift for wordplay are as strong as ever. Producer Thompson gives guitarist Thompson just the right amount of room to show off his estimable skills on these sessions, and the core band -- bassists Danny Thompson and Taras Prodaniuk, drummer Michael Jerome, and rhythm guitarist Michael Hays -- is as strong and versatile as one could hope for. At 68 minutes, Sweet Warrior feels just a bit overstuffed, especially given the simplicity of its immediate predecessors, but there's a hefty portion of fine songs and masterful playing here, and no one who has ever succumbed to Richard Thompson's magic should pass this up. \n\ncd ripped by EAC\n\nplease seed\n\n[url]http://dickthespic.org/2010/11/20/richard-thompson/[/url]","torrent":{"xt":"urn:btih:461c08db2ff214276c156167ea49754fc6a47bde","amp;dn":"Richard+Thompson...Sweet+Warrior%282007%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"461c08db2ff214276c156167ea49754fc6a47bde","infoHashBuffer":{"type":"Buffer","data":[70,28,8,219,47,242,20,39,108,21,97,103,234,73,117,79,198,164,123,222]},"announce":[],"urlList":[]}}