{"title":"Live on Broadway - The Man Who Came to Dinner - Nathan Lane come","uid":4285211,"size":1466036240,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:464f7e7978714e82adf5af23735416bb1c116551&amp;dn=Live+on+Broadway+-+The+Man+Who+Came+to+Dinner+-+Nathan+Lane+come&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"rambam1776","files":2,"time":1215650837,"description":"Live on Broadway - The Man Who Came to Dinner - Nathan Lane comedy\n\nStarring: Nathan Lane, Jean Smart  \n &lt;a href=&quot;\nhttp://www.amazon.com/Man-Who-Came-Dinner/dp/B00008975C/ref=pd_bbs_sr_2?ie=UTF8&amp;s=dvd&amp;qid=1215642386&amp;sr=8-2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Man-Who-Came-Dinner/dp/B00008975C/ref=pd_bbs_sr_2?ie=UTF8&amp;s=dvd&amp;qid=1215642386&amp;sr=8-2&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0259419/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0259419/&lt;/a&gt;\n\nEditorial Reviews\n\nAmazon.com\nNathan Lane practically explodes with bile as Sheridan Whiteside, a tyrannical radio celebrity who has been trapped in a Midwestern household by an injured hip. Whiteside rails entertainingly at the quavering family he&amp;#039;s stuck with, but the play really kicks into motion when Whiteside&amp;#039;s secretary, the only person who can stand to work with him, falls in love with a local newspaperman, forcing Whiteside to hatch a scheme to keep her by his side. Expertly crafted by Moss Hart and George S. Kaufman, The Man Who Came to Dinner zooms along. Lane (The Birdcage, Mouse Hunt) plays the part with his personality cranked up to 11--he rattles off each sneering barb with acid bombast. The production was originally broadcast live from Broadway, which gives it a genuine crackle of energy. Natasha Richardson and Liam Neeson act as hosts, providing some historical background to this classic comedy. --Bret Fetzer \n\nProduct Description\nOne of the most beloved American comedies comes to sparkling life in this fast-paced, stylish production starring Tony Award-winning Broadway favorite Nathan Lane (The Producers) and Jean Smart (&quot;Designing Women&quot;)! While dining at the midwestern home of the prominent Stanley family, noted critic and social celebrity Sheridan Whiteside slips on their doorstep and injures his hip, leaving the city slicker confined to the house for an outrageous six week recovery period which leads to cockroach farms, an octopus in the cellar, a dinner party with ex-convicts, &quot;The Penguin&quot; and more madcap mayhem! Written by the classic comedy team of Moss Hart and George S. Kaufman, this razor sharp farce remains pointed and side-splitting today. Pull up a few extra chairs and invite some guests for dinner and a show; the fun is about to begin! ","torrent":{"xt":"urn:btih:464f7e7978714e82adf5af23735416bb1c116551","amp;dn":"Live+on+Broadway+-+The+Man+Who+Came+to+Dinner+-+Nathan+Lane+come","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"464f7e7978714e82adf5af23735416bb1c116551","infoHashBuffer":{"type":"Buffer","data":[70,79,126,121,120,113,78,130,173,245,175,35,115,84,22,187,28,17,101,81]},"announce":[],"urlList":[]}}