{"title":"Georgia Ruth - Week Of Pines [2013][FLAC / WEB]","uid":8933173,"size":288949411,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:467559082bdf4c3aaee6fab8bb6e49dfadd173e5&amp;dn=Georgia+Ruth+-+Week+Of+Pines+%5B2013%5D%5BFLAC+%2F+WEB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":13,"time":1379500022,"description":"Artist:Georgia Ruth\nRelease:Week Of Pines\nReleased: 2013\nLabel:Gwymon\nCatalog#: \nFormat: FLAC / Lossless\nCountry: UK\nStyle:folk\n\n01 - Week of Pines [05:48]\n02 - Codi Angor [03:23]\n03 - Mapping [05:19]\n04 - Hallt [05:39]\n05 - Dovecote [04:17]\n06 - Seeing You Around [04:15]\n07 - Old Blue [04:41]\n08 - Etrai [04:26]\n09 - In Luna [05:01]\n10 - A Slow Parade [05:43]\n11 - Winter [05:54]\n\nRaised bilingually in Aberystwyth, West Wales, Georgia's haunting voice has earned her favourable comparisons with the melancholy folk sirens of the late 60s. Her unusual fingerpicking style of playing the harp was inspired more by the guitar on Bert Jansch, Meic Stevens and old folk revivalist records than by the classical method she was taught as a child. Yet 'Week of Pines' is not just a tribute to these. Inspired by a recent return to Wales, following time living in Brighton and London, the album represents something of a homecoming trajectory for Georgia. From the motorik drive of the title track, to the darker Eno-like string arrangements, the stark joyfulness of a Welsh sea shanty accompanied by wheezing reed organ, or the more wistful folk ballads: this is a varied and intriguing collection of songs. &quot;Having grown up with dad's Merchant Navy sea stories (he once met Jacques Cousteau onboard the Calypso), a sea shanty was somewhat inevitable&quot;. This one, 'Codi Angor', was popular amongst the Welsh sailors in the Liverpool docks and if the album is a homecoming of sorts, this conveys the opposite: the excitement of leaving, of sailing out to sea. 'Dovecote' - with its clanging bells and mists - maintains the theme, but on a more abstract level: this is the leaving of old love. 'Old Blue' is the Appalachian song, included in Harry Smith's anthology, made popular by Joan Baez. 'Winter', with its slow-march rhythm and redemptive lyrics, brings the album to a fitting close. &quot;Week of Pines is a record about joyfulness. And coming home. And reclaiming things presumed gone. And grace, after making mistakes. That element of forgiveness and calm has been integral to this record&quot;. The album was recorded and produced by David Wrench over six days last August at Snowdonia's Bryn Derwen studios. Her band features members of acclaimed country-folk outfit Cowbois Rhos Botwnnog and, for the album, includes a very special contribution from Lleuwen Steffan. Georgia regularly plays in ex- Gorky's Zygotic Monkey member Richard James' band and appears alongside him in his new project Pen Pastwn. She will also be appearing on the Guillemots' forthcoming album, having recorded parts for it in the summer of 2012. She has performed at Glastonbury, Green Man Festival, SWN and several other festivals. BBC Radio Wales' Adam Walton described her as &quot;one of the most prodigious talents ever to grace my airwaves&quot;.","torrent":{"xt":"urn:btih:467559082bdf4c3aaee6fab8bb6e49dfadd173e5","amp;dn":"Georgia+Ruth+-+Week+Of+Pines+%5B2013%5D%5BFLAC+%2F+WEB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"467559082bdf4c3aaee6fab8bb6e49dfadd173e5","infoHashBuffer":{"type":"Buffer","data":[70,117,89,8,43,223,76,58,174,230,250,184,187,110,73,223,173,209,115,229]},"announce":[],"urlList":[]}}