{"title":"U2 - Achtung Baby","uid":6954802,"size":82441881,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:46e00a4fb09a89fd33fec4a47628b73db65190b4&amp;dn=U2+-+Achtung+Baby&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mikayex","files":12,"time":1326500670,"description":"1)&quot;Zoo Station&quot; 4:36\n2)&quot;Even Better Than the Real Thing&quot; 3:41\n3)&quot;One&quot; 4:36\n4)&quot;Until the End of the World&quot; 4:39\n5)&quot;Who's Gonna Ride Your Wild Horses&quot; 5:16\n6)&quot;So Cruel&quot; 5:49\n7)&quot;The Fly&quot; 4:29\n8)&quot;Mysterious Ways&quot; 4:04\n9)&quot;Tryin' to Throw Your Arms Around the World&quot; 3:53\n10)&quot;Ultraviolet (Light My Way)&quot; 5:31\n11)&quot;Acrobat&quot; 4:30\n12)&quot;Love Is Blindness&quot; 4:23\n\nTotal length: 55:27\n\n\nAchtung Baby is the seventh studio album by Irish rock band U2. It was produced by Daniel Lanois and Brian Eno, and was released on 19 November 1991 on Island Records. Stung by the criticism of their 1988 release Rattle and Hum, U2 shifted their musical direction to incorporate alternative rock, industrial, and electronic dance music influences into their sound. Thematically, the album is darker, more introspective, and at times more flippant than their previous work. Achtung Baby and the subsequent multimedia-intensive Zoo TV Tour were central to the group's 1990s reinvention, which replaced their earnest public image with a more lighthearted and self-deprecating one.\nSeeking inspiration on the eve of German reunification, U2 began recording Achtung Baby at Berlin's Hansa Studios in October 1990. The sessions were fraught with conflict, as the band argued over their musical direction and the quality of their material. After tensions and slow progress nearly prompted the group to break up, they made a breakthrough with the improvised writing of the song &quot;One&quot;. Morale improved during subsequent recording sessions in Dublin throughout 1991 to complete the album. To confound the public's expectations of the band and their music, U2 chose the record's facetious title and colourful multi-image sleeve.\nAchtung Baby is one of U2's most successful records. It received favourable reviews and debuted at number one on the US Billboard 200 Top Albums, while topping the charts in many other countries. Five songs were released as commercial singles, all of which were chart successes, including &quot;One&quot;, &quot;Mysterious Ways&quot;, and &quot;The Fly&quot;. The album has sold 18 million copies worldwide and won a Grammy Award in 1993 for Best Rock Performance by a Duo or Group with Vocal. One of the most acclaimed records of the 1990s, Achtung Baby has regularly been featured on critics' lists of the greatest albums of all time. The record was reissued in October 2011 to commemorate the 20th anniversary of its original release.","torrent":{"xt":"urn:btih:46e00a4fb09a89fd33fec4a47628b73db65190b4","amp;dn":"U2+-+Achtung+Baby","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46e00a4fb09a89fd33fec4a47628b73db65190b4","infoHashBuffer":{"type":"Buffer","data":[70,224,10,79,176,154,137,253,51,254,196,164,118,40,183,61,182,81,144,180]},"announce":[],"urlList":[]}}