{"title":"Double Trouble - 'Been A Long Time' [320k MP3]","uid":4738357,"size":104045252,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:46f7a415ffe0a6f7220f0eaaabfb242bc8a46e68&amp;dn=Double+Trouble+-+%5C%27Been+A+Long+Time%5C%27+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"smbdownload","files":-1,"time":1235419017,"description":"Double Trouble without Stevie Ray Vaughan? Drummer Chris Layton and bassist Tommy Shannon get by with a little help from their friends, on an album of musical depth that will surprise skeptics and delight fans. Amid the varied shades of blue, highlights find the ace rhythm section reuniting with former Arc Angels bandmates Charlie Sexton and Doyle Bramhall II, Storyville singer Malford Milligan, and Stevie's brother, Jimmie Vaughan. There are passing-the-torch contributions from Jonny Lang, Kenny Wayne Shepherd, and Susan Tedeschi (the latter two on a thunderous revival of Led Zeppelin's &quot;Rock and Roll&quot;). But it's Bramhall's power-trio transformation of Muddy Waters's &quot;She's Alright&quot; that evokes the strongest memories of Stevie. The album ends in expansively sophisticated fashion, with Dr. John, guitarist Willie Nelson, and a string section on &quot;Baby, There's No One Like You,&quot; one of the four songs cowritten by Layton and Shannon.\n\nBeen A Long Time [320k MP3]\n\n01. Cry Sky \n02. Turn Toward the Mirror \n03. Say One Thing \n04. Rock and Roll \n05. Ground Hog Day \n06. In the Middle of the Night  \n07. She's Alright \n08. In the Garden \n09. Skyscraper \n10. Baby, There's No One Like You \n\n----------------------------------------------------------------------------------\n\nAbout the Artist:\n\nChris Layton and Tommy Shannon, aka Double Trouble, are without question two of the most respected musicians performing today. Together, they are regarded as the world's premiere blues/rock/r&amp;b rhythm section; their rock-of-Gibraltar groove has been the driving force behind a venerable Who's Who of the contemporary blues scene, recording and appearing with such artists as Jimmie Vaughan, Bonnie Raitt, Eric Clapton, B.B. King, Buddy Guy, Robert Cray, Susan Tedeschi, Jonny Lang, Kenny Wayne Shepherd, the Arc Angels, Eric Johnson and Storyville, among many others. \nBut Chris and Tommy are, of course, best known for their relationship with legendary blues guitarist Stevie Ray Vaughan, a relationship of nearly mythic in proportion. The essential recordings of Stevie Ray Vaughan and Double Trouble set the standard for the modern blues sound, and the band's immense influence on blues and rock musicians the world over only continues to grow. SRV &amp; DT scored four Grammies ('84 Best Traditional Blues Recording: Blues Explosion [&quot;Flood Down in Texas&quot;]; '89 Best Contemporary Blues Record: In Step; '92 Best Contemporary Blues Album: The Sky is Crying; '92 Best Instrumental Rock Performance: &quot;Little Wing&quot;), plus eight additional Grammy nominations, and nearly all of their releases have attained multi-platinum status. \n\nIn the 10 years since Stevie's tragic, untimely passing, it is clear that the incendiary recordings of SRV &amp; DT have served as the catalyst for the current resurgence in blues and blues/rock. Unwilling to rest on their laurels, Double Trouble continues to perform and record with the vitality and effortless precision for which they are known. Through their high-profile associations, Double Trouble's musical signature, undeniably powerful and true, has earned them a devoted worldwide fanbase in the millions. Which brings us to this, the long-awaited Been A Long Time album. \n\n\n","torrent":{"xt":"urn:btih:46f7a415ffe0a6f7220f0eaaabfb242bc8a46e68","amp;dn":"Double+Trouble+-+%5C%27Been+A+Long+Time%5C%27+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46f7a415ffe0a6f7220f0eaaabfb242bc8a46e68","infoHashBuffer":{"type":"Buffer","data":[70,247,164,21,255,224,166,247,34,15,14,170,171,251,36,43,200,164,110,104]},"announce":[],"urlList":[]}}