{"title":"A Cancao de Lisboa [A Song of Lisbon][Portugal][1933]","uid":4815409,"size":736684898,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4733f4a5e68c731ac31e58aed6ccd9dc3def4d04&amp;dn=A+Cancao+de+Lisboa+%5BA+Song+of+Lisbon%5D%5BPortugal%5D%5B1933%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"assuriano","files":1,"time":1238524358,"description":"1933 portuguese comedy that set the trend that haunted portugal for next three decades...this one is still a good laugh and worth watching. Featuring the mighty Beatriz Costa as well as Vasco Santana, AntÃƒÂ³nio Silva and even a young Manoel de Oliveira...\n\nfrom imdb.com:\n&quot;This movie is surely one of the most delicious movies I've ever seen. It's simple, funny, naÃƒÂ¯f, and intelligent. It reflects some of the most important factors of the portuguese student. Vasco LeitÃƒÂ£o is a medicine student in Lisbon (in the old Faculty of Campo de Santana, that still exists), living from the money that his old aunts from the country-side, send him, thinking he is an example of dignity and science. Though the young student, is more like a bohemian, who likes to dance, drink, and flirt young girls. Sudden he is thrown out of the room he rented, the aunts decide to come to Lisbon, and he fails to achieve the degree. The student tries, to illude his aunts by telling them he is already a doctor, but they discover the trick, and cut the funds from wich he was living. A rich friend of his(Carlos, played by Manoel de Oliveira, the director), gets him a job singing fado. The movie ends with his marriage, already a doctor and in peace with everybody. This movie is the classic &quot;it all ends up well&quot;, and it's a marvelous metaphor of the portuguese society of th 1930's, that wasn't that happy.&quot;\n\nWITH ENGLISH SUBTITLES","torrent":{"xt":"urn:btih:4733f4a5e68c731ac31e58aed6ccd9dc3def4d04","amp;dn":"A+Cancao+de+Lisboa+%5BA+Song+of+Lisbon%5D%5BPortugal%5D%5B1933%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4733f4a5e68c731ac31e58aed6ccd9dc3def4d04","infoHashBuffer":{"type":"Buffer","data":[71,51,244,165,230,140,115,26,195,30,88,174,214,204,217,220,61,239,77,4]},"announce":[],"urlList":[]}}