{"title":"Dexter Season 1 Complete DVDRip x264","uid":5519151,"size":2202803341,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:475c2f69b3b39a9dc6ef7853e1d08ede74b21cb5&amp;dn=Dexter+Season+1+Complete+DVDRip+x264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":".BONE.","files":24,"time":1272402531,"description":"1. What is x264?\n\n\nx264 is an open-source encoder for the H.264 codec used for High-Definition movies on HD-DVDs and Blu-Ray Discs. It has a high compression which is way superior to xvid. That means you get more quality at equal bitrates. A 700MB x264 rip will be sharper and more detailed than a 700MB xvid rip from the same source. x264 is the future in DVDrips!\n\n02. What is a .mkv file?\n\n\nMKV means &quot;matroska video&quot; and it is a &quot;extensible open standard Audio/Video container&quot; (AVI is a container, too!). This file format combines several videostreams, audiostreams, subtitles, chapters and information in only one file. It supports new standards like 6-channel AAC (Advanced Audio Coding) audio or x264 video.\n\n\n\n101 Dexter 10/01/06\n\nWhen Miami blood spatter expert Dexter Morgan is not out solving murders, he's a serial killer out committing them. But Dexter's world is shaken when another serial killer commits a riveting series of perfect slayings.\nIGN Rating: 9 - Read the Review\n\n\n102 Crocodile 10/08/06\n\nIn the midst of preparing for his next victim, Dexter is thrust into turmoil when the other serial killer, dubbed the Ice Truck Killer, privately informs him that he knows Dexter's morbid secret.\nIGN Rating: 7.8 - Read the Review\n\n\n103 The Popping Cherry 10/15/06\n\nWhile trailing a recently released murderer with plans to kill again, Dexter is gripped by the latest crime of the Ice Truck Killer, a chopped-up hooker discovered in a pro-hockey ice rink.\nIGN Rating: 8 - Read the Review\n\n\n104 Let's Give The Boy A Hand 10/22/06\n\nDexter is intrigued when the Ice Truck Killer starts leaving pictures from Dexter's childhood at the crime scenes containing body parts left in horrific tableaus meant to tell Dexter something about his own past.\nIGN Rating: 9 - Read the Review\n\n\n105 Love American Style 10/29/06\n\nThe Homicide division is abuzz after the Ice Truck Killer's latest victim is found alive, while Dexter stalks a murderous human trafficker.\nIGN Rating: 9 - Read the Review\n\n\n106 Return To Sender 11/05/06\n\nThe Ice Truck Killer leaves Dexter a surprise at the scene of one of Dexter's recent kills, putting Dexter firmly in the crosshairs of his own Homicide Division.\nIGN Rating: 7.8 - Read the Review\n\n\n107 Circle of Friends 11/12/06\n\nThe Ice Truck Killer's identity is revealed, but something about him doesn't sit right with Dexter.\nIGN Rating: 9.3 - Read the Review\n\n\n108 Shrink Wrap 11/19/06\n\nWhen the 'suicide' of a powerful, high profile woman reveals a strange pattern of murders, Dexter stalks a killer unlike any he's had to deal with before.\nIGN Rating: 8.8 - Read the Review\n\n\n109 Father Knows Best 11/26/06\n\nRita, Debra and Rudy join Dexter for a weekend away when Dexter finds out that his biological father, whom Dexter thought had died 30 years ago, has just recently passed away and left him his all his belongings...and his house.\nIGN Rating: 8.2 - Read the Review\n\n\n110 Seeing Red 12/03/06\n\nThe Ice Truck Killer leaves Dexter the most horrifying crime scene imaginable, forcing him to confront the demons from his past.\nIGN Rating: 9 - Read the Review\n\n\n\n111 Truth Be Told 12/10/06\n\nThe Ice Truck Killer kidnaps someone very close to Dexter, forcing Dexter to play a deadly game of hide-and-seek.\nIGN Rating: 9.2 - Read the Review\n\n\n112 Born Free 12/17/06\n\nDexter and the Ice Truck Killer have a final confrontation.\nIGN Rating: 9.5 - Read the Review ","torrent":{"xt":"urn:btih:475c2f69b3b39a9dc6ef7853e1d08ede74b21cb5","amp;dn":"Dexter+Season+1+Complete+DVDRip+x264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"475c2f69b3b39a9dc6ef7853e1d08ede74b21cb5","infoHashBuffer":{"type":"Buffer","data":[71,92,47,105,179,179,154,157,198,239,120,83,225,208,142,222,116,178,28,181]},"announce":[],"urlList":[]}}