{"title":"Sonny Rollins - Volume 1 (1956) 2013 HDTracks 24-192-FLAC","uid":11194659,"size":1382938092,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:478d08f849d1c8f6b844237ed6975c39c4de1efe&amp;dn=Sonny+Rollins+-+Volume+1+%281956%29+2013+HDTracks+24-192-FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"hal4000","files":-1,"time":1413065202,"description":"Theodore Walter &quot;Sonny&quot; Rollins (born September 7, 1930) is an American jazz tenor saxophonist. Rollins is widely recognized as one of the most important and influential jazz musicians. A number of his compositions, including &quot;St. Thomas&quot;, &quot;Oleo&quot;, &quot;Doxy&quot;, and &quot;Airegin&quot;, have become jazz standards.\nRollins was born in New York City, to parents who were born in the United States Virgin Islands. Rollins received his first saxophone at age 13. He attended Benjamin Franklin High School in East Harlem. He said that a concert by Frank Sinatra there, accompanied by a plea for racial harmony, changed his life.\nRollins started as a pianist, changed to alto saxophone, and finally switched to tenor in 1946. During his high-school years, he played in a band with other future jazz legends Jackie McLean, Kenny Drew and Art Taylor. He was first recorded in 1949 with Babs Gonzales (J. J. Johnson was the arranger of the group). In his recordings through 1954, he played with performers such as Miles Davis, Charlie Parker and Thelonious Monk.\n\nAfter several incredible dates for Prestige, Rollins moved over to Blue Note to cut a series of studio and live recordings; while not as groundbreaking as his earlier work, the albums still stand out among the many hard bop releases of the day. Upon listening to this, his fine debut for the label, not to mention classics like Saxophone Colossus and Sonny Rollins Plus Four, one almost takes for granted the tenor giant's ability to reel off a nonstop flow of breathtaking solo lines while keeping an overall thematic structure intact. And even though it's not as classic sounding as other Blue Note titles like Vol. 2 or Newk's Time, Sonny Rollins, Vol. 1 will satisfy Rollins fans comfortable with a mostly loose and free-flowing set; the hard-swinging originals &quot;Bluesnote&quot; and &quot;Sonnysphere&quot; certainly fit the bill, while the loping blues &quot;Decision&quot; and easy swinger &quot;Plain Jane&quot; up the ante with fetching head statements. Topping things off, Rollins includes one of his singular Broadway song interpretations with the Finian's Rainbow ballad &quot;How Are Things in Glocca Mora.&quot; Figuring prominently in the proceedings are veteran bassist Gene Ramey, longtime drummer Max Roach, and then up-and-coming hard bop stars trumpeter Donald Byrd and pianist Wynton Kelly. Maybe not a first-choice disc for Rollins newcomers, but certainly an essential title down the line.\n\nHDTracks PCM-24Bit-192Khz-FLAC","torrent":{"xt":"urn:btih:478d08f849d1c8f6b844237ed6975c39c4de1efe","amp;dn":"Sonny+Rollins+-+Volume+1+%281956%29+2013+HDTracks+24-192-FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"478d08f849d1c8f6b844237ed6975c39c4de1efe","infoHashBuffer":{"type":"Buffer","data":[71,141,8,248,73,209,200,246,184,68,35,126,214,151,92,57,196,222,30,254]},"announce":[],"urlList":[]}}