{"title":"Sklar - The Nazis and the Occult (1989)","uid":6183984,"size":809418,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4792110b8aab8f2b4756c94950e476913b512a63&amp;dn=Sklar+-+The+Nazis+and+the+Occult+%281989%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"red_gonzo","files":1,"time":1298054590,"description":"This is D. Sklar's amazing book The Nazis and the Occult (1989) which traces the link between the mysticism of the nineteenth and early twentieth centuries and the Nazi movement. Overlapping memberships in mystical societies strengthened political alliances. The rituals, symbols, and attitudes - including virulent anti-Semitism - foreshadowed in astonishing and horrifying detail the language, thoughts, and deeds of der Fuhrer. The Nazis had their roots in an occult sect which believed that the racial struggle between the &quot;pure&quot; Aryan and the &quot;subhuman&quot; Jew was really an ancient supernatural contest between gods and beasts. Going beyond an analysis of the evolution of German Nazism, Sklar warns us about the threat of contemporary fanaticism. She sees in movements like Sun-Myung Moon's Unification Church, L. Ron Hubbard's Scientology, and Werner Erhard's est many of the same elements which linked Germany's occult societies and the Nazi party: unquestioning obedience to a messianic leader, secrecy, loyalty to the group above all else, a belief in the &quot;special&quot; powers of members, and ritualistic initiation ceremonies. The Nazis and the Occult provides a ground-breaking perspective on a fearful historical phenomenon in the light of today's problems. It shows the attraction to occultism in a time of alienation and impotence and warns of the dangers inherent in movements which replace individual conscience with obedience to a leader. 180 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:4792110b8aab8f2b4756c94950e476913b512a63","amp;dn":"Sklar+-+The+Nazis+and+the+Occult+%281989%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4792110b8aab8f2b4756c94950e476913b512a63","infoHashBuffer":{"type":"Buffer","data":[71,146,17,11,138,171,143,43,71,86,201,73,80,228,118,145,59,81,42,99]},"announce":[],"urlList":[]}}