{"title":"Amiga Demobase V3","uid":8176696,"size":11988844634,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:47a57167dae82363f12fe82f492023130f0b016a&amp;dn=Amiga+Demobase+V3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KixxCC","files":58,"time":1361545644,"description":"=====\nMessage from uploader:\n&quot;I will seed this alone for two weeks and then I am getting another broadband connection. I hope we will have seeders by that time. If not I will of course continue when I've got an up and ready broadband connection again.&quot;\n=====\n\n\nWelcome to the Final release of Demobase Amiga!.\n\nThis is the third release of the biggest Amiga demo database.\n\nSince the V2 release the following things have been added :-\n\nHDF demos - almost 1200 - most of them are actual HD demos, the rest are demos that need certain libs so this is the way to get them to work !\nWHDLoad demos  - What can i say ? These HAVE to be a part of this demobase, 347 demos added. Just a very few not working.\n\nFloppy demos, sorted in AGA, OCS and ECS. \n\nThe Only View i did not completey redo is the OCS section, so the floppy swap info and or multiple floppy settings are not verified and or finished.\nWhen you find OCS demos that do NOT work please contact me so i can fix that in the master database, thanks very much !\n\nA MASSIVE total of 20000+ configured demos, including Group and year info.\n\nI have done a major cleanup and many things have been improved.\n\nFor the HD demos i have created a Workbench 3.1 HDF and for every demo i have created a seperate HDF.\nSo when you select a HDF demo, you will enter Workbench screen with 3 Icons.\nRAM Disk, Demo Name HDF and WB 3.1.\nJust double click on the Demoname HDF, then click on the demo icon to start the demo.\nWhen there is more than one file on the demo HDF, i have specified the file to run on the version tab in Gamebase.\n\nPLEASE NOTE:\nThe Workbench.HDF, Kickstart ROMs, WHDLoad and WinUAE are NOT included and must be dowloaded seperately for the Demobase to work.\nYou can download them in this separate emulator package.\n\n\nThe Demobase scripts are configured to work with WinUAE v2.3.1.\nOlder versions of the emulator will probabaly not work correctly, but newer versions should be ok (fingers crossed).\n\nMy thanks go out to...\n\nJimbo (Gamebase)\nTony Willen (WinUAE)\nAll the fellas from Bitworld (the best Amiga demo archive online)\nGalahad ,Retroplay and Stingray for fixing a few WHDLoad Demos.\n\nBIG thanks goes out to .mad. for helping me with so many things.\n\nThis project has cost me years of my life, so i hope you all like it.\nI have now stopped working on this mega project.\n\nPlease remember that this project is never finished and maybe there will be some small things i forgot.\n\nIf you download this from UG and would like to give thanks, a small donation of upload credit would be very much appreciated,\nso i can enjoy some of the goodies in the coming years.\n\nAs a BONUS i have added some videos from some AGA and PPC demos i could not get to work.\n\nENJOY ! I wish you all the best.........\n\nSjakie43 (Dirk)\n","torrent":{"xt":"urn:btih:47a57167dae82363f12fe82f492023130f0b016a","amp;dn":"Amiga+Demobase+V3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47a57167dae82363f12fe82f492023130f0b016a","infoHashBuffer":{"type":"Buffer","data":[71,165,113,103,218,232,35,99,241,47,232,47,73,32,35,19,15,11,1,106]},"announce":[],"urlList":[]}}