{"title":"A Brief History of Disbelief  (BBC - Complete Series)","uid":5065243,"size":1674343187,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:47f3f1f80122cbf8f2203eb4974b85cd9ff9b5d4&amp;dn=A+Brief+History+of+Disbelief++%28BBC+-+Complete+Series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eddie1969","files":5,"time":1250983050,"description":"TV : Documentary : TV quality : English\n\n\n\nJonathan Miller's Brief History of Disbelief\nFirst broadcast BBC-4 October 2004\nThis capture from a re-broadcast on BBC-2 October 2005\n\n\nIn this first ever television history of disbelief, Jonathan Miller goes on a journey exploring the origins of his own lack of belief and uncovering the hidden story of atheism. If you thought that atheism was invented by Richard Dawkins then this is for you!\n\n\n1of3 - Shadows of Doubt\nJonathan Miller visits the absent Twin Towers to consider the religious implications of 9/11 and meets Arthur Miller and the philosopher Colin McGinn. He searches for evidence of the first 'unbelievers' in Ancient Greece and examines some of the modern theories around why people have always tended to believe in mythology and magic.\n\n\n2of3 - Noughts and Crosses\nJonathan Miller examines the religious imagery that dominated the medieval mind and investigates the role that the emerging science of men like Copernicus, Vesalius and Galileo had upon Christianity. Such was the power of the church, however, that it was not until the late 18th century in France that confident modern atheism finally emerged.\n\nWith the domination of Christianity from 500 AD, he wonders how disbelief began to re-emerge in the 15th and 16th centuries. He discovers that division within the Church played a more powerful role than the scientific discoveries of the period. He also visits Paris, the home of the 18th century atheist, Baron D'Holbach, and shows how politically dangerous it was to undermine the religious faith of the masses.\n\n\n3of3 - The Final Hour\nOnce atheism emerged, it began to challenge the moral authority of both the Church and the State. Religious doubt inspired the American War of Independence and the French Revolution, while in England the growing campaign for the rights of the working class was led by radical atheist reformers whose work helped to give birth to Socialism.\n\nThe history of disbelief continues with the ideas of self-taught philosopher Thomas Paine, the revolutionary studies of geology and the evolutionary theories of Darwin. Jonathan Miller looks at the Freudian view that religion is a 'thought disorder'. He also examines his motivation behind making the series touching on the issues of death and the religious fanaticism of the 21st century.\n\n\nFile Specs:\nVideo: XviD 2 Pass, 704x384, approx 1100kb/s\nAudio: VBR MP3, Lame --preset standard, approx 150kb/s\nSource: DVB-T\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:47f3f1f80122cbf8f2203eb4974b85cd9ff9b5d4","amp;dn":"A+Brief+History+of+Disbelief++%28BBC+-+Complete+Series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47f3f1f80122cbf8f2203eb4974b85cd9ff9b5d4","infoHashBuffer":{"type":"Buffer","data":[71,243,241,248,1,34,203,248,242,32,62,180,151,75,133,205,159,249,181,212]},"announce":[],"urlList":[]}}