{"title":"David Guetta feat. Chris Willis,Fergie-Gettin' Over You(Xvid-2n","uid":5980469,"size":88340362,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:48155410a733b6ff8255bc4a2c2f6c7b5336b62b&amp;dn=David+Guetta+feat.+Chris+Willis%2CFergie-Gettin%5C%27+Over+You%28Xvid-2n&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1290576601,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:03:07\n\n[Video]\nResolution : 600x360\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 3650 Kbps\nQuality Factor : 0.58 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nDavid Guetta feat. Chris Willis, Fergie &amp; LMFAO - Gettin' Over You (Xvid-2nafish)\n\n\nThis video has no logos or titles.\n\n\n&quot;Gettin' Over&quot; is a song by French disc jockey David Guetta and American singer Chris Willis from Guetta's fourth studio album One Love. A remix titled &quot;Gettin' Over You&quot; with additional vocals by Fergie and LMFAO was released as the album's fifth single on April 12, 2010. The song topped the charts in France, Scotland, the United Kingdom and United States. It reached top five positions in Italy, New Zealand, Austria, Ireland and Australia.\n\nThe music video began production on April 20, 2010 with Rich Lee who has in the past filmed videos for the Black Eyed Peas. The music video premiered on Tuesday, May 18, 2010. It features David Guetta, Chris Willis, Fergie and LMFAO all producing the song in a recording studio. The singers are all interrupted when a huge crowd of fans enter the studio to party. The singers are then forced to escape to the streets, where the party continues. The music video also features the Jabbawockeez, a dance crew.\n\nThe lyrics in &quot;Gettin' Over You&quot; are written by Chris Willis, will.i.am, Fergie and LMFAO. will.i.am. was originally intended to perform the vocals alongside Willis and Fergie but he was replaced by American duo LMFAO. In an interview with Digital Spy, David Guetta described the song as &quot;one of my more traditional guitar-sounding club tracks - in the vein of 'Love Is Gone'.&quot; He said since he refused to let Black Eyed Peas record the original version for their album The E.N.D., they decided to re-record the song with Fergie. Guetta explained, &quot;Even after I refused to let the Peas have it, Fergie was still saying, 'I love that track!' So I said, 'If you still want to do it, then we'll do it together'. I wanted to keep Chris Willis on there because I've been working with him since the beginning [...] He's the best singer on the planet.&quot;\n\nRed Foo from LMFAO told MTV News the concept the of song: &quot;You're in love with a girl and then you guys separate,&quot; he said, then joked, &quot;She probably got with Lil Jon or somebody,&quot; before continuing, &quot;So I'm gonna party 'til you come get me.&quot;\n\nRobert Copsey of Digital Spy gave the song three out of five stars. He felt that despite the song's &quot;pounding beats and jaggedy axe&quot; that &quot;LMFAO ruin[s] the breakdown, proving that too many cooks can spoil an otherwise tasty electro-housey broth.&quot; Chris Willis's vocal performance were praised by Entertainment Weekly stating: &quot;Willis has a pleasant rasp to his voice, and he guts this one out like the lives of millions of glowsticks hang in the balance&quot;. A reviewer from FemaleFirst' stated that &quot;Gettin' Over You&quot; is a &quot;huge summer anthem&quot; and gave it four out of five stars.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:48155410a733b6ff8255bc4a2c2f6c7b5336b62b","amp;dn":"David+Guetta+feat.+Chris+Willis%2CFergie-Gettin%5C%27+Over+You%28Xvid-2n","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48155410a733b6ff8255bc4a2c2f6c7b5336b62b","infoHashBuffer":{"type":"Buffer","data":[72,21,84,16,167,51,182,255,130,85,188,74,44,47,108,123,83,54,182,43]},"announce":[],"urlList":[]}}