{"title":"GusGus - Polydistortion [1997]","uid":9506864,"size":359023338,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:482dce35fccf283ccc4c24e0dd193a1fdc9ebb40&amp;dn=GusGus+-+Polydistortion+%5B1997%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GenXRock","files":-1,"time":1390331011,"description":"Review by Ned Raggett  [-]\nGus Gus' first formal album as a full band was a quietly astonishing record -- the &quot;new Sugarcubes&quot; tag which the band gained was always misleading, since instead of that group's fractured avant-rock approach, Gus Gus always tended toward a mix of understatement and chilling power. Also, the collective had its roots much more firmly planted in dance, but not merely modern techno -- everything from exotica (opening track &quot;Oh&quot; prominently samples Arthur Lyman) to grimy hip-hop breaks formed the basis of Polydistortion. Combined with the cool restraint that defines all the band's work, notably present in Daniel Agust and Siggi's almost unearthly calm (but never totally dispassionate) singing, the result is an effective blend of styles that works from start to end. Lead single &quot;Believe&quot; gathered and held the most attention, and for very good reason. The inspired choice of Kool &amp; the Gang's &quot;Jungle Jazz&quot; for the core rhythm sample was sharp enough, but with further arrangements contributing to the dark, glowering funk on display and Agust's subtle singing delivering either a vivid statement of religious commitment or a sly demolition of same, it becomes flat-out brilliant. No less brilliant lyrically and musically was &quot;Is Jesus Your Pal?,&quot; with Siggi's almost childlike vocal a hypnotizing call over minimal, gripping accompaniment. Not everything is quite so heavy, though -- &quot;Polyesterday,&quot; the other main single from the album, is a touch calmer, with Siggi's singing meshing with the jazz-funk of the track very well, if still cool all around the edges. Plenty of other strong tracks also appear, such as the gentle but no less compelling grooves of &quot;Cold Breath '79,&quot; Siggi's vocals softly wafting among the beats, or the extended jam &quot;Remembrance,&quot; both hot and cold at once. (4.5/5)","torrent":{"xt":"urn:btih:482dce35fccf283ccc4c24e0dd193a1fdc9ebb40","amp;dn":"GusGus+-+Polydistortion+%5B1997%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"482dce35fccf283ccc4c24e0dd193a1fdc9ebb40","infoHashBuffer":{"type":"Buffer","data":[72,45,206,53,252,207,40,60,204,76,36,224,221,25,58,31,220,158,187,64]},"announce":[],"urlList":[]}}