{"title":"Amadeus quartet Performs Haydn, Schubert, Brahms","uid":5184045,"size":1820048242,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:483ac900d0ad3226c8ff40487d6127d87fd25272&amp;dn=Amadeus+quartet+Performs+Haydn%2C+Schubert%2C+Brahms&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"crookt","files":80,"time":1259385513,"description":"Amadeus quartet Performs Haydn, Schubert, Brahms, 1951-57 [7 Disc Box Set]\n\n\nRelease Date: 2003\nTime 463:00\nLabel: DG Deutsche Grammophon[474730]\nGenre: Chamber\nAMG Album ID: W   115480\n\nReview\tby Blair Sanderson\n\nFormed by three Austrian immigrants and one youthful Londoner, the Amadeus Quartet came to prominence in postwar England. It excelled in the Classical repertoire, and its recordings in the 1950s were important contributions to the growing body of chamber music on the newly introduced LP. The process of recording on tape was a major improvement over the start-and-stop 78 rpm methods, and these clean and skillfully edited masters hold up quite well in the digital transfer. This seven-disc set follows Deutsche Grammophon's 2003 reissue of the quartet's early Mozart recordings, and covers works by Haydn, Schubert, Mendelssohn, and Brahms, thus giving a fuller representation of the group's prodigious output for Westminster and DG. The sound of the original analog reproduction is terrific, even though most of the recordings are mono and may sound slightly flat to contemporary ears. Yet there is still great sonic depth in these performances that is evident on attentive listening; the feeling that these are historic recordings rarely intrudes on one's enjoyment. The players are always engaged and emotionally charged, but they are particularly strong in the Schubert works, of which the String Quartet No. 15 and the &quot;Death and the Maiden&quot; Quartet are wonderfully rendered and recommended as good pieces to start with.","torrent":{"xt":"urn:btih:483ac900d0ad3226c8ff40487d6127d87fd25272","amp;dn":"Amadeus+quartet+Performs+Haydn%2C+Schubert%2C+Brahms","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"483ac900d0ad3226c8ff40487d6127d87fd25272","infoHashBuffer":{"type":"Buffer","data":[72,58,201,0,208,173,50,38,200,255,64,72,125,97,39,216,127,210,82,114]},"announce":[],"urlList":[]}}