{"title":"Lost_Land_of_the_Volcano-Complete-HDTV_720p-PAL_MP4-QuarterBall","uid":6124587,"size":3389362757,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:483c89d73e8cedb617852c39e554ce9e3a9a7c5c&amp;dn=Lost_Land_of_the_Volcano-Complete-HDTV_720p-PAL_MP4-QuarterBall&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"QuarterBall","files":-1,"time":1295889238,"description":"Lost Land of the Volcano (BBC HD)\n\nAir Date        : E1-08/09/2009, E2-15/09/2009, E3-22/09/2009\nRelease Date    : 24/01/2011\nSource          : HDTV\nGenre           : Documentary\n\nSeason #        : N/A\nEpisode #       : COMPLETE\nVideo Codec     : AVC\nVideo Container : MP4\nSize            : E1-1.06GB, E2-1.06GB, E3-1.02GB\nVideo Bitrate   : 2,542-2,585kbps\nAspect Ratio    : 16:9\nResolution      : 1280x720\nAudio Codec     : AAC\nAudio Bitrate   : Min-96kbps Max-96.5kbps\n\n\nEpisode Summaries\n\nEpisode 1:\n\nSeries combining stunning wildlife with high-octane adventure, as a team of scientists and wildlife filmmakers from the BBC's Natural History Unit explores one of the last great unspoilt jungle wildernesses on earth.\n\nNew Guinea is a rugged tropical island that is home to some of the strangest creatures on the planet. The team is based at the foot of Mount Bosavi, a giant extinct volcano covered in thick and largely unexplored rainforest. With the help of trackers from a remote tribe, they aim to search for the animals that live there - and they make amazing finds.\n\nWildlife cameraman Gordon Buchanan discovers the nest of the world's smallest parrot, insect expert Dr George McGavin finds a talking beetle, the scientists identify types of frog, gecko and bat that are completely new to science, and adventurer Steve Backshall has to live and sleep underground as he explores a cave system flooded with white water.\n\nThe cameras follow the team every sweaty step of the way as they search for the evidence that may help preserve this last great jungle forever.\n\nEpisode 2:\n\nThe second part of this exploration series combining stunning wildlife with high energy adventure.\n\nA team of scientists and wildlife filmmakers have made basecamp on a remote extinct volcano at the heart of the tropical island of New Guinea. Their aim is to search the thick jungle for the weird and endangered animals that hide there. Now they are pushing deeper into the rainforest, and cameraman Gordon Buchanan enlists the help of a tribe to find and film the extraordinary birds of paradise as they perform their bizarre courtship displays.\n\nGeorge MacGavin has to manhandle a giant crocodile, and Steve Backshall is living deep underground where he discovers a new cave system never seen by humans.\n\nEpisode 3:\n\nDocumentary series that combines remarkable wildlife discoveries with high action adventure.\n\nSteve Backshall heads a team descending into the crater of a giant extinct volcano covered in thick jungle. Deep in the heart of the remote island of New Guinea, this lost land is protected on all sides by fortress walls half a mile high. They are the first outsiders ever to penetrate this hidden world which biologists have long believed could be home to spectacular new creatures.\n\nGeorge McGavin travels east to an erupting volcano and discovers a rare bird that depends on the hot ash for its survival. Sudden explosions bring the trip to a quick halt as giant boulders crash into camp.\n\nThe series culminates in the lost world of the crater as Steve and wildlife cameraman Gordon Buchanan discover two large mammals that have no fear of people and are brand new species: a giant rat that is as big as a cat, and a cuscus, which is a tree-climbing marsupial.","torrent":{"xt":"urn:btih:483c89d73e8cedb617852c39e554ce9e3a9a7c5c","amp;dn":"Lost_Land_of_the_Volcano-Complete-HDTV_720p-PAL_MP4-QuarterBall","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"483c89d73e8cedb617852c39e554ce9e3a9a7c5c","infoHashBuffer":{"type":"Buffer","data":[72,60,137,215,62,140,237,182,23,133,44,57,229,84,206,158,58,154,124,92]},"announce":[],"urlList":[]}}