{"title":"Julianna Barwick - The Magiace 2011","uid":7011375,"size":212969258,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:48b4baa9dfe833fb41f03f0c279b6105894307aa&amp;dn=Julianna+Barwick+-+The+Magiace+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"barber9","files":-1,"time":1328480579,"description":"Julianna Barwick is an American musician who was born in Louisiana and raised in Brooklyn. Her music is built around multiple loops and layers of her voice. Barwick, who credits a rural, church choir upbringing for her unique sound, begins most tracks with a single phrase or refrain, then uses a loop station and the occasional piano or percussive instrument to build the song into a swirling mass of lush, ambient folk. She released her first two collections of songs, the full-length Sanguine and the EP Florine, in 2009 and 2010, respectively, before issuing her Asthmatic Kitty debut, The Magic Place, in 2011.Her song anjos is used as the background score for the recent Levis 'Go Forth. Ad Campaign.\n\n- - -\n\nAccording to the Allmusic she was influenced by artists like Cocteau Twins and BjÃƒÂ¶rk however music critics linked her to the most successful New Age musician Enya in their reviews like MusicOMH and Pitchfork. Allmusic linked her music to Artists like Harold Budd, Brian Eno's ambient works, Grouper and How to Dress Well\n\n- - -\n\n'The Magic Place was a tree on our farm. It was in the back pasture. It was one tree that grew up, down and around. You had to crawl in and once you were inside, it was like there were different rooms, and you could actually lay in the branches. We named it 'The Magic Place' because it really was magical - especially for a kid and that's how I feel about my life right now - without trying to sound too hippy dippy or cosmic, this year has definitely been a magical one.'\n(wikipedia)\n\nJulianna Barwick - The Magic Place 2011\n(Lander, WY. Asthmatic Kitty Records)\n\n1. Envelop\n2. Keep Up The Good Work\n3. The Magic Place\n4. Cloak\n5. White Flag\n6. Vow\n7. Bob In Your Gait\n8. Prizewinning\n9. Flown\n","torrent":{"xt":"urn:btih:48b4baa9dfe833fb41f03f0c279b6105894307aa","amp;dn":"Julianna+Barwick+-+The+Magiace+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48b4baa9dfe833fb41f03f0c279b6105894307aa","infoHashBuffer":{"type":"Buffer","data":[72,180,186,169,223,232,51,251,65,240,63,12,39,155,97,5,137,67,7,170]},"announce":[],"urlList":[]}}