{"title":"Osho_Bodhidharma The Greatest Zen Master-07.avi","uid":15223077,"size":220818336,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:48d3571e2ad7658d9108ef23ea19d046d66db443&amp;dn=Osho_Bodhidharma+The+Greatest+Zen+Master-07.avi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"drugarica","files":1,"time":1467749971,"description":"Bodhidharma: The Greatest Zen Master\r\nChapter #7\r\nChapter title: Get ready and claim your inheritance\r\n8 July 1987 am in Gautam the Buddha Auditorium\r\nLength: \t116 mins\r\nBELOVED Bhagwan,\r\nANYONE WHO GIVES UP THE TRANSCENDENT FOR THE MUNDANE, IN ANY OF ITS MYRIAD FORMS, IS A MORTAL. A BUDDHA IS SOMEONE WHO FINDS FREEDOM IN GOOD FORTUNE AND BAD. SUCH IS HIS POWER, KARMA CAN'T HOLD HIM. NO MATTER WHAT KIND OF KARMA, A BUDDHA TRANSFORMS IT. HEAVEN AND HELL ARE NOTHING TO HIM.      ...IF YOU'RE NOT SURE, DON'T ACT. ONCE YOU ACT, YOU WANDER THROUGH BIRTH AND DEATH AND REGRET HAVING NO REFUGE ..... TO UNDERSTAND THIS MIND, YOU HAVE TO ACT WITHOUT ACTING. ONLY THEN WILL YOU SEE THINGS FROM A TATHAGATA'S PERSPECTIVE.\r\nBUT WHEN YOU FIRST EMBARK ON THE PATH, YOUR AWARENESS WON'T BE FOCUSED. YOU'RE LIKELY TO SEE ALL SORTS OF STRANGE, DREAMLIKE SCENES. BUT YOU SHOULDN'T DOUBT THAT ALL SUCH SCENES COME FROM YOUR OWN MIND AND NOWHERE ELSE.\r\nIF YOU SEE A LIGHT BRIGHTER THAN THE SUN, YOUR REMAINING ATTACHMENTS WILL SUDDENLY COME TO AN END, AND THE NATURE OF REALITY WILL BE REVEALED. SUCH AN OCCURRENCE SERVES AS THE BASIS FOR ENLIGHTENMENT. BUT THIS IS SOMETHING ONLY YOU KNOW. YOU CAN'T EXPLAIN IT TO OTHERS.      ...OR IF, WHILE YOU'RE WALKING, STANDING, SITTING OR LYING IN THE STILLNESS AND DARKNESS OF NIGHT, EVERYTHING APPEARS AS THOUGH IN DAYLIGHT, DON'T BE STARTLED. IT'S YOUR OWN MIND ABOUT TO REVEAL ITSELF.      ...IF YOU SEE YOUR NATURE, YOU DON'T NEED TO READ SUTRAS OR INVOKE BUDDHAS. ERUDITION AND KNOWLEDGE ARE NOT ONLY USELESS, THEY CLOUD YOUR AWARENESS. DOCTRINES ARE ONLY FOR POINTING TO THE MIND. ONCE YOU SEE YOUR MIND, WHY PAY ATTENTION TO DOCTRINES?\r\nTO GO FROM MORTAL TO BUDDHA, YOU HAVE TO PUT AN END TO KARMA, NURTURE YOUR AWARENESS AND ACCEPT WHAT LIFE BRINGS.      ...ONCE MORTALS SEE THEIR NATURE, ALL ATTACHMENTS END. AWARENESS ISN'T HIDDEN. BUT YOU CAN ONLY FIND IT RIGHT NOW. IT'S ONLY NOW. IF YOU REALLY WANT TO FIND THE WAY, DON'T HOLD ONTO ANYTHING. ONCE YOU PUT AN END TO KARMA AND NURTURE YOUR AWARENESS, ANY ATTACHMENTS THAT REMAIN WILL COME TO AN END. UNDERSTANDING COMES NATURALLY. YOU DON'T HAVE TO MAKE ANY EFFORT. BUT FANATICS DON'T UNDERSTAND WHAT THE BUDDHA MEANT. AND THE HARDER THEY TRY, THE FARTHER THEY GET FROM THE SAGE'S MEANING. ALL DAY LONG THEY INVOKE BUDDHAS AND READ SUTRAS. BUT THEY REMAIN BLIND TO THEIR OWN DIVINE NATURE, AND THEY DON'T ESCAPE THE WHEEL.\r\nA BUDDHA IS AN IDLE PERSON. HE DOESN'T RUN AROUND AFTER FORTUNE AND FAME. WHAT GOOD ARE SUCH THINGS IN THE END?\r\n\r\nBodhidharma does not divide the world into matter and spirit. He is against all divisions","torrent":{"xt":"urn:btih:48d3571e2ad7658d9108ef23ea19d046d66db443","amp;dn":"Osho_Bodhidharma+The+Greatest+Zen+Master-07.avi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48d3571e2ad7658d9108ef23ea19d046d66db443","infoHashBuffer":{"type":"Buffer","data":[72,211,87,30,42,215,101,141,145,8,239,35,234,25,208,70,214,109,180,67]},"announce":[],"urlList":[]}}