{"title":"The Marx Brothers as Social Critics.pdf","uid":9102619,"size":1722399,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:48d63b541428f5e998d0d398e34b6027a0b35f4b&amp;dn=The+Marx+Brothers+as+Social+Critics.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1382802252,"description":"The Marx Brothers' films are packed with slapstick and obvious jokes, gags, puns, pratfalls, and mimicry. \nBut beneath the laughs is a serious and biting condemnation of American culture. This book examines historical events, political practices, economic conditions, manners and customs, literary subjects, and popular entertainment as satirized in the films and considers the ways in which the films were relevant in their era and remain so today.\n\nUser Review:\nI was not real sure about this book when I first saw it. It was excactly what I was hoping for. In the Marx Brothers movies there are scenes and jokes that are not meaningful to this generation (or even a couple before.) The book tells of the times of what was going on in culture of America, things like the Depression and Society. I see it as an informative book helping someone that was not alive in the twenty years the brothers made the films get some inside information. This helps the films become more complete. I learned some things from the book and enjoyed a lot. Thanks for some of the greatest comedy ever Chico, Groucho, Harpo, Zeppo and Gummo.","torrent":{"xt":"urn:btih:48d63b541428f5e998d0d398e34b6027a0b35f4b","amp;dn":"The+Marx+Brothers+as+Social+Critics.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48d63b541428f5e998d0d398e34b6027a0b35f4b","infoHashBuffer":{"type":"Buffer","data":[72,214,59,84,20,40,245,233,152,208,211,152,227,75,96,39,160,179,95,75]},"announce":[],"urlList":[]}}