{"title":"Big Al Carson - Take Your Drunken Ass Home (blues)(mp3@320)[roge","uid":6864186,"size":153981987,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:494406e80b71da7581c66d5f223575a8841c71c2&amp;dn=Big+Al+Carson+-+Take+Your+Drunken+Ass+Home+%28blues%29%28mp3%40320%29%5Broge&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rogercc1","files":13,"time":1323029561,"description":"Big Al Carson  Take Your Drunken Ass Home\nReleased: 2002\nLabel: Mardi Gras Records\nFormat: MP3@320\n\nEveryone has thought it on occasion, when a drunk spoils the party for everyone else, and now Big Al Carson has written a song that expresses what everyone was thinking. &quot;Take Your Drunken Ass Home&quot; was written by Carson extemporaneously one night, as the blues musician and his band were repeatedly interrupted during their set by an inebriated patron at a New Orleans bar. Since then, the song has become a favorite during the Carnival season, culminating in its biggest day, Mardi Gras, with plenty of people needing this kind of advice. Music veteran Carson has chosen the humorous tune as the title cut of his 2002 CD release. Playing a regular gig for years at the Funky Pirate Bar on Bourbon Street, Big Al Carson has seen quite a few patrons like the one who inspired this song. It is just like the good-natured singer to take it all in stride by making an entertaining song out of the situation: crowd control big easy-style. Some other songs on the album reflect the New Orleans party spirit as well. The recording opens with &quot;Because I Got High,&quot; followed by the Muddy Waters tune &quot;Champagne &amp; Reefer.&quot; There are sexy renditions of &quot;Meet Me With Your Black Drawers On&quot; and &quot;Dip My Dipper.&quot; If there was ever anyone meant to sing Willie Dixon's &quot;Built for Comfort,&quot; it is Big Al Carson. The man of the large girth and matching smile entices the listener with his deep and raspy voice that wraps around a song like the warm air of a French Quarter summer night. Listen to him, moody on &quot;I'll Never Love Like That Again&quot; and exuberant on &quot;Nursery Rhymes&quot; and &quot;Strokin'&quot;; you are listening to a blues master. Carson is joined on the CD by many outstanding musicians, including Jon Cleary, Jerry Embree, Steve Blailock, Patrick Williams, Erving Charles, Harold Scott, Emille Hall, Harry Sterling, Frederick Sanders, and Warner Williams. Together, they make the kind of music for which New Orleans is noted. It's a party, y'all. ~ Rose of Sharon Witmer\n\nTracklist:\n01. Because I Got High (5:45)\n02. Champagne &amp; Reefer (5:22)\n03. Nursery Rhymes (5:16)\n04. Dip My Dipper (6:25)\n05. Meet Me With Your Black Drawers On (4:38 )\n06. I'll Never Love Like That Again (5:17)\n07. Baby's Love (5:12)\n08. Everyday Dreamer (2:46)\n09. Built For Comfort (4:44)\n10. Strokin' (Club Version) (5:23)\n11. Tell It Like It Is (8:37)\n12. Take Your Drunken Ass Home (4:21)[/size]\n\nPersonnel:\nAlton &quot;Big Al&quot; Carson (vocals); Harry Sterling, Steve Blailock (guitar); Patrick Williams (harmonica); Emile Hall, Jerry Embree (tenor saxophone); Frederick Sanders (piano, organ); Warner Williams (piano, synthesizers); Harold Scott, Michael Harris, Erving Charles, Jr. (bass); Gerald French (drums, percussion).\n","torrent":{"xt":"urn:btih:494406e80b71da7581c66d5f223575a8841c71c2","amp;dn":"Big+Al+Carson+-+Take+Your+Drunken+Ass+Home+%28blues%29%28mp3%40320%29%5Broge","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"494406e80b71da7581c66d5f223575a8841c71c2","infoHashBuffer":{"type":"Buffer","data":[73,68,6,232,11,113,218,117,129,198,109,95,34,53,117,168,132,28,113,194]},"announce":[],"urlList":[]}}