{"title":"World of Warcraft","uid":4691507,"size":7886643752,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:499aabe0c370076c58f4a8c017c53a350889dfcb&amp;dn=World+of+Warcraft&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"DeathByJayJay","files":51,"time":1233410754,"description":"[center][b][size=3]World of Warcraft - Fate Gaming[/size][/b]\nCurrently ranked 39th on [url=&quot;http://www.xtremetop100.com/world-of-warcraft/&quot;]http://www.xtremetop100.com/world-of-warcraft/[/url]\n\n[url=&quot;http://www.fategaming.com/&quot;][img]http://i465.photobucket.com/albums/rr15/fategaming/fategaming_tbc.gif[/img][/url]\n\n\nIncludes:\n\nWorld of Warcraft enGB (Full)\nWorld of Warcraft: The Burning Crusade enGB (Full)\nAll patches needed to date for Fate Gaming enGB\nEasy installer for 32 and 64 bit :)\n\nFREE SERVER\n\nSize: 7.34GB\nHash: E204B0559D95DF41DA2F932F743C8DD5A1653622\nCreated: 31.01.2009\nServer Site: [url=&quot;http://www.fategaming.com/&quot;]http://www.fategaming.com/[/url]\nServer Type: 100% Blizzlike\n\n[b]Just follow the README.txt to get started..[/b]\n\n\n[img]http://images.amazon.com/images/G/01/videogames/detail-page/xpbar.jpg[/img]\n\n\nWorld of Warcraft didn't invent the online role-playing genre, but it certainly benefits from the missteps of other titles that have come before. A mind-boggling array of improvements in graphics, gameplay, networking, and interface--really every category--makes this game the crown prince of the genre, a great starting place for newbies, and a challenge to any other MMORPG currently in the works.\n\nInside the human camp\nThe game's beautifully rendered locations are filled with small details, such as flying birds and flowing water.\nA History of Conflict\nWoW takes place just four years after the real-time strategy Warcraft series, which chronicles a 25 year struggle between the Alliance (humans, dwarves, gnomes, and elves) and the Horde (orcs, tauren, trolls, and undead). Even though there's tons of accumulated story to the series, new players should not be daunted. The background is there for you to explore, but you don't have to tread a lot of Azeroth history to get into the action.\nThe makers boast 2,000 existing quests with more being added, many of them noncombat in nature.\n\nThe game looks magnificent. There's plenty of detail and variety to the landscapes and interiors, and the artwork has a refreshingly playful style. There's not a lot of variety in the character creation process, but with all the skills and proficiencies to combine in the game, WoW focuses its customization not on the appearance of your character but rather on the character of your character. The game lets you adopt any two trade skills, regardless of character race or class, and combine those skills in useful ways. If you choose skinning and leatherworking, for example, you can fashion bags from the carcasses of monsters you defeat, which will allow you to carry even more inventory items.\n\nExpanded Commerce\nYou can sell the items you make, find, and loot through a variety of outlets. Like any role-playing game, WoW has merchants who will buy your cast-off items for fixed prices, but you can also sell to other players at your own price through in-game chat or by leaving it with one of the auction houses located across the map. This virtual free market is a game within the game, like Monopoly somehow inserted into the middle of Chess. Heck, you can even send items C.O.D. to other players via the game's mail system.\n\nIn-game quest log\nThe game's Quest Log keeps track of up to 20 quests at a time.\nIn other online role-playing games, starting players have to invest dozens of hours whacking at small prey and doing other odd jobs one at a time to gradually &quot;level up&quot; to more interesting challenges. WoW lets players accept a variety of quests--up to 20 at a time without penalty for abandoning any of them before they're complete. The makers boast 2,000 existing quests with more being added, many of them noncombat in nature. Where some games only grant experience through battle, WoW grants experience for exploring and fulfilling quests too.\n\nA Level Playing Field\nThere's also a built-in handicap for casual players where your character enters a rest state when you log off from the game. The longer you're logged off (up to a week), the bigger the experience bonus you'll get when you return to battle. An enemy tagging feature--the player who lands the first attack on an enemy claims the loot for himself or his party--prevents onlookers from swooping in and pilfering items from a monster that you brought down. That resolves a common complaint of other titles.\n\nWoW interface\nIcons and pop-ups help put complex controls easily within reach.\nMost games severely penalize players when they die in-game, usually by shaving experience points, funds, or both. In WoW, death just relocates your ghost to the nearest graveyard, and the only penalty is the time it takes you to get back to resurrect your character's corpse.\n\nAll of this makes for a very complicated game, but the well-designed interface puts all the game's elements into icons either visible framing the action or within a simple keystroke. The enemy's artificial intelligence is quite strong too: Monsters will join nearby fights to aid their comrades, switch targets strategically midbattle, and ambush players. The map system fills in details on places you've visited, so you always know where you are and where you've been.\n\nOverall, World of Warcraft is a game that's easy to learn, challenging to master, beautiful to watch, and tons of fun to play. --Porter B. Hall \n\n\n\n\n\n    PC System Requirements\n\n        * OS: Windows 2000 (Service Pack 4) or Windows XP (Service Pack 2/3) Vista (Service Pack 1) 32bit and 64bit\n        * Processor: Intel Pentium3 800MHz or AMD Athlon 800MHz\n        * Memory:\n              o Minimum: 512 MB RAM\n              o Recommended: 1GB RAM \n        * Video:\n              o Minimum: 32MB 3D graphics processor with Hardware Transform and Lighting, such as an NVIDIA GeForce 2 class card or above\n              o Recommended: 64MB VRAM 3D graphics processor with Vertex and Pixel Shader capability, such as an NVIDIA GeForce FX 5700 class card or above \n        * Sound: DirectX-compatible sound card \n\n\n\n\nPlease seed and help keep this torrent alive...[/center]","torrent":{"xt":"urn:btih:499aabe0c370076c58f4a8c017c53a350889dfcb","amp;dn":"World+of+Warcraft","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"499aabe0c370076c58f4a8c017c53a350889dfcb","infoHashBuffer":{"type":"Buffer","data":[73,154,171,224,195,112,7,108,88,244,168,192,23,197,58,53,8,137,223,203]},"announce":[],"urlList":[]}}