{"title":"Above All Things by Tanis Rideout [MU]","uid":8555827,"size":3907841,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:49a5b326232ff995531d9179d72cf605213da476&amp;dn=Above+All+Things+by+Tanis+Rideout+%5BMU%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Max-Upload","files":-1,"time":1370766224,"description":"Above All Things by Tanis Rideout (June 19th 2012) in PDF, EPUB and MOBI format. \n\n\nFor ebook devices use an ebook converter like: \nHamster Ebook Converter - http://www.hamstersoft.com/free-ebook-converter \nCalibre - http://calibre-ebook.com/download \nOnline - http://ebook.online-convert.com \n\nThe Paris Wife meets Into Thin Air in this breathtaking debut novel of obsession and divided loyalties, which brilliantly weaves together the harrowing story of George Mallory's ill-fated 1924 attempt to be the first man to conquer Mount Everest, with that of a single day in the life of his wife as she waits at home in England for news of his return. \n\nA captivating blend of historical fact and imaginative fiction, Above All Things moves seamlessly back and forth between the epic story of Mallory's legendary final expedition and a heartbreaking account of a day in the life of Ruth Mallory. Through George's perspective, and that of the newest member of the climbing team, Sandy Irvine, we get an astonishing picture of the terrible risks taken by the men on the treacherous terrain of the Himalaya. But it is through Ruth's eyes that a complex portrait of a marriage emerges, one forged on the eve of the First World War, shadowed by its losses, and haunted by the ever-present possibility that George might not come home. \n\nDrawing on years of research, this powerful and beautifully written novel is a timeless story of desire, redemption, and the lengths we are willing to go for honour, glory, and love.\n\n\nSeed and Enjoy!","torrent":{"xt":"urn:btih:49a5b326232ff995531d9179d72cf605213da476","amp;dn":"Above+All+Things+by+Tanis+Rideout+%5BMU%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49a5b326232ff995531d9179d72cf605213da476","infoHashBuffer":{"type":"Buffer","data":[73,165,179,38,35,47,249,149,83,29,145,121,215,44,246,5,33,61,164,118]},"announce":[],"urlList":[]}}