{"title":"SmartsysSoft Label Maker 2.10 Portable [ak]","uid":6211609,"size":25165856,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:49d8c98ab20839f5ac730cbc261455de4f0fb012&amp;dn=SmartsysSoft+Label+Maker+2.10+Portable+%5Bak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1299006617,"description":"SmartsysSoft Label Maker - is a software for label design and beautiful artwork for your videos, mp3 drive, data, photo slide show. Easy to use, with wizards allows you to create covers just a few clicks. The program includes templates - labels for CD, Slim CD, DVD, DVD Slim.\n\nKey Features\n\n* Powerful vector graphics editing program\n* Each vector object such as shape, symbol, text can be filled or stroked with solid color, gradient colors, images, patterns.\n* Provides visual path editing tools to edit shapes. With which, you can create the most unique shapes, symbols or texts if you desires.\n* More than hundreds of dash styles are supported to be used for stroking shapes.\n* Each drawing elements is painted very smoothly. So you can get very nice labels when your designs are translated to printing.\n* Works like a greate image editor program that supports strongly layer-editing. A shape object can be filled and storked with different transparency level.\n\nA lot of Label Templates and Pre-designed Drawing Elements\n\n* Select from attractive label templates and customize with your own pictures and texts to create stunning greeting cards.\n* Provides thousands of pre-defined pictures, symbols, shapes, gradient style, textures and clipart images. In addition, all common image formats are supported so you can use your own pictures and clipart to design the perfect custom greeting cards for you.\n\nDesign Labels With Easy\n\n* The application's interface is attractive and quite intuitive.\n* Undo and redo anytime and anywhere.\n* With moving mouse button you can create, move, resize or rotate each drawing objects visually and freely.\n\nCustom Your Printing\n\n* Supports to print your labels on any local Windows compatible printer.\n* Save your designs as a high quality images with BMP, JPEG, GIF, PNG, TIFF format for outside quality printing.\n\nHome Page - http://www.smartsyssoft.com/label-maker.htm\n","torrent":{"xt":"urn:btih:49d8c98ab20839f5ac730cbc261455de4f0fb012","amp;dn":"SmartsysSoft+Label+Maker+2.10+Portable+%5Bak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49d8c98ab20839f5ac730cbc261455de4f0fb012","infoHashBuffer":{"type":"Buffer","data":[73,216,201,138,178,8,57,245,172,115,12,188,38,20,85,222,79,15,176,18]},"announce":[],"urlList":[]}}