{"title":"Kaleidoscope (Great US psych) - Complete Works 1967 - 1970","uid":3409715,"size":318130569,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4a2e949c53f4e850885e4d4ebacba6de7c1dd42f&amp;dn=Kaleidoscope+%28Great+US+psych%29+-+Complete+Works+1967+-+1970&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"buzzard","files":47,"time":1132080944,"description":"Kaleidoscope - 4 Albums 1967 - 1970\n\nsize:          303 mb\nbitrate:      320\n\n[IMG]http://img213.imageshack.us/img213/4326/kaleidoscopea9is.jpg[/IMG]\n\nPersonnel:\nMARK FEEDMAN \thrmnca \tA\nSOLOMON FELDTHOUSE \tgtr, caz \tA \tB \tC \tD\nDAVID LINDLEY \tgtr, fiddle, harp, banjo \tA \tB \tC \tD\nJOHN WELSH \tgtr \tA\nCHESTER CRILL (alias FENRUS EPP) \tkeyb'ds, violin, vcls \t\tB \tC \tD\nCHRIS DARROW \tbs, mandn \t\tB\nJOHN VIDICAN \tdrms \t\tB\nSTUART BROTMAN \tbs, vcls \t\t\tC\nPAUL LAGOS \tdrms, vcls \t\t\tC\nRON JOHNSON \tbs \t\t\t\tD\nJEFF KAPLAN \tgtr, vcls \t\t\t\tD\n \n\nALBUMS:\n1(B) \tSIDE TRIPS \t(Epic 26304) \t1967\n2(B) \tA BEACON FROM MARS \t(Epic 26333) \t1968\n3(C) \tINCREDIBLE KALEIDOSCOPE \t(Epic 26467) \t1968\n4(D) \tBERNICE \t(Epic 26508) \t1970\n\nNB: (1) reissued on CD (Edsel EDCD 531) and (Epic EK 48513). (1) also reissued on vinyl by Epic 1998. (2)-(4) also now available on CD. (3) and (4) are also available on one CD (Head 3697). It should perhaps be noted that (1) was counterfeited early on, perhaps even in the late 1970s. This fake is easy to identify - the back cover on the original pressing is printed in blue, the fake in black. The discs, however, are very convincing. (1) and (2) were both issued in mono as white label promo issues (R1 and R2 respectively). (1) also reissued on vinyl by Edsel in 1988. Also of interest is the bootleg Live At The Shrine (Boot) 198?.  \n\n45s:\n1 \tPlease/Elevator Man \t(Epic 10117) \t1967\n2 \tWhy Try?/Little Orphan Nannie \t(Epic 10219) \t1967\n3 \tI Found Out/Rampe Rampe \t(Epic 10239) \t1967\n4 \tNobody (with Johnny'Guitar'Watson &amp; Larry Williams)/Find Yourself Someone To Love \t(Okeh 730) \t1967\n5 \tHello Trouble/Just A Taste \t(Epic 10332) \t1968\n6 \tLet The Good Love Flow/Lie To Me \t(Epic 10481) \t1969\n7 \tTempe Arizona/Lie To Me \t(Epic 10500) \t1969\n8 \tKilling Floor/Lie To Me \t(Epic 10500) \t1969\n \n\nKaleidoscope's music was so wide-ranging that it is difficult to categorise. Not surprisingly therefore, all of their albums have become obscure collectors items. However, compilations of material from their first three albums are now available, and all the original albums have been reissued on CD.\n\nAn explanation for the range of this group's music can be found in the backgrounds of its personnel. Lindley, born in L.A., had previously played with a number of bands, including The New Christy Minstrels and The Greenwood Singers and had also played banjo for several labels. He formed the group in September 1966. They initially called themselves The Baghdad Blues Band. Feldthouse originated from Ismit in Turkey and played a wide range of exotic instruments which included the saz, bouzouki, dobro, vina, doumbeg and dulcimer as well as the more mundane 12 string guitar and fiddle. He was responsible for the Eastern influence on tracks like Egyptian Gardens, Why Try and Keep Your Mind Open on their first album. Darrow was born in South Dakota, but raised in Claremont, California. His musical taste encompassed bluegrass, country, blues, jug band, R&amp;B and old time jazz. Percussionist Vidican grew up in Hollywood, and Epp was from Oklahoma City. Apart from the Eastern-influenced songs, other tracks on their first album included the traditional Come On In, Oh Death and the offbeat Minnie The Moocher. Another cut Please was chosen as the 'A' side for their first single with a non-LP track, Elevator Man, a more straight ahead rock track with some superb guitar playing from Lindley, on the flip. The single went nowhere. Next off they tried a remixed version of Why Try and a version of Little Orphan Annie, written by Darrow and Epp, which later turned up on the Bernice album in a very different form. However, this 45 made no commercial impression either.\n\nA Beacon From Mars contained an incredible 12-minute 'live' version of the psychedelic title track and an 11 minute 'live' version of their Eastern-jam Taxim. Indeed, their 'live' performances were quite a show with a belly dancer performing to the latter track and flamenco dancers accompanying their Spanish guitar work. The remainder of the album comprised more traditional country-influenced songs like Greenwood Sidee, Life Will Pass You By, Louisiana Man and the goodtime rag Baldheaded End Of A Broom.\n\nBy the time of Incredible Kaleidoscope, Darrow and Vidican had left. Side One of Incredible... opens with the Eastern-influenced Lie To Me and the goodtime rag Let The Good Times Flow. The bluesy Tempe Arizona is followed by the country-influenced Petite Fleur and Banjo. Side Two contained the group's arrangement of the traditional ballad Cuckoo and the 11.30 minute Seven-Ate Sweet.\n\nHowever, Bernice was comparatively weak and the group disbanded in 1970. The album was to have included many tracks which were censored by Epic, including three that were removed for taking stands on major political issues of the day, including the Chicago riots.\n\nThe group reformed in 1975 for a rather disappointing album When Scopes Collide, (Pacific Arts 102) and again in 1995 for the Greetings From Kartoonistan album.\n\nKaleidoscope also recorded a some pre-Epic demos, which were produced by Curt Boettcher and Victoria Winston. Tantalisingly, these have recently resurfaced and the tape log indicates that the sessions included Down The Line, an early version of Egyptian Gardens, plus a reel apparently containing a number of songs labelled Irish With Sitars.\n\nThe first three albums are recommended but the originals may be difficult to obtain at reasonable prices. More accessible are the CD reissues, and four compilations of their material, including: Sony's Egyptian Candy (CD), Bacon From Mars (Edsel XED 11 5), which features some of their best short compositions, Rampe Rampe (Edsel ED 138), which contains most of their longer cuts and 1993's Blues From Baghdad CD (Edsel EDCD 375), which basically comprised the earlier vinyl compilation Bacon From Mars with four additional tracks:- Beacon From Mars, Seven Ate Sweet, Greenwood Sidee and Rampe Rampe.\n\nDarrow also played fiddle on Morning's second album and went on to record a number of solo albums. He has also had a number of recent releases on the German Taxim label, played for a very short time with The Nitty Gritty Dirt Band and also backed Linda Ronstadt.\n\nKaleidoscope's other compilation appearances include:- Keep Your Mind Open on Psychedelic Dream (Dble LP) and Psychedelic Frequencies (CD); Brother Mary and Mickey's Tune on the Zabriski Point soundtrack; Nobody (with Johnny Guitar Watson and Larry Williams) on Mindrocker, Vol. 7 (LP); and You Don't Love Me on Rockbusters (LP). They also have three live tracks, Oh Death, Taxim and Egyptian Gardens on California Acid Folk (LP). Fans of the band will also want to seek of a free EP which came with 'Ptolemaic Terrascope Magazine No. 12', containing two 1965 acetate tracks by this band - I'm A Hog For You and Little Orphan Annie. \n\nTRACK LISTING\nKaleidoscope / Side Trips\n[IMG]http://img213.imageshack.us/img213/5373/cover4as.jpg[/IMG]\nWildly eclectic mixture of Psychedelia, Mid Eastern music, Appalachian Folk, jug band, hokey jump blues and undefinable weirdness that could only have come from the 60's California music scene.  The original 10 song album is only 26 minutes long, yet it goes through such a wide variety of styles that it really does feel like a full listening experience.  Best tracks are the Mid Eastern opening track &quot;Egyptian Gardens&quot;, the very psychedelic antiwar song &quot;Keep Your Mind Open&quot; and that cheery little Appalachian folk ditty &quot;Oh Death&quot; (lately best known from the more traditional, dirge-like rendition on the hit soundtrack to Oh Brother Where Art Thou).  There's also an oddly faithful cover of &quot;Minnie The Moocher&quot;.\n1. Egyptian Gardens  \n2. In The Night  \n3. Hesitation Blues  \n4. Please  \n5. Keep Your Mind Open  \n6. Pulsating Dream  \n7. Oh Death  \n8. Come On In  \n9. Why Try  \n10. Minnie The Moocher\n\nKaleidoscope / Beacon From Mars\n[IMG]http://img213.imageshack.us/img213/6614/cover24hq.jpg[/IMG]\nMore wildly eclectic psychedelic world music Cajun folk blues from Kaleidoscope.  This album's big centerpieces are the two epic 12 minute jams, the authentic sounding Mid Eastern workout &quot;Taxim&quot; and the psychedelic freak out title track, which is built on the riff to &quot;Smokestack Lightning&quot;.  Those are fantastic (assuming you're into that sort of thing), but another one I really liked is the creepy traditional English murder ballad &quot;Greenwood Sidee&quot;, it's a damm shame Fairport Convention never got around to this one when Sandy Denny was in the group.\n1. I Found Out  \n2. Greenwood Sidee  \n3. Life Will Pass You By  \n4. Taxim  \n5. Louisiana Man  \n6. Baldheaded End Of A Dream  \n7. You Don't Love Me  \n8. Beacon From Mars\n\nKaleidoscope / Incredible!\n[IMG]http://img208.imageshack.us/img208/294/cover30jx.jpg[/IMG]\nKaleidoscope's third album is perhaps not quite as fresh-sounding as their previous two releases, but it's still a solid effort featuring such diverse fare as an odd version of &quot;Killing Floor&quot;, the Cajun &quot;Petite Fleur&quot;, a particularly grim reading of the folk chestnut &quot;Cuckoo&quot;, and another cool 11 1/2 minute psychedelic workout with a stupid title: &quot;Seven-Ate Sweet&quot;.\n1. Lie To Me\t \n2. Let The Good Love Flow\t \n3. Killing Floor\t \n4. Petite Fleur\t \n5. Banjo\t \n6. Cuckoo\t \n7. Seven-Ate Sweet\n\nKaleidoscope / Bernice\n[IMG]http://img208.imageshack.us/img208/1825/cover47or.jpg[/IMG]\nKaleidoscope's last album is a dismal affair.  You can just hear the group giving up entirely, going through the motions solely to fill up enough tape to slap together an album and fulfill their contractual obligations.  None of the exotic multi genre experiments of the earlier albums here, no one has any interest in making that sort of effort.  The closest they get to any sort of creativity is a pair of would-be humorous &quot;social commentary&quot; type songs that are really just half assed Zappa imitations.\t\n1. Chocolate Whale\t \n2. Another Lover\t \n3. Sneakin' Thru The Ghetto\t \n4. To Know Is Not To Be\t \n5. Lulu Arfin Nanny\t \n6. Lie And Hide\t \n7. Ballad Of Tommy Udo\t \n8. Bernice\t \n9. Soft And Easy\t \n10. New Blue Ooze\n\nFor more info see:  http://www.pulsatingdream.com/\nThanks to ImageShack for [URL=http://imageshack.us]Free Image Hosting[/URL]","torrent":{"xt":"urn:btih:4a2e949c53f4e850885e4d4ebacba6de7c1dd42f","amp;dn":"Kaleidoscope+%28Great+US+psych%29+-+Complete+Works+1967+-+1970","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a2e949c53f4e850885e4d4ebacba6de7c1dd42f","infoHashBuffer":{"type":"Buffer","data":[74,46,148,156,83,244,232,80,136,94,77,78,186,203,166,222,124,29,212,47]},"announce":[],"urlList":[]}}