{"title":"Shadowhawk","uid":4576314,"size":835914444,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:4adac2755f3d672caa2eb9ba14aead542291b98c&amp;dn=Shadowhawk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gilgamesh07","files":57,"time":1229246558,"description":"By request from the forums, this torrent contains a fairly comprehensive collection of Jim Valentino's Shadowhawk published by Image Comics.\n\nShadowHawk is a fictional comic book vigilante anti-hero created by Jim Valentino.\n\nHe was first introduced in the Malibu Sun free promotional magazine in May of 1992. His official Image Comics debut was in the second issue of Rob Liefeld's Youngblood series.\n\nPaul Johnstone grew up as a troubled youth in Harlem, New York. He avoided a life of crime due in part to the encouragement of a man named Richard Woodroe, who was originally assigned as a caseworker to Paul when he was caught stealing, and eventually married his mother, becoming his stepfather.\n\nEventually Paul became a lawyer and, beyond that, a district attorney. While his life was going so well, his half brother Hojo had taken his success in college and move to wallstreet and turned it into a coke, and eventually a crack addiction. Using Hojo, some gangsters tried to leverage Paul into letting their men off, but Paul refused. Soon after he ended up the target of an assault intended to serve as an example to others who got in the way of these mobsters. This incident culminated in his attackers injecting him with HIV-infected blood.\n\nAfter the encounter, Johnstone was left uncertain regarding whether he had been infected or not. The attack had been made public and word of his possible infection spread through Johnstone's workplace, making it a very inhospitable environment to be in. Tensions between Johnstone and one of his co-workers led to an altercation between the two which landed Johnstone out of a job and in jail.\n\nAfter he was released Paul received medical confirmation that he was HIV positive and he descended into a depression. While walking the streets to clear his head Paul was threatened by a group of young gang-members. He went berserk and attacked them, leading to his brutal mugging and return to the hospital. During this time he resolved that he would use the rest of his time to dispense justice to the individuals who preyed on innocent victims. One of his friends, a cop named Christina Reid (who had been kicked off the force that day for use of excessive force#, was also in the hospital and came to visit him. She informed Paul that she and a man named Carlton Sun had been developing an exo-skeleton suit of armor that could help aid him in accomplishing this task.\n\nJohnstone decided to don the suit, christening himself &quot;ShadowHawk&quot; after his favourite superhero #a name that would eventually lure out the psychotic and racist villain Hawk's Shadow, who believed he was the one entitled to bear the mantle of ShadowHawk#, and was taught how to fight effectively with the help of Christine, promising to &quot;take back the night&quot;. Johnstone also kept the pills needed to slow his reaction to his HIV infection in small pouches on his belt so he could take them as needed.\n\nEarly on, ShadowHawk's actions against criminals were brutal. He would catch violent criminals in the act and break their spines, leaving them to be discovered by police with no indication that he had attacked them other than hearsay from the criminals. This led to ShadowHawk garnering a reputation as an urban legend as well as being hunted by both criminals and law enforcement alike.\n\nLater in his career #and as his lifespan shortened due to the progression of HIV to full blown AIDS#, Johnstone eventually grew to be less violent. He would also spend a majority of his remaining time searching either for a cure to his infection or another way to extend his life. This led to encounters with the likes of Supreme #in which a battle would ensue, leading to the discovery of ShadowHawk's true identity to the world#, the WildC.A.T.s. #who offered a possible solution involving a robotic body to transplant Johnstone's consciousness into - which would ultimately fail to work# [2] and Youngblood's Chapel #another hero also infected with HIV#. One of his few regrets was that he never got to join a super-group, as in his search for a cure, he had realized how useful and fun fighting in a group was.\n\nIn his final act as ShadowHawk, Johnstone would rescue his mother from being attacked by Hawk's Shadow. The aftermath of the fight would leave Johnstone in a weakened state and unable to elude the pursuit of the police. He was remanded into custody and transported to a hospital where AIDS eventually took its toll and ended his life.\n\nIn the wake of Paul Johnstone's death, it was revealed that ShadowHawk is in fact a Spirit of Justice and the spirit has inhabited at least four people in the past. Three of the revealed ShadowHawks were human, the last one being a robot [3]. After the Spirit of Justice leaves the robot it becomes &quot;Justice&quot;, without human feelings and starts to kill people. The saga of the robot ShadowHawk was told in a crossover story called ShadowHunt which ran through five Image titles in April 1996[4]. At the end of New Man #4,the robot was destroyed.\n\nAfter the robot is destroyed, Eddie Collins makes his debut as the new ShadowHawk. Having just moved to New York with his recently #one year# widowed father, James Collins, an electrician, Eddie a young high school student was walking down a street when the helmet literally fell into his hands. The helmet called Nommo contains the spirits of all people who were, at one time, inhabited by ShadowHawk, the Spirit of Justice. Eddie Collins tried to meditate with the Nommo on, meeting the spirit of Paul Johnstone, who tells Eddie that he is a reincarnation of a first dynasty Egyptian shaman, how he was the last ShadowHawk and that Eddie is destined to start anew.\n\nAt first Eddie Collins widowed father, James Collins ordered him to stop, thinking it would kill him. But Eddie is faster, stronger and more agile now and finds new responsibility to the people of New York City. After saving some hostages, Eddie meets Captain Nieves and starts working with him.\n\nIncluded in this torrent are Shadowhawk v1 # Shadowhawk, Shadowhawk II, Shadowhawk III and the Monster Within storyline Shadowhawk 12 - 18#, Shadowhawk v2, the New Shadowhawk, Vampirella and Shadowhawk and several other one shot issues.\n\nThanks to the scanners and the original source who shall remain nameless.\n\nPlease seed, please enjoy.\n","torrent":{"xt":"urn:btih:4adac2755f3d672caa2eb9ba14aead542291b98c","amp;dn":"Shadowhawk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4adac2755f3d672caa2eb9ba14aead542291b98c","infoHashBuffer":{"type":"Buffer","data":[74,218,194,117,95,61,103,44,170,46,185,186,20,174,173,84,34,145,185,140]},"announce":[],"urlList":[]}}