{"title":"Jade James - Applying for Pleasure (Capture, Inc. #1).epub","uid":9189946,"size":125449,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4ae72d8102ffb548b4fc5a4dd5c32404cf45024c&amp;dn=Jade+James+-+Applying+for+Pleasure+%28Capture%2C+Inc.+%231%29.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"420weedman","files":1,"time":1384370451,"description":"Applying for Pleasure \nAriel Lancaster submits an application to Capture Inc. She's intent on gifting herself a unique thirtieth birthday gift: the captive fantasy she's always dreamt about. Signing with Capture Inc. gives her an opportunity to have it brought to life. The night is everything she ever dreamed and more; her captor takes her body, heart and soul, not just for the night but hopefully for forever.\nJohn Martinez, part owner of Capture Inc., a club which fulfills clients darkest desires, never expected to meet the one woman he'd end up falling for though his own company. He convinces himself he can remain aloof, but once he meets Ariel, all thoughts of remaining detached are gone. She's his captive and he's taken charge of her pleasure, but she's taken charge of his heart.\nThen Ariel's past collides with her present, and history plays an awful cosmic joke. She finds a future with John suddenly out of her reach, but she applied for pleasure and John's determined to see that she gets it.\nPublisher's Note: This book contains explicit sexual situations, graphic language, and material that some readers may find objectionable.\n","torrent":{"xt":"urn:btih:4ae72d8102ffb548b4fc5a4dd5c32404cf45024c","amp;dn":"Jade+James+-+Applying+for+Pleasure+%28Capture%2C+Inc.+%231%29.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ae72d8102ffb548b4fc5a4dd5c32404cf45024c","infoHashBuffer":{"type":"Buffer","data":[74,231,45,129,2,255,181,72,180,252,90,77,213,195,36,4,207,69,2,76]},"announce":[],"urlList":[]}}