{"title":"The Flower Net - Lisa See.epub","uid":8949791,"size":749291,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4b35c5dbcb5fdf0e4501c9a128d1e0d5902c8a7c&amp;dn=The+Flower+Net+-+Lisa+See.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1379856431,"description":"Lisa See's stunning fiction debut pits an American attorney and a Chinese cop against a deadly conspiracy of Chinese gangs, government, and big business that lies behind a series of grisly murders.First the U.S. ambassador's son is discovered entombed in a frozen lake in Beijing. Then the son of a powerful Chinese politician is found dead in the hold of a smuggler's freighter bound for California. The Chinese and American authorities suspect the deaths are linked and, in a rare move, join forces to solve the crime, and soon U.S. District Attorney David Stark is sent across the Pacific to team up with brilliant yet rebellious police detective Liu Hulan. Their investigation takes them into every corner of today's China -- from glitzy karaoke bars, where government leaders and mafia kingpins make their most unsavory deals, to Beijing's labyrinthine hutongs, where working-class Chinese have eked out their livings for centuries.\n\nRevealing a China that most Westerners have never seen -- a strange nation at once admirable and frightening -- Flower Net is an utterly original story and one of the most timely, thrilling, and thought-provoking reads from an astonishing new writer.\n\n&quot;Flower Net is a treat. In this, her debut mystery, Lisa See begins to do for contemporary Beijing what, say, Sir Arthur Conan Doyle did for turn-of-the-century London or Dashiell Hammett did for 1920s San Francisco&quot;. -- Washington Post.","torrent":{"xt":"urn:btih:4b35c5dbcb5fdf0e4501c9a128d1e0d5902c8a7c","amp;dn":"The+Flower+Net+-+Lisa+See.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b35c5dbcb5fdf0e4501c9a128d1e0d5902c8a7c","infoHashBuffer":{"type":"Buffer","data":[75,53,197,219,203,95,223,14,69,1,201,161,40,209,224,213,144,44,138,124]},"announce":[],"urlList":[]}}