{"title":"Corbin Fisher - - - Lucas Fucks Dawson ((MictrmbL))","uid":4825119,"size":388336900,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:4be4a0523a328ff7f3756b5b3351cc4809b1b067&amp;dn=Corbin+Fisher+-+-+-+Lucas+Fucks+Dawson+%28%28MictrmbL%29%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"mictrmbl","files":51,"time":1238917962,"description":"From the vaults of Corbin Fisher:\n\n\n\nThis is one we've surely all been waiting for. Two of CF's signature, exclusive, and hottest young studs having at one another in a real clash of the gorgeous, blond, muscular beauties! These two hotties have a great deal in common - both have amazing faces, flawless bodies, are total lady-killers, and are each total daredevils!\n\nTrust me, I lose sleep at night over how much these two guys love sport bikes! Just the thought of them racing around on those bikes is enough to kick Corbin's maternal instinct into overdrive and freak me out! So with this video I was actually somewhat conflicted. I wanted to show them both bonding with one another and having fun on their bikes because I knew they each had a real passion for them, but I also want to take their bikes down to the nearest boat launch and have them disappear into the ocean forever, taking the obscene amount of worrying I go through whenever I think about them flying around on those things with them to the bottom of the sea! Alas, I can't really do that... can I? So I figured the bikes would provide a good catalyst for some pre-bonding bonding, so to speak. Knowing that scenes we film work so much better when the guys each have something in common and are truly comfortable with one another, we found a deserted parking lot and let the guys race around and show off their stuff - myself all the while biting my nails and a complete nervous wreck while holding the camera. I can't help it! But I think it was all worthwhile, because we all get a glimpse into what these guys like to do for fun away from the cameras, how they like to spend their days, and how they like to have fun. There's a whole lot more to all of our guys than just what we see when they're having sex, and I get a thrill out of sharing that with all of you.\n\nThis isn't the Speed Channel, though, so I know you're all nipping at the bud to see more than just wheelies and racing. I was too! So after each of them working up a sweat and getting those testosterone juices flowing on their bikes, Lucas and Dawson head back to the homestead for some real high-power action ;) Turns out the ones that get parked in the garage aren't the only crotch rockets heating up! The bonding bike session really kicked things off well, because by the time they get into the kitchen they're each rearin' to go! After chilling and chatting for a bit, they leap right in to each other for some heavy making out, licking, stroking, feeling, and totally get all wound up in and worked up with one another. You'll definitely catch how both Dawson and Lucas are already rock hard by the time their dicks get pulled out of their pants! I have to say, the image of these studs sprawled out over the kitchen counter, licking each others' balls and dicks, pits and chests, and burying their faces in to each others' assholes is really amazing.\n\nI wasn't only nervous at the prospect of the two guys flying around on their bikes, but incredibly nervous at the prospect of anticipation being too high for this video. These guys are CF titans! Trademark CF studs! I can't even count all the e-mails I've received asking to see them together. How could we possibly meet what would certainly be such lofty expectations for their pairing!? Well... it turned out to be way easier than I'd expected. All that needs to happen is for these two gorgeous young men to share a camera frame together and you've already gotten damn near close to achieving brilliance. They're both just that hot! Every pose, every position, every movement and moan and groan; every word spoken, every kiss and every flick of the tongue; it's all made amazing by the simple fact that it's these two stunning studs. The kitchen counter never held anything so tasty! But both of these men are great performers, too, and horny as can be. They weren't going to let looks alone carry this video! They dive in to the action - and each other - with such eagerness and excitement that it's damn near overpowering.\n\nAfter practically setting the kitchen on fire, they head upstairs to the bedroom where they shift in to high gear, with Lucas prepping Dawson for an intense fuck! I'm not sure there's anything else I can say here that could ever hope to match the moans and groans of these two young hotties when it comes to letting you know just how hot and intense Dawson and Lucas' fuck is! So strap yourselves in, put on your helmet, and prepare to be taken on the ride of your life! ","torrent":{"xt":"urn:btih:4be4a0523a328ff7f3756b5b3351cc4809b1b067","amp;dn":"Corbin+Fisher+-+-+-+Lucas+Fucks+Dawson+%28%28MictrmbL%29%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4be4a0523a328ff7f3756b5b3351cc4809b1b067","infoHashBuffer":{"type":"Buffer","data":[75,228,160,82,58,50,143,247,243,117,107,91,51,81,204,72,9,177,176,103]},"announce":[],"urlList":[]}}