{"title":"Lisa Loeb - No Fairy Tale (2013) [FLAC]","uid":8080176,"size":319618256,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4c8a9dd9645e43661deb1a6cc56795257e060333&amp;dn=Lisa+Loeb+-+No+Fairy+Tale+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1359479092,"description":"\n  Lisa Loeb - No Fairy Tale (2013) [FLAC]\n\n  Released: 2013\n  Genre: Pop/Rock\n  Style: Pop\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  Cover: Front\n      \n  01 No Fairy Tale\n  02 The 90's\n  03 Weak Day\n  04 Walls\n  05 A Hot Minute\n  06 Sick, Sick, Sick\n  07 Matches\n  08 Married\n  09 Swept Away\n  10 He Loved You So Much\n  11 Ami, I'm Sorry\n  12 The Worst \n  13 A Holiday Song (Bonus)\n  14 Fall Back Guy (Bonus)\n\n  Lisa Loeb's recording career has frequently found her caught in a tug of war between the quiet, introspective side of her musical personality, typified by her first and biggest hit, &quot;Stay (I Missed You),&quot; and her fondness for writing big, bright pop hooks (&quot;I Do&quot; from Firecracker was such a seemingly perfect single it made most of the album that followed sound dreary). Eighteen years after &quot;Stay,&quot; No Fairy Tale finds Loeb throwing caution to the wind and letting her pop instincts hold sway for almost an entire album; Chad Gilbert of New Found Glory co-produced the sessions with Loeb and plays lead guitar on most tracks, and if his standard-issue SoCal electric guitar crunch doesn't sound all that special within the context of his own band, here it gives Loeb's melodies a sharp kick in the butt, and Loeb seems to be having a grand time throwing her music into third gear. \n\n  Loeb's lyrics on No Fairy Tale are informed by the ennui and relationship troubles that have long dominated her songwriting, but the tone overall is sharper and more playful, and &quot;Married,&quot; &quot;Matches,&quot; and the title tune find her giving her themes just a bit of a twist, much like her music, and she sounds fully engaged with the material, letting the melodies and her voice roll out with the chug of the guitars. Loeb even has a bit of fun with her own reputation on &quot;The '90s&quot; (though she was a different type of MTV babe than the character in the song), and her collaborations with a handful of outside writers (including Maia Sharp, Morgan Taylor, Marvin Etzioni, and producer Gilbert) similarly seem to push her out of her usual comfort zone, with impressive result. (Loeb also covers two numbers by Tegan and Sara, which fit the set nicely.) And if you miss the old Lisa, the pensive &quot;Ami, I'm Sorry&quot; confirms she hasn't gone away. No Fairy Tale may not be the best or most personal album of Lisa Loeb's career, but it's hands down the most fun, and it's hard to imagine even the most subdued of her fans begrudging her for enjoying herself as much as she does on these 12 songs.","torrent":{"xt":"urn:btih:4c8a9dd9645e43661deb1a6cc56795257e060333","amp;dn":"Lisa+Loeb+-+No+Fairy+Tale+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c8a9dd9645e43661deb1a6cc56795257e060333","infoHashBuffer":{"type":"Buffer","data":[76,138,157,217,100,94,67,102,29,235,26,108,197,103,149,37,126,6,3,51]},"announce":[],"urlList":[]}}