{"title":"A History of the Stiff Upper Lip  (BBC 2013)","uid":9275183,"size":47454959,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4ca32c8b95faec6dd6f8b390db1e566886e54b7f&amp;dn=A+History+of+the+Stiff+Upper+Lip++%28BBC+2013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Robin1966","files":2,"time":1385846071,"description":"Audio Books : Educational : MP3/128Kbps : English\n\nEmotion is no longer private. Whether a marital collapse on reality TV or real-time twitter updates on the progress of an abortion, emotions are hung out there for all to witness. Whatever element of self-restraint may exist in our cultural DNA, it's increasingly under siege.\n\nWe've come a long way from when the ruling classes saw reticence and fair play as virtues uniquely their own and lamented 'the emotionally-uncontrolled and latently-violent working class'; when English public schools were created specifically to educate boys into showing submission, courtesy and devotion to their superiors; and when there lurked a real fear of the working class 'losing control', rebelling, and giving rise to anarchy.\n\nLouisa Foxe goes on a journey through the archives - sometimes horrifying or amusing, always revealing and perceptive - and reveals how and why the British attitudes towards the expression of emotion have changed; how the nation has swung in and out of its penchant for repression over 600 years; and how that first Victorian stiff upper lip, far from being entrenched, was actually the product of post-Romantic pragmatism, anxiety about manliness and colonial necessity.\n\nTaking their toll on the stiff upper lip, Louisa argues, have been two world wars, the socialist project, the rise of therapy culture, and the demise of the aristocracy's moral influence.\n\nThe results? Exclusively positive, some would say. But archive from World War One to Princess Diana, and interviewees including Frank Furedi, Ralph Fiennes, David Starkey, Andrew Motion, Peter Hitchens (brother of Christopher), and Thomas Dixon suggest that results are mixed at best and that we haven't changed as much as we believe.\n\nProducer: David Coomes A CTVC Production for BBC Radio 4.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:4ca32c8b95faec6dd6f8b390db1e566886e54b7f","amp;dn":"A+History+of+the+Stiff+Upper+Lip++%28BBC+2013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ca32c8b95faec6dd6f8b390db1e566886e54b7f","infoHashBuffer":{"type":"Buffer","data":[76,163,44,139,149,250,236,109,214,248,179,144,219,30,86,104,134,229,75,127]},"announce":[],"urlList":[]}}