{"title":"How to Build the Perfect Bug Out Bag","uid":8114470,"size":285837,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4ceb5091c7a901808a16334cc22cb816b32ee12a&amp;dn=How+to+Build+the+Perfect+Bug+Out+Bag&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"DaRule762","files":-1,"time":1360260460,"description":"Emergencies and disasters happen when we least expect them. In this new book you'll learn the secrets to creating the perfect Bug Out Bag for you!\n\nNot all bug out bags are created equal. Given that you may be in a different location, climate, circumstance or other such situation, your needs will differ from that of others who would like you to believe that all bug out bags should contain the same basic elements.\n\n72 hours is not enough! Learn how to maximize what you have and plan for re-purposing the contents of your bug out bag for longer durations if necessary. You need to know what to include in both long and short term scenarios to make it to your destination safely even if your intended plan changes dramatically.\n\nHow to Build the Perfect Bug Out Bag includes all the descriptions and uses of the items you need and some that you never thought of. You'll also get a shopping list of items to complete your bug out bag building plan.\n\nAs an added bonus you'll get a special link to get a free issue of Survivalist Magazine!\n\nDon't get caught unprepared when you need it the most, only to realize that your bug out plan came up short. Get this book instantly and get prepared now...","torrent":{"xt":"urn:btih:4ceb5091c7a901808a16334cc22cb816b32ee12a","amp;dn":"How+to+Build+the+Perfect+Bug+Out+Bag","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ceb5091c7a901808a16334cc22cb816b32ee12a","infoHashBuffer":{"type":"Buffer","data":[76,235,80,145,199,169,1,128,138,22,51,76,194,44,184,22,179,46,225,42]},"announce":[],"urlList":[]}}