{"title":"Pachelbel Greatest Hit - The Ultimate Canon MP3","uid":4959543,"size":175337107,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4dd81f241a9ed195f7e4c4eb90a38efec2287d13&amp;dn=Pachelbel+Greatest+Hit+-+The+Ultimate+Canon+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"muzik62","files":-1,"time":1245254656,"description":"Pachelbel's Greatest Hit The Ultimate Canon (2003)\n\nmp3 320 kbps\n\n\n\nEditorial Review:\n\nPachelbel's Greatest Hit is an expansion of an earlier RCA Gold Seal staple of the same name (released as RCA Gold Seal 60712-2-RG). Whereas that package was rather stingily limited to only eight tracks, here you get Johann Pachelbel's only contribution to the standard repertoire in no less than 15 versions, all different from one another. This disc seemingly includes everything that was on the earlier disc except in that the &quot;regular&quot; Pachelbel Canon included is a digital recording by the artist and ensemble that initially popularized it on records (Jean-FranÃƒÂ§ois Paillard) rather than a recording by Ettore Stratta with a pick-up ensemble. Among the new recordings of the famous Canon in D offered here is guitarist Clive Carroll's own solo arrangement, the duo pianists Peerless 2x2 performing Denes Agay's four-hand version, a rendition played on traditional Japanese instruments and Arthur Fiedler's lickety-split 1940 recording with his own Sinfonietta, the first ever made of Pachelbel's piece. Whether you have the patience to sit through all of these incarnations of the same work is up to the taste of the individual listener, and although it was shorter in content, the same held true of the original Gold Seal issue. Consider this, then, the &quot;deluxe&quot; edition of Pachelbel's Greatest Hit -- if you have the old one, you may not need it. But even if you love Pachelbel's Canon in D, this may still be more than you bargained for. -- Uncle Dave Lewis\n\n01. Canon In D - Jean-Francois Paillanrd Chamber Orchestra\n02. Canon In D - Munich Radio Orchestra\n03. Canon (Over A Basso Ostinato) - Peerless 2x2\n04. Canon Of The Three Stars - Isao Tomita &amp; The Plasma Symphony Orchestra\n05. How, Where, When? (Canon In D) - Cleo Laine\n06. Earth Angel - The Hampton String Quartet\n07. Canon - The Canadian Brass\n08. Canon In F - BRR (Shakuhachi &amp; Koto Quintet)\n09. Variations On The Pachelbel Canon In D (From Rochberg, Quartet No. 6) - The Concord String Quartet\n10. Canon - Clive Carroll\n11. Canon - Platinum (A Cappella Vocal Ensemble)\n12. Sweet Home (Based On Pachelbel's Canon) - Dai Sakakibara\n13. Canon - Angel Romero\n14. Canon In D - Arthur Fiedler Sinfonietta\n15. Canon &amp; Gigue In D - Guildhall String Ensemble\n\nmuzik62","torrent":{"xt":"urn:btih:4dd81f241a9ed195f7e4c4eb90a38efec2287d13","amp;dn":"Pachelbel+Greatest+Hit+-+The+Ultimate+Canon+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4dd81f241a9ed195f7e4c4eb90a38efec2287d13","infoHashBuffer":{"type":"Buffer","data":[77,216,31,36,26,158,209,149,247,228,196,235,144,163,142,254,194,40,125,19]},"announce":[],"urlList":[]}}