{"title":"The Complete Idiot's Guide to Near-Death Experiences","uid":8352829,"size":19323403,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4de7df97d1d4f6389162bc507e93c5601774e0e6&amp;dn=The+Complete+Idiot%27s+Guide+to+Near-Death+Experiences&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1365392744,"description":"\nP. M. H. Atwater, David H. Morgan, &quot;The Complete Idiot's Guide to Near-Death Experiences&quot;\nISBN: 0028632346 | 2000 | PDF | 460 pages | 18 MB\n\nYours&quot;re no idiot, of course. Yours&quot;ve heard stories about people who saw their life pass before their eyes, felt as though they were walking toward a bright light, or experienced contact with the world beyond before returning to this one. But it all still seems a little far-fetched. Donrs&quot;t bah-humbug it away just yet! The Complete Idiotrs&quot;s Guidereg; to Near-Death Experiences explores a topic that receives plenty of talk-show attention, yet seldom gets serious inquiry. In this Complete Idiotrs&quot;s Guidereg; yours&quot;ll get: A fair-minded examination of near-death experiences and beliefs in a range of religions and cultures. Engrossing stories from those who claim that theyrs&quot;ve been to the beyond-as well as expert assessment of their accounts. Informed advice on what to do if you or someone you love has a near-death experience. A compelling look at the tension between subjective and objective reality, as well as biomedical factors that may partly explain the phenomenon.","torrent":{"xt":"urn:btih:4de7df97d1d4f6389162bc507e93c5601774e0e6","amp;dn":"The+Complete+Idiot%27s+Guide+to+Near-Death+Experiences","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4de7df97d1d4f6389162bc507e93c5601774e0e6","infoHashBuffer":{"type":"Buffer","data":[77,231,223,151,209,212,246,56,145,98,188,80,126,147,197,96,23,116,224,230]},"announce":[],"urlList":[]}}