{"title":"ExploitedCollegeGirls - Ginger (Ginger's ANAL Shoot) NEW 24 July","uid":12154166,"size":291596082,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:4e2b15dd4cbafdc176ce8ec432e4048c4533e731&amp;dn=ExploitedCollegeGirls+-+Ginger+%28Ginger%27s+ANAL+Shoot%29+NEW+24+July&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1437726023,"description":"Ginger returns to Ex Co Gi for anal! Remember this curvy little redhead with her great attitude and impressive set of bouncy, natural boobs from such websites as this one right here? She and Jay clicked right away and she agreed to offer up her brown eye for an anal update.Jay takes it easy on Ginger's innocent pink ass and starts things slowly with a lubed up finger. As she relaxes and gets used to it, he steps up to a small vibe and lets her get comfortable with it. She keeps the vibe in her ass as she blows Jay and he does his best to get her ready before he lays her out and and taps that ass with his cock.Despite her nervousness at getting a full size cock in her ass, Ginger really seems to get into it. She tell him over and over how good it feels, how much she likes it and how she's feeling great. After some really sexy cowgirl and some positive words from Ginger, Jay decided to go for it and see if he can get an anal orgasm from her. After filling her ass and fingering Ginger's pussy in sideshow she's there and her orgasm takes her as much by surprise as it does Jay.Finally Jay is ready to get his and ticks the final box on his anal checklist with a little ass to mouth. He has Ginger suck him off, fresh from her butt and then drop to the floor for a nice splashy facial. As usual he coats her face and even manages to glue an eye shut!\nTags: Anal, Deep Throat, Blowjob, Facial, Sex Toys, Teen, Amateur, Casting, POV, Hardcore\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=10727006256462201714.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=10727006256462201714.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=62631363887416232192.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=62631363887416232192.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:4e2b15dd4cbafdc176ce8ec432e4048c4533e731","amp;dn":"ExploitedCollegeGirls+-+Ginger+%28Ginger%27s+ANAL+Shoot%29+NEW+24+July","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e2b15dd4cbafdc176ce8ec432e4048c4533e731","infoHashBuffer":{"type":"Buffer","data":[78,43,21,221,76,186,253,193,118,206,142,196,50,228,4,140,69,51,231,49]},"announce":[],"urlList":[]}}