{"title":"Henry VIII: The King and His Court","uid":6605611,"size":2561047,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4e4b04b528f130246a2d01f624fefaa5a55c1a10&amp;dn=Henry+VIII%3A+The+King+and+His+Court&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"_F1_","files":-1,"time":1313391065,"description":"Henry VIII: The King and His Court\nAlison Weir (Author)\n\nPaperback: 656 pages\nPublisher: Ballantine Books (October 29, 2002)\nLanguage: English\nISBN-10: 034543708X\nISBN-13: 978-0345437082\n\nAmazon.com Review:\nContemporary observers described the young king in glowing terms. At over six feet tall, with rich auburn hair, clear skin, and a slender waist, he was, to many, &quot;the handsomest prince ever seen.&quot; From this starting point in Henry VIII, the King and His Court, biographer extraordinare Alison Weir reveals a Henry VIII far different from the obese, turkey-leg gnawing, womanizing tyrant who has gone down in history. Henry embodied the Renaissance ideal of a man of many talents--musician, composer, linguist, scholar, sportsman, warrior--indeed, the Dutch humanist Erasmus (not a man inclined to flattery) declared him a &quot;universal genius.&quot; In scholarly yet readable style, Weir brings Henry and his court to life in meticulous, but never tedious, detail. Weir describes everything from courtly fashions to political factions and elaborate meals to tournament etiquette. Along the way she offers up charming--if all too brief--glimpses of Henry's court: tiny Princess Mary, still a very young girl, at her betrothal ceremony saying to the proxy, &quot;Are you the Dauphin of France? If you are, I want to kiss you&quot;; Henry weeping with joy as he held his long-awaited son and heir for the first time; Henry showing off his legs to the Venetian ambassador (&quot;Look here! I have also a good calf to my leg&quot;); Henry's courtiers dressing in heavily padded clothes to emulate--and flatter--their increasingly stout monarch. She also reveals some surprises, for example, that Henry and Katherine were still hunting together as late as 1530, even though Henry was desperately trying to have their marriage annulled. Weir also describes surprisingly happier times in their relationship; Henry loved to dress up in costume, and &quot;was especially fond of bursting in upon Queen Katherine and her ladies in the Queen's Chambers.... Henry took a boyish delight in these disguisings and Katherine seemingly never tired of feigning astonishment that it was her husband who had surprised her.&quot; Henry's queens receive relatively little attention here (for them, see Weir's excellent Six Wives of Henry VIII), but this book is fascinating and a joy to read. Alison Weir has done it again. --Sunny Delaney --This text refers to an out of print or unavailable edition of this title.","torrent":{"xt":"urn:btih:4e4b04b528f130246a2d01f624fefaa5a55c1a10","amp;dn":"Henry+VIII%3A+The+King+and+His+Court","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e4b04b528f130246a2d01f624fefaa5a55c1a10","infoHashBuffer":{"type":"Buffer","data":[78,75,4,181,40,241,48,36,106,45,1,246,36,254,250,165,165,92,26,16]},"announce":[],"urlList":[]}}