{"title":"Shadow Hearts 2 [NTSC] [2-Disc] PS2","uid":7588645,"size":4128720443,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:4e813f7704ab83e5e0b57b8165319cb094a36c79&amp;dn=Shadow+Hearts+2+%5BNTSC%5D+%5B2-Disc%5D+PS2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Big_dude","files":-1,"time":1346478603,"description":"Shadow Hearts 2 - Covenant for the PS2                     Rel. 09/27/2004\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         2\nImage:         ISO\nGenre.:        RPG\nRating:        Teen\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method.\n\n\nCompressed with 7Zip, Game was tested and works.\n\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\n\nGame Description:\n\nThe year is 1915. War has raised its ugly head to greet the nations of Europe. A year and a half after the events described in Shadow Hearts, the French town of Domremy resists German invasion, rumored to be protected by a demon. The German army sends Lieutenant Karin Koenig along with a man named Nicolas, allegedly an inquisitor from the Vatican, whose task is to exorcise the demon. When the two arrive in Domremy, events take an unexpected turn. Karin meets the young harmonixer Yuri Hyuga, who is afflicted with a curse that gradually saps the life out of him. Yuri travels across Europe and through Russia to the Far East, trying to find a cure before it is too late, and stop a secret society from dominating the world by political and magical means.\n\nShadow Hearts: Covenant is a direct sequel to Shadow Hearts, continuing its story and featuring the same main protagonist as well as a few recurrent characters. Like the previous game, it is set in a concrete historical epoch with heavy supernatural additions. Several historical characters, such as the Russian princess Anastasia, play important roles in the game's plot.\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nIf Using DVD+R booktype to DVD-ROM.\n(If your Mod-Chip or Ps2 doesn't support DVD+R)\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t\t\t\t\t","torrent":{"xt":"urn:btih:4e813f7704ab83e5e0b57b8165319cb094a36c79","amp;dn":"Shadow+Hearts+2+%5BNTSC%5D+%5B2-Disc%5D+PS2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e813f7704ab83e5e0b57b8165319cb094a36c79","infoHashBuffer":{"type":"Buffer","data":[78,129,63,119,4,171,131,229,224,181,123,129,101,49,156,176,148,163,108,121]},"announce":[],"urlList":[]}}