{"title":"BBC Getting Our Way 3of3 PDTV x264 AC3 MVGroup","uid":5417503,"size":796836227,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4e97d2face83990134c8d66fd94ced0ff3a682aa&amp;dn=BBC+Getting+Our+Way+3of3+PDTV+x264+AC3+MVGroup&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"BasilBrush","files":1,"time":1267976203,"description":"BBC Getting Our Way 3of3 Values PDTV x264 AC3 MVGroup\n\nSir Christopher Meyer, former British Ambassador to the USA, presents a series telling the behind-the-scenes story of British diplomacy over 500 years of intrigue and adventure.\n\nPart 3: Values\nThe final episode is devoted to values, as Meyer explores the troubled history behind the idea of an 'ethical foreign policy'. Should we intervene to stop atrocities or instigate regime change to rid the world of dictators?\n\nThe film shows that these are not new dilemmas. There was public outcry in Britain when 19th-century Ottoman Turkey suppressed an uprising in Bulgaria, and the British ambassador in Constantinople was caught in the crossfire between realpolitik and values - ultimately losing his job for pointing out that the moral high ground was the opposite of the British national interest.\n\nFifty years later, after World War One, statesmen liked to boast they had ushered in a new era of altruistic international cooperation, where principles of human rights would dictate foreign policy. But the so-called 'new diplomacy' ran into trouble almost immediately and the League of Nations proved powerless to save Haile Selassie's Abyssinia from the clutches of Mussolini. Britain's attempt 'to buy Mussolini off' left the Foreign Office tainted with the dread charge of appeasement.\n\nFinally, Meyer revisits the catastrophic failures of British and international diplomacy to prevent genocide in Bosnia in the 1990s. Whether it is ethnic cleansing in the Balkans or Saddam Hussein in Iraq, the last two decades have shown that infusing British foreign policy with values is far from straightforward.\n\nInteviewees include Henry Kissinger, America's Balkans envoy Richard Holbrooke, EU peace envoy David Owen and our man in Belgrade during the Bosnian war, Ivor Roberts.\n\n\nVideo Codec: x264 CABAC\nVideo Bitrate: 1600Kbps\nVideo Resolution: 704 x 400\nVideo Aspect Ratio: 1.760\nFrames per Second: 25\nAudio Codec: AC3\nAudio Bitrate: 192Kbps 48KHz\nAudio Languages: English\nRunTime Per Part: 59mins\nPart Size: 760MB\nNumber of Parts: 3\nSubtitles: Merged\nripped by: JungleBoy\nSource: DVB-T\n\nforums[dot]mvgroup[dot]org","torrent":{"xt":"urn:btih:4e97d2face83990134c8d66fd94ced0ff3a682aa","amp;dn":"BBC+Getting+Our+Way+3of3+PDTV+x264+AC3+MVGroup","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e97d2face83990134c8d66fd94ced0ff3a682aa","infoHashBuffer":{"type":"Buffer","data":[78,151,210,250,206,131,153,1,52,200,214,111,217,76,237,15,243,166,130,170]},"announce":[],"urlList":[]}}