{"title":"Area 51 Pack - New Documentary and Annie Jacobsen Book!","uid":6427181,"size":376729366,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4ec9ce00d76334696f6c9ba89eb822db1e6cea92&amp;dn=Area+51+Pack+-+New+Documentary+and+Annie+Jacobsen+Book%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Wilsson002","files":2,"time":1306517335,"description":"Documentary Video:\nNational Geographic: Area 51 Declassified\nMay, 2011\nDuration: 00:45:28\nIts the most famous military installation in the world, yet it doesnt officially exist. Area 51-- a site for covert Cold War operations-- has long been a magnet for crackpots, conspiracy theorists, and the overly curious. While there may not be truth to the rumors that Area 51 is a haven for UFOs and extraterrestrials, its clear that our government has been up to something in Area 51 for decades, and it turns out there is a kernel of truth to even some of the wildest speculation. Underground tunnels Hidden enemy aircraft Secret government UFO files Now, after years of silence, for the first time Area 51 insiders spill their secrets and reveal whats really been going on inside the most secretive place on earth.\n\n\nBook:\nArea 51: An Uncensored History of America's Top Secret Military Base\n2011 Ã‡â‚¬ 544 Ã‡â‚¬ ISBN: 0316132942 Ã‡â‚¬ PDF Ã‡â‚¬ 10 Mb\n\nIt is the most famous military installation in the world. And it doesn't exist. Located a mere seventy-five miles outside of Las Vegas in Nevada's desert, the base has never been acknowledged by the U.S. government-but Area 51 has captivated imaginations for decades.\n\nMyths and hypotheses about Area 51 have long abounded, thanks to the intense secrecy enveloping it. Some claim it is home to aliens, underground tunnel systems, and nuclear facilities. Others believe that the lunar landing itself was filmed there. The prevalence of these rumors stems from the fact that no credible insider has ever divulged the truth about his time inside the base. Until now.\n\nAnnie Jacobsen had exclusive access to nineteen men who served the base proudly and secretly for decades and are now aged 75-92, and unprecedented access to fifty-five additional military and intelligence personnel, scientists, pilots, and engineers linked to the secret base, thirty-two of whom lived and worked there for extended periods. In Area 51, Jacobsen shows us what has really gone on in the Nevada desert, from testing nuclear weapons to building super-secret, supersonic jets to pursuing the War on Terror.\n\nThis is the first book based on interviews with eye witnesses to Area 51 history, which makes it the seminal work on the subject. Filled with formerly classified information that has never been accurately decoded for the public, Area 51 weaves the mysterious activities of the top-secret base into a gripping narrative, showing that facts are often more fantastic than fiction, especially when the distinction is almost impossible to make. \n","torrent":{"xt":"urn:btih:4ec9ce00d76334696f6c9ba89eb822db1e6cea92","amp;dn":"Area+51+Pack+-+New+Documentary+and+Annie+Jacobsen+Book%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ec9ce00d76334696f6c9ba89eb822db1e6cea92","infoHashBuffer":{"type":"Buffer","data":[78,201,206,0,215,99,52,105,111,108,155,168,158,184,34,219,30,108,234,146]},"announce":[],"urlList":[]}}