{"title":"Barbara Kingsolver Flight Behavior 2012 Retail EPUB eBook-BitBoo","uid":8636450,"size":1095619,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f34a576cb29b989b9840bb75fc898c4fee92d06&amp;dn=Barbara+Kingsolver+Flight+Behavior+2012+Retail+EPUB+eBook-BitBoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"BlackTar","files":2,"time":1372763721,"description":" |                            Flight Behavior                                 |\n |                                                                            |\n |                                 A Novel                                    |\n |                                                                            |\n |                                                                            |\n | DATE: 2013-05-16  SIZE: 1,03MB   DISKS: 01_______4,77MB      PAGES:        |\n |                                                                            |\n | PUBLISHER: HarperCollins                     GENRE: Fiction                |\n |                                                                            |\n | AUTHOR: Barbara Kingsolver                                                 |\n |                                                                            |\n | FORMAT: EPUB   PROTECTION: DRM     EDITION:                                |\n |                                                                            |\n | URL: http://www.booksamillion.com/p/Flight-Behavior/Barbara-Kingsolver/Q798592949                                                   |\n |                                                                            |\n | LANGUAGE: English   ISBN: 9780062124289                                    |\n :                                                                            :\n : Flight Behavior transfixes from its opening scene, when a young woman's    :\n : narrow experience of life is thrown wide with the force of a raging fire.  :\n : In the lyrical language of her native Appalachia, Barbara Kingsolver bares :\n : the rich, tarnished humanity of her novel's inhabitants and unearths the   :\n : modern complexities of rural existence. Characters and reader alike are    :\n : quickly carried beyond familiar territory here, into the unsettled ground  :\n : of science, faith, and everyday truces between reason and conviction.      :\n :                                                                            :\n : Dellarobia Turnbow is a restless farm wife who gave up her own plans when  :\n : she accidentally became pregnant at seventeen. Now, after a decade of      :\n : domestic disharmony on a failing farm, she has settled for permanent       :\n : disappointment but seeks momentary escape through an obsessive flirtation  :\n : with a younger man. As she hikes up a mountain road behind her house to a  :\n : secret tryst, she encounters a shocking sight: a silent, forested valley   :\n : filled with what looks like a lake of fire. She can only understand it as a:\n : cautionary miracle, but it sparks a raft of other explanations from        :\n : scientists, religious leaders, and the media. The bewildering emergency    :\n : draws rural farmers into unexpected acquaintance with urbane journalists,  :\n : opportunists, sightseers, and a striking biologist with his own stake in   :\n : the outcome. As the community lines up to judge the woman and her miracle, :\n : Dellarobia confronts her family, her church, her town, and a larger world, :\n : in a flight toward truth that could undo all she has ever believed.        :\n :                                                                            :\n : Flight Behavior takes on one of the most contentious subjects of our time: :\n : climate change. With a deft and versatile empathy Kingsolver dissects the  :\n : motives that drive denial and belief in a precarious world.                :","torrent":{"xt":"urn:btih:4f34a576cb29b989b9840bb75fc898c4fee92d06","amp;dn":"Barbara+Kingsolver+Flight+Behavior+2012+Retail+EPUB+eBook-BitBoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f34a576cb29b989b9840bb75fc898c4fee92d06","infoHashBuffer":{"type":"Buffer","data":[79,52,165,118,203,41,185,137,185,132,11,183,95,200,152,196,254,233,45,6]},"announce":[],"urlList":[]}}