{"title":"Democracy Now - 22 jul 2011","uid":6558242,"size":457247984,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4f4d02d5522cf69e3a1f7ec6fc32d2694b7d57a3&amp;dn=Democracy+Now+-+22+jul+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":1,"time":1311362933,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jul 22, 2011\n\n- Al-Shabab Says Foreign Aid Ban Continues in Somalia\n- Obama, Boehner Near Deficit Agreement\n- Pentagon to Announce Readiness on &quot;Don't Ask, Don't Tell&quot; Repeal\n- Greece, EU Reach New Bailout Deal\n- Gaddafi Rules Out Talks With Rebels\n- Syrian Forces Attack City of Homs\n- Egypt Approves New Cabinet Amid Ongoing Protests\n- Ex-News Execs: James Murdoch Mislead British Lawmakers on Hacking\n- Britain Loses Bid to Dismiss Mau Mau Case\n- NASA Wraps Up 30-Year Space Shuttle Program\n\n\nSpecial reports\n\n- NLRB Orders New Election After Ruling SEIU, Kaiser Colluded to Influence Union Vote\n\nThe National Labor Relations Board has recommended the cancellation of the results of an election last year between two unions to represent 43,000 employees in California's largest hospital chain, Kaiser Permanente. The giant Service Employees International Union, or SEIU, beat out the much smaller breakaway National Union of Health Workers, or NUHW, in a bitterly contest race. But a National Labor Relations Board judge has now ruled SEIU was guilty of misconduct and collusion with Kaiser Permanente to influence the vote's outcome. Democracy Now! co-host and New York Daily News columnist Juan Gonzalez comments on what he calls a &quot;huge decision&quot; for the labor movement.\n\n\n- Horn of Africa Famine: Millions At Risk in &quot;Deadly Cocktail&quot; of War, Climate Change, Neoliberalism\n\nThe United Nations has called an emergency meeting to discuss the Horn of Africa drought, which it says has already claimed tens of thousands of lives. Famine was declared in two regions of Somalia on Wednesday where 3.7 million people are in need of urgent humanitarian assistance. Another 8 million people need food assistance in neighboring countries including Kenya and Ethiopia. United Nations Secretary-General Ban Ki-moon calls the situation a &quot;catastrophic combination of conflict, high food prices and drought&quot; and has appealed for immediate aid. We go to Nairobi for an update from Kiki Gbeho of the U.N. Office for the Coordination of Humanitarian Affairs. We also speak with Christian Parenti, author of &quot;Tropic of Chaos: Climate Change and the New Geography of Violence.&quot; &quot;This was predicted long ago by people on the ground,&quot; Parenti says. &quot;It is a combination of war, climate change and very bad policy, particularly an embrace of radical free-market by regional governments that mean the withdrawal of support for pastoralists, the type of people you saw with their dead cattle.&quot;\n\n\n- Pushing Crisis: GOP Cries Wolf on Debt Ceiling In Order To Impose Radical Pro-Rich Agenda\n\nPresident Obama and Republican House speaker John Boehner are allegedly close to a $3 trillion deficit-reduction package as part of a deal to raise the federal debt ceiling before an Aug. 2 deadline. But the deal is coming under fire from both Congressional Democrats and Republicans - part of it calls for lowering personal and corporate income tax rates, while eliminating or reducing an array of popular tax breaks, such as the deduction for home mortgage interest. Some Democratic lawmakers expressed outrage on Thursday because the Obama-Boehner agreement appears to violate their pledge not to cut Social Security and Medicare benefits as well as Obama's promise not to make deep cuts in programs for the poor without extracting some tax concessions from the rich. We're joined by economist Michael Hudson, President of the Institute for the Study of Long-Term Economic Trends, a Distinguished Research Professor of Economics at the University of Missouri, Kansas City, and author of &quot;Super-Imperialism: The Economic Strategy of American Empire.&quot;\n\n\n- Rejecting Lucrative Offer, Cenk Uygur Leaves MSNBC After Being Told to &quot;Act Like An Insider&quot;\n\nAfter giving a nearly six-month tryout for the Internet talk show host Cenk Uygur, the cable news channel MSNBC is preparing to instead award its 6 p.m. primetime slot to the Reverend Al Sharpton. MSNBC President Phil Griffin offered Uygur a well-paid but lower-profile on-air slot, but Uygur rejected the offer, saying the decision to demote him was politically motivated. Uygur is known for aggressively interrogating leading Washington figures and challenging the political establishment, which he alleges made some MSNBC executives uneasy. He said Griffin had called him into his office in April and told him he had been talking to people in Washington, and that they did not like Uygur's tone. We speak with Uygur, who also blogs at several liberal websites and hosts a popular Internet and radio show, &quot;The Young Turks.&quot; &quot;It is corporate media... It is not just MSNBC. Do you think the CNN hosts can aggressively challenge government officials? I don't think so,&quot; says Uygur says.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:4f4d02d5522cf69e3a1f7ec6fc32d2694b7d57a3","amp;dn":"Democracy+Now+-+22+jul+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f4d02d5522cf69e3a1f7ec6fc32d2694b7d57a3","infoHashBuffer":{"type":"Buffer","data":[79,77,2,213,82,44,246,158,58,31,126,198,252,50,210,105,75,125,87,163]},"announce":[],"urlList":[]}}