{"title":"PublicAgent - Kitty Lovedream - Black haired babe fucks stranger","uid":12179256,"size":687239958,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:4fae2cc727a6eb22795a9e69852fa8669218e302&amp;dn=PublicAgent+-+Kitty+Lovedream+-+Black+haired+babe+fucks+stranger&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"panupong","files":1,"time":1438382442,"description":"imgdrive.co/vvuemnjmdgeh/1.jpg.html\n\n\n\n\nI was walking along with my camera when I saw this hot black haired babe, she had the best body. So hot. I stopped her and started chatting to her. Luckily we were able to communicate in English because I don't speak her native tongue, Hungarian. So I told her about this modelling business and I could tell she was in to it. I told her about how much she could earn and she was keen to do a small casting somewhere nearby, as long as it was quick! So, we found this little staircase, we could see up or down and hear anyone coming. She took off her clothes and showed me her perfect body up close! Wow! She had lovely white underwear on. After I got the shots I needed I asked her if she'd be interested in having some more fun for a load more cash. Once she saw what I had to offer she was already on her knees wrapping her lips around my cock! Looking up at me with those 'come to bed' eyes! I pulled her up and pulled down her skimpy white panties and started giving it to her from behind, she was loving it! I got on the floor and got her to ride me, she got on top of my cock and I pulled her tits out of her blouse. They felt so nice! We got up again and I fucked her from behind for a bit before emptying my load all over her ass!","torrent":{"xt":"urn:btih:4fae2cc727a6eb22795a9e69852fa8669218e302","amp;dn":"PublicAgent+-+Kitty+Lovedream+-+Black+haired+babe+fucks+stranger","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fae2cc727a6eb22795a9e69852fa8669218e302","infoHashBuffer":{"type":"Buffer","data":[79,174,44,199,39,166,235,34,121,90,158,105,133,47,168,102,146,24,227,2]},"announce":[],"urlList":[]}}