{"title":"Modern Art - A Very Short Introduction (Art Ebook).pdf","uid":10093361,"size":3774064,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4fd086745d131f54ce3c61af0105ecfe0e21d9c7&amp;dn=Modern+Art+-+A+Very+Short+Introduction+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"STBGD","files":-1,"time":1399243786,"description":"David Cottington - Modern Art: A Very Short Introduction\nISBN: 0192803646 | PDF | 168 pages | 3.59 MB\n\n\nPublic interest in modern art continues to grow, as witnessed by the spectacular success of the Tate Modern in London and the Bilbao Guggenheim. Modern Art: A Very Short Introduction engages general readers, offering them not only information and ideas about modern art, but also explaining its contemporary relevance and history. The book focuses on interrogating the idea of &quot;modern&quot; art by asking such questions as: What makes a work of art qualify as modern, or fail to? How has this selection been made? What is the relationship between modern and contemporary art? Is &quot;postmodernist&quot; art no longer modern, or just no longer modernist? In either case, why--and what does this claim mean, both for art and the idea of &quot;the modern?&quot;\nCottingham examines many key aspects of this subject, including the issue of controversy in modern art, from Manet's Dejeuner sur L'Herbe (1863) to Picasso's Les Demoiselles, and Tracey Emin's Bed (1999). He also looks at the role of the dealer from the main Cubist art dealer Kahnweiler, to Charles Saatchi.","torrent":{"xt":"urn:btih:4fd086745d131f54ce3c61af0105ecfe0e21d9c7","amp;dn":"Modern+Art+-+A+Very+Short+Introduction+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fd086745d131f54ce3c61af0105ecfe0e21d9c7","infoHashBuffer":{"type":"Buffer","data":[79,208,134,116,93,19,31,84,206,60,97,175,1,5,236,254,14,33,217,199]},"announce":[],"urlList":[]}}