{"title":"Question (?) Mark &amp; The Mysterians - Cameo Parkway 1966-1967","uid":4792608,"size":50396732,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:502b5d14f09c88f918c4d97f506e62b5703cadcc&amp;dn=Question+%28%3F%29+Mark+%26+The+Mysterians+-+Cameo+Parkway+1966-1967&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":4,"uploader":"dankencity","files":28,"time":1237763768,"description":"Question Mark and the Mysterians (or ? and the Mysterians) were an American rock and roll band formed in Bay City, Michigan, in 1962.\n\nThe group is best known for its song &quot;96 Tears,&quot; a garage rock classic recorded in 1966 that reached #1 on the Billboard Hot 100 and would go on to sell over one million copies and receive a BMI award for over three million airplays. Rudy Martinez, the lead singer, legally changed his name to Question Mark (?). Question Mark and the Mysterians was perhaps the first band to be described as punk rock[1], and also may be the first Latino rock group to have a general audience hit record in the United States. The group named itself after the 1957 Japanese science fiction film The Mysterians, in which aliens from the destroyed planet Mysteroid arrive to conquer Earth.\n\nThe band's frontman and primary songwriter was Question Mark. Though the singer has never confirmed it, Library of Congress copyright registrations indicate that his birth name is Rudy Martinez. His eccentric behavior helped to briefly establish the group in the national consciousness. He claimed (and still claims) to be a Martian who lived with dinosaurs in a past life, and he never appears in public without sunglasses. He has also claimed that voices told him he would still be performing &quot;96 Tears&quot; in the year 10,000.","torrent":{"xt":"urn:btih:502b5d14f09c88f918c4d97f506e62b5703cadcc","amp;dn":"Question+%28%3F%29+Mark+%26+The+Mysterians+-+Cameo+Parkway+1966-1967","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"502b5d14f09c88f918c4d97f506e62b5703cadcc","infoHashBuffer":{"type":"Buffer","data":[80,43,93,20,240,156,136,249,24,196,217,127,80,110,98,181,112,60,173,204]},"announce":[],"urlList":[]}}