{"title":"The Complete Book of Spaceflight - From Apollo 1 to Zero Gravity","uid":10867515,"size":10527117,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:503896bf1125fed00c663d9670fc9681c76c57ce&amp;dn=The+Complete+Book+of+Spaceflight+-+From+Apollo+1+to+Zero+Gravity&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"tmcnl","files":-1,"time":1408927787,"description":"The Complete Book of Spaceflight: From Apollo 1 to Zero Gravity\n\nby David Darling\n\n\nA commanding encyclopedia of the history and principles of spaceflight-from earliest conceptions to faster-than-light galaxy-hopping\nHere is the first truly comprehensive guide to space exploration and propulsion, from the first musings of the Greeks to current scientific speculation about interstellar travel using &quot;&quot;warp drives&quot;&quot; and wormholes. Space buffs will delight in its in-depth coverage of all key manned and unmanned missions and space vehicles-past, present, and projected-and its clear explanations of the technologies involved.\nOver the course of more than 2,000 extensively cross-referenced entries, astronomer David Darling also provides fascinating insights into the cultural development of spaceflight. In vivid accounts of the major characters and historical events involved, he provides fascinating tales of early innovators, the cross-pollination that has long existed between science fiction and science fact, and the sometimes obscure links between geopolitics, warfare, and advances in rocketry.\n\n2002\nPDF","torrent":{"xt":"urn:btih:503896bf1125fed00c663d9670fc9681c76c57ce","amp;dn":"The+Complete+Book+of+Spaceflight+-+From+Apollo+1+to+Zero+Gravity","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"503896bf1125fed00c663d9670fc9681c76c57ce","infoHashBuffer":{"type":"Buffer","data":[80,56,150,191,17,37,254,208,12,102,61,150,112,252,150,129,199,108,87,206]},"announce":[],"urlList":[]}}