{"title":"Sonokinetic - Haka [KONTAKT]","uid":8989737,"size":671064515,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:523e6580644ce456d991a38e1966ada9cfdbfd6a&amp;dn=Sonokinetic+-+Haka+%5BKONTAKT%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"NewSky006","files":625,"time":1380758132,"description":"Torrent Info:\n==============\n\nThis is not my own torrent! Also, I'm sorry for the lack of an image, bayimg is not working well atm.\n\n\nTorrent Contents:\n==================\n\nInfo files (an NFO from Magnetrixx, a notice that the torrent was from Demonoid and a hash file)\nKontakt Library\n\n\nInstallation:\n==============\n\nAdd the Kontakt library (&quot;Sonokinetic Haka KONTAKT&quot;) as a library to (cracked) Kontakt.\n\n\nProduct Info:\n==============\n\nRuss Landau and Sonokinetic joined forces with pacific warriors.This library is guaranteed to help you impress your opponent and proclaim your strength and prowess in order to intimidate your opposition. Recorded on location deep within the Vanuatu, Samoan, Hawaiian, New Zealand and the Marquesas Islands, this is original tribal warrior music that we discovered and captured in high quality audio. With this production we're proud to present you a testament of these ancient musical cultures in song, chant and dance.\n\nScraping the surface of this vast cultural heritage Russ Landau and Sonokinetic invested in producing a collection of samples that are unmatched in authenticity, realism, power and beauty. Lomax would have been jealous and anxious if he'd knew what would be possible with modern technology.\n\nThis second volume of this special sample line we're enriching field recorded genuine original ethnic music with a high mark on originality and usability.\nThe intelligent scripting and use of the Kontakt sample format makes this sample pool of live performed music and dance fit right in, or be the base to work from for, your compositions and productions.Built in a single Kontakt patch, this new setup will give you the flexibility to construct your own instrument by selecting and adding groups of samples and simply dragging them to your midi keyboard. So gone are the days that you had to weed through tons of patches.\n\nA note by Russ:\n&quot;Bringing authenticity of place and tradition has been very important to my scoring for Survivor. I've been fortunate to have had the opportunity to record traditional ancestral music all over the globe and incorporate it into my scores. &quot;HAKA&quot; is the result of the fantastic people from Sonokinetic taking the best of my personal field and studio recordings of musicians from Tahiti, the Marquesas, Vanuatu and Samoa and bringing these to your fingertips. Thanks to all the musicians and traditional performers from Samoa, Vanuatu and Marquesas/Tahiti who lent their extraordinary talents to this project.&quot; February 2011 - Russ Landau","torrent":{"xt":"urn:btih:523e6580644ce456d991a38e1966ada9cfdbfd6a","amp;dn":"Sonokinetic+-+Haka+%5BKONTAKT%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"523e6580644ce456d991a38e1966ada9cfdbfd6a","infoHashBuffer":{"type":"Buffer","data":[82,62,101,128,100,76,228,86,217,145,163,142,25,102,173,169,207,219,253,106]},"announce":[],"urlList":[]}}