{"title":"The Creative Writer's Workshop by Cathy Birch","uid":12639803,"size":2164692,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:525e2008692087db2b31585463ddd939fe237f13&amp;dn=The+Creative+Writer%27s+Workshop+by+Cathy+Birch&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"ZamKhan","files":1,"time":1445977251,"description":"This book aims to get you writing and keep you writing - and help you enjoy your writing to the full. It will show you how to free your own unique voice and create original, individual work. It is packed with exercises, visualisation techniques, flow charts, dream-work and word webs that will enable you to explore the treasures of your subconscious, revisit your childhood world of games and make believe, and bring back what you find. Then it shows you how to harness that creativity in developing your characters, settings, plot and dialogue. Additional exercises focus on sustaining your own motivation, providing the perfect setting in which to develop your writing. This book will help you at every stage. Use it to rediscover your love of words and the spontaneity in your writing. Find your voice and become the writer you were meant to be. \r\n\r\nContents:\r\n1. Writing as a Way of Life; 2. Tuning In; 3. Discovering the Plot; 4. Developing Atmosphere, Pace and Mood; 5. Working with Beginnings and Endings; 6. Surprise Yourself; 7. Working With Your Dreams; 8. Recycling; 9. Crafting Your Work; 10. Editing Your Work; Glossary; References; Further reading; Useful addresses and websites; Index","torrent":{"xt":"urn:btih:525e2008692087db2b31585463ddd939fe237f13","amp;dn":"The+Creative+Writer%27s+Workshop+by+Cathy+Birch","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"525e2008692087db2b31585463ddd939fe237f13","infoHashBuffer":{"type":"Buffer","data":[82,94,32,8,105,32,135,219,43,49,88,84,99,221,217,57,254,35,127,19]},"announce":[],"urlList":[]}}