{"title":"Splitting The Second: The Story of Atomic Time","uid":8317229,"size":15623346,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:52fd3f2d24347240462bd14a8f427831063368a8&amp;dn=Splitting+The+Second%3A+The+Story+of+Atomic+Time&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1364614447,"description":" A. Jones, &quot;Splitting The Second: The Story of Atomic Time&quot;\n2000 | pages: 202 | ISBN: 0750306408 | PDF | 14,9 mb\n\nUntil the 1950s timekeeping was based on the apparent motion of the Sun that in turn reflected the rotation of the Earth on its axis. But the Earth does not turn smoothly. By the 1940s it was clear that the length of the day fluctuated unpredictably and with it the length of the second. Astronomers wanted to redefine the second in terms of the motions of the Moon and the planets. Physicists wanted to dispense with astronomical time altogether and define the second in terms of the fundamental properties of atoms.\n\nThe physicists won. The revolution began in June 1955 with the operation of the first successful atomic clock and was complete by October 1967 when the atomic second ousted the astronomical second as the international unit of time.\n\nSplitting the Second: The Story of Atomic Time presents the story of this revolution, explaining how atomic clocks work, how more than 200 of them are used to form the world's time, and why we need leap seconds. The book illustrates how accurate time is distributed around the world and what it is used for. It concludes with a look at the future of timekeeping.","torrent":{"xt":"urn:btih:52fd3f2d24347240462bd14a8f427831063368a8","amp;dn":"Splitting+The+Second%3A+The+Story+of+Atomic+Time","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52fd3f2d24347240462bd14a8f427831063368a8","infoHashBuffer":{"type":"Buffer","data":[82,253,63,45,36,52,114,64,70,43,209,74,143,66,120,49,6,51,104,168]},"announce":[],"urlList":[]}}