{"title":"The Association - Songs That Made Them Famous (1984)","uid":8625955,"size":413417286,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:532dcb72b23a59b952250550df48b26d290f52b2&amp;dn=The+Association+-+Songs+That+Made+Them+Famous+%281984%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"WasAtWoodstock","files":33,"time":1372511352,"description":"This is the same torrent that was uploaded to Demonoid in July 2008.\n\n\nThe Association - Songs That Made Them Famous (1984)\n &lt;a href=&quot;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/14/27/e469d250fca053b375161010._AA240_.L.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/14/27/e469d250fca053b375161010._AA240_.L.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nTracks have full tags (including embedded thumbnail).\nAll artwork in jpgs at 300 d.p.i. Rotated and cropped losslessly using jpegcrop.\nAMG Bio.txt\nAMG Review.txt\nNotes.txt (which is simply these notes included in the torrent)\n\nBio Excerpt from All Music:\n\nThe Association was one of the more underrated groups to come out of the mid- to late '60s. Creators of an enviable string of hits from 1966 through 1969, they got caught in a shift in popular culture and the unwritten criteria for significance in that field and never recovered. The group's smooth harmonies and pop-oriented sound (which occasionally moved into psychedelia and, much more rarely, into a harder, almost garage-punk vein) made them regular occupants of the highest reaches of the pop charts for two years -- their biggest hits, including &quot;Along Comes Mary,&quot; &quot;Cherish,&quot; &quot;Windy,&quot; and &quot;Never My Love,&quot; became instant staples of AM play lists, which was a respectable achievement for most musicians at the time. That same sound, along with their AM radio popularity, however, proved a liability as the music environment around them changed at the end of the decade. Additionally, their ensemble singing, essential to the group's sound and appeal, all but ensured that the individual members never emerged as personalities in their own right. The Association was as anonymous an outfit as their contemporaries the Grass Roots, in terms of any individual names or attributes, despite the fact that both groups generated immensely popular hits that millions of listeners embraced on a deeply personal level. ...\n\nTo read the entire bio: &lt;a href=&quot;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:3ifixqw5ldae~T1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:3ifixqw5ldae~T1&lt;/a&gt;\n\nA minimal review from &lt;a href=&quot;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:gifexq95ldte&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:gifexq95ldte&lt;/a&gt;\n\nBeyond the hits, all of which are included here (&quot;Windy,&quot; &quot;Cherish,&quot; &quot;Along Comes Mary&quot;), The Association made stunning orchestral folk-pop that still makes the listener feel good.\n\nThe page at Amazon.com: &lt;a href=&quot; http://www.amazon.com/dp/B000008D00/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B000008D00/&lt;/a&gt;\nHas this customer review:\n\nManufactured for Pair Records by Warner Special Products and put out in 1984, the name doesn't really give you any idea about what's on this CD. It is actually 2 of The Association's early albums in one, with &quot;And Then...Along Comes the Association&quot; from 1966 and &quot;Inside Out&quot; from 1967. Obviously Pair-ed up since they were two of the Association's better albums. No extra tracks, just what appeared on the originals, and it states: &quot;Original Analog Recordings - Digitally Remastered&quot;. I am no expert on remastering, but it sound good to me....and the music is great too.\n\nWell, checking the track list I see that the customer is correct! So here are the All Music reviews for those two albums:\n\nTracks 1-12: And Then...Along Comes the Association\n\nThe group's debut album may be better listening today than it was in 1966, because it can be appreciated more -- and it definitely deserves a better reputation than it has among folk-rock, psychedelic pop, and pop/rock enthusiasts. The album is usually neglected because of the Association's reputation as a soft rock outfit and the prominence of the hits &quot;Cherish&quot; and &quot;Along Comes Mary,&quot; both of which are too poppy for most serious '60s archeologists. The original LP was one or two songs short of uniformly high-quality material, but that defect was compensated for by the better numbers and the production of the late Curt Boettcher. Admittedly one of Boettcher's softer creations, And Then...Along Comes the Association displayed the same creative use of stereo sound separation -- the interlocking instrumental and vocal parts divided in discreet two-channel sound -- that was to characterize his work with groups like the Millennium and Sagittarius a little later in the decade. Indeed, And Then...Along Comes the Association was among the earliest American rock albums to make full creative use of stereo sound and to exploit it on behalf of a group. In those days, the stereo mix on a rock album was usually little more than an afterthought by the producer and engineer (most of whom hated rock &amp; roll), but Boettcher appreciated just what he had here, with the six singers and instrumentalists in this band, and he spread their work out in front of the listener in vivid detail, giving each &quot;voice&quot; (human and instrumental) a close airing, yet meshing them together as well.\n\n\nTrack List:\n\n01. Enter The Young\n02. Your Own Love\n03. Don't Blame It On Me\n04. Blistered\n05. I'll Be Your Man\n06. Along Comes Mary\n07. Cherish\n08. Standing Still\n09. Message of Our Love\n10. Round Again\n11. Remember\n12. Changes\n\n13. Wasn't It A Bit Like Now (Parallel 23)\n14. On A Quiet Night\n15. We Love Us\n16. When Love Comes To Me\n17. Windy\n18. Reputation\n19. Never My Love\n20. Happiness\n21. Sometime\n22. Wantin' Ain't Gettin'\n23. Requiem For The Masses\n","torrent":{"xt":"urn:btih:532dcb72b23a59b952250550df48b26d290f52b2","amp;dn":"The+Association+-+Songs+That+Made+Them+Famous+%281984%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"532dcb72b23a59b952250550df48b26d290f52b2","infoHashBuffer":{"type":"Buffer","data":[83,45,203,114,178,58,89,185,82,37,5,80,223,72,178,109,41,15,82,178]},"announce":[],"urlList":[]}}