{"title":"Downton Abbey Seizoen 1(comp) NL subs ( 2010)(Retail) TBS ","uid":6715185,"size":13512076308,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:535f75aca73acd7c269ff8022bb986756072edf7&amp;dn=Downton+Abbey+Seizoen+1%28comp%29+NL+subs+%28+2010%29%28Retail%29+TBS+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Betty-Boop","files":-1,"time":1317545176,"description":"Downton Abbey Seizoen 1 NL subs TV Serie 2010 \t\n\n\nHet zijn 3 DVD's in 1 spot.\n\n\nDownton Abbey, bedacht en geschreven door Oscar winnaar Julian Fellowes (Gosford Park, The Young Victoria), is een weelderig kostuumdrama dat kan bogen op een absolute sterrencast: Hugh Bonneville, Maggie Smith, Elizabeth McGovern, Michelle Dockery, Dan Stevens, Penelope Wilton, Jim Carter, Phyllis Logan, Siobhan Finneran, Joanne Froggatt, Rob James-Collier en Brendan Coyle. Dit uitgelezen ensemble laat de wereld van Downton op prachtige, meeslepende wijze herleven.\n\nHet verhaal speelt zich af in Engeland, tijdens de jaren net voor de Eerste Wereldoorlog, en schildert het portret van een complexe gemeenschap. Hoewel het landgoed al vele generaties de thuishaven is van de adellijke Crawleys, is het immers ook de plek waar de bedienden - binnen een strikte hiÃƒÂ«rarchie - hun leven doorbrengen, met al hun grote dromen en kleine kantjes. Ook hun motieven blijken erg uiteenlopend. Terwijl sommigen de familie en levensstijl van Downton hondstrouw zijn, beschouwen anderen het landgoed als een tussenstadium naar een andere, betere betrekking of als een plaats waar je liefde of avontuur kunt vinden. Het enige verschil is dat zij zowat alle familiegeheimen kennen, terwijl de familie nauwelijks weet wat hen beroert. Ondanks de vaak heftige gevoelens die onder de oppervlakte borrelen, biedt Downton iedereen houvast. Het is een serene, rustgevende plaats waar ieder zijn plek heeft en kent. Een plaats die er, zo lijkt het althans, altijd zal zijn. Wat familie noch personeel echter beseffen, is dat de wolken van het conflict dat alles op zijn kop zal zetten, zich al boven hun hoofden aan het samenpakken zijn... \n\nEnglish\n\nStoryline\n\nLord Crawley sees his family heritage, especially the grand country home Downton Abbey, as his mission in life. The death of his heir aboard the Titanic means distant cousin Matthew Crawley, a Manchester lawyer, suddenly is next in line and accepts moving onto the vast estate with his even more modernist, socially engaged mother, who clashes with his lordship's domineering, conservative ma the dowager. Marrying off the daughters is another concern. Meanwile the butler presides over a staff which serves the family but also lead most of their entire lives in the servants quarters, intriguing amongst themselves. Written by\n\n\n\nCategory........: Video\nFormat..........: DVD5\nSource..........: Retail\nSubtitle........: Dutch subs optional\nGenre...........: Drama\nLanguage........: English audio\nUitvoering......: Dvd, 3 disks, speelduur 360:00 minuten\nBeeldformaat....: 1.85:1 16:9\n\n \nwww.imdb.com/title/tt1606375\n \t\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n\nKom ook eens kijken :\n &lt;a href=&quot;\nhttp://black-sam.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://black-sam.org&lt;/a&gt;\n\nEnjoy\n\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@","torrent":{"xt":"urn:btih:535f75aca73acd7c269ff8022bb986756072edf7","amp;dn":"Downton+Abbey+Seizoen+1%28comp%29+NL+subs+%28+2010%29%28Retail%29+TBS+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"535f75aca73acd7c269ff8022bb986756072edf7","infoHashBuffer":{"type":"Buffer","data":[83,95,117,172,167,58,205,124,38,159,248,2,43,185,134,117,96,114,237,247]},"announce":[],"urlList":[]}}