{"title":"Body by Weimar - Athletes, Gender, and German Modernity (History","uid":9996586,"size":3118373,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:537bd2d3a1e65326218c8c2e0a1c75ceecd94c46&amp;dn=Body+by+Weimar+-+Athletes%2C+Gender%2C+and+German+Modernity+%28History&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"STBGD","files":-1,"time":1397930480,"description":"Erik N. Jensen, &quot;Body by Weimar: Athletes, Gender, and German Modernity&quot;\nPublisher: OUP, USA | 2010 | ISBN 0195395646 | PDF | 200 pages | 3 MB\n\nIn Body by Weimar, Erik N. Jensen shows how German athletes reshaped gender roles in the turbulent decade after World War I and established the basis for a modern body and modern sensibility that remain with us to this day. The same cutting-edge techniques that engineers were using to increase the efficiency of factories and businesses in the 1920s aided athletes in boosting the productivity of their own flesh and bones. Sportswomen and men embodied modernity-quite literally-in its most streamlined, competitive, time-oriented form, and their own successes on the playing fields seemed to prove the value of economic rationalization to a skeptical public that often felt threatened by the process. Enthroned by the media as culture's trendsetters, champions in sports such as tennis, boxing, and track and field also provided models of sexual empowerment, social mobility, and self-determination. They showed their fans how to be modern, and, in the process, sparked heated debates over the aesthetics of the body, the limits of physical exertion, the obligations of citizens to the state, and the relationship between the sexes. If the images and debates in this book strike readers as familiar, it might well be because the ideal body of today-sleek, efficient, and equally available to men and women-received one of its earliest articulations in the fertile tumult of Germany's roaring twenties. After more than eighty years, we still want the Weimar body.","torrent":{"xt":"urn:btih:537bd2d3a1e65326218c8c2e0a1c75ceecd94c46","amp;dn":"Body+by+Weimar+-+Athletes%2C+Gender%2C+and+German+Modernity+%28History","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"537bd2d3a1e65326218c8c2e0a1c75ceecd94c46","infoHashBuffer":{"type":"Buffer","data":[83,123,210,211,161,230,83,38,33,140,140,46,10,28,117,206,236,217,76,70]},"announce":[],"urlList":[]}}