{"title":"Supreme 90 Day System x264 MP4 DVDrip","uid":8506395,"size":3355977926,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:53af11a7b65fcb14c4f2322fdac0d0f14bc47d74&amp;dn=Supreme+90+Day+System+x264+MP4+DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"MrTVGuy","files":-1,"time":1369437128,"description":"SUPREME 90 DAY SYSTEM x264 MP4 DVDrip\n\nTen no-nonsense, total-body workouts designed to completely reshape your body in 90 days. It's all based on &quot;muscle confusion&quot; -- a technique that constantly challenges your muscles with varying sequences of different exercises. All the workouts include carefully planned &quot;work&quot; and &quot;rest&quot; circuits (without specific rep counts -- you'll just do as much as you can in the time allotted). The exercises blend proven weight-room classics with newer &quot;functional fitness&quot; routines. The toning ranges from classic squats and bicep curls to multi-muscle training and and kettlebell-style moves. Your trainer, Tom Holland, makes the most of his equipment -- he matches the dumbbell weight to the exercise and often uses the stability ball as a weight bench to improve range of motion. \n\nOrdinary workouts lose steam because muscles plateau so you stop seeing results. Supreme 90 Day employs muscle confusion to accelerate results. Each routine brings on muscle shocking moves so your body stays challenged, so you keep getting stronger! The body you've always dreamed of is just 90 days away!\n\nThe warmup and cooldown are the same in every video but the variety of the workouts keep you going. If you like P90x, this workout is similar will add variety to your workout routine.\n\nRequired Equipment:\nStability ball and\nTwo sets of dumbbells (e.g. 5 lb. and 10 lb.)","torrent":{"xt":"urn:btih:53af11a7b65fcb14c4f2322fdac0d0f14bc47d74","amp;dn":"Supreme+90+Day+System+x264+MP4+DVDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53af11a7b65fcb14c4f2322fdac0d0f14bc47d74","infoHashBuffer":{"type":"Buffer","data":[83,175,17,167,182,95,203,20,196,242,50,47,218,192,208,241,75,196,125,116]},"announce":[],"urlList":[]}}