{"title":"Zero Day - A Novel (2011) Mark Russinovich","uid":6603557,"size":355287,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5433c498271a772370d93cff0e1ba7168f27d587&amp;dn=Zero+Day+-+A+Novel+%282011%29+Mark+Russinovich&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"WentloogWhix","files":1,"time":1313316214,"description":"Microsoft computer guru Russinovich's first novel, a cautionary tale about the imminence of the great cyber attack to wipe out the Internet, works pretty well as a thriller, though it takes a while to boot up and for the bodies to begin to fall. Arab terrorists, with the collusion of Osama bin Laden, are behind the attack, which is supposed to destroy Western civilization. A New York City law firm enlists cyber expert Jeff Aiken to track down a virus that has knocked out the company's computer network. While working on this problem, Jeff uncovers the larger threat. With the help of &quot;stunningly attractive&quot; Daryl Haugen, an old friend who becomes his love interest, Jeff attempts to warn the authorities, but to little avail. The author effectively employs the usual genre types - government traitors, amoral hackers, professional assassins - but his main characters spend too much time at the keyboard to build up much heat.\n\nCheck out more reviews on Amazon - mostly 5 and 4 stars.\nPrevious torrent upload turned out to be a disaster. Try this one","torrent":{"xt":"urn:btih:5433c498271a772370d93cff0e1ba7168f27d587","amp;dn":"Zero+Day+-+A+Novel+%282011%29+Mark+Russinovich","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5433c498271a772370d93cff0e1ba7168f27d587","infoHashBuffer":{"type":"Buffer","data":[84,51,196,152,39,26,119,35,112,217,60,255,14,27,167,22,143,39,213,135]},"announce":[],"urlList":[]}}