{"title":"A Century of progress - A Photographic Tour of the 1933-34 Chica","uid":9985068,"size":5383806,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5455af5e14a9674fe650ac65bb3de04b3ba31a3b&amp;dn=A+Century+of+progress+-+A+Photographic+Tour+of+the+1933-34+Chica&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"STBGD","files":-1,"time":1397778492,"description":"Chicago Tribune, &quot;Century of Progress: A Photographic Tour of the 1933-34 Chicago World's Fair&quot; \nEnglish | e-ISBN: 1572844450 | ASIN: B00BHOYDRE | 2013 | EPUB | 105 pages | 5,1 MB\n\nBetween 1933 and 1934, over 48 million visitors attended &quot;A Century of Progress Exposition,&quot; the world's fair located in Chicago, Illinois. Conceived of during the Roaring Twenties and born during the Great Depression, this was a sprawling event celebrating Chicago's 100th anniversary with industrial and scientific displays, lascivious entertainment, and a touch of unadulterated bad taste.\n\nCentury of Progress is a collection of rare photographs from the world's fair that has been carefully chosen from the Chicago Tribune's voluminous archives. Featuring an informative introduction by Tribune reporter and historian Ron Grossman, this book documents one of the most expansive displays of technological advancement and cultural diversity that took place in the 20th century. The lakefront exposition, on the present site of McCormick Place and Northerly Island, opened on May 27, 1933, and was reopened in 1934 at the urging of President Franklin D. Roosevelt who hoped it would stimulate the Depression-era economy.\n\nThis book is an engrossing and fascinating look at the numerous sides of the &quot;A Century of Progress Exposition&quot;: the whimsical attractions, the architectural and scientific achievements, the palpable spirit of fun, and the occasionally unsavory exhibits of differing cultures. At a time when the entire U.S. population numbered just over 125 million people, the Chicago world's fair left an indelible mark on the collective consciousness of American culture, and Century of Progress captures that feeling as only a photograph can.","torrent":{"xt":"urn:btih:5455af5e14a9674fe650ac65bb3de04b3ba31a3b","amp;dn":"A+Century+of+progress+-+A+Photographic+Tour+of+the+1933-34+Chica","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5455af5e14a9674fe650ac65bb3de04b3ba31a3b","infoHashBuffer":{"type":"Buffer","data":[84,85,175,94,20,169,103,79,230,80,172,101,187,61,224,75,59,163,26,59]},"announce":[],"urlList":[]}}