{"title":"James T. Patterson - Grand Expectations [64] Unabridged","uid":8505888,"size":874549312,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:55a83c444d96b06f17d3e4ccf7f74323dfe2d4b3&amp;dn=James+T.+Patterson+-+Grand+Expectations+%5B64%5D+Unabridged&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rambam1776","files":-1,"time":1369420471,"description":"James T. Patterson - Grand Expectations: The United States, 1945-1974\n\nFrom Audible dot com, Read by Robert Fass, 64 kbps\n\n2010 Audible, published 1996, Winner of the 1997 Bancroft Prize. Volume 10 of the Oxford History of the United States.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Oxford_History_of_the_United_States&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Oxford_History_of_the_United_States&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Bancroft_Prize&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Bancroft_Prize&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.barnesandnoble.com/w/grand-expectations-james-t-patterson/1100617329?ean=9780195117974&amp;isbn=9780195117974&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.barnesandnoble.com/w/grand-expectations-james-t-patterson/1100617329?ean=9780195117974&amp;isbn=9780195117974&lt;/a&gt;\n\nBeginning in 1945, America rocketed through a quarter-century of extraordinary economic growth, experiencing an amazing boom that soared to unimaginable heights in the 1960s. At one point, in the late 1940s, American workers produced 57 percent of the planet's steel, 62 percent of the oil, 80 percent of the automobiles. The U.S. then had three-fourths of the world's gold supplies. English Prime Minister Edward Heath later said that the United States in the post-War era enjoyed &quot;the greatest prosperity the world has ever known.&quot; It was a boom that produced a national euphoria, a buoyant time of grand expectations and an unprecedented faith in our government, in our leaders, and in the American dream--an optimistic spirit which would be shaken by events in the '60s and '70s, and particularly by the Vietnam War.\n\nNow, in Grand Expectations, James T. Patterson has written a highly readable and balanced work that weaves the major political, cultural, and economic events of the period into a superb portrait of America from 1945 through Watergate. Here is an era teeming with memorable events--from the bloody campaigns in Korea and the bitterness surrounding McCarthyism to the assassinations of the Kennedys and Martin Luther King, to the Vietnam War, Watergate, and Nixon's resignation. Patterson excels at portraying the amazing growth after World War II--the great building boom epitomized by Levittown (the largest such development in history) and the baby boom (which exploded literally nine months after V-J Day)--as well as the resultant buoyancy of spirit reflected in everything from streamlined toasters, to big, flashy cars, to the soaring, butterfly roof of TWA's airline terminal in New York. And he shows how this upbeat, can-do mood spurred grander and grander expectations as the era progressed.\n\nOf course, not all Americans shared in this economic growth, and an important thread running through the book is an informed and gripping depiction of the civil rights movement--from the electrifying Brown v. Board of Education decision, to the violent confrontations in Little Rock, Birmingham, and Selma, to the landmark civil rights acts of 1964 and 1965. Patterson also shows how the Vietnam War--which provoked LBJ's growing credibility gap, vast defense spending that dangerously unsettled the economy, and increasingly angry protests--and a growing rights revolution (including demands by women, Hispanics, the poor, Native Americans, and gays) triggered a backlash that widened hidden rifts in our society, rifts that divided along racial, class, and generational lines. And by Nixon's resignation, we find a national mood in stark contrast to the grand expectations of ten years earlier, one in which faith in our leaders and in the attainability of the American dream was becoming shaken.\n\nThe Oxford History of the United States\n\nThe Oxford History of the United States is the most respected multi-volume history of our nation. The series includes three Pulitzer Prize winners, a New York Times bestseller, and winners of the Bancroft and Parkman Prizes. The Atlantic Monthly has praised it as &quot;the most distinguished series in American historical scholarship,&quot; a series that &quot;synthesizes a generation's worth of historical inquiry and knowledge into one literally state-of-the-art book.&quot; Conceived under the general editorship of C. Vann Woodward and Richard Hofstadter, and now under the editorship of David M. Kennedy, this renowned series blends social, political, economic, cultural, diplomatic, and military history into coherent and vividly written narrative.","torrent":{"xt":"urn:btih:55a83c444d96b06f17d3e4ccf7f74323dfe2d4b3","amp;dn":"James+T.+Patterson+-+Grand+Expectations+%5B64%5D+Unabridged","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55a83c444d96b06f17d3e4ccf7f74323dfe2d4b3","infoHashBuffer":{"type":"Buffer","data":[85,168,60,68,77,150,176,111,23,211,228,204,247,247,67,35,223,226,212,179]},"announce":[],"urlList":[]}}