{"title":"Poke That Tranny In The Fanny Vol. 3 XXX 2015 WEB-DL","uid":12237606,"size":5794940224,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:56135ae62c49607ba59cf5e1ca522e9ca111fcfc&amp;dn=Poke+That+Tranny+In+The+Fanny+Vol.+3+XXX+2015+WEB-DL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Ctrlme","files":4,"time":1439693833,"description":"Poke That Tranny In The Fanny Vol. 3 XXX 2015 WEB-DL\n\nScreenshot(s): &lt;a href=&quot;\nhttp://imgctrl.com/image/N2m&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/N2m&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgctrl.com/image/N2r&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/N2r&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgctrl.com/image/N2s&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/N2s&lt;/a&gt;\n\nDescription: Our first scene begins with school athlete Christian reading the newspaper on his couch. He gets a knock on the door from opposing team cheerleader Jenna Belle. Christian lets her firmly know she's not allowed to be there, but she talks her way in and they quickly begin making out. She drops to her knees and begins blowing him. Then he eats her out on the couch and then fucks her while she's on her back, giving her some blowjobs in between. Then they switch to doggy and fucking side by side. She blows him a bit more then hops on his cock cowgirl and then reverse. Christian finishes by busting on her mouth. In the following scene, Jay Huntington walks into his place with Foxxy after paying her, he feels her up a bit and then Foxxy goes down on him and lets him titty fuck her. Then she takes him in doggy, on her back, from behind while side by side, and reverse cowgirl. Jay finishes with a cumshot on her tits. Next scene begins with Christian talking on the phone with his friend. Apparently the friend saw his babysitter Ryder Monroe dancing at a transsexual bar in Long Beach. Christian in disbelief goes into the bedroom where his babysitter is sleeping to find out the truth and indeed she is. Of course this means he's going down on her immediately. Then she gets on her knees and blows him. After a bit, he fucks her doggy style, on her back, on her side, reverse cowgirl, and cowgirl. He finishes by coming in her mouth. Next up is Venus Lux in heels, stockings and a skimpy top walking up to Smith's car while he's grubbing. He says he's not interested in what she's offering and rolls up the window. She responds by rubbing her cock on the window and his mood suddenly changes. After taking her back to his place, and paying her, he goes down on her. He rims her some and then they 69. She hops on him cowgirl and then spins around reverse. Then Smith fucks her from behind while they lay side by side. Then Venus fucks him prone, doggy, and on his back where he strokes himself until he comes and then Venus follows suit. Cheerleader Natalie Foxx opens the next scene as she chats with soccer player Jay Huntington. After some brief chit chat, they start making out. Natalie begins blowing him and then hops on his cock reverse cowgirl. Then she takes him in doggy style and then props her ass in the air so he can fuck her from above. Then he carries her onto the couch and fucks her on her back while she strokes herself until she sprays all along her thigh. He follows suit and comes on her cock and in her mouth. Next scene we see babysitter Ariel Everitts and Earl Slate. In the bedroom, they get the foreplay going, strip, and Ariel starts blowing him. She hops on his cock cowgirl then reverse cowgirl, Earl fucks her from behind while laying side by side, doggy style, and on her back where she strokes herself until she comes all over. Earl quickly follows suit with a facial. Nelly opens the following scene practicing her cheerleading skills with Jay Huntington. They go inside and start with the foreplay. She starts going down on him and then takes him in doggy style. Then she hops on him reverse cowgirl. The scene switches to her getting fucked on her back and then he quickly pulls out and busts a sloppy come shot on her face and chest. The last scene begins with babysitter Khloe Hart outside enjoying the flowers. She comes in to see Earl Slate and after a bit of chat, he learns that she's a transsexual. Earl's elated since he doesn't have to worry about knocking her up! Khloe goes down on him and after a bit, Earl has her on her back getting fucked. Then she hops on him reverse cowgirl and then she takes him in doggy while she strokes herself hard until she comes. Earl finishes with a nice facial.\n\nLength: 3:45:22\n\nScene 1: Jenna Belle\nScene 2: Foxxy\nScene 3: Ryder Monroe\nScene 4: Venus Lux\nScene 5: Natalie Foxx\nScene 6: Ariel Everitts\nScene 7: Nelly\nScene 8: Khloe Hart\n\nâ˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…\n\n               If you like this torrent, please post a comment!\n            \n                            Don't forget to seed!\n\nâ˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…â˜…\n &lt;a href=&quot;\nhttps://pirates-forum.org/User-Ctrlme&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/User-Ctrlme&lt;/a&gt;\n &lt;a href=&quot;\nhttps://thepiratebay.vg/user/Ctrlme/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.vg/user/Ctrlme/&lt;/a&gt;","torrent":{"xt":"urn:btih:56135ae62c49607ba59cf5e1ca522e9ca111fcfc","amp;dn":"Poke+That+Tranny+In+The+Fanny+Vol.+3+XXX+2015+WEB-DL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56135ae62c49607ba59cf5e1ca522e9ca111fcfc","infoHashBuffer":{"type":"Buffer","data":[86,19,90,230,44,73,96,123,165,156,245,225,202,82,46,156,161,17,252,252]},"announce":[],"urlList":[]}}