{"title":"What Makes a Terrorist_ Economics and the Roots of Terrorism [No","uid":8884511,"size":3296233,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:567302a4ab162f5341a09fc73285cda6d4a4ce9c&amp;dn=What+Makes+a+Terrorist_+Economics+and+the+Roots+of+Terrorism+%5BNo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"K-Slender","files":3,"time":1378417271,"description":"ISBN-10: 0691138753\nISBN-13: 978-0691138756\n\nMany popular ideas about terrorists and why they seek to harm us are fueled by falsehoods and misinformation. Leading politicians and scholars have argued that poverty and lack of education breed terrorism, despite the wealth of evidence showing that most terrorists come from middle-class, and often college-educated, backgrounds. In What Makes a Terrorist, Alan Krueger argues that if we are to correctly assess the root causes of terrorism and successfully address the threat, we must think more like economists do.\n\nKrueger is an influential economist who has applied rigorous statistical analysis to a range of tough issues, from the minimum wage and education to the occurrence of hate crimes. In this book, he explains why our tactics in the fight against terrorism must be based on more than anecdote and speculation. Krueger closely examines the factors that motivate individuals to participate in terrorism, drawing inferences from terrorists' own backgrounds and the economic, social, and political conditions in the societies from which they come. He describes which countries are the most likely breeding grounds for terrorists, and which ones are most likely to be their targets. Krueger addresses the economic and psychological consequences of terrorism. He puts the terrorist threat squarely into perspective, revealing how our nation's sizeable economy is diverse and resilient enough to withstand the comparatively limited effects of most terrorist strikes. And he calls on the media to be more responsible in reporting on terrorism.\n\nWhat Makes a Terrorist brings needed clarity to one of the greatest challenges of our time. ","torrent":{"xt":"urn:btih:567302a4ab162f5341a09fc73285cda6d4a4ce9c","amp;dn":"What+Makes+a+Terrorist_+Economics+and+the+Roots+of+Terrorism+%5BNo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"567302a4ab162f5341a09fc73285cda6d4a4ce9c","infoHashBuffer":{"type":"Buffer","data":[86,115,2,164,171,22,47,83,65,160,159,199,50,133,205,166,212,164,206,156]},"announce":[],"urlList":[]}}