{"title":"Science in World History (Themes in World History)","uid":8338997,"size":1374780,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5718cd9c51f832ae6e6b4752ea33a6d01bc7a256&amp;dn=Science+in+World+History+%28Themes+in+World+History%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1365041571,"description":"James Trefil, &quot;Science in World History (Themes in World History)&quot;\nISBN: 0415782546 | 2011 | PDF | 176 pages | 1 MB\n\nIn Science in World History, James Trefil presents a comprehensive, thematic survey of the history of science from its roots in different cultures around the world through to the present day. He explores crucial milestones in scientific development and at the same time examines the enormous social and intellectual changes they initiated.\n\nOpening with a discussion of the key elements of modern scientific enterprise, the book goes on to explore the earliest scientific activities, moving through Greece and Alexandria, science in the Muslim world, and then on to Isaac Newton, atomic theory and the major developments of the nineteenth century. After examining the most recent scientific activities across the world, the book concludes by identifying future directions for the field.\n\nSuitable for introductory courses and ideal for students new to the subject, this concise and lively study reconsiders the history of science from the perspective of world and comparative history.\n","torrent":{"xt":"urn:btih:5718cd9c51f832ae6e6b4752ea33a6d01bc7a256","amp;dn":"Science+in+World+History+%28Themes+in+World+History%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5718cd9c51f832ae6e6b4752ea33a6d01bc7a256","infoHashBuffer":{"type":"Buffer","data":[87,24,205,156,81,248,50,174,110,107,71,82,234,51,166,208,27,199,162,86]},"announce":[],"urlList":[]}}