{"title":"Tom Stoppard - Rosencrantz and Guildenstern are Dead","uid":4628030,"size":427829365,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:573a727547f1c2f52cf9f2b823bc56b430987c10&amp;dn=Tom+Stoppard+-+Rosencrantz+and+Guildenstern+are+Dead&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"sheila6","files":10,"time":1231280857,"description":"Audio Books : Literary : MP3/Variable : English\n\n\n\nThis contains three distinct versions of Stoppard's Rosencrantz and Guildenstern are Dead.\n\nAll three were adapted for radio by Stoppard.\n\n\n\nStoppard's first and perhaps most famous full-length play, Rosencrantz &amp; Guildenstern Are Dead presents a worm's-eyeview of a classical tragedy, Shakespeare's Hamlet, as filtered through the existential sensibilities of Samuel Beckett's Waiting for Godot.\n\nThe play opens with the title characters alone on stage, placing bets on the toss of a coin while traveling toward Elsinore, the castle of Danish King Claudius and their childhood friend, Prince Hamlet. Guildenstern is perturbed that the coin has come down heads eighty-five times in a row. This seems ominously significant to him. Rosencrantz sees nothing particularly amiss.\n\nR&amp;G inhabit a world completely beyond their comprehension. Unsure of where they are going (and even of who they are and where they come from), they depend upon others to give their lives meaning. While awaiting instructions, they fall back upon games -- word play and simple wagers -- that rarely achieve their intended goals.\n\nInstructed by the King and Queen to &quot;glean what afflicts&quot; poor Hamlet, the boys attempt to cross-examine the prince but end up only more confused. Neither do they have the wit to see their own deaths foretold when the Player and his Tragedians rehearse the melodramatic tragedy, The Murder of Gonzago , which includes the execution of &quot;two smiling accomplices -- friends -- courtiers -- two spies&quot; who accompany a prince to England, only to be betrayed by a purloined letter.\n\nAfter Hamlet kills Polonius, R&amp;G are dispatched to retrieve the body, but they of course bungle the job. They are then dispatched to England with the prince. During the ocean voyage, R&amp;G discover that the letter they carry from Claudius calls for the immediate cutting off of Hamlet's head. Before they can decided what to do with the letter, it is stolen from them by Hamlet and replaced with another. After the ship is attacked by pirates and Hamlet escapes overboard in a barrel, R&amp;G open the letter again, only to learn that it is now they who must be killed when they arrive in England.\n\nThe Player and his band are also on the ship, but he is not especially surprised to learn of this treacherous turn of events, saying, &quot;In our experience, most things end in death.&quot; Infuriated, Guildenstern plunges a knife into the Player's throat and watches him die spectacularly. After a moment, the Player jumps up, brushes himself off and reveals the knife to be a spring-loaded fake. Guildenstern is too distraught to be impressed, saying, &quot;Dying is not romantic, and death is not a game which will soon be over...Death is not anything...death is not...It's the absence of presence, nothing more...the endless time of never coming back...a gap you can't see, and when the wind blows through it, it makes no sound...&quot;\n\nIn the end, R&amp;G resign themselves to their fate, although Guildenstern says, &quot;There must have been a moment, at the beginning, when we could have said -- no. But somehow we missed it.&quot; Perhaps. But the play ends with two ambassadors from England informing Horatio that, at long last, Rosencrantz and Guildenstern are dead.","torrent":{"xt":"urn:btih:573a727547f1c2f52cf9f2b823bc56b430987c10","amp;dn":"Tom+Stoppard+-+Rosencrantz+and+Guildenstern+are+Dead","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"573a727547f1c2f52cf9f2b823bc56b430987c10","infoHashBuffer":{"type":"Buffer","data":[87,58,114,117,71,241,194,245,44,249,242,184,35,188,86,180,48,152,124,16]},"announce":[],"urlList":[]}}