{"title":"Payback: Why We Retaliate and Take Revenge (2011) epub","uid":11160369,"size":322689,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:577c0af49a14d19b69e7d76534e1b16d00a46a1d&amp;dn=Payback%3A+Why+We+Retaliate+and+Take+Revenge+%282011%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bookzilla","files":1,"time":1412522559,"description":"Payback: Why We Retaliate, Redirect Aggression, and Take Revenge\n\n\nFrom the child taunted by her playmates to the office worker who feels stifled in his daily routine, people frequently take out their pain and anger on others, even those who had nothing to do with the original stress. The bullied child may kick her puppy, the stifled worker yells at his children: Payback can be directed anywhere, sometimes at inanimate things, animals, or other people. In Payback, the husband-and wife team of evolutionary biologist David Barash and psychiatrist Judith Lipton offer an illuminating look at this phenomenon, showing how it has evolved, why it occurs, and what we can do about it.\n Retaliation and revenge are well known to most people. We all know what it is like to want to get even, get justice, or take revenge. What is new in this book is an extended discussion of redirected aggression, which occurs not only in people but other species as well. The authors reveal that it's not just a matter of yelling at your spouse &quot;because&quot; your boss yells at you. Indeed, the phenomenon of redirected aggression--so-called to differentiate it from retaliation and revenge, the other main forms of payback--haunts our criminal courts, our streets, our battlefields, our homes, and our hearts. It lurks behind some of the nastiest and seemingly inexplicable things that otherwise decent people do, from road rage to yelling at a crying baby. And it exists across boundaries of every kind--culture, time, geography, and even species. Indeed, it's not just a human phenomenon. Passing pain to others can be seen in birds and horses, fish and primates--in virtually all vertebrates. It turns out that there is robust neurobiological hardware and software promoting redirected aggression, as well as evolutionary underpinnings. \n Payback may be natural, the authors conclude, but we are capable of rising above it, without sacrificing self-esteem and social status. They show how the various human responses to pain and suffering can be managed--mindfully, carefully, and humanely. ","torrent":{"xt":"urn:btih:577c0af49a14d19b69e7d76534e1b16d00a46a1d","amp;dn":"Payback%3A+Why+We+Retaliate+and+Take+Revenge+%282011%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"577c0af49a14d19b69e7d76534e1b16d00a46a1d","infoHashBuffer":{"type":"Buffer","data":[87,124,10,244,154,20,209,155,105,231,215,101,52,225,177,109,0,164,106,29]},"announce":[],"urlList":[]}}