{"title":"Lithium Batteries: Science and Technology [2016] [PDF]","uid":14661177,"size":19066205,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:580ce2188fecbb1967312bf21b11e204cddeedec&amp;dn=Lithium+Batteries%3A+Science+and+Technology+%5B2016%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"NoctDeath","files":2,"time":1463752990,"description":"Title: Lithium Batteries: Science and Technology \r\nAuthor: Christian Julien, Alain Mauger, Ashok Vijh, Karim Zaghib \r\nFormat: PDF \r\nHardcover: 619 pages \r\nPublisher: Springer; 1st ed. 2016 edition (September 29, 2015) \r\nLanguage: English \r\nISBN: 9783319191072 \r\n\r\n\r\nThe book focuses on the solid-state physics, chemistry and electrochemistry that are needed to grasp the technology of and research on high-power Lithium batteries. After an exposition of fundamentals of lithium batteries, it includes experimental techniques used to characterize electrode materials, and a comprehensive analysis of the structural, physical, and chemical properties necessary to insure quality control in production. The different properties specific to each component of the batteries are discussed in order to offer manufacturers the capability to choose which kind of battery should be used: which compromise between power and energy density and which compromise between energy and safety should be made, and for which cycling life. Although attention is primarily on electrode materials since they are paramount in terms of battery performance and cost, different electrolytes are also reviewed in the context of safety concerns and in relation to the solid-electrolyte interface. Separators are also reviewed in light of safety issues. The book is intended not only for scientists and graduate students working on batteries but also for engineers and technologists who want to acquire a sound grounding in the fundamentals of battery science arising from the interaction of electrochemistry, solid state materials science, surfaces and interfaces","torrent":{"xt":"urn:btih:580ce2188fecbb1967312bf21b11e204cddeedec","amp;dn":"Lithium+Batteries%3A+Science+and+Technology+%5B2016%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"580ce2188fecbb1967312bf21b11e204cddeedec","infoHashBuffer":{"type":"Buffer","data":[88,12,226,24,143,236,187,25,103,49,43,242,27,17,226,4,205,222,237,236]},"announce":[],"urlList":[]}}