{"title":"World War II Collector's Set - 6 Films (2009).DVDrip","uid":9595965,"size":6377029423,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:58306e7286ba526bc1769066ecdfa98eae7768ff&amp;dn=World+War+II+Collector%27s+Set+-+6+Films+%282009%29.DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"L337ish","files":-1,"time":1392015421,"description":"World War II Collector's Set: 6 Films\n===================================================================================\n\nFormat: Color, NTSC\n\nLanguage: English\n\nAspect Ratio: 1.33:1\n\nStudio: Echo Bridge Home Entertainment\n\nDVD Release Date: July 7, 2009\n\nRun Time: 367 minutes\n\n===================================================================================\n\nThe 6 Films include:\n\n\nDESERT VICTORY\n-----------------------------------------------------------------------------------\nA gritty and tense Academy AwardÂ® winner, Desert Victory documents the clash of Germany's General Rommel and Britain's General Montgomery as their militaries collide in battle under harsh desert conditions. Britain's defeat at El Alemein is only a stumbling block on the road to victory as they ultimately conquer the Germans at Tripoli. Notably, Desert Victory utilizes actual German footage of Rommel and Hitler that was confiscated during the skirmish by the British. During the making of this documentary, four British Army cameramen were killed, seven were wounded, and six were taken prisoner by the enemy - as these brave men captured history-in-the-making on film, they became part of history themselves... \n\n\nTHE NAZIS STRIKE\n-----------------------------------------------------------------------------------\nMasterfully compiled by Col. Frank Capra, The Nazis Strike features actual German archival footage - Nazi newsreel propaganda - as a forceful and revealing tool to expose the Third Reich's underhanded acts of political and military injustice. \n\n\nHERE IS GERMANY\n-----------------------------------------------------------------------------------\nAn unprecedented WWII documentary, Here Is Germany takes its focus off Allied forces and turns its attention to Germany - a beautiful country populated by a hard-working and prosperous people. From Friedrich the Great to Adolph Hitler, Germany's political figures, government, military, and war history are thoughtfully examined. \n\n\nTHE SPREADING HOLOCAUST\n----------------------------------------------------------------------------------\nThe Holocaust spreads across Europe as the Third Reich overwhelms France, Holland, Belgium, Denmark, and Norway. As invasion of the United States becomes reality, the American Army is motivated into action. There is no other option: Germany must be stopped. Utilizing rare wartime footage, The Spreading Holocaust traces the beginnings of WWII and the U.S.'s involvement from the bombing of Pearl Harbor to the invasion of Italy. \n\n\nHOW HITLER LOST THE WAR\n-----------------------------------------------------------------------------------\nAn eye-opening documentary, How Hitler Lost the War examines the theory that Germany essentially won and then lost World War II before 1942. This is a riveting and revealing alternative look at the theories behind and the flaws within Hitler's strategy, which ultimately resulted in Germany's defeat and the downfall of his regime. \n\n\nHITLER'S BRITAIN\n-----------------------------------------------------------------------------------\nLondon, Spring 1941. Columns of Wehrmacht soldiers make their way along the Mall, swastikas hang from Buckingham Palace and Junkers scream low overhead - a potent symbol of Nazi victory. The Germans have conquered the capital. Churchill and his government have gone into hiding. It's a chilling picture: What would the Nazis have done if they had conquered Britain? Filmed in England and using Allied and German documents, blueprints, and archive film, this two-part documentary answers \none of the most intriguing questions in history.\n\n\nSupport the media you like, and enjoy! :) ","torrent":{"xt":"urn:btih:58306e7286ba526bc1769066ecdfa98eae7768ff","amp;dn":"World+War+II+Collector%27s+Set+-+6+Films+%282009%29.DVDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58306e7286ba526bc1769066ecdfa98eae7768ff","infoHashBuffer":{"type":"Buffer","data":[88,48,110,114,134,186,82,107,193,118,144,102,236,223,169,142,174,119,104,255]},"announce":[],"urlList":[]}}