{"title":"reel rock tour 2011","uid":7020318,"size":1737692385,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:58802a67d07cd1083353519c2d782ac87f8ec9e3&amp;dn=reel+rock+tour+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"trasgu72","files":1,"time":1328816407,"description":"Reel Rock es un evento inspirador internacional que reÃƒÂºne a amantes de la naturaleza locales para deleitarse con el deporte de la escalada.\n\n&quot;Hemos recorrido un largo camino en seis aÃƒÂ±os&quot;, dijo el co-fundador de Josh Lowell. &quot;La gente ama una excusa reunirse, fiesta, vivir a travÃƒÂ©s de la tuerca de los casos que la pelÃƒÂ­cula y obtener inspiraciÃƒÂ³n para sus propias aventuras.&quot;\n\nCon exÃƒÂ¡menes de conjunto de casi 250 lugares en todo el mundo Reel Rock ofrecerÃƒÂ¡ una serie de seis cortometrajes. Aunque cada uno estÃƒÂ¡ centrado en un aspecto particular de la escalada de la competencia de gimnasia para el montaÃƒÂ±ismo de gran altitud Lowell dijo que el programa estÃƒÂ¡ destinado a atraer a un pÃƒÂºblico mÃƒÂ¡s amplio.\n\n&quot;Creo que hemos introducido a subir un montÃƒÂ³n de gente nueva a travÃƒÂ©s de la gira&quot;, dijo. &quot;Tratamos de que sea lo suficientemente accesible para las personas que traen a sus novias o sus padres o amigos que nunca lo han intentado antes. Creo que las pelÃƒÂ­culas se hacen de una manera que la gente normal puede conseguir inspirado por ellos y divertirse con ellos sin necesidad de conocer todos los jerga. &quot;\n\nProgramado para una muy watchable 120 minutos, la serie de cortometrajes ofrece una atractiva alternativa de la pantalla grande a la casa de visualizaciÃƒÂ³n de DVD o descarga de escritorio. Proyecciones asumen la emociÃƒÂ³n y el fervor del show de mÃƒÂºsica en vivo, con oportunidades para organizaciones sin fines lucrativos y de los minoristas para conectarse a los dedicados miembros de su comunidad. Este modelo de distribuciÃƒÂ³n de pelÃƒÂ­culas pone a cineastas como Lowell en el asiento del conductor para llevar un producto de calidad a una audiencia cautivada.","torrent":{"xt":"urn:btih:58802a67d07cd1083353519c2d782ac87f8ec9e3","amp;dn":"reel+rock+tour+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58802a67d07cd1083353519c2d782ac87f8ec9e3","infoHashBuffer":{"type":"Buffer","data":[88,128,42,103,208,124,209,8,51,83,81,156,45,120,42,200,127,142,201,227]},"announce":[],"urlList":[]}}