{"title":"Nanotechnology in Tissue Eng,Regenerative Medicine{BBS}","uid":7364399,"size":21088605,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:591c5ac6bbe611c9a9ea7c370549a3eadeb377f7&amp;dn=Nanotechnology+in+Tissue+Eng%2CRegenerative+Medicine%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1340059647,"description":"Although nanotechnology applied to medicine has a potentially huge impact on drug delivery and tissue engineering, significant challenges need to be resolved before clinically viable nanomedicine or nanobiomedicine therapies will be available. Skillfully edited, with contributions from an expert panel of researchers, Nanotechnology in Tissue Engineering and Regenerative Medicine discusses the use of nanotechnology for medical applications with a focus on its use for drug delivery and tissue engineering. It sheds light on the challenges facing the field and examines cutting-edge research that may provide solutions.\n\nTopics covered include:\n\n    Patterning of biomimetic substrates with AFM lithography, primarily focusing on DPN Nanotemplating polymer melts\n    Nanotechnology-based approaches in the treatment of injuries to tendons and ligaments\n    Progress in the use of electrospinning processing techniques for fabricating nanofiber scaffolds for neural applications\n    Nanotopography techniques for tissue-engineered scaffolds and the effects of nanotopography on cells and tissues\n    Vertically aligned TiO2 nanotube surface structuring for optimization of Ti implants utilizing nanotechnology\n    Applications originating from the harmony of nanotechnology to biological systems, especially for the regeneration in the nervous system\n    Current understanding of the mechanisms by which cells sense nano-scale structure at the molecular level and how this understanding can be useful in developing novel antifouling materials\n\nWhile there are books available on tissue engineering and nanotechnology and others about regenerative medicine, most do not comprehensively cover applications of nanotechnology to both these areas. Focusing chiefly on drug delivery, tissue engineering, and regenerative medicine, the book uses an application-based approach to relate laboratory-based research to the development of technologies that can be readily adaptable to an industrial environment.\n\n\n\nHardcover: 302 pages\nPublisher: CRC Press; 1 edition (November 22, 2010)\nLanguage: English\nISBN-10: 143980141X\nISBN-13: 978-1439801413","torrent":{"xt":"urn:btih:591c5ac6bbe611c9a9ea7c370549a3eadeb377f7","amp;dn":"Nanotechnology+in+Tissue+Eng%2CRegenerative+Medicine%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"591c5ac6bbe611c9a9ea7c370549a3eadeb377f7","infoHashBuffer":{"type":"Buffer","data":[89,28,90,198,187,230,17,201,169,234,124,55,5,73,163,234,222,179,119,247]},"announce":[],"urlList":[]}}