{"title":"Triumph of the Spirit [1989] Willem Dafoe","uid":6632504,"size":1048672632,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:591c8cfe1e7c7a045f171a9c0af8a341e6db3157&amp;dn=Triumph+of+the+Spirit+%5B1989%5D+Willem+Dafoe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1314426936,"description":" &lt;a href=&quot;http://bayimg.com/CAjFcAadm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/CAjFcAadm&lt;/a&gt;\n\nTriumph of the Spirit (1989) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0098513/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0098513/&lt;/a&gt;\n\nTriumph of the Spirit is a 1989 American film directed by Robert M. Young and starring Willem Dafoe and Edward James Olmos. The majority of the film is set in the death camp at Auschwitz during the Holocaust and details how the Jewish boxer Salamo Arouch was forces to fight other internees to the death for the SS guards' entertainment. Prior to Triumph of the Spirit, no major feature film had ever been shot on location at Auschwitz.\n\n  Willem Dafoe  ...  Salamo Arouch  \n  Edward James Olmos  ...  Gypsy  \n  Robert Loggia  ...  Father Arouch  \n  Wendy Gazelle  ...  Allegra  \n  Kelly Wolf  ...  Elena  \n  Costas Mandylor  ...  Avram Arouch  \n  Kario Salem  ...  Jacko  \n  Edward Zentara  ...  Janush  \n  Hartmut Becker  ...  Maj. Rauscher  \n  Burkhard Heyl  ...  Aide to Rauscher  \n  Zofia Saretok  ...  Momma  \n  Grazyna KrukÃƒÂ³wna  ...  Sister Julie  \n  Karolina Twardowska  ...  Bemmi  \n  Juranda Krol  ...  Sarah  \n  Wiktor Mlynarczyk  ...  Beppo \n\nYoung was reluctant to make the film when he was first approached with the script, finding the topic too momentous to cover; he only agreed to direct when provided a script that focused only on one small element, &quot;like a cork, bubbling on the surface of the sea.&quot;[2] The film, which positions Arouch as a witness to the horrors of the Holocaust, was shot on a budget of US $12 million dollars.[2] Filming with permission at Auschwitz-Birkenau, producers were able to utilize some existing structures but were also tasked with recreating a crematory given the condition of those that remain.[2] The film also shot briefly in Israel.[4]\n\nThe title of the film is suggestive of human triumph, a view to which star Dafoe subscribed, but others, including actor Olmos perceived its impact differently: &quot;[W]hat does...[the film] project? The moral decay needed to survive in the camp.&quot;[2] Lawrence Baron, the author of 2005's Projecting the Holocaust Into the Present, agreed, stating that the cumulative impression undermines whatever uplifting impact its title and publicity imply. A closer scrutiny of the movie reveals that it is not about the triumph of the spirit but rather about 'choiceless choices', to use Lawrence Langer's term for the dilemma faced by death camp inmates, who were never offered any moral alternatives to prolong their survival.&quot; Baron suggests that this message is crystallized in one scene where Arouch is set to fight his best friend Jacko, who has already been beaten by the guards, knowing that the loser will be consigned to the gas chamber; when he balks, his friend is executed on the spot.\n\nThe film is the story of a man named Salamo (Willem Dafoe), a Greek shipped to Auschwitz, where he might have died if his Nazi captors had not discovered that he was a championship boxer. As an entertainment one evening, they set up a boxing match, which Salamo wins. They make him fight again. Money is wagered on the outcome, and soon Salamo's fights are part of the Nazi social schedule; the officers gather once a week to eat, drink and watch prisoners pound one another.\n\nSalamo, of course, is in an impossible situation. If he wins, he sends his opponent to certain death. If he loses, he himself dies.\n\nIt is this irony that enriches the sadistic enjoyment of his Nazi audiences. Salamo has another reason for fighting well, and that is the fate of his father in the camp - an old man (Robert Loggia) he hopes to keep from the gas chambers by using what small influence his stature has given him.\n\nOne of the camp's gypsy prisoners (Edward James Olmos) is sort of a fixer in the camp, a slippery character who operates a shady black market based on bribery and persuasion. He becomes involved in Salamo's attempts to help his father, but finally the father's name appears on a list of those scheduled to disappear, and when Salamo asks what can be done, the gypsy replies, &quot;Nothing, unless someone can be found to take his place.&quot; At this point, in a more predictable movie, the son would have offered to take his father's place. Salamo remains silent. Well, which of us would volunteer? The mystery at the heart of the Holocaust experience, as taught in countless books and films, is that an artificial situation was set up in which evil was the engine and there was no way to protest except by self-sacrifice.\n\nSome chose to die. Many did not want to die, but died anyway.\n\nA few, like Salamo, hid in a tiny crevice of the wall of insanity surrounding them, and survived. Salamo, we learn, won enough fights that he was still alive at the end of the war; he survived to tell his story, and this is the film of his story. But what does it mean? The title &quot;Triumph of the Spirit,&quot; with its obvious echo of the Nazi documentary &quot;Triumph of the Will,&quot; seems to indicate that Salamo's spirit did triumph. But he survived at the cost of the lives of his opponents, who were fellow Jews. Is this a triumph, or merely an escape? The great inescapable problem of the Holocaust is that it defies being made sense of. That was the message of &quot;Shoah,&quot; the most profound film about the subject. The weakness of &quot;Triumph of the Spirit&quot; is that it takes a vast, humbling, infinitely sad subject and fits it into a fictional form - makes it into a fight movie, if you will.\n\nThere are several fight scenes, staged and choreographed like those in any other boxing movie, and the audience is enlisted to cheer for Salamo against his enemies. We are presumeably supposed to be relieved when he wins. Does this feeling not place us with the Nazis in his audience? Are the fights themselves not obscene? Did the filmmakers ever consider placing the fights offscreen, or dwelling on them less, and considering the implications of the situation Salamo finds himself in? Of course not, because the fictional formula was too seductive. And so what we finally have here is a boxing movie that tries to borrow meaning and authenticity from the great sorrow of the Holocaust. There are too many contradictions here to count. \n","torrent":{"xt":"urn:btih:591c8cfe1e7c7a045f171a9c0af8a341e6db3157","amp;dn":"Triumph+of+the+Spirit+%5B1989%5D+Willem+Dafoe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"591c8cfe1e7c7a045f171a9c0af8a341e6db3157","infoHashBuffer":{"type":"Buffer","data":[89,28,140,254,30,124,122,4,95,23,26,156,10,248,163,65,230,219,49,87]},"announce":[],"urlList":[]}}