{"title":"The Secret History of Joan of Arc (2011)","uid":9422882,"size":2857592,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:59d151fdb47035dd0c3efaa5d8df38026b191e7d&amp;dn=The+Secret+History+of+Joan+of+Arc+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Robin1966","files":5,"time":1388623280,"description":"Books : History : English\n\n\n\nHow did an illiterate seventeen-year-old peasant girl manage to become one of histories most salient females? It is almost 600 years since Joan of Arc heard the voices of angels that would change her life for ever: in a breathtaking story her quest saved France from English domination and restored France's hereditary monarchy.\n\nJust thirteen when her life was turned upside down, Joan's holy guidance led her on an arduous eleven-day journey into the unknown, restoring the Dauphin back to his original birthright in an official coronation, allowing him to resume his rule as France's legitimate king. Joan summoned and led an impressive army of French loyalists against the English; the siege at Orleans was an exhilarating English defeat that liberated the city. The following year witnessed Joan's capture by the enemy. After a series of heroic endeavours to escape cruel adversaries, she was subjected to trial by inquisition and then in Rouen, the heart of France, Joan's courageous journey came to a heartbreaking conclusion. This is the story at the core of centuries of myth-making.\n\nBut what if we no longer accept this tale? What if we question whether the Heavens and their angels were truly Joan's only source of strength and power? What if we demand a different narrative? This revisionist biography unearths the secular and verifiable basis for Joan's heroic exploits: Yolande of Aragon, a forgotten mentor. This is a story of not one life, but two; two lives that together were intertwined in the restoration of France's greatness.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:59d151fdb47035dd0c3efaa5d8df38026b191e7d","amp;dn":"The+Secret+History+of+Joan+of+Arc+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59d151fdb47035dd0c3efaa5d8df38026b191e7d","infoHashBuffer":{"type":"Buffer","data":[89,209,81,253,180,112,53,221,12,62,250,165,216,223,56,2,107,25,30,125]},"announce":[],"urlList":[]}}