{"title":"Rescue Special Ops Season 1 &amp; 2 Complete mp4 - NO RAR -psut","uid":5997854,"size":12253978585,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5a3a0d4bde643e7311ebb0ac8bac168eb892208c&amp;dn=Rescue+Special+Ops+Season+1+%26+2+Complete+mp4+-+NO+RAR+-psut&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":4,"uploader":"psut","files":27,"time":1291086068,"description":"Rescue: Special Ops centers around a team of experienced paramedics involved in complex search and rescue operations. The job brings them face to face with life and death situations every day but just like anyone else, they juggle life, love and careers.\n\n----------------------------------------------------\n\nOk, so I got tired of having to search everywhere &amp; get these episodes one at a time - and SLOWLY on top of that.  I'm sure you guys did too.  So I have them all together here for you now in one spot.  I also HATE when things are rar'd.  No torrent I ever put up will be rar'd.  Ever.  The files are also in .mp4 format.  This cuts down on the filesize without impacting quality very much at all.\n\nBUT\n\nThe episodes are of different qualities.  I got them from multiple sources, so they're not all completely uniform in size or quality.  I had to get the last episode from youtube and tried to fix it up as best I could.  Also, episode 102 the audio gets out of sync after a little while.  If you use VLC player, you can adjust the audio delay when you're watching it and it'll play pretty well.  I don't know if any other players have that feature, so I can't speak to them.\n\nIf you don't like the fact that these files aren't perfect, then don't download them.  I don't want to hear whining and complaining about anything I've just explained.\n\nAll I ask is that you just please seed for as long as you can.\n\nThanks &amp; enjoy!\n\nPSUT.\n\n\nOh, also please comment and rate!!!","torrent":{"xt":"urn:btih:5a3a0d4bde643e7311ebb0ac8bac168eb892208c","amp;dn":"Rescue+Special+Ops+Season+1+%26+2+Complete+mp4+-+NO+RAR+-psut","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a3a0d4bde643e7311ebb0ac8bac168eb892208c","infoHashBuffer":{"type":"Buffer","data":[90,58,13,75,222,100,62,115,17,235,176,172,139,172,22,142,184,146,32,140]},"announce":[],"urlList":[]}}