{"title":"CL02 - What Doesn't Kill You - Iris Johansen.epub","uid":9132323,"size":333301,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5a5679c89a8a511bb3be0eeeae32ebee421a3941&amp;dn=CL02+-+What+Doesn%27t+Kill+You+-+Iris+Johansen.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"420weedman","files":1,"time":1383347832,"description":"From the #1 New York Times bestselling author comes an explosive new thriller featuring Catherine Ling from Chasing The Night.\nCatherine Ling was abandoned on the streets of Hong Kong at age four. Schooled in the art of survival, she traded in the only commodity she had: information. As a teenager, she came under the tutelage of a mysterious man known only as Hu Chang - a skilled assassin and master poisoner. As a young woman, she was recruited by the CIA and now, she is known as one of their most effective operatives. Having lived life in the shadows, Catherine is aware of the wobbly moral compass of her existence and even more aware of just how expendable she is to those she deals with. When her old friend Hu Chang creates something so deadly, and completely untraceable, the chase is on to be the first to get it. With rogue operative John Gallo also on the hunt, Catherine finds herself pitted against a group so villainous and a man so evil that she may not survive the quest to protect those she cares about. Iris Johansen is at her page-turning best in this novel that takes you from the corridors of Langley to the alleyways of Hong Kong, and the darkest places of the human soul.\nGenre: Mystery , Thriller","torrent":{"xt":"urn:btih:5a5679c89a8a511bb3be0eeeae32ebee421a3941","amp;dn":"CL02+-+What+Doesn%27t+Kill+You+-+Iris+Johansen.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a5679c89a8a511bb3be0eeeae32ebee421a3941","infoHashBuffer":{"type":"Buffer","data":[90,86,121,200,154,138,81,27,179,190,14,238,174,50,235,238,66,26,57,65]},"announce":[],"urlList":[]}}