{"title":"[Claudio De Rosa , Finizia Auriemma]Crystals and Crystallinity i","uid":11199794,"size":32513787,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5aa8972d633d808e5fc293cb23480e55f3a6b4f9&amp;dn=%5BClaudio+De+Rosa+%2C+Finizia+Auriemma%5DCrystals+and+Crystallinity+i&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":1,"time":1413154241,"description":"Product Description\n\nProvides the tools needed to master and apply the fundamentals of polymer crystallography\n\nUsing core concepts in physics, chemistry, polymer science and engineering, this book sheds new light on the complex field of polymer crystallography, enabling readers to evaluate polymer crystallization data and determine the best methods to use for their investigations. The authors set forth a variety of tested and proven methods for analyzing ordered and disordered structures in polymer crystals, including X-ray diffraction, electron diffraction, and microscopy. In addition to the basics, the book explores several advanced and emerging topics in the field such as symmetry breaking, frustration, and the principle of density-driven phase formation.\n\nCrystals and Crystallinity in Polymers introduces two new concepts in crystallinity and crystals in synthetic polymers. First, crystallinity in polymeric materials is compatible with the absence of true three-dimensional long-range order. Second, the disorder may be described as a structural feature, using the methods of X-ray scattering and electron diffraction analysis.\n\nThe book begins by introducing the basic principles and methods for building structural models for the conformation of polymer crystal chains. Next, it covers:\n\n    Packing of macromolecules in polymer crystals\n    Methods for extracting structural parameters from diffraction data\n    Defects and disorder in polymer crystals\n    Analytical methods for diffuse scattering from disordered polymer structures\n    Crystal habit\n    Influence of crystal defects and structural disorder on the physical and mechanical properties of polymeric materials\n\nCrystals and Crystallinity in Polymers examines all the possible types of structural disorder generally present in polymer crystals and describes the influence of each kind of disorder on X-ray and electron diffraction patterns. Its comprehensive, expert coverage makes it possible for readers to learn and apply the fundamentals of polymer crystallography to solve a broad range of problems.\nFrom the Back Cover\nProvides the tools needed to master and apply the fundamentals of polymer crystallography Using core concepts in physics, chemistry, polymer science and engineering, this book sheds new light on the complex field of polymer crystallography, enabling readers to evaluate polymer crystallization data and determine the best methods to use for their investigations. The authors set forth a variety of tested and proven methods for analyzing ordered and disordered structures in polymer crystals, including X-ray diffraction, electron diffraction, and microscopy. In addition to the basics, the book explores several advanced and emerging topics in the field such as symmetry breaking, frustration, and the principle of density-driven phase formation. Crystals and Crystallinity in Polymers introduces two new concepts in crystallinity and crystals in synthetic polymers. First, crystallinity in polymeric materials is compatible with the absence of true three-dimensional long-range order. Second, the disorder may be described as a structural feature, using the methods of X-ray scattering and electron diffraction analysis. The book begins by introducing the basic principles and methods for building structural models for the conformation of polymer crystal chains. Next, it covers: Packing of macromolecules in polymer crystals Methods for extracting structural parameters from diffraction data Defects and disorder in polymer crystals Analytical methods for diffuse scattering from disordered polymer structures Crystal habit Influence of crystal defects and structural disorder on the physical and mechanical properties of polymeric materials Crystals and Crystallinity in Polymers examines all the possible types of structural disorder generally present in polymer crystals and describes the influence of each kind of disorder on X-ray and electron diffraction patterns. Its comprehensive, expert coverage makes it possible for readers to learn and apply the fundamentals of polymer crystallography to solve a broad range of problems. \n\nPublisher: Wiley; 1 edition (26 August 2013)\nSold by: Amazon Digital Services, Inc.\nLanguage: English\nASIN: B00EU8ZUHQ","torrent":{"xt":"urn:btih:5aa8972d633d808e5fc293cb23480e55f3a6b4f9","amp;dn":"%5BClaudio+De+Rosa+%2C+Finizia+Auriemma%5DCrystals+and+Crystallinity+i","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5aa8972d633d808e5fc293cb23480e55f3a6b4f9","infoHashBuffer":{"type":"Buffer","data":[90,168,151,45,99,61,128,142,95,194,147,203,35,72,14,85,243,166,180,249]},"announce":[],"urlList":[]}}