{"title":"Michael Moorcock - A Nomad of the Time Streams","uid":8104504,"size":1156673316,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5b13c6d5bce8933594023b8efe089c8bbbfc0389&amp;dn=Michael+Moorcock+-+A+Nomad+of+the+Time+Streams&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sulla_felix","files":28,"time":1360052341,"description":"Michael Moorcock's Nomad of the Timestreams is a political statement of deep profundity wrapped in an imperialist candy-coating of red uniforms, zeppelins, and ripping yarns.\n\nMoorcock's multiverse is never better here. Oswald Bastable, ripped from his home in the Railway Children Series by E. Nesbitt, is part of the British Empire in 1902. Like a Kipling story, he finds himself doing the dirty work of imperialism unthinkingly. He is punished by being sent into an alternate history seventy-odd years in the future. There he tries to reassemble his life, but finds his sense of social justice is too much, and ends up working for anti-imperialist terrorists. The books are rife with real historical figures turned into their ugliest form, and in each racism is the central conflict, and no matter what he does, or what his good intentions are, Bastable always ends up at the forefront of mass destruction namely twice dropping nuclear weapons.\n\nThis is a work of the 1970's with its politicals worn bravely on its sleeve, still, Moorcocks vision is soaked with justice and through the adventures in various apocalyptic landscapes, one is as much entertained as educated.\n\nBrilliantly written, well-researched, a dazzling performance equaled only by his Dancers at the End of Time series. \n\n-----------------------------------------------------------------------------------\n\nPirates, sharing is caring! Please do your part to show support and combat copyright everywhere! Seed the torrents you download, and upload your own!\n\nAnd remember... &quot;If Sulla did it, why can't I?&quot;\t\t","torrent":{"xt":"urn:btih:5b13c6d5bce8933594023b8efe089c8bbbfc0389","amp;dn":"Michael+Moorcock+-+A+Nomad+of+the+Time+Streams","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b13c6d5bce8933594023b8efe089c8bbbfc0389","infoHashBuffer":{"type":"Buffer","data":[91,19,198,213,188,232,147,53,148,2,59,142,254,8,156,139,187,252,3,137]},"announce":[],"urlList":[]}}