{"title":"Learning Devise for Rails [PDF]~StormRG~","uid":9502772,"size":3738418,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5b99a1f8aa58d89eb8205ab2bb398be641fc4b11&amp;dn=Learning+Devise+for+Rails+%5BPDF%5D%7EStormRG%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"steelballz","files":-1,"time":1390254691,"description":"Description\nLearning Devise For Rails\nAuthors: Hafiz Giovanni Sakti and Nia Mutiara\nPublished: October 25, 2013\nPublisher: Packt Publishing\nISBN: 9781782167044\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\n\nTested on the above readers with no problems on laptop and Android tablet.\nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss.\nPlease allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n\nCover from actual book file\n\n\nUse Devise to make your Rails application accessible, user friendly, and secure\n\nOverview\nUse Devise to implement an e-mail-based sign-in process in a few minutes\nOverride Devise controllers to allow username-based sign-ins, and customize default Devise HTML views to change the look and feel of the authentication system\nTest your authentication codes to ensure stability\n\nWhat you will learn from this book\nUnderstand Devise as a flexible and customizable authentication solution for Rails\nCustomize sign-in, sign-up, password reset, email confirmation, account cancellation, and user account edit pages\nHide and show views based on defined user authorization rules using CanCan view helpers\nConfigure OmniAuth to make user sign-ins and sign-ups via social network accounts work on your Rails application\nUse CanCan abilities to implement simple and SQL-based user privileges to restrict user access\nTest authentications to ensure code stability\n\nApproach\nA hands-on, step-by-step guide to using Devise for authentication in Rails.\n\nWho this book is written for\nIf you are a web developer who is getting started with Rails and you are looking for authentication solutions, then this is the book for you. If you are a current Rails developer who is looking to extend your authentication implementation with capabilities such as authorization and remote authentication, this book will also be great for you.","torrent":{"xt":"urn:btih:5b99a1f8aa58d89eb8205ab2bb398be641fc4b11","amp;dn":"Learning+Devise+for+Rails+%5BPDF%5D%7EStormRG%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b99a1f8aa58d89eb8205ab2bb398be641fc4b11","infoHashBuffer":{"type":"Buffer","data":[91,153,161,248,170,88,216,158,184,32,90,178,187,57,139,230,65,252,75,17]},"announce":[],"urlList":[]}}