{"title":"Adam Kadmon - Illuminati, [Epub Mobi Pdf - Ita][TNTVillage]","uid":12742457,"size":54110619,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5bc66161589bbc1366e6df6dc69f91124a3162f5&amp;dn=Adam+Kadmon+-+Illuminati%2C+%5BEpub+Mobi+Pdf+-+Ita%5D%5BTNTVillage%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"vitolanz","files":3,"time":1447253116,"description":"Adam Kadmon - Illuminati[Epub Mobi Pdf - Ita][TNTVillage]\r\n----------------------------------------\r\n.: Dettagli :.\r\n\r\nAutore: Adam Kadmon\r\nTitolo: Illuminati\r\nAnno: 2013\r\nLingua: Italiana\r\nGenere: Studi culturali e sociali\r\nDimensione del file: 13,9 MB (Mobi), 8,34 MB (EPUB), 29,2 MB (PDF)\r\nFormato del file: EPUB + MOBI + PDF\r\n----------------------------------------\r\n.: Trama :.\r\nNel 1990, agenti federali fanno irruzione in un'azienda di giochi americana portando via tutti i computer, alcuni dei quali mai più restituiti, anche quando le accuse che avevano portato al blitz decadono. Tra i giochi sequestrati, ce n'è uno di carte, &quot;Illuminati&quot;. Che la vera ragione del sequestro siano le carte, che riportano immagini molto simili ad altre diventate poi notissime dell'esplosione delle Twin Towers, dell'aereo schiantato sul Pentagono o del maremoto di Fukushima, nessuno lo dice ufficialmente, ma, alla luce di quanto avvenuto nel 2001 e nel 2011, pare molto probabile. E può esserci un collegamento tra questo episodio e gli esclusivi incontri del Bohemian Club, che riunisce nomi come Rockefeller, Kissinger e molti presidenti americani, o del Gruppo Bilderberg, a cui fa capo il gotha della finanza e della politica europea e mondiale? Che esista un ristretto gruppo di persone talmente potenti da infiltrarsi in ogni ambito della vita sociale e politica mondiale e di influenzare ogni decisione che ci riguardi è ormai più che un sospetto per molti. Quello che non tutti sanno è che queste persone, note o sconosciute, farebbero parte di una società segreta di storiche origini, quella degli Illuminati. Verità? Menzogna? Esistono prove della loro esistenza? Adam Kadmon, il personaggio misterioso che raccoglie milioni di contatti sul web, di coincidenze - prove, forse? - ne presenta a centinaia.\r\n----------------------------------------\r\n.: Biografia dell'autore :.\r\nAdam Kadmon è un personaggio immaginario apparso per la prima volta nel 2005 sul web su un blog amatoriale. Nel 2009 è stato ripreso dalla trasmissione radiofonica Lo Zoo di 105 e nel 2010 dalla trasmissione televisiva Mistero, diventando popolare presso il pubblico italiano. Viene anche accreditato come autore di alcuni libri. Nell'ambito di libri, trasmissioni e interviste viene presentato come se fosse una persona realmente esistente. Nella versione televisiva è rappresentato come un misterioso appartenente a culture esoteriche che, celando il suo viso con una maschera, sostiene svariate teorie del complotto. Il nome è ispirato alla figura dell'Adam Qadmon, l'uomo primordiale della mistica ebraica, e significa &quot;uomo delle origini&quot; ossia &quot;umanità incontaminata","torrent":{"xt":"urn:btih:5bc66161589bbc1366e6df6dc69f91124a3162f5","amp;dn":"Adam+Kadmon+-+Illuminati%2C+%5BEpub+Mobi+Pdf+-+Ita%5D%5BTNTVillage%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bc66161589bbc1366e6df6dc69f91124a3162f5","infoHashBuffer":{"type":"Buffer","data":[91,198,97,97,88,155,188,19,102,230,223,109,198,159,145,18,74,49,98,245]},"announce":[],"urlList":[]}}