{"title":"Sugarloaf - Don't Call Us, We'll Call You [1975][2011][320 KBPS]","uid":8773164,"size":169365410,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5c3f6cb81fa30ed8a32f48501d2dc55ce9f9c6db&amp;dn=Sugarloaf+-+Don%27t+Call+Us%2C+We%27ll+Call+You+%5B1975%5D%5B2011%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LameDuck69","files":20,"time":1375498087,"description":"Sugarloaf - Don't Call Us, We'll Call You [1975][2011][Bonus Tracks]\n\n\n\n\n\n01 I Got A Song\n02 Myra Myra\n03 Lay Me Down\n04 Wild Child\n05 Don't Call Us, We'll Call You\n06 Lookin' For Some Fun\n07 Round And Round\n08 Colorado Jones\n09 Easy Evil\n10 I've Got A Song [Reprise]\n11 Boogie Man [Bonus Track]\n12 Texas Two Lane [Bonus Track]\n13 Stars In Her Eyes [Bonus Track]\n14 Last Dance [Bonus Track]\n15 Green Eyed Lady [Live]\n\n\n\n\n\n320 KBPS\n\nCover Art\n\n\n\n\n\n\n\nFrom Wikipedia :\n\n\n\n\nSugarloaf was an American rock band in the 1970s, featuring lead vocalist and keyboardist Jerry Corbetta. They originated in Denver, Colorado.\n\nCorbetta founded the band with guitarist Bob Webber of the Moonrakers; the other initial bandmembers were drummer Bob MacVittie and rhythm guitarist Veeder Van Dorn III, also from the Moonrakers, plus bassist Bob Raymond. The Moonrakers had previously released 4 singles on Tower; three of their songs are collected on the Colorado garage rock compilation album Highs in the Mid-Sixties, Volume 18, and another was released earlier on the Pebbles Volume 10 LP.\n\nThe band was originally known as Chocolate Hair. They changed their name to Sugarloaf, a mountain outside of Boulder, Colorado,  when they received their first recording contract.\n\nThey are best known for two songs, both of which hit the top 10 charts in the United States: &quot;Green-Eyed Lady&quot; in the autumn of 1970 (their biggest hit, reaching No. 3 on the Billboard chart) and &quot;Don't Call Us, We'll Call You&quot; in 1975 (US No. 9).\n\nOther songs which charted on the Billboard Hot 100 were &quot;Mother Nature's Wine&quot; (1971), &quot;Tongue in Cheek&quot; (1971), and &quot;Stars In Our Eyes&quot; (1976). In addition, &quot;West of Tomorrow&quot; and &quot;Myra Myra&quot; were not hit singles, but received modest airplay at the time of their release on album rock radio stations.\n\nThe 1975 album Don't Call Us, We'll Call You was a re-release of their 1973 album I Got A Song, with one of the tracks on the earlier album replaced by the title track of the later album, which had become a hit single.\n\nThe song &quot;Don't Call Us, We'll Call You&quot; is notable because it contained a practical joke at the expense of CBS Records, which had just turned them down for a recording contract. The song includes the sound of a touch-tone telephone number being dialed near the beginning and ending of the song. Those numbers were an unlisted phone number at CBS Records and a public number at the White House respectively. In addition, the recording includes snippets of the guitar riff of The Beatles' &quot;I Feel Fine,&quot; Stevie Wonder's &quot;Superstition,&quot; and a line of dialogue from Wolfman Jack stating the call sign of a radio station; numerous tracks of this line were cut to match local markets.\n\nCorbetta later went on to perform with the group Disco-Tex and the Sex-O-Lettes (best known for their hit &quot;Get Dancin'&quot;). In 1980, he became a member of The Four Seasons. He currently performs with The Classic Rock All-Stars, a touring supergroup of hitmakers from the 1960s and 1970s.\n\n","torrent":{"xt":"urn:btih:5c3f6cb81fa30ed8a32f48501d2dc55ce9f9c6db","amp;dn":"Sugarloaf+-+Don%27t+Call+Us%2C+We%27ll+Call+You+%5B1975%5D%5B2011%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c3f6cb81fa30ed8a32f48501d2dc55ce9f9c6db","infoHashBuffer":{"type":"Buffer","data":[92,63,108,184,31,163,14,216,163,47,72,80,29,45,197,92,233,249,198,219]},"announce":[],"urlList":[]}}