{"title":"Catherine of Siena - The Dialogue (pdf)","uid":10501931,"size":4994769,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c6237536c6876b54c819da8a9679cb7f5bcc771&amp;dn=Catherine+of+Siena+-+The+Dialogue+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1404714009,"description":"Suzanne Noffke, O.P., trans. - Catherine of Siena: The Dialogue (Paulist Press, 1980). Series: Classics of Western Spirituality. 398 pp.\n\n\nImproved version of an older scan. Page images completely reprocessed.  Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc. Many thanks to the original scanner.\n\n\ndescription:\n\nThis is the crowning spiritual work of the only woman other than Teresa of Avila [and now Therese of Lisieux and Hildegard of Bingen] to be granted the title of Doctor of the Roman Catholic Church.\n\nThis volume was simply called &quot;my book&quot; by the fourteenth-century Italian saint. The aim of her book (one of the first books to see print in Spain, Germany, Italy, and England), says Dr. Noffke in her Foreword, was &quot;the instruction and encouragement of all those whose spiritual welfare was her concern.&quot; Catherine was &quot;a mystic whose plunge into God plunged her deep into the affairs of society, Church and the souls who came under her influence.&quot;\n\nProfessor Noffke goes on to call The Dialogue &quot;a great tapestry to which Catherine adds stitch upon stitch until she is satisfied that she has communicated all she can of what she has learned of the way of God.&quot; In this, the sixth centenary of the great Dominican's death, we live in a time so badly in need of her sense of institutional reform as flowing from Divine truth, love and charity. Dr. Noffke says: &quot;In the opening pages of The Dialogue Catherine presents a series of questions or petitions to God the Father each of which receives a response and amplification. There is the magnificent symbolic portrayal of Christ as the bridge. There are specific discussions of discernment, tears (true and false spiritual emotion), truth, the sacramental heart ('mystic body') of the Church, divine providence, obedience... It is not so much a treatise to be read as it is a conversation to be entered into with earnest leisure and leisurely earnest.&quot;\n\n","torrent":{"xt":"urn:btih:5c6237536c6876b54c819da8a9679cb7f5bcc771","amp;dn":"Catherine+of+Siena+-+The+Dialogue+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c6237536c6876b54c819da8a9679cb7f5bcc771","infoHashBuffer":{"type":"Buffer","data":[92,98,55,83,108,104,118,181,76,129,157,168,169,103,156,183,245,188,199,113]},"announce":[],"urlList":[]}}