{"title":"Fucking Castings! (NEW 2013 Evil Angel) [DVDRip]","uid":9038111,"size":2035313368,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:5c6ab2a11eb4be40102025c9a22c4c446812d79b&amp;dn=Fucking+Castings%21+%28NEW+2013+Evil+Angel%29+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":5,"uploader":"chkm8te","files":1,"time":1381554778,"description":"Fucking Castings! (NEW 2013 Evil Angel) [DVDRip]\n\nAmanda X, Brenda Boop, Carolina Abril, Jesika Diamond, Lady Core, Laura Peralta, Marta Sanz, Nacho Vidal, Noe Milk, Rachel Woods, Raquel Love.\n\nFucking Castings: Spanish porn superstud Nacho Vidal brings his enormous cock and his infamously brutal style of hard-core passion to Fucking Castings! Its a five-scene collection of intimate auditions in which gorgeous Latina babes prove their sexual stamina and appetite for Nachos trademark brand of intense pussy pounding. Petite, blonde, sassy Lady Core shows up hoping to make the grade. The 21-year-old reveals soft, natural tits and wide nipples, and in no time Nacho is brutally manhandling the fishnet-clad cutie. Perky, petite Raquel Love gets on all fours, taking the directors massive pole deeply. Busty, tattooed teen Brenda Boop joins delectable Carolina Abril for some lesbian lust in the shower, then enjoys an epic session with Nacho. He leaves Brendas lower back splattered in jism. Adorable Rachel Woods lets Nacho worship her plump, succulent tits and peel off her clothes for a relentless fucking. Dark-skinned beauty Noe Milk wraps her sweet lips around the directors huge dork and rides him hard; she fingers her juicy cunt to a squirting orgasm. Next in line is pink-haired punkette Jesika Diamond, who services Nachos mighty member while in another room Noe fingers lovely Latina Laura Peralta. Nacho worships thick, busty Marta Sanz, burying his face in her generous ass. After shes sucked him dry, Nacho fucks sultry MILF Amanda X to a satisfying climax. The true test of a slut is how she handles Nachos Fucking Castings!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=cdtyszct27xx4f9uo6ud.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=cdtyszct27xx4f9uo6ud.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=2mwpryybbdr7a8bdbrse.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=2mwpryybbdr7a8bdbrse.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:5c6ab2a11eb4be40102025c9a22c4c446812d79b","amp;dn":"Fucking+Castings%21+%28NEW+2013+Evil+Angel%29+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c6ab2a11eb4be40102025c9a22c4c446812d79b","infoHashBuffer":{"type":"Buffer","data":[92,106,178,161,30,180,190,64,16,32,37,201,162,44,76,68,104,18,215,155]},"announce":[],"urlList":[]}}