{"title":"DJ Spooky (That Subliminal Kid) - Songs of a Dead Dreamer","uid":3391036,"size":106708819,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5cf11f1b2ed93762e4f9f56f2bbf0453e5597d1a&amp;dn=DJ+Spooky+%28That+Subliminal+Kid%29+-+Songs+of+a+Dead+Dreamer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"courseB","files":16,"time":1128244475,"description":"Asphodel 0961 (c) 1996\n192kbps\n\n&quot;Songs of a Dead Dreamer&quot; is swimming in surreal urban ambient soundscapes, often a textural street sound collage. Hip-hop grooves begin, then trail off. Odd ham radio-type chirps groove along, then drop off; vaguely gritty analog keyboard sweeps come in, and static and overheard voices whisk by as if overheard from a passing car. Vocals and bass beats are relatively scarce. Even the occasional percussion and world music sounds creep in. Interestingly, this release is oddly warm and emotional. If Brian Eno had been raised on the Lower East Side today, he might be sculpting music that sounds like this. However, Paul Miller, a.k.a. DJ Spooky, The Subliminal Kid is the creator of this fascinating &quot;illbient&quot; music, which manages to evoke a surreal New York mindwarp while simultaneously transporting the listener to another environment altogether.\n\n&quot;The sense is one of listening from backstage, through a door that keeps opening and closing, to bits and pieces of performances. The vantage point is at a little distance from the singers, and they seem to be heard through a certain amount of backstage clatter; sometimes they move out of line of hearing, and sometimes the noise obscures the voices. But mostly, they can be heard quite well enough for the listener to get a very definite sense of personalities and occasionally of the full impact of virtuosity, that in terms of the opera house today, is quite beyond the wildest imagination...&quot;","torrent":{"xt":"urn:btih:5cf11f1b2ed93762e4f9f56f2bbf0453e5597d1a","amp;dn":"DJ+Spooky+%28That+Subliminal+Kid%29+-+Songs+of+a+Dead+Dreamer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cf11f1b2ed93762e4f9f56f2bbf0453e5597d1a","infoHashBuffer":{"type":"Buffer","data":[92,241,31,27,46,217,55,98,228,249,245,111,43,191,4,83,229,89,125,26]},"announce":[],"urlList":[]}}