{"title":"Wing Commander 4 Price Of Freedom GOG","uid":8151093,"size":6905904835,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5db255dc355a6669c5ed60233f4e962e708c0396&amp;dn=Wing+Commander+4+Price+Of+Freedom+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"AN0NYMOUS142857","files":-1,"time":1361038712,"description":"    genre     shooter / action / sci-fi\n    download size     6.2 GB\n    release date     December 31, 1995\n    compatible with     Windows (XP, Vista, 7, 8)\n    languages     English\n    developer / publisher     Origin Systems / Electronic Arts\n    game modes     single-player\n\n    Bonus content included for FREE with purchase:\n    manual\n    playguide\n    2 wallpapers\n    Origin Official Guide\n    reference card\n    8 production videos\n    2 promotional videos\n    Wing Commander 4 script\n    Wing Commander bible\n\nWhat's cool about it:\n\n    This version of Wing Commanderâ„¢ 4: The Price of Freedom features DVD-quality cutscenes.\n    Arguably the best installment of the Wing Commanderâ„¢ series and one of the best space sims of all time.\n    Enthralling and believable story, accompanied by great gameplay and fantastic orchestrated music.\n    Hours of masterfully directed full-motion video with actors such as Mark Hamill and Malcolm McDowell.\n\nOverview:\n\nThe year is 2673, four years after the Treaty of Torgo and the end of the Kilrathi War. As hostilities died out, more trivial concerns like rebuilding what was lost or dealing with space piracy, became the biggest concerns of the Terran Confederation. Even Christopher &quot;Maverick&quot; Blair, the famous Confed pilot responsible for ending the war, settled down and became a farmer. In these times of peace, humans grew fat and complacent. All good things must end, though. Soon enough, heinous incidents erupted on the outskirts of the Confederation, and humanity was forced to the brink of civil war. Confed HQ needed the best and decided to recall Colonel Blair to active duty. This is where you come in.\n\nWing Commanderâ„¢ 4 is one of the greatest space sims of all time, and some even consider it the greatest one of all. It is one of those games that did everything right. This is one of the few games that actually successfully manages to integrate a lot of FMV into the action, mostly because it uses trained film actors and directors. The combat is straightforward, fluid, and entertaining. The characters are as believable and memorable as they come. The orchestrated music -- just perfect. Finally, its enthralling story is both deep and plausible -- a combination that is often lost in modern games. There is simply no reason not to play this game and, once you do start playing, you will find it hard to think of a reason why you should stop.\n\nAge requirements: ESRB Rating: MATURE with Mild Language, Realistic Violence.\n\nMinimum system requirements: Windows XP or Windows Vista, 1.8 GHz Processor, 512MB RAM (1 GB recommended), 3D graphics card compatible with DirectX 7 (compatible with DirectX 9 recommended), 2GB HDD, Mouse, Keyboard.\n\nACCEPTANCE OF END USER LICENSE AGREEMENT REQUIRED TO PLAY\n\nInstall and Play.","torrent":{"xt":"urn:btih:5db255dc355a6669c5ed60233f4e962e708c0396","amp;dn":"Wing+Commander+4+Price+Of+Freedom+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5db255dc355a6669c5ed60233f4e962e708c0396","infoHashBuffer":{"type":"Buffer","data":[93,178,85,220,53,90,102,105,197,237,96,35,63,78,150,46,112,140,3,150]},"announce":[],"urlList":[]}}