{"title":"Linkman Pro 8.10 Multilanguage Portable","uid":6501928,"size":17235968,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5ea88f94d034be294bb3dc56a06ae9272345b064&amp;dn=Linkman+Pro+8.10+Multilanguage+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1309277960,"description":"Linkman Pro 8.10 Multilanguage Portable\n\nLinkman is a complete bookmark management solution to store, organize, annotate and check your favorite Internet pages. Linkman efficiently handles up to tens of thousands of URLs by using a database to store your links. It can call upon many powerful facilities that replace the browser's native URL management systems. You can easily add links from all browser windows and let retrieve keywords and descriptions automatically. The user interface is highly customizable. You get the capability to import and synchronize from existing bookmark collections and export bookmarks in a variety of formats. You can even build your own Export Templates. Several Template examples like XML and HTML output are included. Linkman supports multiple versions of ten different Windows browsers. The help file includes a comprehensive, screenshot based tutorial.\n\nFeatures:\nÃ‚Â» Compatibility with all major Windows browsers (IE, Firefox, Opera, Chrome, Seamonkey, Maxthon, etc.)\nÃ‚Â» Use the same link collection across different browsers\nÃ‚Â» Supports keywords, ratings, comments, descriptions and user defined data\nÃ‚Â» Ability to handle large databases (even millions of links) without performance or stability issues\nÃ‚Â» Internet Explorer integration\nÃ‚Â» Firefox 3 integration\nÃ‚Â» Optional Desktop Toolbar for fastest browsing ever\nÃ‚Â» Optional Internet Explorer Toolbar\nÃ‚Â» Highly customizable user interface\nÃ‚Â» Detects duplicate links, even if they differ in subdomains, ports or login data\nÃ‚Â» Query for URLs on the same domain or subdomain and display results in groups\nÃ‚Â» User defined rating system\nÃ‚Â» Synchronization\nÃ‚Â» Extensive help file including Tutorial\nÃ‚Â» Retrieves keywords, descriptions from web pages\nÃ‚Â» Password protection\nÃ‚Â» Multiple import and export formats\nÃ‚Â» Fully customizable Html Link webpage generation\nÃ‚Â» Text and Status Query\nÃ‚Â» Printing support\nÃ‚Â» Sort feature with multiple sort orders and autosort\nÃ‚Â» Drop Basket for faster browsing and URL addition\nÃ‚Â» URL Path associated launch\nÃ‚Â» URL Launch History\nÃ‚Â» Fast Links for fast access to your favorite URLs\nÃ‚Â» Daily Links feature to launch several bookmarks with one click\nÃ‚Â» Full Drag and Drop support including link drops from browser to Linkman\nÃ‚Â» Advanced Tray Icon (configurable click actions)\nÃ‚Â» User defined browser support\nÃ‚Â» Auto save\nÃ‚Â» System-wide hotkeys for easy use, even when working with another application\n\nHome Page - http://www.outertech.com/index.php?_charisma_page=product&amp;id=5\n\n","torrent":{"xt":"urn:btih:5ea88f94d034be294bb3dc56a06ae9272345b064","amp;dn":"Linkman+Pro+8.10+Multilanguage+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ea88f94d034be294bb3dc56a06ae9272345b064","infoHashBuffer":{"type":"Buffer","data":[94,168,143,148,208,52,190,41,75,179,220,86,160,106,233,39,35,69,176,100]},"announce":[],"urlList":[]}}