{"title":"Stossel.2013.11.16.Special.[War on the Little Guy].FNC.CF.avi","uid":9208624,"size":342730950,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5f227395d47ab8d130fe4a6aebd368dfe14f5a4f&amp;dn=Stossel.2013.11.16.Special.%5BWar+on+the+Little+Guy%5D.FNC.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1384740390,"description":"----------\n\nSTOSSEL Special - [War on the Little Guy] - Fox News Channel\n2013, November 16, Saturday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nMEET THE VICTIMS: Marty the Magician uses a rabbit in his act, so the USDA told him he needed a written &quot;disaster&quot; plan to deal with potential problems like hurricanes and tornadoes. Marty is just one of many victims of government's endless rules.\n\nENTREPRENEURS: Bill Main started a clever business called Segs in the City. It's a guided tour on Segways in Washington, D.C., but government says you need a license to talk on these tours.\n\nENDANGERED SPECIES ACT: The U.S. Fish and Wildlife Service has designated more than 1,500 acres in Louisiana as critical habitat for the dusky gopher frog, even though no frogs currently live anywhere near the land. I talk to the landowner who says designation makes it almost impossible for him to use his land.\n\nGUN RULES: The Constitution says individuals have a right to bear arms. But some cities make it nearly impossible to carry one. I test the system by applying to carry a gun in New York City. Will they accept my application?\n\nMOUNTAIN MAN: Eustace Conway runs a popular camp in North Carolina called &quot;Turtle Island&quot; where he teaches people how to live like a pioneer. Local government shut him down because it didn't meet building and health codes. In the end, he's so popular, that he wins.\n\nMOVING COMPANIES: RJ Bruner started one. People loved his service and his company grew... until state regulators told him to stop. He needed a &quot;Certificate of Necessity and Convenience&quot;. Basically he needed to prove his business was needed and won't hurt existing businesses.\n\nTECH TROUBLE: I become a taxi driver using an innovative phone application called Lyft, which connects people with a car with people who need rides. Passengers are kept safe because users give them ratings. People love it. But the regulators crack down.\n\nTHE GOOD NEWS: Technology also helps people rent out extra rooms in their apartments to make extra money, through websites like Airbnb and Roomorama. Regulators are fighting this, too. In New York State, they passed a law banning such rentals if they're shorter than a month. But people do this anyway, and use of the sites is growing. Entrepreneurs sometimes win.","torrent":{"xt":"urn:btih:5f227395d47ab8d130fe4a6aebd368dfe14f5a4f","amp;dn":"Stossel.2013.11.16.Special.%5BWar+on+the+Little+Guy%5D.FNC.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f227395d47ab8d130fe4a6aebd368dfe14f5a4f","infoHashBuffer":{"type":"Buffer","data":[95,34,115,149,212,122,184,209,48,254,74,106,235,211,104,223,225,79,90,79]},"announce":[],"urlList":[]}}