{"title":"Sony Ps2 Burn Tools &amp; Guides","uid":4390201,"size":16324992,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:602592e89c0ebd2bca0918a55ba2d1790e590de9&amp;dn=Sony+Ps2+Burn+Tools+%26+Guides&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Big_dude","files":1,"time":1221133401,"description":"Here's 14 Essential Program &amp; Rebuilding cd/dvd tools for Ps2 games + Guides to walk you through it.\n\n\n\nThese are some key goods &amp; how-to guides which I use and you can use to here in this download.  You can use it for rebuilding a Dvd9 (or commonly known as Dual-Layer DVD), Game into Dvd5 format. Or you can use these tools in conjucation with the guides to rebuild a cd ps2 game to a dvd5 format game. There's many mutliple\nthings you can do with these like patch a pal game to ntsc or vice versa, and much more.\n\n\nThere's other small ps2 programs out there on the net that's useful. But this good little bundle is the one I always use &amp; relay on.\n\n\n\n\nNote: On the issue with rebuilding ps2 cd-rom games to dvd, there are some things\nyou should know...In cdgen 2.0 or 1.5 version you will most likely get an \nerror message that says 'Error less than 60000 sectors'.  Which basically means\nthe data is to small or you need more space in order create the dvd image.  To fix\nthis use the dummy file creator included in this download, (or you can use something else on the net if you want)...in order to create a dummyfile.bin and place it in with the other files, it may have be to 540 mbs in size or 920 Mega bytes in size or even larger, it just depends on how much more size you need in order for it to be large enough to create the dvd image. And you need to patch the files with dvdscan to dvd instead of cd-rom which it checks the routine in-game file code for a cd or dvd check that the ps2 game checks for...its in the game data files that it can patch the files to dvd or cd routine checks for most games but not all. Then rebuild the image with a dummy file. This is how I was able to rebuild smugglers run 1 ps2 cd-rom game onto a dvd format. Some ps2 cd-rom games cannot be converted to dvd-rom format using these methods. And even some ps2 cd-rom games cannot be rebuilt to dvd at all, as of yet anyways.\n\n\n\n\nEnjoy!\n\nYou guys and anyone else downloading this need to seed don't just leech, I can't seed all the time.","torrent":{"xt":"urn:btih:602592e89c0ebd2bca0918a55ba2d1790e590de9","amp;dn":"Sony+Ps2+Burn+Tools+%26+Guides","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"602592e89c0ebd2bca0918a55ba2d1790e590de9","infoHashBuffer":{"type":"Buffer","data":[96,37,146,232,156,14,189,43,202,9,24,165,91,162,209,121,14,89,13,233]},"announce":[],"urlList":[]}}