{"title":"Beginning Fedora Desktop- Fedora 18 Edition [PDF] [StormRG]","uid":9820988,"size":23717747,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:603a80bfc6a878f158260809759e082a403bba94&amp;dn=Beginning+Fedora+Desktop-+Fedora+18+Edition+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"steelballz","files":-1,"time":1395697517,"description":"Description\nBeginning Fedora Desktop, Fedora 18 Edition - Richard Petersen\nAuthor: Richard Petersen\nPublished:Nov. 10 2013\nPublisher:Springer/Sci-Tech/Trade; 1 edition\nISBN-10:1430265620\nISBN-13:9781430265627\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\n\nTested on the above readers with no problems on laptop and Android tablet. \nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple \nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\nimage\nCover from actual book file\n\n\nProduct Description\n\nPublication Date: Nov. 10 2013\nBeginning Fedora Desktop: Fedora 18 Edition is a complete guide to using the Fedora 18 Desktop Linux release as your daily driver for mail, productivity, social networking, and more. Author and Linux expert Richard Petersen delves into the operating system as a whole and offers you a complete treatment of Fedora 18 Desktop installation, configuration, and use. /&gt; /&gt;You'll discover how to install Fedora 18 Desktop on any hardware, learn which applications perform which functions, how to manage software updates, tips and tricks for the GNOME 3 and KDE desktops, useful shell commands, and both the Fedora administration and network tools. /&gt; /&gt;Get the most out of Fedora 18 Desktop -- including free Office suites, editors, e-book readers, music and video applications and codecs, email clients, Web and FTP browsers, microblogging and IM applications -- with a copy of Beginning Fedora Desktop: Fedora 18 Edition at your side. What you'll learn how to install Fedora 18 Desktop on any hardware the available GUI choices, including KDE, GNOME, and alternative desktop environments how to use word processors, spreadsheets, presentation, and e-mail software how to maintain your system and back it up how to participate in social networks using open source clients Who this book is for Beginning Fedora Desktop: Fedora 18 Edition is for novice to intermediate users who are looking to install Fedora 18 as their primary computing environment. Table of Contents Fedora 18 Introduction Installation and Upgrade Usage Basics: Login, Desktop, and Help Installing and Updating Software: YUM, PackageKit, and RPM Office Applications and Editors Graphics and Multimedia Mail E-mail and News Internet Applications: Web and FTP Social Networking: Microblogging, IM, VoIP, and Social Desktop GNOME 3 The K Desktop Environment: KDE Shells Additional Desktops Fedora System Tools System Administration Network Configuration Printing\n\n\n\n\n\nimage\nScientia est potentia\n","torrent":{"xt":"urn:btih:603a80bfc6a878f158260809759e082a403bba94","amp;dn":"Beginning+Fedora+Desktop-+Fedora+18+Edition+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"603a80bfc6a878f158260809759e082a403bba94","infoHashBuffer":{"type":"Buffer","data":[96,58,128,191,198,168,120,241,88,38,8,9,117,158,8,42,64,59,186,148]},"announce":[],"urlList":[]}}