{"title":"Icke, David - I Am Me, I Am Free; The Robot's Guide to Freedom.","uid":3819064,"size":2101210,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:60b33f926610aa2c686249ffdd2b1521150338f4&amp;dn=Icke%2C+David+-+I+Am+Me%2C+I+Am+Free%3B+The+Robot%5C%27s+Guide+to+Freedom.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"drugarica","files":1,"time":1190753882,"description":"David Icke:I am me_I am free\n\n\nfrom the book\n\n...So who the hell are you, then? What lies behind those eyes? When you\nlook in the mirror, what do you see? Do you see the real you, or what\nyou have been conditioned to believe is you? The two are so, so,\ndifferent. One is an infinite consciousness capable of being and creating\nwhatever it chooses, the other is an illusion imprisoned by its own\nperceived and programmed limitations.\nWhich of these ???yous??? is controlling your life? Infinity or limitation?\nSelf love or self disdain? Freedom of thought or a prison of the mind?...\n\n...\nThe Global Dictatorship\nControl of the world over a very long period has been achieved by the\nmeans I have already outlined: mind manipulation, manufactured\ndivision, and most important of all, fear. This is the emotion that has\nhanded control of our lives to the manipulating clique which I call the\nGlobal Elite.\nOnce you can make people fearful they will look to someone to\nprotect them from whatever they have been conditioned to fear. This is\nwhy history, and the world today, is full of hyped up ???monsters??? and\n???dangerous people??? - a focus of fear from which we must look to our\n???leaders??? to save us.\n\n\nI highlight hundreds of people, events and organisations,\nwho in the public arena appear to be in opposition, but in truth are\nconnected to the same Global Elite. Among these connections, for\nexample, are those between George Bush and Saddam Hussein, the\n???opponents??? in the Gulf War of 1991. The manufactured Cold War\nbetween the West and the Soviet Union was another classic of this kind...\n\n.\n(&quot;read, look around.. and think yourself if it is true or not what david id talking about..&quot;...comment of uploader!)","torrent":{"xt":"urn:btih:60b33f926610aa2c686249ffdd2b1521150338f4","amp;dn":"Icke%2C+David+-+I+Am+Me%2C+I+Am+Free%3B+The+Robot%5C%27s+Guide+to+Freedom.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60b33f926610aa2c686249ffdd2b1521150338f4","infoHashBuffer":{"type":"Buffer","data":[96,179,63,146,102,16,170,44,104,98,73,255,221,43,21,33,21,3,56,244]},"announce":[],"urlList":[]}}