{"title":"(Film-Ita) - Navigator - (Toky)","uid":4259893,"size":732062058,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:619e2b11eb369c243f0314b94eaef66fbcbcc2bb&amp;dn=%28Film-Ita%29+-+Navigator+-+%28Toky%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pablo35","files":1,"time":1214416623,"description":"Releaser: Toky\n\nTitolo film: Navigator\nAnno: 1986\nGenere: Fantascienza\nRegia: Randal Kleiser\nDurata 85 min.\nLingua: Italiana\nSottotitoli: ---\n\nFormato: Xvid\nDimensioni: 720x336\nBitrate: 1148,39 kbit/s\nFile: 690,14 MB\n\n\nTrama:\nDavid Scott Freeman, un ragazzo di 12 anni, mentre rincorre il suo fratellino in un bosco, scivola in un anfratto e sviene. Quando si riprende corre subito a casa, ma scopre con immenso stupore che casa sua ÃƒÂ¨ ora abitata da persone a lui sconosciute. Avvisata la Polizia, si scopre che i suoi genitori (che nel frattempo si erano trasferiti) ne avevano denunciato la scomparsa 8 anni prima. Il suo aspetto, perÃƒÂ², ÃƒÂ¨ rimasto inspiegabilmente quello del ragazzino in etÃƒÂ  pre-adolescenziale. Nel frattempo un&amp;#039;astronave viene trovata dalla NASA poco lontano e viene nascosta in un hangar per essere studiata. Durante un test encefalografico effettuato su David, il cervello di quest&amp;#039;ultimo inizia a comunicare in modo inconscio con il computer che effettua l&amp;#039;esame encefalografico, mostrando tra il resto immagini costruttivi dell&amp;#039;astronave trovata dalla NASA.\nA causa di questa ovvia correlazione, David viene ospitato dalla NASA per scopi di ricerca. Durante il primo esame, effettuato interfacciandosi direttamente al cervello di David, si apprende che il ragazzo ÃƒÂ¨ stato trasportato a velocitÃƒÂ  prossima a quella della luce sul pianeta Phaelon, e riportato indietro alla medesima velocitÃƒÂ . La Teoria della relativitÃƒÂ  spiega come, sebbene il suo viaggio sia durato poche ore dal suo punto di vista, sulla terra siano passati 8 anni. La mente di David fornisce anche una dettagliata mappa spaziale del pianeta in questione.\nDopo pochi giorni, seguendo il suo istinto, David riesce a eludere la sorveglianza e a penetrare nell&amp;#039;hangar dove ÃƒÂ¨ custodita la nave spaziale. Parlando con la navetta (dotata di una austera intelligenza artificiale) il ragazzino scopre di essere stato chiamato in quanto, a seguito di un incidente avvenuto sulla terra subito dopo averlo rilasciato, la nave necessita le mappe stellari instillate nel cervello di David durante il breve soggiorno a Phaelon.\nA questo punto il personale della NASA si rende conto della violazione nell&amp;#039;hangar ospitante la nave, e lo occupa militarmente. A seguito di un comando diretto di David, la navetta evade facilmente dall&amp;#039;hangar ove era imprigionata e si allontana dalla base. Iniziano quindi una serie di avventure finalizzate al ritorno di David a casa sua a Fort Lauderdale, in Florida. Durante questo viaggio, la nave spaziale (ribattezzata MAX) estrae le mappe spaziali dal cervello di David e, con esse, tratti caratteristici della personalitÃƒÂ  del ragazzo, che portano la macchina ad assumere un atteggiamento nettamente piÃƒÂ¹ umano e, per molti versi, decisamente infantile.\nGiunti a casa di David, trovano ad attenderlo la NASA accompagnata dall&amp;#039;esercito. Improvvisamente David capisce che, in quel continuum spazio-temporale la sua vita ÃƒÂ¨ rovinata, essendo destinato ad una vita da cavia da laboratorio. Con una frase molto eloquente (&quot;Voi siete si la mia famiglia, ma non siete la mia casa: la mia casa ÃƒÂ¨ rimasta nel &amp;#039;78&quot;), David risale sulla nave spaziale. Chiede quindi a Max (la navetta) se puÃƒÂ² portarlo indietro nel tempo sino alla sera quando fu prelevato. Max afferma che ÃƒÂ¨ possibile, ma estremamente rischioso. David decide di correre il rischio e, dopo un viaggio effettuato probabilmente a VelocitÃƒÂ  superluminale, il ragazzo si ritrova nel medesimo fosso dove era caduto inseguendo il fratello. Correndo a casa, scopre di essere tornato nel &amp;#039;78 e di aver ripreso la sua vita esattamente come l&amp;#039;aveva lasciata. Nell&amp;#039;ultima sequenza, David vede (e sente) Max mentre sfeccia nel cielo stellato sopra di lui.\n\nBanda: 30kb dalle 24 alle 8 tutti i giorni.\n\n\n","torrent":{"xt":"urn:btih:619e2b11eb369c243f0314b94eaef66fbcbcc2bb","amp;dn":"%28Film-Ita%29+-+Navigator+-+%28Toky%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"619e2b11eb369c243f0314b94eaef66fbcbcc2bb","infoHashBuffer":{"type":"Buffer","data":[97,158,43,17,235,54,156,36,63,3,20,185,78,174,246,111,188,188,194,187]},"announce":[],"urlList":[]}}