{"title":"PHIL COLLINS Hello, I Must Be Going (2011 Steve Hoffman Remaster","uid":7288614,"size":294417524,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:61d4ed1daecc14dd781b1e509d797c7716295f16&amp;dn=PHIL+COLLINS+Hello%2C+I+Must+Be+Going+%282011+Steve+Hoffman+Remaster&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"rjordan21","files":-1,"time":1337658119,"description":"from Steve Hoffmans forum.......\n\n\nHello, I Must Be Going! (an album pretty much about Phils divorce), recorded and mixed in analog in 1982 was pretty easy to work on in mastering, for one reason. Phil and his management love what Audio Fidelity has done with Phils sound on the other two Gold CDs and our condition that the original tapes would be used was(with a bit of anxious waiting) accomplished. The masters, stored in the UK, came directly from Phils management and with them in the loop, we in the mastering studio could clearly hear what Phil and Hugh were going for in the studio. Our goal was to translate that to digital, all the while respecting the original intent of the sound picture, not forgetting that the compromises that were made in 82 to get this to vinyl were no longer in play. That meant that the extra sharp bite of some of the songs no longer had to be toned down to be cut correctly on a phonograph record. However, Stephen Marsh and I did not want to kill anyones eardrums by leaving the mixes totally unworked.\n\nIn mastering these 30 ips tapes we wanted a full, rich sound, mindful of the fact that Phil didn't always want that. He likes stark, moody sounds sometimes and to warm up something like that in mastering would be the biggest type of betrayal of the original intent of the recording.\n\nMarsh and I worked at it until we nailed it with just the right amount of depth, warmth and lifelike sound and I believe we have faithfully reproduced what Phil and Hugh were going for back in 1982, but with the amazing tonality reproduction of the best Audio Fidelity sound. The crucial, magic midrange is here on our version and not in hiding like on most other releases of this album down through the years, especially the versions released in the United States that used the third generation Atlantic EQd cutting dub. This is tres important, for the MAGIC OF THE MUSIC IS IN THE MIDRANGE!\n\nIt's always great to be able to work from analog tapes and Im happy that this album was mixed without Dolby A and at 30 ips AES. That made it fun to watch the giant metal reels spinning around quicklike and it always amazes the groupie girls who hang out with us stud mastering engineers. \n\nNot my rip but verified with Audiochecker V1.2.  All tracks CDDA with probability 100%. Artwork included.\t","torrent":{"xt":"urn:btih:61d4ed1daecc14dd781b1e509d797c7716295f16","amp;dn":"PHIL+COLLINS+Hello%2C+I+Must+Be+Going+%282011+Steve+Hoffman+Remaster","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61d4ed1daecc14dd781b1e509d797c7716295f16","infoHashBuffer":{"type":"Buffer","data":[97,212,237,29,174,204,20,221,120,27,30,80,157,121,124,119,22,41,95,22]},"announce":[],"urlList":[]}}