{"title":"Joey DeFrancesco - Snapshot","uid":10026796,"size":144263416,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:61dc8e633936833aaa0926c56a06360698721a54&amp;dn=Joey+DeFrancesco+-+Snapshot&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"L_Hammond","files":-1,"time":1398279500,"description":"Joey DeFrancesco - Snapshot\n\nLive, burning B-3 trio jazz by jazz organ giant Joey DeFrancesco and his two old friends Paul Bollenback and Byron Landham.\n\nRelease: 2009\nLabel: HighNote\n\nTracks:\n01. Eighty One (7:58)\n02. The End of a Love Affair (9:56)\n03. Introductions (2:45)\n04. Ode to Angela (7:28)\n05. Songline (6:20)\n06. You Don't Know Me (7:16)\n07. Fly Me to the Moon (8:32)\n08. Whichole (9:20)\n\nTotal Time: 59:35\n\nPersonnel:\n- Joey DeFrancesco - Hammond B-3 organ,\n- Paul Bollenback - guitar,\n- Byron Landham - drums.\n\nRecorded live at the Kerr Cultural Center, Scottsdale, AZ on March 5, 2009.\n\nFormat: MP3 320 kbit/s. All songs are tagged by the book.\n\n--------\n\nSnapshot is latest in a long line of records Joey Francesco has cut for HighNote, and this time, the master organist takes his show on the road, literally. This live engagement out of Scottsdale, Arizona earlier this year is a no-frills delight by a standard organ/guitar/drums combo. For the show, DeFrancesco got support from guys who he has trusted for a couple of decades. Guitarist Paul Bollenback had toured with him for fifteen years starting in 1990 and reunited for this recording. Byron Landham goes back even further, having played for DeFrancesco since the tour supporting his first album. Both appeared on DeFrancesco's third album in 1991 and have graced many of his records since then (Bollenback boasts more than a half dozen records under his own name, as well).\n\nThis stage date runs through five standards and two originals ('Songline' by Bollenback and 'Whichole' by DeFrancesco), and does it with much fire and little fuss. As is the case in these settings, the leader gets the most solo spotlight, but leaves plenty of room left over for his bandmates. The standards are given treatments that tends to accentuate the format and it's clear that these dudes read each others minds very well with the subtle touches done on many of these songs. My personal faves are the Miles Davis/Ron Carter stalwart 'Eighty One', the mood-shifting rendition of 'Fly Me To The Moon' and Bollenback's own 'Songline'.\n\nThe mission of Snapshot is straightforward and it accomplishes that mission well. For live, burning B-3 trio jazz in the honored tradition of Jimmy Smith, Jack McDuff and Charles Earland, it can't be said that it can be done better these days than by Joey DeFrancesco and his two old friends. \nBy S. Victor Aaron\n\n--------\n\nIf you encounter errors during the file sharing, please, place this material as close to the root of the hard disk as possible and restart the file sharing (e.g. as close as possible to C: in Windows). This is in order to make the path (drive, directory and filename) as short as possible. Operating systems have limits regarding how long a path including the filename can be, and if this limit is exceeded there will be errors.\n\n--------\n\nL Hammond, The Pirate Bay, where you'll find more jazz organ.\n","torrent":{"xt":"urn:btih:61dc8e633936833aaa0926c56a06360698721a54","amp;dn":"Joey+DeFrancesco+-+Snapshot","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61dc8e633936833aaa0926c56a06360698721a54","infoHashBuffer":{"type":"Buffer","data":[97,220,142,99,57,54,131,58,170,9,38,197,106,6,54,6,152,114,26,84]},"announce":[],"urlList":[]}}