{"title":"The Oxford Project (Photo Art Society Ebook).pdf","uid":9114658,"size":106843748,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:61fa69fefbe805d9a702ea5d1f58a5693e80955f&amp;dn=The+Oxford+Project+%28Photo+Art+Society+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"STBGD","files":-1,"time":1383004561,"description":"The Oxford Project\nWelcome Books | Stephen G. Bloom, Peter Feldstein | 2008 | HQ PDF | ISBN: 1599620480 | 293 pages | 101 Mb\n\nIn 1984, photographer Peter Feldstein set out to photograph every single resident of his town, Oxford, Iowa (pop. 676). He converted an abandoned storefront on Main Street into a makeshift studio and posted fliers inviting people to stop by. At first they trickled in slowly, but in the end, nearly all of Oxford stood before Feldstein's lens. Twenty years later, Feldstein decided to do it again.\nOnly this time he invited writer Stephen G. Bloom to join him, and together they went in search of the same Oxford residents Feldstein had originally shot two decades earlier. Some had moved. Most had stayed. Others had passed away. All were marked by the passage of time.\n\nIn a place like Oxford, not only does everyone know everyone else, but also everyone else's brothers, sisters, parents, grandparents, lovers, secrets, failures, dreams, and favorite pot luck recipes. This intricate web of human connections between neighbors friends, and family, is the mainstay of small town American life, a disappearing culture that is unforgettably captured in Feldstein's candid black-and-white portraiture and Bloom's astonishing rural storytelling.\n\nMeet the town auctioneer who fell in love with his wife in high school while ice-skating together on local ponds; his wife who recalls the dress she wore as his prom date over fifty years ago; a retired buck skinner who started a gospel church and awaits the rapture in 2028; the donut baker at the Depot who went from having to be weighed on a livestock scale to losing over 150 pounds with the support of all of Oxford; a twenty-one-year-old man photographed in 1984 as an infant in his father's arms, who has now survived both of his parents due to tragedy and illness.\n\nConsidered side-by-side, the portraits reveal the inevitable transformations of aging: wider waistlines, wrinkled skin, eyeglasses, and bowed backs. Babies and children have instantly sprouted into young nurses, truck drivers, teachers, and rodeo riders, become Buddhists, racists, democrats, and drug addicts. The courses of lives have been irrevocably altered by deaths, births, marriages, and divorces. Some have lost God--others have found Him. But there are also those for whom it appears time has almost stood still. Kevin Somerville looks eerily identical in his 1984 and 2004 portraits, right down to his worn overalls, shaggy mane, and pale sunglasses. Only the graying of his lumberjack beard gives away the years that have passed.\n\nFace after face, story after story, what quietly emerges is a living composite of a quintessential Midwestern community, told through the words and images of its residents--then and now. In a town where newcomers are recognized by the sound of an\nunfamiliar engine idle, The Oxford Project invites you to discover the unexpected details, the heartbreak, and the reality of lives lived on the fringe of our urban culture.","torrent":{"xt":"urn:btih:61fa69fefbe805d9a702ea5d1f58a5693e80955f","amp;dn":"The+Oxford+Project+%28Photo+Art+Society+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61fa69fefbe805d9a702ea5d1f58a5693e80955f","infoHashBuffer":{"type":"Buffer","data":[97,250,105,254,251,232,5,217,167,2,234,93,31,88,165,105,62,128,149,95]},"announce":[],"urlList":[]}}