{"title":"Frank Zappa - Halloween - 2003 (Live in NYC 1978) flac","uid":5162786,"size":435063709,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6241bda0bc77c69da0e80f9f541b3fba9e0fb267&amp;dn=Frank+Zappa+-+Halloween+-+2003+%28Live+in+NYC+1978%29+flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":null,"files":18,"time":1258240682,"description":" &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51QypxDDeyL._SL500_AA240_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51QypxDDeyL._SL500_AA240_.jpg&lt;/a&gt;  \n\nFrank Zappa - Halloween - 2003 (Live in NYC 1978) flac\n\nNo CUE and no LOG files.\n\nMusic samples at:  &lt;a href=&quot;\nhttp://www.last.fm/music/Frank+Zappa/Halloween&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.last.fm/music/Frank+Zappa/Halloween&lt;/a&gt;  \n\nBBC Review\nNot a release for beginners; but most satisfying for those who already know Frank's...\nChris Jones 2003-10-08\n\nFrom Zappa's earliest days with the original Mothers Of Invention he had a special affinity with New York. It was during a Summer 1967 residency at the Garrick theatre that he first honed his role as arch social commentator and MC to an act that veered between jazzy music concrete and scatalogical Dadaism. On the East Coast he found an acceptance and cynical affinity that was missing in the blissed-out West, and never forgot the warm welcome the Big Apple gave him. Thus he returned yearly for a series of halloween shows that became legendary for their length and degree of audience participation. His film Baby Snakes captured one of these marathon gigs in 1979; now Halloween gives us a selection from the previous year's fun and frolics.\n\nAny new Zappa release, coming on the heels of 70-odd others, is bound to be a little daunting for the uninitiated. Yet this DVD Audio-only release, produced by son Dweezil, plays it safe with a selection of crowd-pleasing comedy numbers (''Don't Eat The Yellow Snow'', ''Dancin' Fool'', ''Conehead'' etc.). This is not to say the whole thing is played for laughs. Zappa's touring bands, despite their necessary ablity to wing it, were ruled by an iron hand and never fail to deliver all the right notes onto the tape.\n\nHere we see Zappa in transition, between his most musically fecund jazz-rock phase (where he worked with peerless musicians of the calibre of George Duke, Ruth Underwood and Chester Thompson) and the later, grumpier, more muso period where flash and filth tended to overshadow his genius. Old stalwarts like Denny Walley (slide guitar) are joined by younger bucks like Vinnie Colaiuta (drums), Patrick OHearn (bass) and guest violinist L Shankar for a show that's tight if a little perfunctory for the listener.\n\nThis is strange considering that this new medium affords the most amazing fidelity (much is made in the sleeve notes about the ability to hear the 'slap back' of the bass in the auditorium). It really does feel like a front row seat, but stretches the patience slightly without visuals in the spoken interludes. However, there are moments here that rank with the best of Frank's other live recordings. The opening solo on ''Ancient Armaments'' shows you why even Radio 3 listeners still regard him as a true master of the axe, while the duet with Shankar on ''Black Napkins/The Deathless Horsie'' brings a tear to the eye.\n\nThe DVD is packed with extras such as a full libretto and two live videos that are vaguely contemporaneous. So, not a release for beginners; but most satisfying for those who already know Frank's true place in the pantheon of 20th century greats. Great googly-moogly, indeed...\n\nEnjoy!\n\n\n\nX Lossless Decoder (freeware, Mac OS X 10.3 or later)  &lt;a href=&quot;\nhttp://www.macupdate.com/info.php/id/23430/x-lossless-decoder&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.macupdate.com/info.php/id/23430/x-lossless-decoder&lt;/a&gt;  \n\nfoobar2000 (freeware, Windows XP, Windows XP 64-bit edition, Windows Server 2003, Windows Vista)  &lt;a href=&quot;\nhttp://www.foobar2000.org/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.foobar2000.org/index.html&lt;/a&gt;  \n","torrent":{"xt":"urn:btih:6241bda0bc77c69da0e80f9f541b3fba9e0fb267","amp;dn":"Frank+Zappa+-+Halloween+-+2003+%28Live+in+NYC+1978%29+flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6241bda0bc77c69da0e80f9f541b3fba9e0fb267","infoHashBuffer":{"type":"Buffer","data":[98,65,189,160,188,119,198,157,160,232,15,159,84,27,63,186,158,15,178,103]},"announce":[],"urlList":[]}}