{"title":"Peter en the Wolf(multi Audio)(2Lions-Team)","uid":5414451,"size":4702874961,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:62ec0882a15a9d15c5c457a40d7d55f2c13732ba&amp;dn=Peter+en+the+Wolf%28multi+Audio%29%282Lions-Team%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"JUULTJE","files":-1,"time":1267867265,"description":"Peter &amp; the Wolf (2006) \n\n \t\nHet is een wereld waarin wolven eenden verslinden. Het is echter ook een wereld, waarin een kleine jongen met uitzonderlijke moed en met hulp van een maffe vogel en een dromerige eend, een wolf vangt. Prokofievs verhaal heeft al vijf generaties kinderen en volwassenen diep weten te raken. Zij werden betoverd door haar kracht en plezier. Deze nieuwe film bewerkt het klassieke verhaal en geeft het een 21e-eeuwse draai, maar blijft trouw aan het originele verhaal.\nPeter &amp; de Wolf is geproduceerd door BreakThru Films in de beroemde Se-ma-for studio's in Polen, met behulp van stop frame motion animatie (zoals in Wallace en Grommit en Chicken Run). De film is geregisseerd door het aanstormende animatietalent Suzie Templeton (eerder regelmatig in de prijzen gevallen, waaronder een Britse Academy Award voor Beste animatie) en maakt gebruik van een nieuwe opname door het Philharmonia Orchestra uit Londen.\n\nEngels\n\nOn the edge of the vast forests of Russia, where wolves still roam, lies a little cottage surrounded by a big, high fence. This is where Peter lives with his grumpy Grandfather. Grandfather will not let Peter go out into the forest. Peter has a friend, the lovable Duck, with whom he hangs around Grandfather's yard. A Bird with a broken wing arrives in the yard. Bird is very impatient with Peter and signals to go into the forest. His heart beating fast, Peter tiptoes into the cottage and reaches over his sleeping Grandfather and the snoring, fat Cat. Ever so carefully Peter takes the keys to the gate........\n\nWeblink http://www.imdb.com/title/tt0863136/\n\n\nVideo                 : DVD RIP\nAudio                 : Engels German French Spanish Italian Portuguese Nederlands\nSubs                  : Engels\nID                    : 0xE0\nFormat                : MPEG Video\nFormat version        : Version 2\nBit rate mode         : Variable\nWidth                 : 720 pixels\nHeight                : 576 pixels\nDisplay aspect ratio  : 16:9\nFrame rate            : 25.000 fps\nStandard              : PAL\n\n\n*****************************************\n\nBrought to you by Juultje\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n                          &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\t\t\n","torrent":{"xt":"urn:btih:62ec0882a15a9d15c5c457a40d7d55f2c13732ba","amp;dn":"Peter+en+the+Wolf%28multi+Audio%29%282Lions-Team%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62ec0882a15a9d15c5c457a40d7d55f2c13732ba","infoHashBuffer":{"type":"Buffer","data":[98,236,8,130,161,90,157,21,197,196,87,164,13,125,85,242,193,55,50,186]},"announce":[],"urlList":[]}}