{"title":"The Jesus Puzzle - Earl Doherty","uid":6764350,"size":6494507,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:62eedca5eb6695d75d5717bce513b4dcdf235d83&amp;dn=The+Jesus+Puzzle+-+Earl+Doherty&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rosie1966","files":2,"time":1319315937,"description":"The Jesus Puzzle: Did Christianity Begin with a Mythical Christ? Challenging the Existence of an Historical Jesus\nEarl Doherty (Author)\n\nI've read three shelves worth of books on Christian apologetics and the quest for the historical Jesus. I can save you a lot of time. All you really need is this one. The other books raise more questions than they answer, and go off on a lot of wild goose chases. But Doherty's book makes full use of the available evidence, and his thesis actually makes sense.\nIf you want to read the Christian side (and you should) I recommend &quot;The Case for Christ&quot; by Lee Strobel. Strobel is very selective in his use of evidence, but the book is a good read, and probably the best that can be done for the Christian faith. Read it first if you like, and then read Doherty. There's no comparison.\n\nDoherty also has a web site. I recommend you first read his book and then visit the site. Spend the time to go through everything he presents there - it's well worth it. The site also contains a novel (also titled &quot;The Jesus Puzzle&quot;) I thought it was excellent. It deserves to be published. Doherty also provides a lengthy and devastating critique of the Strobel book on his site.\n\nAs I read &quot;The Jesus Puzzle&quot; I was surprised at how resistant I was to the thesis that there had been no historical Jesus (I'm not a Christian), but I was impressed at how thoroughly Doherty overwhelmed my resistance. This book deserves the whole world as its audience. Buy it, read it, buy more copies and give them away, spread the word. Nineteen hundred years of misconception has finally been clarified.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:62eedca5eb6695d75d5717bce513b4dcdf235d83","amp;dn":"The+Jesus+Puzzle+-+Earl+Doherty","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62eedca5eb6695d75d5717bce513b4dcdf235d83","infoHashBuffer":{"type":"Buffer","data":[98,238,220,165,235,102,149,215,93,87,23,188,229,19,180,220,223,35,93,131]},"announce":[],"urlList":[]}}