{"title":"Ride - Carnival of Light [1994]","uid":9414972,"size":392267290,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:62f1cdcdc6d3c68a7bccde67565b66556e6104b3&amp;dn=Ride+-+Carnival+of+Light+%5B1994%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GenXRock","files":-1,"time":1388417508,"description":"Credit Ride for using only their own creative radar, completely ignoring all outside expectations for their third LP. Listeners could tell they had a love for the likes of the Byrds and Buffalo Springfield, but admiring the Black Crowes was practically out of the question for the scene that birthed them. Even Crowes producer George Drakoulias was called in to produce, but John Leckie ended up working on the majority. Fans generally didn't dig the classic vibe, and the lazy-daisy, pastoral record fared poorly. Carnival's first side largely consists of Mark Gardener's songs, while the latter is mainly Andy Bell's affair. Gardener's contributions are solid. &quot;1000 Miles&quot; lifts '60s jangle convincingly. &quot;From Time to Time&quot; is a &quot;Vapour Trail&quot; part two of sorts, lyrically, introduced with tasteful Rhodes tones from Andy Bell. Bell's songs, however, tend to falter. While he wrote the bulk of the band's prior top material, he's trumped here; in fact, Loz Colbert's &quot;Natural Grace&quot; wipes the mat with Bell's work. Perhaps Bell's ego was too big to recognize the lyrical shortcomings of &quot;Crown of Creation,&quot; the poor Al Greenism of &quot;Endless Road,&quot; and the outright flimsiness of &quot;I Don't Know Where It Comes From,&quot; which features a kiddie choir. Despite the gaps in song quality and that hackneyed Creation cover, Carnival of Light creates a pleasant, freewheeling feeling throughout. The LP might have run better with the extraction of some of the duff, which is all the more frustrating when considering the quality of the B-sides from this period. Album number three, despite its troubles, remains a pleasant listen and was unlike anything released at the time in the U.K. (3/5)","torrent":{"xt":"urn:btih:62f1cdcdc6d3c68a7bccde67565b66556e6104b3","amp;dn":"Ride+-+Carnival+of+Light+%5B1994%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62f1cdcdc6d3c68a7bccde67565b66556e6104b3","infoHashBuffer":{"type":"Buffer","data":[98,241,205,205,198,211,198,138,123,204,222,103,86,91,102,85,110,97,4,179]},"announce":[],"urlList":[]}}