{"title":"Michael J Fox - Lucky Man (autobiography) read by the author","uid":3971644,"size":118805849,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:62fde4a91467a2f35bb08a9386e1b1b4cea195a8&amp;dn=Michael+J+Fox+-+Lucky+Man+%28autobiography%29+read+by+the+author&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"paulyearwig","files":8,"time":1200040068,"description":"In September 1998, Michael J. Fox stunned the world by announcing that he had been diagnosed with Parkinson&amp;#039;s disease -- a degenerative neurological condition. In fact, he had been secretly fighting it for seven years. The worldwide response was staggering. Fortunately, he had accepted the diagnosis, and by the time the public started grieving for him, he had stopped grieving for himself. With the same passion, humor, and energy that he has invested in his dozens of performances over the last eighteen years, he tells the story of his life, his career, and his campaign to find a cure for Parkinson&amp;#039;s. \n\nCombining his trademark ironic sensibility and keen sense of the absurd, he recounts his life -- from his childhood in western Canada to his meteoric rise in film and television which made him a worldwide celebrity. Most importantly, he writes of the last ten years, during which -- with the unswerving support of his wife, family, and friends -- he has dealt with his illness. He talks about what Parkinson&amp;#039;s has given him: the chance to appreciate a wonderful life and career, and the opportunity to help search for a cure and spread public awareness of the disease. He feels as if he is a very lucky man, indeed.\n\n\n6 hours (abridged)\n\n\n","torrent":{"xt":"urn:btih:62fde4a91467a2f35bb08a9386e1b1b4cea195a8","amp;dn":"Michael+J+Fox+-+Lucky+Man+%28autobiography%29+read+by+the+author","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62fde4a91467a2f35bb08a9386e1b1b4cea195a8","infoHashBuffer":{"type":"Buffer","data":[98,253,228,169,20,103,162,243,91,176,138,147,134,225,177,180,206,161,149,168]},"announce":[],"urlList":[]}}