{"title":"The Believing Brain - From Ghosts to Gods","uid":6572574,"size":662214903,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:634215af35e0ec0264d9635673e59b5cfe0668c8&amp;dn=The+Believing+Brain+-+From+Ghosts+to+Gods&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"neil1966hardy","files":4,"time":1312035177,"description":"Michael Shermer - The Believing Brain: From Ghosts and Gods to Politics and Conspiracies [Audio Book] [2011\n &lt;a href=&quot;\nhttp://www.michaelshermer.com/the-believing-brain/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.michaelshermer.com/the-believing-brain/&lt;/a&gt;\n\n \n\nIn this, his magnum opus, the world's best known skeptic and critical thinker, Dr. Michael Shermer - founding publisher of Skeptic magazine and perennial monthly columnist (&quot;Skeptic&quot;) for Scientific American - presents his comprehensive theory on how beliefs are born, formed, nourished, reinforced, challenged, changed, and extinguished. This book synthesizes Dr. Shermer's 30 years of research to answer the question of how and why we believe what we do in all aspects of our lives, from our suspicions and superstitions to our politics, economics, and social beliefs.\n\nIn this book Dr. Shermer is interested in more than just why people believe weird things, or why people believe this or that claim, but in why people believe anything at all. His thesis is straightforward: We form our beliefs for a variety of subjective, personal, emotional, and psychological reasons in the context of environments created by family, friends, colleagues, culture, and society at large; after forming our beliefs, we then defend, justify, and rationalize them with a host of intellectual reasons, cogent arguments, and rational explanations. Beliefs come first, explanations for beliefs follow.\n\nDr. Shermer also explains the neuroscience behind our beliefs. The brain is a belief engine. From sensory data flowing in through the senses, the brain naturally begins to look for and find patterns, and then infuses those patterns with meaning. These meaningful patterns become beliefs. Once beliefs are formed, the brain begins to look for and find confirmatory evidence in support of those beliefs, which adds an emotional boost of further confidence in the beliefs and thereby accelerates the process of reinforcing them - and round and round the process goes in a positive feedback loop of belief confirmation. Dr. Shermer outlines the numerous cognitive tools our brains engage to reinforce our beliefs as truths and to insure that we are always right.\n\nFormat: mp3\nBitrate: V0 VBR\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:634215af35e0ec0264d9635673e59b5cfe0668c8","amp;dn":"The+Believing+Brain+-+From+Ghosts+to+Gods","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"634215af35e0ec0264d9635673e59b5cfe0668c8","infoHashBuffer":{"type":"Buffer","data":[99,66,21,175,53,224,236,2,100,217,99,86,115,229,155,92,254,6,104,200]},"announce":[],"urlList":[]}}