{"title":"Euphoria - Mash Up - Various(SPLIT TRACKS + COVERS)","uid":4732978,"size":298596931,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6393e51a74ecd9b2e669d2d87da48032fbedc545&amp;dn=Euphoria+-+Mash+Up+-+Various%28SPLIT+TRACKS+%2B+COVERS%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"michelinman","files":40,"time":1235138048,"description":"[img]http://images.play.com/covers/8826156x.jpg[/img]\n\nDisc 1\n\n   1. Peter Gelderblom Waiting 4 - Kings Of Tomorrow Finally Acappella\n   2. Yves Larock Rise Up Vandalism Remix - Moloko The Time Is Now Acappella Agnelli &amp; Nelson Embrace\n   3. Slusnik Luna Sun Club Mix - Magnolia It's All Vain Acappella\n   4. Agnelli &amp; Nelson Hudson Street - Chanel Dance Acappella\n   5. The Space Brothers Shine - ATB 9PM (Till I Come)\n   6. Push The Legacy - Freefall Feat. Jan Johnston Skydive (I Feel Wonderful) Acappella\n   7. Mauro Picotto Pulsar Original Picotto Tea Mix - Powers That Be Vs Roland Clark Planet Rock Acappella Snap! Rhythm Is A Dancer Acappella\n   8. Mauro Picotto Lizard Megavoices Mix - 666 D.E.V.I.L. Acappella A.T.F.C. Presents Onephatdeeva In And Out Of My Life Acappella Marco V Red Blue Purple\n   9. BK Revolution - Adam Freeland We Want Your Soul Acappella\n  10. DJ Misjah &amp; DJ Tim Access - M/A/R/R/S Pump Up The Volume USA 12&quot; Mix Public Domain Operation Blade\n  11. Lost Tribe Gamemaster- Schiller Das Glockenspiel Humate Remix South West Beats It's Love (Trippin') Acappella Soulsearcher Can't Get Enough Acappella\n  12. Darude Sandstorm \n\n Disc 2\n\n   1. Lustral Everytime Acappella - Deepest Blue Is It A Sin Circada's Stadium Remix\n   2. Mother's Pride Learning to Fly - Revelation Just Be Dub To Me Acappella\n   3. Billy Hendrix Bodyshine - Starchaser Love Will Set You Free (Jambe Myth) Acappella\n   4. Underworld Cowgirl - The Thrillseekers Synaesthesia Original En Motion Mix Deepest Blue Deepest Blue Acappella\n   5. Three Drives Greece 2000 De Souza Feat. Shena Guilty Acappella Blue Amazon The Javelin Album Version Booty Luv Boogie 2Nite Acappella\n   6. Karizma Feat. DJ Spen 4 The Love Acappella Jurgen Vries The Theme JamX &amp; De Leon's DuMonde Remix (Clean Version) Henrik B Feat. Terri B Soul Heaven Acappella\n   7. Voodoo &amp; Serano Blood Is Pumping - Junior Jack E Samba Acappella\n   8. Storm Time To Burn - Tomcraft Loneliness Acappella The Lost Brothers Feat. G Tom Mac Cry Little Sister (I Need U Now) Acappella\n   9. Minimalistix Close Cover (The Piano Track) - Chakra I Am Acappella) Matt Darey Presents DSP From Russia With Love Acappella\n  10. Sunscreem Vs Push Please Save Me - Lost Tribe Angel Acappella\n  11. BK &amp; Nick Sentience Flash - Perasma Swing 2 Harmony The Caramel Club Mama Say Mama Sa Acappella\n\n Disc 3\n\n   1. Bob Sinclar Feat. Gary Nesta Pine Love Generation Preacher Vocal Mix - Dave Armstrong &amp; Redroche Feat. H-Boogie Love Has Gone Instrumental Mix Shakedown At Night Acappella\n   2. Commander Tom Attention! - The Prodigy Posion Mylo Drop The Pressure DT8 Project Feat. Andrea Britton Winter Acappella\n   3. Mandrake Children - Meck Windmills Club Mix Matt Darey Feat. Marcella Woods Beautiful Acappella\n   4. Leftfield Feat. John Lydon Open Up - Chicane Salt Water\n   5. DT8 Project Feat. Andrea Britton Winter Instrumental - Carrington Feat. Lisa McQuillan Tonite (Let's All Make Love In London) Acappella\n   6. Adam White &amp; Andy Moor Present Whiteroom The White Room - SASH! Feat. STUNT Raindrops (Encore Une Fois) Acappella\n   7. Hurley &amp; Todd Crazy World - Shannon Let The Music Play Acappella Francesca Naked In The Rain Acappella\n   8. Mike Koglin The Silence - BeatFreakz Somebody's Watching Me Acappella\n   9. SASH! Encore Une Fois Original 12&quot; Vocal Mix - September Cry For You Acappella\n  10. Soul Seekerz Fillix - Basement Jaxx Jus 1 Kiss Acappella\n  11. Lexos The Key - Picco Yeke Yeke \n\n[IMG]http://i78.photobucket.com/albums/j81/wrcfoucs/watching3vemq8.gif[/IMG]\n\n[IMG]http://i78.photobucket.com/albums/j81/wrcfoucs/dontseed.gif[/IMG]\n\n[img]http://i121.photobucket.com/albums/o219/uuffoo/vghlr7.png[/img]\n\n[img]http://i447.photobucket.com/albums/qq195/mariokazg/20qdrhe.gif[/img]","torrent":{"xt":"urn:btih:6393e51a74ecd9b2e669d2d87da48032fbedc545","amp;dn":"Euphoria+-+Mash+Up+-+Various%28SPLIT+TRACKS+%2B+COVERS%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6393e51a74ecd9b2e669d2d87da48032fbedc545","infoHashBuffer":{"type":"Buffer","data":[99,147,229,26,116,236,217,178,230,105,210,216,125,164,128,50,251,237,197,69]},"announce":[],"urlList":[]}}