{"title":"Nanotechnology and Nanoelectronics - Materials, Devices, Measure","uid":15540022,"size":6899544,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:63cdc358caea6712663d82182a50fcfa26db284c&amp;dn=Nanotechnology+and+Nanoelectronics+-+Materials%2C+Devices%2C+Measure&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"clouderone","files":1,"time":1470914732,"description":"Nanotechnology and Nanoelectronics - Materials, Devices, Measurement Techniques - W. R. Fahrner (Springer, 2005).pdf\r\n\r\nSplit a human hair thirty thousand times, and you have the equivalent of a nanometer. The aim of this work is to provide an introduction into nanotechnology for the s- entifically interested. However, such an enterprise requires a balance between comprehensibility and scientific accuracy. In case of doubt, preference is given to the latter. Much more than in microtechnology – whose fundamentals we assume to be known – a certain range of engineering and natural sciences are interwoven in nanotechnology. For instance, newly developed tools from mechanical engine- ing are essential in the production of nanoelectronic structures. Vice versa, - chanical shifts in the nanometer range demand piezoelectric-operated actuators. Therefore, special attention is given to a comprehensive presentation of the matter. In our time, it is no longer sufficient to simply explain how an electronic device operates; the materials and procedures used for its production and the measuring instruments used for its characterization are equally important. The main chapters as well as several important sections in this book end in an evaluation of future prospects. Unfortunately, this way of separating coherent - scription from reflection and speculation could not be strictly maintained. So- times, the complete description of a device calls for discussion of its inherent - tential; the hasty reader in search of the general perspective is therefore advised to study this work’s technical chapters as well","torrent":{"xt":"urn:btih:63cdc358caea6712663d82182a50fcfa26db284c","amp;dn":"Nanotechnology+and+Nanoelectronics+-+Materials%2C+Devices%2C+Measure","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63cdc358caea6712663d82182a50fcfa26db284c","infoHashBuffer":{"type":"Buffer","data":[99,205,195,88,202,234,103,18,102,61,130,24,42,80,252,250,38,219,40,76]},"announce":[],"urlList":[]}}