{"title":"Railworks TS2016 DTG North Somerset Railway Route Add-On","uid":14288678,"size":508561791,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:63d1ec5f436bc97ed68b0ad348626b28f6b7381b&amp;dn=Railworks+TS2016+DTG+North+Somerset+Railway+Route+Add-On&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TS2015","files":1,"time":1460417675,"description":"The stunning and picturesque landscapes of the Somerset hills come to life in this unique route for Train Simulator, representing the proposed reopened heritage line from Frome to Radstock. \r\n\r\nA railway line in the North of Somerset is nothing new, with the Bristol and North Somerset Railway opening in 1873. This important line connected Bristol with Radstock, joining an existing branch from Frome to Radstock to serve collieries and the communities that brought workers to the coal industry. \r\n\r\nHowever, since 1973 this part of Somerset has been without a rail line, until now - the North Somerset Railway's plan to reintroduce a heritage railway operation between Radstock and Frome will bring new access to an area of natural beauty and serve a growing housing population in the area. \r\n\r\nThe route for Train Simulator demonstrates what the new railway will look like, running from Frome, with important connections to the mainline, through Mells and Kilmersdon, to Radstock. The first phase of the line, from Mells Road to Mells, is planned to open in 2018, with the full line from Radstock to Frome scheduled for opening in 2025. \r\n\r\nIncluded with the North Somerset Railway route for Train Simulator is the Class 117, a diesel multiple unit synonymous with branch lines and suburban services. Built from 1959 until 1961, many of the units still run today on preserved railways, despite being withdrawn from mainline service in the mid 1990s.\r\n\r\n\r\n\r\nTHIS ADDON WILL NOT WORK ON LEGIT TRAIN SIMUALTOR 2016!!!","torrent":{"xt":"urn:btih:63d1ec5f436bc97ed68b0ad348626b28f6b7381b","amp;dn":"Railworks+TS2016+DTG+North+Somerset+Railway+Route+Add-On","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63d1ec5f436bc97ed68b0ad348626b28f6b7381b","infoHashBuffer":{"type":"Buffer","data":[99,209,236,95,67,107,201,126,214,139,10,211,72,98,107,40,246,183,56,27]},"announce":[],"urlList":[]}}