{"title":"Brad Paisley - When I Get Where I'm Going","uid":4831787,"size":127967236,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:64b6d0f92af4f6be259c92cd7b64d13c20ebea9b&amp;dn=Brad+Paisley+-+When+I+Get+Where+I%5C%27m+Going&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1239160946,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;When I Get Where I'm Going&quot; is Brad Paisley's second single from his album Time Well Wasted and is his fourteenth career single (not counting album cuts). Written by George Teren and Rivers Rutherford, the song features harmony vocals from Dolly Parton. The song was Parton's twenty-fifth Billboard Number One, and Paisley's fifth.\n\nThe song reached #1 on March 4, 2006, giving Brad Paisley the fifth #1 of his career. It also gave Parton her first foray into the top of the country chart since 1991's &quot;Rockin' Years&quot;, a duet with Ricky Van Shelton. At age 60 years, one month and 14 days, Parton became the oldest woman to have a No. 1 song on the Billboard Hot Country Songs chart, and the third-oldest overall (behind Willie Nelson and Kenny Rogers, who were 70 and 61, respectively). It also restored Parton's status as the female performer with the most number-one country singles (25) over the course of her career, a position she had held for several years, before being tied by Reba McEntire in 2004.\n\nThe video of this song features footage of Paisley singing in a forest, as well as home movies of himself with his grandfather, Warren L. Jarvis. He also holds up photos of himself with Jarvis and his aunt Rita Takach. The extended version of the video ends with Jarvis in a home movie saying &quot;Come on in and rock a while!&quot; and Paisley smiling when he looks up from his guitar playing and sees this. It also features many different people holding photographs of loved ones who have presumably died. Two notable people featured in this video are Michael Reagan, who is shown holding a photograph of his father Ronald Reagan, and Teresa Earnhardt, who is shown sitting in front of a painted portrait of her husband, NASCAR driver Dale Earnhardt. Although she does vocals on the song, Dolly Parton is not shown singing in the video. However, she is shown holding a picture of a her grandfather, Rev. Jake Owens, who'd died a few years earlier. She kisses her hand then touches the photograph in this scene. John Carter Cash is featured holding a photo of his parents, Johnny Cash and June Carter Cash. Also in the video is Pixar director John Lasseter holding up a picture of co-director and fellow CalArts alumnus Joe Ranft who suddenly died in 2005 in a car accident. Various unknown people hold up photos of relatives who have passed on throughout as well. In 2007, after the Virginia Tech massacre, the last slide was dedicated to those lost with the VT emblem shining brightly. On tour in 2008, Paisley also added a picture of late actor Heath Ledger.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:64b6d0f92af4f6be259c92cd7b64d13c20ebea9b","amp;dn":"Brad+Paisley+-+When+I+Get+Where+I%5C%27m+Going","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64b6d0f92af4f6be259c92cd7b64d13c20ebea9b","infoHashBuffer":{"type":"Buffer","data":[100,182,208,249,42,244,246,190,37,156,146,205,123,100,209,60,32,235,234,155]},"announce":[],"urlList":[]}}