{"title":"A Nice Little Place on the North Side - George Will - Audiobook","uid":10326838,"size":148868861,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:654140b84c6207eba4e2e121997b83d3e353b3f9&amp;dn=A+Nice+Little+Place+on+the+North+Side+-+George+Will+-+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1402366906,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Smart AudioBook Player or Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nA Nice Little Place on the North Side: Wrigley Field at One Hundred\n\nWritten by: George Will\nNarrated by: Mark Deakins\nLength: 5 hrs and 9 mins\nFormat: Unabridged\nRelease Date:03-25-14\nProgram Type: Audiobook\n\nIn A Nice Little Place on the North Side, leading columnist George Will returns to baseball with a deeply personal look at his hapless Chicago Cubs and their often beatified home, Wrigley Field, as it turns one hundred years old. Baseball, Will argues, is full of metaphors for life, religion, and happiness, and Wrigley is considered one of its sacred spaces. But what is its true, hyperbole-free history?\n\nWinding beautifully like Wrigley's iconic ivy, Will's meditation on &quot;The Friendly Confines&quot; examines both the unforgettable stories that forged the field's legend and the larger-than-life characters - from Wrigley and Ruth to Veeck, Durocher, and Banks - who brought it glory, heartbreak, and scandal. Drawing upon his trademark knowledge and inimitable sense of humor, Will also explores his childhood connections to the team, the Cubs' future, and what keeps long-suffering fans rooting for the home team after so many years of futility.\n\nIn the end, A Nice Little Place on the North Side is more than just the history of a ballpark. It is the story of Chicago, of baseball, and of America itself.","torrent":{"xt":"urn:btih:654140b84c6207eba4e2e121997b83d3e353b3f9","amp;dn":"A+Nice+Little+Place+on+the+North+Side+-+George+Will+-+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"654140b84c6207eba4e2e121997b83d3e353b3f9","infoHashBuffer":{"type":"Buffer","data":[101,65,64,184,76,98,7,235,164,226,225,33,153,123,131,211,227,83,179,249]},"announce":[],"urlList":[]}}