{"title":"Sexually Broken--Amazing double cat 5 suspension Cherry Torn  Ma","uid":8651565,"size":1024306238,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:65621eb52673b8cb9514b96e509c8d75699eccb5&amp;dn=Sexually+Broken--Amazing+double+cat+5+suspension+Cherry+Torn++Ma&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"merzedes","files":-1,"time":1373121109,"description":"Amazing double category 5 back breaking suspension, double deep face fucking, extreme orgasms | Cherry Torn | Matt Williams\n\nJuly 5, 2013 \n \n\nMP4 only\n \n \nToday we bring you two bondage legends. Both are flexible, both can deep throat a cock with award winning skill, and both can withstand Category 5 bondage. Rare to find in one person, today we have two in the studio! We are proud to present Cherry Torn and Darling together for the first time in one shoot.\n\nThis will no doubt be the first time you have ever seen a double suspension like this in your life. Both girls from the same tie point in a category 5 back arching suspension from hell. The really impressive part is that we did the suspension on camera for you to see. Any other bondage company would just tie the whole thing off camera, but we aren't most bondage companies, we are the source, where all other come to learn and copy.\n\nWe start with Cherry on the table, with her head hanging off the back edge completely helpless. Darling is bound spread underneath with her face directly under Cherry's and a vibrator locked in place on her pussy. Both girls have their massive boobs severely bound and wrapped with custom leather cord.\n\nWe start by flipping the vibrator on and sending Darling into a massive orgasms trip. She is cursed (or Blessed) with the ability to cum over and over and over, she can't stop it, she can only hang on as her body just keeps cumming. We move around and start plowing Cherry's face hole, all the spit dripping down on poor Darling. We destroy Cherry's throat, and control her air intake. It is not long before she is in subspace just from the skull fucking.\n\nWith Darling continuing to cum over and over, we move around and fuck Cherry's wet, tight shaved pussy. We fuck her hard and deep causing her to cum and cum hard. We then move back and forth deeply fucking her throat and her pussy. Cherry is wrecked from cock, so Darling gets her throat fucked while cumming her brains out too.\n\nNext we remove the table and hoist both girls up into a category 5 back arching suspension that any fine art book would love to print. This is where art meets porn and both girls look beautiful in their suffering. We place a vibrator on both girl's pussy and they cum and cum hard while floating upside down completely helpless. We let both girls ride out the wave of endorphins as they float in the bondage tie of the year.\n\nJoin Sexually Broken today, and see the cutting edge of bondage. All others look to us for inspiration. Cut out the clones and copies and get the best bondage and rough sex from the SOURCE, Sexually Broken!  \n \nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/07_05ctorn7/SexuallyBroken-Cherry-Torn-Darling-Matt-Williams-Amazing-double-category-5-back-breaking-suspension-double-deep-face-fucking-extreme-orgasms.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/07_05ctorn7/SexuallyBroken-Cherry-Torn-Darling-Matt-Williams-Amazing-double-category-5-back-breaking-suspension-double-deep-face-fucking-extreme-orgasms.php&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:65621eb52673b8cb9514b96e509c8d75699eccb5","amp;dn":"Sexually+Broken--Amazing+double+cat+5+suspension+Cherry+Torn++Ma","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65621eb52673b8cb9514b96e509c8d75699eccb5","infoHashBuffer":{"type":"Buffer","data":[101,98,30,181,38,115,184,203,149,20,185,110,80,156,141,117,105,158,204,181]},"announce":[],"urlList":[]}}