{"title":"Mer Eller Mindre Mann aka The Almost Man 2012 DVDRip Sonata Prem","uid":9154101,"size":633274861,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:656add01348e477aff4e4c1232d8871d3613be80&amp;dn=Mer+Eller+Mindre+Mann+aka+The+Almost+Man+2012+DVDRip+Sonata+Prem&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"klinho","files":3,"time":1383744925,"description":"In this frequently hilarious, engaging, and brutally honest portrait of a 35-year-old man with a definite case of arrested development, Henryk has a new apartment, a challenging job, and a beautiful pregnant wife, which is where the trouble starts. Winner, Best Film, Karlovy Vary Film Festival. Growing up can be one of the hardest decisions we ever have to make. 35-year-old Henrik (Henrik Rafaelson) has always had a playful relationship with his girlfriend Tone (Janne Heltberg Haarseth), but his life has suddenly gotten a lot more complex. He has a new job with co-workers who aren't very welcoming, an apartment with a hefty price tag, and Tone is pregnant. Rafaelson's restrained portrayal details Henrik's powerful internal struggle as he clings to his immature friends while reaching out for a future with the woman he loves, knowing he can't have both. As Henrik's distress grows, his relationship with Tone becomes more strained, until he finally reaches an epiphany based on a pair of bedroom slippers. The Almost Man is a gentle and funny tour through the awkward adolescent stage than can last long into adulthood. Director Martin Lund contrasts scenes of deep tenderness with bawdy roughhousing full of full-frontal male nudity, bringing us along with all of the movie's passion and pathos.\n\n\nSubs srt: Portuguese / English","torrent":{"xt":"urn:btih:656add01348e477aff4e4c1232d8871d3613be80","amp;dn":"Mer+Eller+Mindre+Mann+aka+The+Almost+Man+2012+DVDRip+Sonata+Prem","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"656add01348e477aff4e4c1232d8871d3613be80","infoHashBuffer":{"type":"Buffer","data":[101,106,221,1,52,142,71,122,255,78,76,18,50,216,135,29,54,19,190,128]},"announce":[],"urlList":[]}}