{"title":"Mario and Sonic at the Olympic Games: London 2012 (2011) PAL","uid":6894394,"size":4702319255,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:6643e4e6597dcd7e65cd2770aa93d060a3348510&amp;dn=Mario+and+Sonic+at+the+Olympic+Games%3A+London+2012+%282011%29+PAL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"NLUPPER002","files":-1,"time":1324140257,"description":"Mario and Sonic at the Olympic Games: London 2012 (2011) PAL\n.\n[IMG]http://img33.imageshack.us/img33/8721/mariosonicopdeolympische.jpg[/IMG]\n.\nHet is niet de eerste keer dat Mario &amp; Sonic met elkaar en anderen de strijd aangaan op sportief gebied. Bij alle Olympische spelen komt er een spel uit met alle helden uit de wereld van Mario en uit die van Sonic. Bij dit spel kan er in twaalf sporten om de medailles worden gestreden: atletiek, turnen, watersport, kanovaren, ruitersport, badminton, strandvolleybal, tafeltennis, voetbal, schietsport, schermen en wielersport. Bij atletiek heb je daarna nog de keuze uit 7 verschillende onderdelen, zowel de hardloop- als de technische nummers. Ook bij turnen en watersport zijn meer opties. Naast deze sporten kun je ook nog deelnemen aan de zogenaamde droomevenementen, waarbij 10 sporten op een totaal onrealistische manier gespeeld kunnen worden. En speciaal voor de stad Londen is er nog een Londen Party, waarbij je het tegen elkaar kunt opnemen in een strijd om je stickervel als eerste vol te hebben. Daarvoor moet je lopen door de straten van Londen en zoveel mogelijk opdrachten moet uitvoeren.\n.\nIt is not the first time that Mario &amp; Sonic with each other and compete in sports. In all Olympic Games is a game with all the heroes from the world of Mario and Sonic that. This game can be in twelve sports medals to be fought: athletics, gymnastics, water sports, canoeing, equestrian, badminton, beach volleyball, table tennis, football, shooting, fencing and cycling. In athletics, you then have a choice of 7 different parts, both running, and technical tracks. Also in gymnastics and sports are other options. In addition to these sports, you can also participate in the so-called dream events, 10 sports played in a totally unrealistic way to be. And especially for the city of London there is a London party, where you can record against each other in a battle for your first full sticker to have. For that you walk through the streets of London and as many tasks to perform.\n.\nINFO\n.\n*** Wiu1.1 zit erbij als je de update eruit wilt halen ***\n\nRegio PAL\nTaal Nederlands\niso origineel onbewerkt\nReleasedatum: 18 november 2011\nOntwikkeld door: SEGA\nUitgegeven door: SEGA\nIn Nederland vertegenwoordigd door: SEGA Benelux\nGenres: Sport, Voetbal en Atletiek\nBevat: Multiplayer (4 spelers) en Online)\n.\n*** Wiu1.1 sit there if you want to get the update out ***\n\nregion PAL\nDutch language\niso original raw\nRelease Date: November 18, 2011\nDeveloped by: SEGA\nPublished by: SEGA\nIn the Netherlands, represented by: SEGA Benelux\nGenres: Sports, Football and Athletics\nIncludes: Multiplayer (4 players) and Online)\n.\nEnjoy\n","torrent":{"xt":"urn:btih:6643e4e6597dcd7e65cd2770aa93d060a3348510","amp;dn":"Mario+and+Sonic+at+the+Olympic+Games%3A+London+2012+%282011%29+PAL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6643e4e6597dcd7e65cd2770aa93d060a3348510","infoHashBuffer":{"type":"Buffer","data":[102,67,228,230,89,125,205,126,101,205,39,112,170,147,208,96,163,52,133,16]},"announce":[],"urlList":[]}}