{"title":"Jean Michel Basquiat : The Radiant Child [EN]","uid":6186268,"size":732700967,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:665c765d16280bac7e4ab4dc1c23f98a171a38fd&amp;dn=Jean+Michel+Basquiat+%3A+The+Radiant+Child+%5BEN%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Montmartre","files":3,"time":1298075526,"description":"In his short career, Jean-Michel Basquiat was a phenomenon. He became notorious for his graffiti art under the moniker Samo in the late 1970s on the Lower East Side scene, sold his first painting to Deborah Harry for $200 and became best friends with Andy Warhol. Appreciated by both the art cognoscenti and the public, Basquiat was launched into international stardom. However, soon his cult status began to override the art that had made him famous in the first place.\n\nDirector Tamra Davis pays homage to her friend in this definitive documentary, but also delves into Basquiat as an iconoclast. His dense, bebop-influenced neoexpressionist work emerged while minimalist, conceptual art was the fad; as a successful black artist, he was constantly confronted by racism and misconceptions. Much can be gleaned from insider interviews and archival footage, but it is Basquiat's own words and work that powerfully convey the mystique and allure of both the artist and the man.\n\nFeaturing interviews with Julian Schnabel, Larry Gagosian, Bruno Bischofberger, Tony Shafrazi, Fab 5 Freddy, Jeffrey Deitch, Glenn O'Brien, Maripol, Kai Eric, Nicholas Taylor, Fred Hoffmann, Michael Holman, Diego Cortez, Annina Nosei, Suzanne Mallouk, and Rene Ricard, among many others.","torrent":{"xt":"urn:btih:665c765d16280bac7e4ab4dc1c23f98a171a38fd","amp;dn":"Jean+Michel+Basquiat+%3A+The+Radiant+Child+%5BEN%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"665c765d16280bac7e4ab4dc1c23f98a171a38fd","infoHashBuffer":{"type":"Buffer","data":[102,92,118,93,22,40,11,172,126,74,180,220,28,35,249,138,23,26,56,253]},"announce":[],"urlList":[]}}