{"title":"Axis.Of.Evil.Comedy.Tour[ENG]DvDrip - zeroXTC","uid":4489519,"size":639047888,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:679d97dc705752a7811bccf3d8dad14e9e9f8c41&amp;dn=Axis.Of.Evil.Comedy.Tour%5BENG%5DDvDrip+-+zeroXTC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zeroXTC","files":2,"time":1225915718,"description":"Only strange days such as these could have made possible The Axis of Evil Comedy Tour, a showcase for four Arab-American comedians telling jokes about life for people of Middle Eastern descent in the United States in the aftermath of 9/11. A mostly Arab-American audience thoroughly enjoys Dean Obeidallah&amp;#039;s monologue, in which he describes his homeland as Eastern Palestine, i.e., New Jersey. He also says &quot;Obeidallah&quot; translates as &quot;Servant of Allah,&quot; which does not sit well with airport security. In general, he has a few choice things to say about such extreme safety measures as the Patriot Act: &quot;Are the guys in Al Qaeda really going to libraries and reading books? Maybe Chicken Soup for the Terrorist Soul?&quot; Dapper comic Ahmed Ahmed talks about his own travails trying to fly with a name like his: &quot;I Googled my name and it matches a known terrorist in the Middle East. Right now I think he&amp;#039;s Googling me--&amp;#039;Hey, there&amp;#039;s an American comedian with my name.&amp;#039;&quot; Ahmed talks about the modern life of a Muslim: &quot;You know you&amp;#039;re a Muslim when you drink and have sex but don&amp;#039;t eat pork.&quot; Aron Kader has fun describing his mixed background as the son of a Palestinian dad and a Mormon mom: &quot;When I turned 19, the Mormons asked me if I wanted to go on a mission. I said, &amp;#039;Is that different from a Palestinian mission? Because you don&amp;#039;t come back from those.&amp;#039;&quot; Kader also recalls his trip to Jordan shortly after 9/11: &quot;I was driving with my cousin, who was cursing the U.S. but asking if I wanted to grab some lunch at Burger King or McDonald&amp;#039;s.&quot;","torrent":{"xt":"urn:btih:679d97dc705752a7811bccf3d8dad14e9e9f8c41","amp;dn":"Axis.Of.Evil.Comedy.Tour%5BENG%5DDvDrip+-+zeroXTC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"679d97dc705752a7811bccf3d8dad14e9e9f8c41","infoHashBuffer":{"type":"Buffer","data":[103,157,151,220,112,87,82,167,129,27,204,243,216,218,209,78,158,159,140,65]},"announce":[],"urlList":[]}}