{"title":"Bob Dylan - Hurricane (Single)1975 320ak +1","uid":13023782,"size":33879463,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:67d1c699b5665cf3f11f7d584690dd235a04d3b3&amp;dn=Bob+Dylan+-+Hurricane+%28Single%291975+320ak+%2B1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"analogkid6103","files":3,"time":1450383234,"description":"&quot;Hurricane&quot; is a protest song by Bob Dylan co-written with Jacques Levy, about the imprisonment of Rubin &quot;Hurricane&quot; Carter. It compiles alleged acts of racism and profiling against Carter, which Dylan describes as leading to a false trial and conviction.\r\nCarter and a man named John Artis had been charged with a triple murder at the Lafayette Grill in Paterson, New Jersey in 1966. The following year Carter and Artis were found guilty of the murders, which were widely reported as racially motivated. In the years that followed, a substantial amount of controversy emerged over the case, ranging from allegations of faulty evidence and questionable eyewitness testimony to an unfair trial.\r\n\r\nn 1985 Federal Judge H. Lee Sarokin of the United States District Court for the District of New Jersey, who declined to hear the song when it was offered to him by his family, ruled that Carter had not received a fair trial and set aside the conviction, resulting in Carter's release, commenting that the prosecution had been &quot;based on racism rather than reason and concealment rather than disclosure.&quot; In 1988, after the prosecution said they would not seek a third trial and filed a motion to dismiss, a Superior Court judge dropped all charges against Carter and Artis.\r\n\r\n1. &quot;Hurricane&quot;\r\n\t\r\nFormat \tSingle\r\n\r\nRecorded -July 1975 &amp; October 24, 1975 at Columbia Studios, New York\r\n\r\nGenre \tFolk rock, protest song\r\n\r\nLength \t8:33\r\n\r\n2. &quot;Tweeter And The Monkeyman&quot;\r\n\r\nThe song tells the story of two drug dealers – Tweeter and the Monkeyman – their nemesis, &quot;The Undercover Cop&quot;, and the cop's sister, Jan, a longtime love interest of the Monkeyman. Some of the lyrics imply that Tweeter may have changed from being a male to a female, for example: &quot;Tweeter was a boy scout / before she went to Vietnam...&quot;. Later in the song, Jan is quoted as saying of Tweeter, &quot;I knew him long before he ever became a Jersey girl.&quot;\r\n\r\nThroughout the ballad, the fall of Tweeter and the Monkeyman is examined.\r\n\r\nWhy this as a second track? It all happens in New Jersey. The Garden State","torrent":{"xt":"urn:btih:67d1c699b5665cf3f11f7d584690dd235a04d3b3","amp;dn":"Bob+Dylan+-+Hurricane+%28Single%291975+320ak+%2B1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67d1c699b5665cf3f11f7d584690dd235a04d3b3","infoHashBuffer":{"type":"Buffer","data":[103,209,198,153,181,102,92,243,241,31,125,88,70,144,221,35,90,4,211,179]},"announce":[],"urlList":[]}}