{"title":"Triathlon - through the eyes of the elite","uid":5102899,"size":577573208,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:682f84a4d7ab190de48f119a0bc4b7e0e45d6918&amp;dn=Triathlon+-+through+the+eyes+of+the+elite&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"FuTG","files":1,"time":1254137151,"description":"About the Triathlon-Through the Eyes of the Elite:\n\nIn 1974, two members of the San Diego Track Club conceived of an idea meant to be little more than a fun, yet challenging break from the tedium of traditional training. They called it a Triathlon. Today, Triathlon has evolved from its rudimentary beginnings in Mission Bay into an endurance event of immense international appeal. Deeply embedded in the public consciousness, Triathlon is now poised to debut as the inaugural event of the 2000 Summer Olympic games in Sydney, Australia. What is it about the sport and its competitors that intrigue so many people worldwide? Triathlon: Through the Eyes of the Elite tells the dramatic and compelling stories that revolve around the young sport of Triathlon. From an in-depth and truly unique perspective, we share both the historical documentation and evolution of the sport as well as the lifestyle, perseverance and passion of the professional triathlete. Our film is essentially a &quot;behind the scenes&quot; look at the sport of Triathlon with the Olympics serving as the dramatic backdrop. \n\n\n\n","torrent":{"xt":"urn:btih:682f84a4d7ab190de48f119a0bc4b7e0e45d6918","amp;dn":"Triathlon+-+through+the+eyes+of+the+elite","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"682f84a4d7ab190de48f119a0bc4b7e0e45d6918","infoHashBuffer":{"type":"Buffer","data":[104,47,132,164,215,171,25,13,228,143,17,154,11,196,183,224,228,93,105,24]},"announce":[],"urlList":[]}}