{"title":"Supergirl (2006-10) 00, 09-15 (digital) (OkC.O.M.P.U.T.O.-Novus)","uid":10650428,"size":275126763,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:68556d3e7cb245365f6d7233d341f9b46d2a4b8b&amp;dn=Supergirl+%282006-10%29+00%2C+09-15+%28digital%29+%28OkC.O.M.P.U.T.O.-Novus%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dadrkhomr","files":-1,"time":1406599805,"description":"\nA Novus Release\n\n\n\n\nThis torrent includes the HD versions.\n  \n \n\n\n*Note: You can download all or only choose which version you'd prefer by deselecting the one you don't want when you add the torrent to your client software. If you're adding the torrent via magnet link, you can deselect any undesired file in the list of files once the torrent has begun downloading.\n\n========================================================\n\n\n\n\n\n\n\n#00  Now that Kara Zor-El has accepted her role as Supergirl, what will she do with it? And just how powerful is she? How will her life impact Batman and Superman? This issue is the starting point of an incredible journey that leads into SUPERGIRL #1! \n\n#09  When Kara returned from space after INFINITE CRISIS, she found Paradise Island gone, Superboy dead and Superman powerless. Feeling very much alone, she found romance with someone that no hero will condone. Who is Supergirl's boyfriend?\n\n#10  Supergirl takes on a secret identity and heads to high school! After battling monsters and aliens, can she handle the brutality of teenagers? Kara befriends a popular girl but quickly learns the popularity comes with a price.\n\n#11  Supergirl joins the Outsiders on a high seas adventure! Supergirl and Grace Choi stage a robbery to gain entrance to a gang of pirates, but these swashbucklers hold a secret that could spell doom for the Maiden of Might!\n\n#12  The first appearance of the new Terra! The Girl of Steel is down in the dumps and shirking her superhero duties for a night on the town. But the party gets crashed when a dinosaur pops up! Thankfully, the mysterious new hero Terra shows up to help!\n\n#13  Supergirl and Powerboy! The two super-powered teens head across the world on a few dates--along the way stopping natural disasters and ruthless assassins. Of course, Captain Boomerang might not find Kara's new playmate so great...\n\n#14  The Girl of Steel discovers the League of Assassins' involvement with the attempts on her life, which leads her to a deadly confrontation with their leader: Cassandra Cain! Supergirl versus Batgirl comes to a surprising ending even they couldn't see coming!\n\n#15  Sparks continue to fly between Supergirl and Powerboy. But after she shows concern for her injured friend Boomer, the sparks stop and the flying fists begin! The origins of Powerboy's abilities--and now obvious obsession--revealed!\n\n\n\n\n\n\nThanks goes to the OkC.O.M.P.U.T.O this release.\n","torrent":{"xt":"urn:btih:68556d3e7cb245365f6d7233d341f9b46d2a4b8b","amp;dn":"Supergirl+%282006-10%29+00%2C+09-15+%28digital%29+%28OkC.O.M.P.U.T.O.-Novus%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68556d3e7cb245365f6d7233d341f9b46d2a4b8b","infoHashBuffer":{"type":"Buffer","data":[104,85,109,62,124,178,69,54,95,109,114,51,211,65,249,180,109,42,75,139]},"announce":[],"urlList":[]}}