{"title":"True Wholesale Sources with current price lists","uid":4504634,"size":156956586,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6856e912326d26804f5243b919b5259440b49a3a&amp;dn=True+Wholesale+Sources+with+current+price+lists&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"user507","files":1,"time":1226541516,"description":"This list was made by going to http://www.asiansources.com and join up for free. Once you do that then you can inquire to hundreds of manufacturers from all over the world in one shot. You can send an inquiry to lets say just ipods, or laptops or whatever you want.\n\nMake one message that asks for their current catalog and price list, FOB Prices, Do you sell low volume? Do you drop Ship? Do you allow mixed orders? What is your minimum order quantity? and so on.\n\nYou only have to make one message. When you go to lets say the laptop category then you will click &quot;Inquire All&quot;. Now paste your message in the text box and send. It will send that one message to all the sellers and manufacturers in that category. Just repeat this process for each category by pasting the same message into the test box.\n\nWhen its night time here in the USA, it is morning time in China, so if you send messages or inquiries to hundreds of manufacturers, you will start to receive responces back at night.\n\nGo through the hundreds of emails you will get and save the wholesale lists of your favorite manufacturers. The prices you will get will amaze you because those are REAL WHOLESALE PRICES!\n\nMany of these manufacturers will sell you samples for about 3-10 dollars more over the bulk pricing. It is still cheap.\n\n","torrent":{"xt":"urn:btih:6856e912326d26804f5243b919b5259440b49a3a","amp;dn":"True+Wholesale+Sources+with+current+price+lists","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6856e912326d26804f5243b919b5259440b49a3a","infoHashBuffer":{"type":"Buffer","data":[104,86,233,18,50,109,38,128,79,82,67,185,25,181,37,148,64,180,154,58]},"announce":[],"urlList":[]}}