{"title":"The Truth: An Uncomfortable Book About Relationships","uid":12993562,"size":5266735,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:68bbee04f52736daece99e9e1fc2a35162ae0ea4&amp;dn=The+Truth%3A+An+Uncomfortable+Book+About+Relationships&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TopShelfBook","files":2,"time":1450142703,"description":"The Truth: An Uncomfortable Book About Relationships\r\n\r\n\r\nThis is not a journey that was undertaken for journalistic purposes. It is a painfully honest account of a life crisis that was forced on me by my own behavior and its consequences.\r\n\r\n&quot;As such, it requires sharing a lot of things I'm not proud of—and a few things I feel like I should regret a whole lot more than I actually do. Because, unfortunately, I am not the hero in this tale. I am the villain.&quot;\r\n\r\nSo begins Neil Strauss's long-awaited follow-up to The Game, the funny and slyly instructive work of immersive journalism that jump-started the international &quot;seduction community&quot; and made Strauss a household name—revered or notorious—among single men and women alike.\r\n\r\nIn The Truth, Strauss takes on his greatest challenge yet: Relationships. And in this wild and highly entertaining ride, he explores the questions that men and women are asking themselves every day:\r\n\r\nIs it natural to be faithful to one person for life?\r\nDo alternatives to monogamy lead to better relationships and greater happiness?\r\nWhat draws us to the partners we choose?\r\nCan we keep passion and romance from fading over time?\r\nHis quest for answers takes him from Viagra-laden free-love orgies to sex addiction clinics, from cutting-edge science labs to modern-day harems, and, most terrifying of all, to his own mother.\r\n\r\nWhat he discovered changed everything he knew about love, sex, relationships, and, ultimately, himself.\r\n\r\nSearingly honest and compulsively readable, The Truth just may have the same effect on you.\r\n\r\nIf The Game taught you how to meet members of the opposite sex, The Truth will teach you how to keep them.\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:68bbee04f52736daece99e9e1fc2a35162ae0ea4","amp;dn":"The+Truth%3A+An+Uncomfortable+Book+About+Relationships","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68bbee04f52736daece99e9e1fc2a35162ae0ea4","infoHashBuffer":{"type":"Buffer","data":[104,187,238,4,245,39,54,218,236,233,158,158,31,194,163,81,98,174,14,164]},"announce":[],"urlList":[]}}