{"title":"Ferdinand Porsche [DivX Ita] [Tntvillage]","uid":5001786,"size":346879048,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:69b0aff20dde508dc912e68a2f7060f882bad14d&amp;dn=Ferdinand+Porsche+%5BDivX+Ita%5D+%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"darayava","files":1,"time":1247561814,"description":"Visit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=La%20storia%20siamo%20noi%20-%20Ferdinand%20Porsche&amp;sb=1&amp;sd=0&amp;cat=0\n\nVisit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=serman&amp;sb=1&amp;sd=0&amp;cat=0\n\n\nVisit this info link: http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=111976 http://img518.Imageshack.us/img518/2470/giornatamemoria288x150nx2.png\nVisit this info link: http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=11466  Visit this link: http://img367.Imageshack.us/img367/5986/secondaguerra288x150jj4.png\n \n\n\n Posted by serman\n\n Visit this link: http://img292.Imageshack.us/img292/4232/lastoriasiamonoiur5.jpg\n\nFERDINAND PORSCHE\nI manager di Hitler [3/5] \nLa storia siamo noi \n\n\n Visit this link: http://img139.Imageshack.us/img139/9441/ferdinandporschefy5.jpg\n\n\n \n - Scheda tecnica del filmato - \n\n\n\nTitolo: Ferdinand Porche \nSerie: La storia siamo noi \nEmittente: Rai3 \nGenere: documentario \nA cura di: Giovanni Minoli\nAudio: Italiano \nSottotitoli: n.d. \n\n\n\n - Trama - \n\nIl geniale progettista e designer Ferdinand Porsche nacque in Boemia il 3 settembre 1875 nel villaggio di Maffersdorf, poi denominato Leberec quando venne nuovamente ceduto alla Cecoslovacchia. Figlio di un umile stagnaio sviluppÃƒÂ² subito un forte interesse verso le scienze ed in particolare verso lo studio dell'elettricitÃƒÂ . In casa sua Fedinand cominciÃƒÂ² infatti a condurre rudimentali esperimenti con acidi e batterie di ogni tipo. Il suo acume arrivÃƒÂ² perfino a fargli costruire un marchingegno in grado di produrre elettricitÃƒÂ , tanto che la sua famiglia divenne una delle prime a poter utilizzare questa fonte di energia in quello sperduto paese. Inoltre, giÃƒÂ  da bambino era un entusiasta, oltre che di tutti i ritrovati tecnici in generale, in particolare delle automobili, di cui alcuni esemplari cominciavano all'epoca a circolare per le strade.\n\nLa sua inclinazione verso le materie di tipo scientifico lo portÃƒÂ² a Vienna dove, nel 1898, dopo aver conseguito studi adeguati, riuscÃƒÂ¬ ad entrare nella fabbrica di automobili elettriche di Jakob Lohner. Questa fu la prima tappa di una lunga e del tutto unica carriera nel settore automobilistico. Basti dire che alla fine della sua attivitÃƒÂ  Porsche aveva all'attivo piÃƒÂ¹ di trecentottanta progetti industriali.\n\nAttorno al 1902 fu chiamato a svolgere il servizio militare nelle Riserve imperiali, prestando servizio come autista per i piÃƒÂ¹ alti ufficiali dell'esercito austro-ungarico. E' stato persino l'autista di Francesco Ferdinando il cui successivo assassinio scatenÃƒÂ² la prima guerra mondiale. In seguito, si sposÃƒÂ² con Louise, che gli diede due figli. Uno di essi, Ferdinand jr. (molto importante, come si vedrÃƒÂ  , per il futuro dei Porsche), venne soprannominato &quot;Ferry&quot;. Come pioniere del design automobilistico, comunque, Porsche guadagnÃƒÂ² in fretta una buona somma di denaro. Con i soldi, comprÃƒÂ² una casa estiva sulle montagne Austriache (chiamata, in onore della moglie, &quot;Louisenhuette&quot;), dove Porsche potÃƒÂ¨ guidare e sperimentare le macchine che costruiva. Allo stesso modo, patito com'era di tutto quanto avesse un motore, era uso sfrecciare sulla calme acque dei laghi montani con barche costruite sempre da lui. Qui poi, in seguito il suo figlio prediletto, &quot;Ferry&quot;, all'etÃƒÂ  di soli dieci anni guidava piccole macchine costruite dal padre.\n\nFinita la prima guerra mondiale, con il paese in ginocchio e con il giogo economico derivato dallo sforzo della ricostruzione, solo pochi facoltosi potevano permettersi un'automobile. A partire da questa constatazione prese il via uno dei progetti piÃƒÂ¹ ambiziosi di Porsche: costruire una macchina economica che tutti potevano permettersi, un'utilitaria con basso prezzo d'acquisto e ridotti costi di gestione che, stando alle sue intenzioni, avrebbe motorizzato la Germania. Porsche si era giÃƒÂ  creato un'ottima reputazione, avendo lavorato come direttore tecnico all'Austro-Daimler, alla Daimler tedesca (che piÃƒÂ¹ tardi sarebbe diventata la Mercedes), disegnando le Mercedes SS e SSK nonchÃƒÂ© macchine da corsa, per poi passare all'austriaca Steyr. Il continuo girovagare tra fabbriche diverse, che una volta lasciate portavano comunque a termine i progetti di cui lui aveva creato i presupposti, non poteva perÃƒÂ² soddisfare il suo mai sopito desiderio di autonomia.\n\nPropose comunque, nel 1929, la sua idea al suo capo Daimler che, timoroso di avventurarsi in un'impresa del genere, rifiutÃƒÂ². CosÃƒÂ¬ Porsche decise di fondare uno Studio privato di progettazione che portasse il suo nome. Questo gli permise di stipulare contratti con le case costruttrici e di mantenere allo stesso tempo una certa indipendenza. Nel 1931, si mise a collaborare con ZÃƒÂ¼ndapp che era un produttore di motociclette. Insieme costruirono tre prototipi, che perÃƒÂ² presentarono subito gravi problemi apparentemente irrisolvibili (dopo dieci minuti di funzionamento i motori puntualmente fondevano). ZÃƒÂ¼ndapp, a questo punto, sfiduciato, si ritirÃƒÂ². L'inarrendevole Porsche, invece, andÃƒÂ² in cerca di un altro partner, che trovÃƒÂ² nella NSU, un'altra ditta costruttrice di motociclette. E' il 1932. Coniugati gli sforzi, insieme migliorano il motore e lo rendono molto piÃƒÂ¹ affidabile, anche se questo, dal punto di vista della riuscita sul mercato, non basta. Incombono ancora, infatti, pesanti problemi finanziari. Anche la NSU dunque abbandona, lasciando nuovamente l'intraprendente progettista da solo e alla ricerca di un nuovo partner che potesse finanziare la realizzazione del suo sogno.\n\nIntanto perÃƒÂ² qualcun altro inseguiva lo stesso progetto di Porsche. Qualcuno di molto piÃƒÂ¹ grande, di piÃƒÂ¹ solido e con maggiori risorse economiche: si trattava delle neonata &quot;Wolks Vagen&quot;, nome che letteralmente significa &quot;Macchina del popolo&quot;. Risale a quel tempo l'invenzione da parte di questa casa automobilistica, del mitico &quot;Maggiolino&quot;, seppur nella sua forma rudimentale. Questa vettura, poi, ebbe una sorte curiosa, che coincise con il percorso di Porsche. Infatti, mentre Porsche si arrabattava con i suoi progetti, si scatenÃƒÂ² la Seconda guerra mondiale. In quell'epoca, quella che doveva essere &quot;la macchina del popolo&quot;, il Maggiolino, si trasformÃƒÂ² anch'essa in una vettura da combattimento. E proprio Ferdinand Porsche venne chiamato a modificare per i nuovi scopi il progetto. In breve vennero approntate nuove versioni del Maggiolino, adatte per i piÃƒÂ¹ disparati impegni sui campi di battaglia. In seguito, Porsche disegnÃƒÂ² anche carri armati alimentati dall'energia elettrica. Quando Stuttgart fu pesantemente bombardata nel 1944 dagli aeroplani degli Alleati, Porsche e la sua famiglia erano comunque giÃƒÂ  tornati alla loro casa estiva in Austria. Alla fine della guerra fu perÃƒÂ² messo agli arresti domiciliari, anche se le autoritÃƒÂ  militari francesi in seguito invitarono l'anziano e distinto progettista a tornare in Germania per discutere la possibilitÃƒÂ  di costruire una macchina &quot;Wolksvagen&quot; per la Francia.\n\nÃƒË† il momento perÃƒÂ² in cui entra in campo invece il giovane Porsche, dal talento non inferiore a quello del padre. Liberato il padre dalla prigionia francese, Ferry Porsche, che era nato nel 1909 e da sempre aveva collaborato nei progetti paterni, riunÃƒÂ¬ nel paese austriaco di GmÃƒÂ¼nd i collaboratori piÃƒÂ¹ validi dello Studio Porsche per realizzare un coupÃƒÂ¨ sportivo che portasse il suo nome. Nacque cosÃƒÂ¬ il progetto 356, una piccola vettura sportiva basata sulla meccanica del Maggiolino che traeva spunto dalla Typ 60K10. Furono di questi anni i successi sportivi con le celeberrime auto da corsa a 16 cilindri, con motore centrale e barre di torsione che lo Studio progettÃƒÂ² per il gruppo Auto Union. Porsche aveva sempre dato importanza alle competizioni sportive, lui stesso aveva vinto nel 1909 la coppa &quot;Prinz Heinrich&quot; a bordo di un'Austro-Daimler, ed aveva capito che le gare oltre a valido test per materiali e soluzioni rappresentavano un ottimo mezzo pubblicitario.\n\nFerry Porsche prese in mano le redini del destino del nome paterno dopo aver lanciato, nel 1948, diverse fabbriche con l'aiuto appunto del padre, ormai settantacinquenne e che morirÃƒÂ  qualche anno dopo (precisamente nel 1951). Da quel momento in poi, il marchio Porsche ÃƒÂ¨ diventato distintivo di macchine sportive altamente raffinate e dalla linea unica, di cui la punta di diamante ÃƒÂ¨ rappresentata dalla mitiche e forse inarrivabili 911 e Boxster. In seguito, Ferry progetta nel 1963 la Carrera 904 e qualche anno dopo la fortunatissima 911.\n\nLasciata la Porsche AG nel 1972, fonda la Porsche Design, dove, con un limitato numero di collaboratori si dedica alla progettazione di veicoli sperimentali e di vari oggetti, caratterizzati da un look aggressivo e high-tech sostanzialmente fedele ai criteri del funzionalismo, tutti destinati alla produzione di grande serie, di cui cura solo l'aspetto stilistico-formale senza entrare in merito all'ingegnerizzazione.\n\n\n - Scheda tecnica  del DivX -\n- dati ottenuti con GsSpot  Ver. 2.70a -\n\nDimensione: 330MB \nDurata: 00:56:03\nVideo Codec:DivX 5.X \nVideo Bitrate: 783 kb/s\nRisoluzione: 720x576 \nFPS (Frames/sec):25\nQF (Frame quality): 0,076. b/p \nAudio Codec: Mp3 \nAudio Bitrate: 32kb/s\nFreq Audio: 11.025Hz\n\n*Note: Orari di seed 19,00-6,00 e banda disponibile 150kb\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:69b0aff20dde508dc912e68a2f7060f882bad14d","amp;dn":"Ferdinand+Porsche+%5BDivX+Ita%5D+%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69b0aff20dde508dc912e68a2f7060f882bad14d","infoHashBuffer":{"type":"Buffer","data":[105,176,175,242,13,222,80,141,201,18,230,138,47,112,96,248,130,186,209,77]},"announce":[],"urlList":[]}}