{"title":"Sebadoh - Defend Yourself CD-FLAC-2013-OUTERSPACE","uid":8917533,"size":326513920,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:69fac1cf7073d044be77f7228db755f567cef032&amp;dn=Sebadoh+-+Defend+Yourself+CD-FLAC-2013-OUTERSPACE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"politux","files":-1,"time":1379178218,"description":"\n  Sebadoh - Defend Yourself CD-FLAC-2013-OUTERSPACE\n\n  Genre: Pop/Rock\n  Styles: Indie Rock, Alternative, Lo-Fi, Garage\n  Source: Scene CD\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 I Will 3:57\n  02 Love You Here 3:33\n  03 Beat 4:12\n  04 Defend Yr Self 3:12\n  05 Oxygen 3:21\n  06 Once 2:55\n  07 Inquiries 2:02\n  08 State Of Mine 3:44\n  09 Final Days 4:22\n  10 Can't Depend 4:23\n  11 Let It Out 4:29\n  12 Listen 3:37\n  13 Separate 1:59\n\n  As much a collective of musicians as a band, Sebadoh was the quintessential lo-fi band of the '90s. Formed by singer/songwriter Lou Barlow while he was the bassist for Dinosaur Jr. in the late '80s, Sebadoh's music was a virtual catalog of '80s alternative rock and '90s indie rock, featuring everything from jangle pop to noise-rock experimentalism. After being kicked out of Dinosaur in 1989, Barlow turned his attention toward Sebadoh, a home-recording project that he and drummer/songwriter Eric Gaffney began in 1987. Sebadoh soon developed into a backing band for both Barlow and Gaffney, as each submitted home-recorded tapes for release and toured behind the albums. Eventually adding drummer/songwriter Jason Loewenstein, the trio became an indie rock sensation, as well-known for the size and inconsistency of its output as the music itself. Often, Sebadoh sounded schizophrenic, flipping between Barlow's sensitive folk-rock and Gaffney's noise experiments without warning. This very diversity became the band's calling card, and by 1992 they had earned a devoted following. As the media focused on Barlow -- who also released a number of solo records under the name Sentridoh -- Gaffney grew frustrated. Gaffney left in 1994, and with new drummer Bob Fay, Sebadoh produced its most accessible albums -- Bakesale and Harmacy -- which expanded its cult somewhat. Despite the group's flirtation with (relatively) polished production and the fluke success of Barlow's side project Folk Implosion, Sebadoh remained a cult band and became one the largest touchstones of '90s indie rock.\n\n  Sebadoh began as an outlet for Lou Barlow's frustration with J Mascis, who refused to let Barlow contribute songs to any Dinosaur Jr. releases. In 1987, Barlow released Weed Forestin', a cassette of acoustic songs he had recorded at home on a four-track recorder, under the name Sentridoh. The cassette was sold at local Massachusetts record stores. Eric Gaffney contributed percussion to Weed Forestin', and when Barlow had a break from Dinosaur in 1988, the duo recorded The Freed Man, which consisted of songs by both songwriters. Also released as a homemade cassette, The Freed Man worked its way to Gerard Cosloy, the head of Homestead Records. Cosloy offered to release the cassette on his record label, and the tape was revised and expanded into a full-length album. Homestead released The Freed Man in 1989, and shortly after its appearance, Mascis kicked Barlow out of Dinosaur, and Lou turned his attentions toward Sebadoh. A revised and expanded Weed Forestin' was released in early 1990; the two records were combined on the CD The Freed Weed later that year.","torrent":{"xt":"urn:btih:69fac1cf7073d044be77f7228db755f567cef032","amp;dn":"Sebadoh+-+Defend+Yourself+CD-FLAC-2013-OUTERSPACE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69fac1cf7073d044be77f7228db755f567cef032","infoHashBuffer":{"type":"Buffer","data":[105,250,193,207,112,115,208,68,190,119,247,34,141,183,85,245,103,206,240,50]},"announce":[],"urlList":[]}}