{"title":"Cake - Comfort Eagle [Late World with Zach, 2002].VOB","uid":9282074,"size":177053696,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:69fbe4f277affef970a934559130a7e50bd0bb6c&amp;dn=Cake+-+Comfort+Eagle+%5BLate+World+with+Zach%2C+2002%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"SgtRlee","files":-1,"time":1385952525,"description":"Cake - Comfort Eagle [Late World with Zach, 2002].VOB\n\n\nHQ rare live performance on Late World with Zach that was uploaded by me to youtube. &quot;Comfort Eagle&quot; is a song from  Comfort Eagle, the fourth studio album by American alternative rock band Cake. It was released on July 24, 2001, through record label Columbia; their first with the label.\n\nIn its opening week, Comfort Eagle sold about 72,000 copies, debuting at number 13 on the Billboard 200. On February 2, 2003 the album was certified gold by the RIAA for shipments of half a million copies.\n\nComfort Eagle was generally well-received by critics, with reviewers noting the album's similarity to the band's previous albums, for better or worse.\n\nCake is an American alternative rock band from Sacramento, California. Consisting of singer John McCrea, trumpeter Vince DiFiore, guitarist Xan McCurdy, bassist Gabe Nelson and drummer Paulo Baldi, the band has been noted for McCrea's sarcastic lyrics and deadpan voice, DiFiore's trumpet parts, and their wide-ranging musical influences, including country music, Mariachi, rock, funk, Iranian folk music and hip-hop.\n\nCake was formed in 1991 by McCrea, DiFiore, Greg Brown, Frank French and Shon Meckfessel, who soon left and was replaced by Nelson. Following the self-release of its debut album, Motorcade of Generosity, the band was signed to Capricorn Records in 1995 and released its first single, &quot;Rock 'n' Roll Lifestyle&quot;, which hit number 35 on the Modern Rock Tracks music chart and was featured on MTV's 120 Minutes; French and Nelson then left the band, and were replaced by Todd Roper and Victor Damiani. Cake's second album, Fashion Nugget, was released in 1996; on the strength of the lead single, &quot;The Distance&quot;, which went platinum. Following a tour of Europe and the United States, both Brown and Damiani announced they were leaving Cake, which led to speculation about the band's future; McCrea eventually recruited Xan McCurdy to take over on guitar, and persuaded Nelson to return.\n\nAfter creating its own label, Upbeat Records, the band released Showroom of Compassion in 2011, which became its first album to debut at the top of the Billboard charts, selling 44,000 copies in the first week after release.\n\nThey will release a vinyl box set consisting of their six studio albums, their rarities album and the previously unreleased, Live at the Crystal Palace for Record Store Day 2014. A new studio album has been announced for an early 2014 release.\n(video has a white &quot;Late World with Zach&quot; logo at the bottom right)\n\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Comfort_Eagle&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Comfort_Eagle&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/nAcOKAAFj&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/nAcOKAAFj&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 9800kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 192kbps\n   Duration: 00:04:39\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.1\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t\n*this is the actual file i uploaded to youtube on December 12, 2011","torrent":{"xt":"urn:btih:69fbe4f277affef970a934559130a7e50bd0bb6c","amp;dn":"Cake+-+Comfort+Eagle+%5BLate+World+with+Zach%2C+2002%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69fbe4f277affef970a934559130a7e50bd0bb6c","infoHashBuffer":{"type":"Buffer","data":[105,251,228,242,119,175,254,249,112,169,52,85,145,48,167,229,11,208,187,108]},"announce":[],"urlList":[]}}