{"title":"Dilling-Red Betrayal of Churches(communist infiltration of churc","uid":4746806,"size":96429,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6a56994d1d012b6ac0092273542d727b0f5d0e29&amp;dn=Dilling-Red+Betrayal+of+Churches%28communist+infiltration+of+churc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"red_gonzo","files":1,"time":1235927000,"description":"This is Elizabeth Dilling's shocking booklet The Red Betrayal of the Churches (1938) which is an investigation into how communists have infiltrated and subverted the church, organized religion and christianity around the world. Just as Judas by acting as one of the beloved disciples of Jesus Christ, living with him, eating out of the same dish with him, with a kiss was able to betray him to the soldiers to be crucified, as no stranger could have done, so, through the ages, the eternal Judas has worked for the destruction of Christ's church from within. The gruesome martyrdom of Christians and the far more deadly atheization of their children at the hands of Satanic Red forces in Mexico, Spain and Russia, could not have taken place without preceding cooperation on the part of Judas-like clergy and laymen who played with, protected and fanned the destroying Red fire. The faith of children and adults as well is being destroyed today in schools, colleges and churches, supposedly staffed by Christian ministers but secretly infiltrated by communist agents throughout the decades. 20 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:6a56994d1d012b6ac0092273542d727b0f5d0e29","amp;dn":"Dilling-Red+Betrayal+of+Churches%28communist+infiltration+of+churc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a56994d1d012b6ac0092273542d727b0f5d0e29","infoHashBuffer":{"type":"Buffer","data":[106,86,153,77,29,1,43,106,192,9,34,115,84,45,114,123,15,93,14,41]},"announce":[],"urlList":[]}}