{"title":"Anti Diabetes (Type2) Healing Tone","uid":4119354,"size":412776044,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6b29a5114659dccc8ccdffff71670efae587c369&amp;dn=Anti+Diabetes+%28Type2%29+Healing+Tone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"btalex1990","files":1,"time":1207471998,"description":"Thousands to millions of elderly, adults and people are dying and suffering to type2 diabetes. It is a battle that is hard, difficult and time consuming to overcome and it makes suffering acceptable :&amp;#039;(.\n\nSo I decided to share a healing code that will destroy diabetes. Share this with all your children, families, mothers, and everyone, Share and seed this everywhere.\n\nSo I decided to release a (Made Forbidden by the secret religions and societies) Healing frequency that may lower blood sugars of Type2 diabetics and may cure Type 2.\n\nFor it to be effective you must play there sounds for weeks to months.\n\nOnly 1 side effect:\n\n(1)You may feel tired from being healed, cause your body has to heal itself\n\nThats It! No death, No more health problems.\n\nThis was Brought to you by the &quot;The Shaman Healer&quot;\n\n\nand heres the info for the Skeptical people or Skeptics for short:\n---------------------------------------------------------------------------------------\n\nI will explain how this works. First you might wanna look up &quot;String Theory&quot; and symatics (I can&amp;#039;t spell that word right but my mom told me that word so I&amp;#039;m telling you that word.) before you read my explaination why this isn&amp;#039;t quackery.\n\nYou may rebuttal by debate but I just know you will believe my explanation.\n\n\nOk these sounds use a special vibration and each Hz uses different vibrations, and (This is for religious people and preachers) they said god used sound to create life, god spoke and these sounds I am giving out is Not the same ones he used but he is allowing us to use them, and no I am not religious, this explains how the universe was created, it was created through sound.\n\nand now heres the scientific explanation and after this I swear you will believe me and this stuff will overtake the internet and everyone will be healed.\n\nEach planet, us, each spirit, the solar system, each animal, each organ in the body, each virus, each cell, everything has a sound frequency.\n\nNow the reason we can&amp;#039;t hear these sounds is because our ears are limited to certain sounds and frequencies.\n\nNow if you want proof use a frequency or tone generator (like NCH Tone Generator for example) and play 10 Hz and you will hear no sound, now you would expect to hear a sound like in my tones but again our ears are limited, and even though are aren&amp;#039;t hearing anything that frequency is giving out vibrations to your body at the moment.\n\n(Part2)\n\nNow Royal Raymond Rife found out that all cells, viruses, parasites, and germs can be controlled by two special frequencies, one is a creation frequency, and the other one is destructive.\n\nHe invented a special microscope and prism technology to find the signature to these cells and organisms, but the U.S Government backed by Pharmaceuticals tried to destroy and burn all proof that this isn&amp;#039;t quackery, so he started drinking alcohol, until his death cause he was so depressed his machine got destroyed, BUT you too with any computer with special secrets can recreate the rife machine but you would need the frequencies that would destroy viruses, bad cells, bad cancer, or recreate cells, such as the islet cells to fix your pancreas for curing diabetes.\n\nAnyways when his work was destroyed and the people he has his picture taken with denied they ever met him, but then they had a second thought about just shoving down his healing technology, future medicine that required no drugs, no drug dealers (Pharmacies) so they have been secretly, like the black markets, have been trying to recreate his research and eventually in the 80&amp;#039;s a book came out called &quot;The cancer cure that worked&quot; or something like that, it looks likeRoyal Raymond Rife, had a backup plan ;) a plan B so it looks like maybe the black markets and underground dealers got a hold of his special microscopes in case the government were to destroy his original research plan.\n\nSo what does this mean, someones been busy, someones been studying more viruses, how to cure diabetes by recreating islet cells, someone underground has been finding out all the frequencies for stuff and has been publishing these:\n\ncheck here: http://www.quantumbalancing.com/news/new_frequency_2.htm\n\nand now heres why these sounds can heal:\n\nand again whether you believe in god or not here will explain why these tones work:\n\nin the bible there are two gods:\n\nJesus explained of a god of peace and lovingness\n\nand the old testament explained a Jealous god, a god of war, slavery, he gets angry.\n\nSo theres a creative god, and a god of destruction.\n\nLike the frequencies, there is a creation frequency, and a frequency of destruction.\n\nYou can destroy a cell or recreate it.\n\na sound could transport you back in time or forward.\n\na sound could poison or heal you.\n\nlike we can choose to follow god or not and be an not god believer.\n\ndon&amp;#039;t you all realize there there is more to this world then what meets the eye.\n\nThese sounds can be proven scientifically, my healing tones can be proven scientifically, and can medically help us.\n\nhe reason why I didn&amp;#039;t say rife was because I knew I would be banned the minute I said rife and you would never ask me to explain how these frequencies work so I just said healing tones.\n\nthese sounds work by vibrating into your body and providing healing energy into your body, you could also use cancer destroying frequencies to kill the cancer and to avoid chemo therapy but I recommend telling your doctor this and explain to him how these frequencies work so he will understand and let you test this.\n\nSo skeptics it is within ur nature to be skeptical but I swear under the bible that I am telling the truth and that these frequencies can heal or destroy and can help kill cancer or bring back the islet cells.\n\nif this tone doesn&amp;#039;t work then you are not doing it right or we didn&amp;#039;t figure out the right tone.\n\nbut we are protected by a shield and thats why we are not dead yet, I think we all have shields and thats why we are not destroyed, why we are alive.\n\nAnyways Tesla, and Albert Einstein knew about frequencies, also take a look at the Montauk project and see their involvement, but don&amp;#039;t take a look at the history channels version because it is to spread lies and make it look like it&amp;#039;s all fake.\n\n(Part3)\n\nnow will you help me seed these or shall we continue this debate until I explain everything and you will understand why I am sharing these, why these can heal people, and why I can cure diabetes.\n\nI got to goto bed cause I am sleepy, but I want to continue this forum debate later, and want you skeptics to question me until you run out of questions and realize the truth.\n\nAnyways goodnight and we will talk more later and pretty soon if you believe the truth you can seed my torrents but if you don&amp;#039;t believe you can go back to the real world and believe whatever you wanna believe.","torrent":{"xt":"urn:btih:6b29a5114659dccc8ccdffff71670efae587c369","amp;dn":"Anti+Diabetes+%28Type2%29+Healing+Tone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b29a5114659dccc8ccdffff71670efae587c369","infoHashBuffer":{"type":"Buffer","data":[107,41,165,17,70,89,220,204,140,205,255,255,113,103,14,250,229,135,195,105]},"announce":[],"urlList":[]}}