{"title":"Jessica Pratt - Jessica Pratt [2012] [FLAC]","uid":8041753,"size":229692035,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6b6c1b3e6ea95fb1e844f52676faa2f34cbcab67&amp;dn=Jessica+Pratt+-+Jessica+Pratt+%5B2012%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dickspic","files":12,"time":1358647501,"description":"\n0\n \n0\nJessica Pratt - Jessica Pratt [2012] [FLAC]\nseeders: 0leechers: 0\nDOWNLOAD TORRENT\nAdded on Jan 20, 2013 by  dickthespic300 in Music &gt; FLAC\t\nDownloaded 0 times.\nCOMMENTS\nTECHNICAL\nMAIN\nadd to bookmarks add to rss\nJessica Pratt - Jessica Pratt [2012] [FLAC] (Size: 219.05 MB)\n \t\t1-Night_Faces.flac\t22.69 MB\n \t\t10-Titles_Under_Pressure.flac\t13.39 MB\n \t\t11-Dreams.flac\t18.14 MB\n \t\t2-Hollywood.flac\t18 MB\n \t\t3-Bushel_Hyde.flac\t21.12 MB\n \t\t4-Mountainr_Lower.flac\t17.05 MB\n \t\t5-Half_Twain_the_Jesse.flac\t33.38 MB\n \t\t6-Casper.flac\t23.57 MB\n \t\t7-Midnight_Wheels.flac\t16.12 MB\n \t\t8-Mother_Big_River.flac\t21.06 MB\n \t\t9-Streets_of_Mine.flac\t14.35 MB\n \t\tcover.jpg\t209.14 KB\nDescription\n\n\nArtist: Jessica Pratt\nRelease: Jessica Pratt\nDiscogs: 4024208\nReleased: 2012\nLabel: Birth Records\nCatalog#: Birth Records 001\nFormat: FLAC / Lossless / WEB\nCountry: US\nStyle: Folk, World, &amp; Country, \n\nTracklisting:\n\n01. Night Faces\n02. Hollywood\n03. Bushel Hyde\n04. Mountain'r Lower\n05. Half Twain The Jesse\n06. Casper\n07. Midnight Wheels\n08. Mother Big River\n09. Streets Of Mine\n10. Titles Under Pressure\n11. Dreams\n\nFirst pressing, limited to 500 copies.\n\nYet another Pitchfork review I don't understand\n\nThe mid-aughts freak-folk moment found artists and fans blurring the boundaries between past and present and seeking out kindred spirits across time, which made it an abundant season for folk reissues. Linda Perhacs' Parallelograms, Karen Dalton's In My Own Time, and Sibylle Baier's Colour Green, to name just a few, all got their long-delayed, much-deserved days in record store windows. And now, after an unhurried half-decade gestation period, 2012 felt like the year we started to hear the debut records from some of the young artists who scooped those reissues up.\nOne such record is Missouri native Angel Olsen's excellent debut LP Half Way Home. Her songs are struck through with poetic macabre (&quot;I thought this time last year I'd be dead/ It's quite strange the thoughts that pop into your head&quot;) and showcase a tortured, warbling croon that sounds like Vashti Bunyan leading a seance to commune with Roy Orbison. San Francisco's Jessica Pratt calls upon similar influences but makes music that feels like a counterpoint to Olsen's. As with Baier, the simplicity and affectlessness of Pratt's tranquil tunes are precisely what make them so hypnotic. Anyone who appreciated the general idea behind The Milk-Eyed Mender but couldn't quite make peace with Joanna Newsom's divisive vocal quirks (or her love of obtuse, 10-dollar-and-change vocab words) might feel more at home in the plaintive, unadorned warmth of Pratt's debut LP.\nPratt is a young songwriter with a decidedly old soul and a voice that balances spry sweetness with husky grit. &quot;Night Faces&quot; has a weathered, world-weary vibe as she sings of shedding &quot;a million tears trying to dig myself out all these years,&quot; while &quot;Half Twain the Jesse&quot; moves with an air of childlike curiosity. The songs themselves also feel lodged in some liminal realm between past and present, devoid of references that might place them in a historical moment. But their sepia tone never feels like a cheap gimmick; words like &quot;brethren,&quot; &quot;twain,&quot; and &quot;bushel&quot; roll off Pratt's tongue so naturally that you quickly become enveloped in the record's self-contained grammar. The effect is cumulative, lulling the listener into a tranquil, meditative space somewhere outside the interruptions of the modern world. \nPratt and her acoustic guitar are mostly unaccompanied, and there are occasional imperfections-- buzzing strings, the faint crack of her voice-- that add to its atmosphere of unvarnished intimacy. Her chord progressions are neither neat resolutions nor mournful elegies, which is to say that her songs traverse that vast, somewhat under-explored territory between happy and sad (except for &quot;Titles Under Pressure&quot;, which revolves around a hook that goes &quot;The next time, I'm stayin' away from this place/ I cannot make more mistakes&quot;; that one's a heartbreaker.) Even when Pratt sings a line like &quot;All the lights in my life are fading&quot; on &quot;Streets of Mine&quot;, there's a bright, resilient note or two that belie how dismal it looks on paper.\nThe last song on the album is a dim, crackling, live-recorded track called &quot;Dreams&quot;, on which she's joined by a man whose voice sounds like a cross between Phil Elvrum and Fred Neil. It's subdued enough to keep the vibe enact, but his sudden presence reinforces what a quiet, private and secluded place Pratt's self-titled debut has been. Listeners who prefer their folk flashier or wrapped around memorable, poppy hooks might find Pratt's approach meandering or bland. But those with a more patient ear will find her a worthy and quietly distinct heir of Baier, Bunyan, and Dalton's homespun sound. &quot;There was a time before us,&quot; she murmurs on the lovely &quot;Bushel Hyde&quot;, sounding like she's perhaps found a way to travel back there herself, picking up some of her forebears' weathered wisdom and weaving it into her own worldview.\n","torrent":{"xt":"urn:btih:6b6c1b3e6ea95fb1e844f52676faa2f34cbcab67","amp;dn":"Jessica+Pratt+-+Jessica+Pratt+%5B2012%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b6c1b3e6ea95fb1e844f52676faa2f34cbcab67","infoHashBuffer":{"type":"Buffer","data":[107,108,27,62,110,169,95,177,232,68,245,38,118,250,162,243,76,188,171,103]},"announce":[],"urlList":[]}}