{"title":"Edmonton Folk Music Festival - Comp. 1 1997 [FLAC] - Kitlope","uid":7057465,"size":450532547,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6c1949b4cb3de55ffa6553191689cf6f18c4e015&amp;dn=Edmonton+Folk+Music+Festival+-+Comp.+1+1997+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Kitlope","files":17,"time":1330187912,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nOptical Drive Hardware: Samsung SH-S223L\nOptical Drive Firmware: SB04\nCd Software: Exact Audio Copy V1.0 Beta 3 (Secure Mode)\nEAC Log: Yes\nEAC Cue Sheet: Yes\nM3U Playlist: Yes\nTracker(s):http://tracker.openbittorrent.com/announce; \nTorrent Hash: 6C1949B4CB3DE55FFA6553191689CF6F18C4E015\nFile Size: 429.66 MB\nYear: 1997\nLabel: Thanks to CBC Canada\nCatalog #:  Limited Edition number 1859\n\n\n\nPlease help seed these FLACs! \n\n\n\n\n\nHere's a bit of a plug for my hometown and where I reside. The Edmonton Folk Festival is one  of the most popular folk fests in North America. Unbelievably I've actually never attended and kick myself in the ass every year for not going as some great bands &amp; artists perform. Included is a great picture of the festival itself with downtown Edmonton in the background. If anybody has anymore of these rare compilations please do make available in lossless!\n\n\nKit \n\n\n\n\n\n\nFrom Wiki:\n\n\nThe Edmonton Folk Music Festival is an annual four-day outdoor music event held the second weekend of August in Edmonton, Alberta, Canada, established in 1980 by Don Whalen.[1] The festival continues to draw many people from around the world as both spectators and performers. The current producer of the festival is Terry Wickham.\n\nThe festival showcases performers in many genres. Most years, folk, celtic, bluegrass, blues, gospel, roots, and worldbeat acts perform. Past main stage performers include k.d. lang, Joni Mitchell, Stan Rogers, Great Big Sea, Oysterband, Loreena McKennitt, Norah Jones, Steve Earle, The Blind Boys Of Alabama, David Gray, Neko Case, Van Morrison, David Byrne and Michael Franti. In addition to mainstage and sidestage concerts by individual artists, the festival has artists collaborate on shared stages.\n\nDuring the daytime hours of the festival, there are six active stages hosting workshops and concerts. One stage is devoted to children's entertainment. Food vendors number in the dozens, ranging from carnival fare to vegetarian and world cuisine. A large tent houses craftspeople and there is a CD tent where the performers' albums can be purchased. There is also a beer garden, which serves more beer than any other single event in western Canada.\n\nThe EFMF relies heavily on volunteers which keeps ticket prices down. Volunteers do everything from picking garbage to working as stage hands. There are approximately 2000 people on the volunteer list each year.\n\nThe EFMF is held at Gallagher Park, on the banks of the North Saskatchewan river. During the winter the area is a ski club. The mainstage audience seating is a natural amphitheatre with great sightlines. The skyline of downtown Edmonton acts as a backdrop for the stage.\n\nIn recent years, a fifth evening of music has been added, with revenue from that concert being dedicated to the festival's endowment fund. \n\n\n\n\n\n\n\n\nCompilation 1 1997\n\n\n\nTracks: \n\nY'en Await Tout Le monde - La Bottine Souriante\nWhen God Dips his Pen Of Love In My Heart - Quartette\nOle Buffalo - Bill Bourne and Shannon Johnson\nHasn't Hit Me Yet - Blue Rodeo\nShapes And Sizes - Joan Armatrading\nHow To Make Gravy - Paul Kelly\nRainin' In My Heart - Jo-El Sonnier\nIf A Tree Falls - Bruce Cockburn\nLady Of Shallot - Loreena McKennitt\nThe Cuban Sandwich - Tom Russel and Barrence Whitfield\nDimples - Long John Baldry\nCold Missouri Waters - James Keelaghan\nWorld of Love - K.D. Lang\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:6c1949b4cb3de55ffa6553191689cf6f18c4e015","amp;dn":"Edmonton+Folk+Music+Festival+-+Comp.+1+1997+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c1949b4cb3de55ffa6553191689cf6f18c4e015","infoHashBuffer":{"type":"Buffer","data":[108,25,73,180,203,61,229,95,250,101,83,25,22,137,207,111,24,196,224,21]},"announce":[],"urlList":[]}}