{"title":"2015 Poet's Market [Epub &amp; Mobi] [StormRG]","uid":11423536,"size":5456103,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6c4993eb5d3317c6027a698d667ddcdc28f8ad1e&amp;dn=2015+Poet%27s+Market+%5BEpub+%26amp%3B+Mobi%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"krystine","files":-1,"time":1415639494,"description":"2015 Poet's Market: The Most Trusted Guide for Publishing Poetry\nAuthor: Robert Lee Brewer\nPublished: 2014\nPublisher: Writer's Digest Books\nISBN: 9781599638447\nFormat: Retail Epub and Mobi\nReader Required:\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nMobi- Kindle app, Calibre, MoonReader for Android\n\n\n\nThe most trusted guide to getting poetry published!\n\nWant to get your poetry published? There's no better tool for making it happen than the 2015 Poet's Market, which includes hundreds of publishing opportunities specifically for poets, including listings for book/chapbook publishers, poetry publications, contests, and more. These include contact information, submission preferences, insider tips on what specific editors want, and--when offered--payment information.\n\nIn addition to the listings, Poet's Market offers articles on the Craft of Poetry, Business of Poetry, and Promotion of Poetry--not to mention new poems from today's best and brightest poets, including Beth Copeland, Joseph Mills, Judith Skillman, Laurie Kolp, Bernadette Geyer, and more. Learn the habits of highly productive poets, the usefulness of silence, revision tricks, poetic forms, ways to promote a new book, and more.\n\nYou also gain access to:\n\nLists of conferences, workshops, organizations, and grants\nA free digital download of Writer's Yearbook featuring the 100 Best Markets\n*Includes access to the webinar &quot;How to Build an Audience for Your Poetry&quot; from Robert Lee Brewer, editor of Poet's Market*","torrent":{"xt":"urn:btih:6c4993eb5d3317c6027a698d667ddcdc28f8ad1e","amp;dn":"2015+Poet%27s+Market+%5BEpub+%26amp%3B+Mobi%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c4993eb5d3317c6027a698d667ddcdc28f8ad1e","infoHashBuffer":{"type":"Buffer","data":[108,73,147,235,93,51,23,198,2,122,105,141,102,125,220,220,40,248,173,30]},"announce":[],"urlList":[]}}