{"title":"The Devil in the White City: Murder, Magic, and Madness at the F","uid":7938365,"size":1123369,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6c731c1e1e3e927f9c55087c9776305d838e51cb&amp;dn=The+Devil+in+the+White+City%3A+Murder%2C+Magic%2C+and+Madness+at+the+F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"wearehidden","files":1,"time":1355878413,"description":"Amazon.com Review\nAuthor Erik Larson imbues the incredible events surrounding the 1893 Chicago World's Fair with such drama that readers may find themselves checking the book's categorization to be sure that The Devil in the White City is not, in fact, a highly imaginative novel. Larson tells the stories of two men: Daniel H. Burnham, the architect responsible for the fair's construction, and H.H. Holmes, a serial killer masquerading as a charming doctor. Burnham's challenge was immense. In a short period of time, he was forced to overcome the death of his partner and numerous other obstacles to construct the famous &quot;White City&quot; around which the fair was built. His efforts to complete the project, and the fair's incredible success, are skillfully related along with entertaining appearances by such notables as Buffalo Bill Cody, Susan B. Anthony, and Thomas Edison. The activities of the sinister Dr. Holmes, who is believed to be responsible for scores of murders around the time of the fair, are equally remarkable. He devised and erected the World's Fair Hotel, complete with crematorium and gas chamber, near the fairgrounds and used the event as well as his own charismatic personality to lure victims. Combining the stories of an architect and a killer in one book, mostly in alternating chapters, seems like an odd choice but it works. The magical appeal and horrifying dark side of 19th-century Chicago are both revealed through Larson's skillful writing. --John Moe --This text refers to the Hardcover edition.\n\nPaperback: 447 pages\nPublisher: Vintage (February 10, 2004)\nLanguage: English\nISBN-10: 0375725601\nISBN-13: 978-0375725609","torrent":{"xt":"urn:btih:6c731c1e1e3e927f9c55087c9776305d838e51cb","amp;dn":"The+Devil+in+the+White+City%3A+Murder%2C+Magic%2C+and+Madness+at+the+F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c731c1e1e3e927f9c55087c9776305d838e51cb","infoHashBuffer":{"type":"Buffer","data":[108,115,28,30,30,62,146,127,156,85,8,124,151,118,48,93,131,142,81,203]},"announce":[],"urlList":[]}}