{"title":"On the Road with Janis Joplin - John Byrne Cooke - Audiobook MP3","uid":11497781,"size":385317417,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6c73d57ac9020405a2ddb45050affc16823719a7&amp;dn=On+the+Road+with+Janis+Joplin+-+John+Byrne+Cooke+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1416311954,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nOn the Road with Janis Joplin\n\nWritten by: John Byrne Cooke\nNarrated by: John Byrne Cooke\nLength: 13 hrs and 21 mins\nUnabridged Audiobook\nRelease Date:10-29-14\n\nAs a road manager and filmmaker, he helped run the Janis Joplin show - and record it for posterity. Now he reveals the never-before-told story of his years with the young woman from Port Arthur, Texas, who would become the first female rock and roll superstar - and depart the stage too soon.\n\nIn 1967, as the new sound of rock and roll was taking over popular music, John Byrne Cooke was at the center of it all. As a member of D.A. Pennebaker's film crew, he witnessed the astonishing breakout performances of Janis Joplin and Jimi Hendrix at the Monterey Pop Festival that June. Less than six months later, he was on a plane to San Francisco, taking a job as road manager for Janis and her band, Big Brother and the Holding Company. From then on, Cooke was Joplin's road manager amid a rotating cast of musicians and personnel, a constant presence behind the scenes as the woman called Pearl took the world by storm.\n\nCooke was there when Janis made the difficult decision to leave Big Brother and form a new band. He was with her when the Kozmic Blues Band toured Europe in the spring of 1969, when they performed at Woodstock in August, and when Janis and her Full Tilt Boogie band took their famous Festival Express train trip across Canada. He accompanied Janis to her friend and mentor Ken Threadgill's 70th birthday party, and he was at her side when she attended her 10th high school reunion in Port Arthur.\n\nThis intimate memoir spans the years he spent with Janis, from her legendary rise to her tragic last days. Cooke tells the whole incredible story as only someone who lived it could","torrent":{"xt":"urn:btih:6c73d57ac9020405a2ddb45050affc16823719a7","amp;dn":"On+the+Road+with+Janis+Joplin+-+John+Byrne+Cooke+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c73d57ac9020405a2ddb45050affc16823719a7","infoHashBuffer":{"type":"Buffer","data":[108,115,213,122,201,2,4,5,162,221,180,80,80,175,252,22,130,55,25,167]},"announce":[],"urlList":[]}}