{"title":"Richie Sambora - Stranger In This Town (1991) - Complete Disk","uid":3426074,"size":76889802,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6cc989be733c9e250772fd78699c728ba55df62e&amp;dn=Richie+Sambora+-+Stranger+In+This+Town+%281991%29+-+Complete+Disk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tanelin","files":11,"time":1135971372,"description":"(I have a slow connection so if you download this torrent, please be patient and please help seed.)\n\nFresh off their last two hugely successful albums, Slippery When Wet and New Jersey respectively, Bon Jovi decided to take a much deserved break in the early 1990's. Jon Bon Jovi released his first solo album, Blaze of Glory in 1990, while guitarist Richie Sambora, who co-wrote nearly all of the band's biggest hits, released his first solo album, Stranger In This Town, in 1991. Many times when a guitarist in a successful band, particularly one that plays hard rock, releases a solo album, the music presented is more based on the guitarist's six-string talents rather than the music. However, while there is more guitar here than on the Bon Jovi albums, Richie's solo debut is all about the songs. Stranger In This Town is a strong album containing both the anthems and power ballads that Bon Jovi made famous but also a couple ventures into the blues which are among the best tracks. \n\nThe album opens with &quot;Rest In Peace&quot;, which is essentially a 4-minute intro rather than an actual song. Consisting of keyboards and Richie's moody vocals and guitar work, it works very well despite its length. &quot;Church Of Desire&quot; is an awesome dramatic hard rocker with a great chorus that is one of the album's best tracks. &quot;Stranger In This Town&quot; is a killer blues complemented by both the glossy production and Richie's passionate vocals and solos. The album's single, &quot;Ballad of Youth&quot;, is a great hard rocker with a memorable riff while &quot;One Light Burning&quot; is very melodic and laid-back. &quot;Mr. Bluesman&quot;, another dramatic track that features both Richie and special guest Eric Clapton's tasty solos, is also an awesome track. &quot;Rosie&quot; and &quot;River Of Love&quot; are anthems that are decent but aren't as catchy as the ones Richie co-wrote with Jon Bon Jovi. &quot;Father Time&quot; is a bombastic power ballad that is similar to the ones that Bon Jovi made famous and is also very good. &quot;The Answer&quot; is a great acoustic tune that closes out the album. While not containing as many hooks and catchy songs as those on Slippery When Wet and New Jersey, Stranger In This Town is a strong album that shows Richie Sambora's exceptional talents as both a songwriter and a musician. Definitely worth picking up. \n\n\ncovers.jpg\n01 - Rest In Peace.mp3\n02 - Church Of Desire.mp3\n03 - Stranger In This Town.mp3\n04 - Ballad Of Youth.mp3\n05 - One Light Burning.mp3\n06 - Mr. Bluesman.mp3\n07 - Rosie.mp3\n08 - River Of Love.mp3\n09 - Father Time.mp3\n10 - The Answer.mp3","torrent":{"xt":"urn:btih:6cc989be733c9e250772fd78699c728ba55df62e","amp;dn":"Richie+Sambora+-+Stranger+In+This+Town+%281991%29+-+Complete+Disk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cc989be733c9e250772fd78699c728ba55df62e","infoHashBuffer":{"type":"Buffer","data":[108,201,137,190,115,60,158,37,7,114,253,120,105,156,114,139,165,93,246,46]},"announce":[],"urlList":[]}}