{"title":"Supercritical Water (2012) by Yizhak Marcus [HxH]","uid":10950443,"size":3160282,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6ce0054c2dd9441158cbfdf21525aa2b55a850ae&amp;dn=Supercritical+Water+%282012%29+by+Yizhak+Marcus+%5BHxH%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Sunghabib","files":-1,"time":1409628475,"description":"Book Description:\n\nDiscover the many new and emerging applications of supercritical water as a green solvent\n\nDrawing from thousands of original research articles, this book reviews and summarizes what is currently known about the properties and uses of supercritical water. In particular, it focuses on new and emerging applications of supercritical water as a green solvent, including the catalytic conversion of biomass into fuels and the oxidation of hazardous materials.\n\nSupercritical Water begins with an introduction that defines supercritical fluids in general. It then defines supercritical water in particular, using the saturation curve to illustrate its relationship to regular water. Following this introduction, the book:\n\nDescribes the bulk macroscopic properties of supercritical water, using equations of state to explain temperature-pressure-density relationships\n\nExamines supercritical water's molecular properties, setting forth the latest experimental data as well as computer simulations that shed new light on structure and dynamics\n\nExplores the solubilities of gases, organic substances, salts, and ions in supercritical water in terms of the relevant phase equilibria\n\nSets forth the practical uses of supercritical water at both small scales and full industrial scales\n\nThroughout the book, the author uses tables for at-a-glance reviews of key information. Summaries at the end of each chapter reinforce core principles, and references to original research and reviews serve as a gateway and guide to the extensive literature in the field.\n\nSupercritical Water is written for students and professionals in physical chemistry, chemistry of water, chemical engineering, and organic chemistry, interested in exploring the applications and properties of supercritical water.\n\nProduct Details:\n\nPDF: 214 pages\nPublisher: Wiley; 2 edition (June 26, 2012)\nLanguage: English\nISBN-10: 0470889470\nISBN-13: 978-0470889473\n\n------------------------------------------------\nSeed - Share - Enjoy - Give me Thumbs Up\n------------------------------------------------","torrent":{"xt":"urn:btih:6ce0054c2dd9441158cbfdf21525aa2b55a850ae","amp;dn":"Supercritical+Water+%282012%29+by+Yizhak+Marcus+%5BHxH%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ce0054c2dd9441158cbfdf21525aa2b55a850ae","infoHashBuffer":{"type":"Buffer","data":[108,224,5,76,45,217,68,17,88,203,253,242,21,37,170,43,85,168,80,174]},"announce":[],"urlList":[]}}