{"title":"He Came To Set The Captives Free - Rebecca Brown","uid":11773466,"size":44835006,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6ce72ff9e5a167c8c97e49155d240809141507c8&amp;dn=He+Came+To+Set+The+Captives+Free+-+Rebecca+Brown&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1427168898,"description":"\nFor seventeen years, Elaine served her master, Satan, with total commitment. Then she met Dr. Rebecca Brown, who served her master, Jesus Christ, with equal commitment. Elaine, one of the top witches in the U.S., clashed with Dr. Brown, who stood against her alone. In the titanic life-and-death struggle that followed, Dr. Brown nearly lost her life. Elaine, finding a power and love greater than anything Satan could give her, left Satan and totally committed her life to Jesus Christ. In this honest, in-depth account of Satan's activities today, you'll see how to recognize and combat the many satanists who regularly infiltrate and destroy Christian churches; recognize and combat satanic attacks; and recognize those serving Satan, and bring them to Jesus Christ.\n\n\nAbout the author:\nRebecca Brown, M.D., was a young intern just out of medical school when she first encountered the activities of a group of Satanists. She began a lifelong journey of danger and excitement as she followed step-by-step the Lord's commands for her life. She learned complete trust and obedience as God faithfully guided her to truth and ultimate victory.This remarkable woman has ministered to thousands of people through her books, seminars and individual counseling. Dr. Brown's vast experience through personal encounters gives exceptional credibility to her teaching.While there are many Christian authors who write on the subject of the occult, few have the extensive hands-on experience of Rebecca. In fourteen years of ministry, Dr. Brown has led many people out of hard-core Satanism and all types of occult bondage, including Eastern mysticism and New Age philosophy, and into a personal relationship with Jesus Christ. She has also effectively taught believers how to defend themselves against demonic activity by strengthening themselves daily in the Lord by obeying His Word.When Rebecca first encountered the shocking facts behind Satanism and the occult, there was little accurate information available on these dark and evil practices. Movies and television shows that portrayed the supernatural were regarded by the average viewer as fiction. By contrast, today it is common to see newspapers and talk shows discussing details of Satanic ritualistic abuse, demon possession and &quot;white&quot; witchcraft. In spite of the popularity of these topics, however, the full truth is not being accurately disclosed. As a result, there are massive numbers of Christians being deceived in their schools, on the job and even in their own churches.Rebecca candidly discusses the brutal facts and little-known secrets of the occult, such as placement of &quot;inserts&quot; and the practice of &quot;caging.&quot; She deals with demons in a no-nonsense manner that takes the &quot;three-ring circus&quot; out of deliverance. Her instruction is based on the simple steps of faith found in scripture. She emphasizes that these steps are also necessary for the believer's entire Christian walk.Rebecca Brown has authored these best-selling books: He Came To Set The Captives Free, Prepare For War, Unbroken Curses, and Becoming A Vessel of Honor. They have been translated into over twelve languages and are used worldwide as teaching tools in churches and ministries. Her counsel is often sought by pastors, doctors and lawyers. In addition, her books are utilized by various U.S. law enforcement officials as part of their training programs for dealing with the occult.Although there are many Christian books exposing the occult, Dr. Brown's are among the few that offer definite answers and specific personal advice. They have helped countless people to pray effectively and to protect themselves from demonic attack and bondage","torrent":{"xt":"urn:btih:6ce72ff9e5a167c8c97e49155d240809141507c8","amp;dn":"He+Came+To+Set+The+Captives+Free+-+Rebecca+Brown","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ce72ff9e5a167c8c97e49155d240809141507c8","infoHashBuffer":{"type":"Buffer","data":[108,231,47,249,229,161,103,200,201,126,73,21,93,36,8,9,20,21,7,200]},"announce":[],"urlList":[]}}