{"title":"Rick Atkinson - The WWII Liberation Trilogy [Unabridged]","uid":9538356,"size":2451846816,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6d2825621cafe0fa76152d2683ee35880247de2d&amp;dn=Rick+Atkinson+-+The+WWII+Liberation+Trilogy+%5BUnabridged%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rambam1776","files":-1,"time":1390978780,"description":"Rick Atkinson - The Liberation Trilogy; Complete, Unabridged\n\n\n01 - An Army at Dawn: The War in North Africa, 1942-1943 [48 kbps, Read by George Guidall]\n\n\n02 - The Day of Battle: The War in Sicily and Italy, 1943-1944 [64 kbps, Read by Jonathan Davis]\n\n\n03 - The Guns at Last Light: The War in Western Europe, 1944-1945 [64 kbps, Read by L. J. Ganser]\n\n\nThe definitive chronicle of the Allied triumph in Europe during World War II, Rick Atkinson's Liberation Trilogy is now together in one boxed set\n\nFrom the War in North Africa to the Invasion of Normandy, the Liberation Trilogy recounts the hard fought battles that led to Allied victory in World War II. Pulitzer Prize-winning and New York Times bestselling author Rick Atkinson brings great drama and exquisite detail to the retelling of these battles and gives life to a cast of characters, from the Allied leaders to rifleman in combat. His accomplishment is monumental: the Liberation Trilogy is the most vividly told, brilliantly researched World War II narrative to date.\n\nRick Atkinson is the bestselling author of An Army at Dawn (winner of the Pulitzer Prize for history), The Day of Battle, The Long Gray Line, In the Company of Soldiers, and Crusade. His many other awards include a Pulitzer Prize for journalism, the George Polk award, and the Pritzker Military Library Literature Award. A former staff writer and senior editor at The Washington Post, he lives in Washington, D.C.","torrent":{"xt":"urn:btih:6d2825621cafe0fa76152d2683ee35880247de2d","amp;dn":"Rick+Atkinson+-+The+WWII+Liberation+Trilogy+%5BUnabridged%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d2825621cafe0fa76152d2683ee35880247de2d","infoHashBuffer":{"type":"Buffer","data":[109,40,37,98,28,175,224,250,118,21,45,38,131,238,53,136,2,71,222,45]},"announce":[],"urlList":[]}}