{"title":"Randy Crawford - Ultimate Collection (FLAC)","uid":5839138,"size":925886010,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6d74280d5f06ec8533da9013fedc839ff1d5b456&amp;dn=Randy+Crawford+-+Ultimate+Collection+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"piratetorrent1989","files":50,"time":1284859203,"description":"Randy Crawford (born Veronica Crawford, February 18, 1952, Macon, Georgia) is an American jazz and R&amp;B singer. She has been more successful in Europe than in the United States, where she has not entered the Billboard Hot 100 as a solo artist.\n\nCrawford first performed at club gigs from Cincinnati to Saint-Tropez, but made her name in mid 1970s in New York, where she sang with jazzmen George Benson and Cannonball Adderley.[2] Adderley invited her to sing on his album, Big Man (1975).[3] Crawford recorded &quot;Don't Get Caught in Love's Triangle,&quot; produced by Johnny Bristol, during her short stint on the Fantasy label.[3]\n\nIn 1978 former Genesis guitarist Steve Hackett had Crawford perform on his second solo album &quot;Please Don't Touch&quot;. Hackett discovered Crawford in a Chicago club and was so impressed that he had her sing &quot;Hoping Love Will Last&quot;, which was the opening song on side two of the album.\n\nShe led R&amp;B veterans The Crusaders on the transatlantic hit &quot;Street Life&quot; (1979).[2] This song stayed atop the U.S. jazz chart for twenty weeks and has since become both a rare groove and disco classic.[citation needed] It was featured in the soundtrack for the film, Sharky's Machine,[3] and appeared in commercials in the early 2000s. She moved to Warner Bros. and after &quot;Street Life,&quot; recorded and toured Europe with the Crusaders. Crawford was named the 'Most Outstanding Performer' at the 1980 Tokyo Music Festival.[3]\n\nHer follow up solo efforts included &quot;One Day I'll Fly Away&quot; (1980); &quot;You Might Need Somebody&quot; (1981); and &quot;Rainy Night in Georgia&quot; (1981); which all became soul standards. The album, Secret Combination (1981) stayed on the UK Albums Chart for sixty weeks, after which her profile dipped, despite a return to the UK Top Ten with &quot;Almaz&quot; in 1986.[2] She remained with Warner Bros. through to the early 1990s, but was unable to score either a big R&amp;B hit or major crossover success, despite having one of the most readily identifiable voices and distinctive approaches of any contemporary female vocalist.[3]\n\nNaked And True (1995) brought Crawford back to her roots: it included George Benson's &quot;Give Me the Night&quot;, and confirmed her soul heritage by featuring Funkadelicists Bootsy Collins, Bernie Worrell and the Fred Wesley Horns.[2] She enjoyed her highest profile of the decade when rising starlet, Shola Ama, had a worldwide hit with her 1997 cover of &quot;You Might Need Somebody&quot;.[2]\n\nCrawford recorded a live session with Joe Sample on 24 July 2007 at Abbey Road Studios for Live from Abbey Road. The episode she shared with David Gilmour and Amos Lee was screened on the Sundance Channel in the U.S. and Channel 4 in the UK.\n\nShe has sung with Bootsy Collins, Johnny Bristol, Quincy Jones, Al Jarreau, Rick Springfield and Joe Sample amongst others.","torrent":{"xt":"urn:btih:6d74280d5f06ec8533da9013fedc839ff1d5b456","amp;dn":"Randy+Crawford+-+Ultimate+Collection+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d74280d5f06ec8533da9013fedc839ff1d5b456","infoHashBuffer":{"type":"Buffer","data":[109,116,40,13,95,6,236,133,51,218,144,19,254,220,131,159,241,213,180,86]},"announce":[],"urlList":[]}}