{"title":"Soups &amp; Stews 101 Master Soups and Stews with 101 Great Reci","uid":9099045,"size":853668,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6d823fde966ba8cbc34921a1fd2526827ed47628&amp;dn=Soups+%26amp%3B+Stews+101+Master+Soups+and+Stews+with+101+Great+Reci&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"420weedman","files":1,"time":1382743326,"description":" Publication Date: January 29, 2013\nThe 101 series expands with an all-new, everything-you-need-to-know guide to making delicious soups and stews. This cookbook features 101 delicious, diverse, and accessible recipes, all of which have been thoroughly kitchen tested. Soups &amp; Stews 101 also features a simple, contemporary-looking design that's as practical as it is elegant, with measures calculated using both traditional and metric quantities. Scattered throughout are beautiful full-color photographs that enhance the book's utility and visual appeal. These practical, hands-on kitchen resources also look great on the kitchen bookshelf--and because their durable flexi-binding is sewn, they are extremely easy to keep open and lay flat on your kitchen counter while you're cooking from their pages. Every home cook can appreciate how a lie-flat binding makes a cookbook much easier to use!\n\nSoups &amp; Stews 101 starts off with a detailed introduction that covers soup-and-stew basics and provides plenty of helpful how-tos, insider tips, and keys to best results. The idea is to provide everything a reader needs to know in order to make these recipes successfully. The 101 recipes included feature a breadth of different dishes drawn from a wide range of culinary traditions, all of them featuring clear, straightforward directions, and all of them delicious. The 101 series is perfect both for beginners and more experienced cooks looking to broaden their kitchen horizons.\nGenre: Cooking.\n","torrent":{"xt":"urn:btih:6d823fde966ba8cbc34921a1fd2526827ed47628","amp;dn":"Soups+%26amp%3B+Stews+101+Master+Soups+and+Stews+with+101+Great+Reci","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d823fde966ba8cbc34921a1fd2526827ed47628","infoHashBuffer":{"type":"Buffer","data":[109,130,63,222,150,107,168,203,195,73,33,161,253,37,38,130,126,212,118,40]},"announce":[],"urlList":[]}}