{"title":"Plastic Man v4","uid":4873017,"size":198373272,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:6e11cc0e6d6d5e7cc49f72a650daafc3d24c5683&amp;dn=Plastic+Man+v4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"brodahisou","files":-1,"time":1240943642,"description":"The latest series of Plastic Man from 2005. Written and illustrated by Kyle Baker.\n\nPlastic Man was a crook named Patrick &quot;Eel&quot; O'Brian. During a late-night heist at the Crawford Chemical Works, he and his three fellow gang members were surprised by a night watchman. During the gang's escape, Eel was shot in the shoulder and doused with a large drum of unidentified acid. He escaped to the street only to discover that his gang had driven off without him. Fleeing to a local monastery Eel was saved by a order of monks. This act of faith and kindness - combined with the realization that his gang had left him to be captured without a moment's hesitation - fanned Eel's longstanding dissatisfaction with his criminal life and his desire to reform. During his short convalescence at the monastery, he discovered that the acid had entered his bloodstream and caused a radical physical change. His body now had all of the properties of rubber, allowing him to stretch, bounce, and mold himself into any shape. He immediately determined to use his new abilities on the side of law and order, donning a red, black and yellow (later red and yellow) rubber costume and capturing criminals as Plastic Man.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:6e11cc0e6d6d5e7cc49f72a650daafc3d24c5683","amp;dn":"Plastic+Man+v4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e11cc0e6d6d5e7cc49f72a650daafc3d24c5683","infoHashBuffer":{"type":"Buffer","data":[110,17,204,14,109,109,94,124,196,159,114,166,80,218,175,195,210,76,86,131]},"announce":[],"urlList":[]}}