{"title":"[1993] A Terceira Margem do Rio - Nelson Pereira dos Santos","uid":5083172,"size":734056218,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6e2341e63cdcd717a92067e3de983f26d797a22f&amp;dn=%5B1993%5D+A+Terceira+Margem+do+Rio+-+Nelson+Pereira+dos+Santos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"just_nobody","files":-1,"time":1252509878,"description":"It's a VHSRIP and there're no subs available.\n\nFrom the book &quot;Brazilian Cinema&quot; - Edited by Randal Johnson and Robert Stam:\n\n[quote]&quot;The Third Bank of the River&quot; is a coproduction (French and Brazilian) and, like the Guerra film, it too ingeniously interweaves diverse stories by its source author. Beginning with the story that provides the title for the film - the virtually wordless drama of a man who abandons his family to live on a boat in the middle of the river - Nelson Pereira dos Santos integrates four other stories. Liojorge (Ilya SÃƒÂ£o Paulo) the son (in Nelson's re-creation) of the enigmatic boatman of the first story, follows an enchanted cow and thus becomes the protagonist of another story (&quot;SeqÃƒÂ¼ÃƒÂªncia&quot;) in which the cow leads him to the most beautiful woman in the world (Sonja Saurin). From their romance is born the miracle-working saint Nhinhinha (BÃƒÂ¡rbara Brandt) from still another story (&quot;A Menina de LÃƒÂ¡&quot;). But the family is the persecuted by an evil group of brothers evocative of corrupt policemen or &quot;death squads&quot; - the DagobÃƒÂ³ brothers - from yet another story, one of whom desires Nhinhinha. To get rid of him, Liojorge calls the philosopher-assassin (Jofre Soares) from still another story (&quot;Fatalidade&quot;). Feeling threatened, the family fless to BrasÃƒÂ­lia. The postcard vision of the magnificent buildings of the city - concretizations of official modernity - give away to scenes of squalor reminiscent of the favelas of Rio. Apart from mixing different source stories, The Third Bank of the River also mixes distinct styles and motifs from Dos Santo's own oeuvre.[/quote]\n\nFile Name .........................................: [1993] A Terceira Margem do Rio - NÃƒÂ©lson Pereira dos Santos.avi\nFile Size (in bytes) ............................: 734,056,218 bytes\nRuntime ............................................: 1:39:30\n\nVideo Codec ...................................: DivX 5.x/6.x\nFrame Size ......................................: 716x480 (AR: 1.326)\nFPS .................................................: 29.970\nVideo Bitrate ...................................: 841 kb/s\nBits per Pixel ...................................: 0.082 bpp\nB-VOP, N-VOP, QPel, GMC.............: [], [], [], []\n\nAudio Codec ...................................: 0x0055 MPEG-1 Layer 3\nSample Rate ...................................: 48000 Hz\nAudio Bitrate ...................................: 128 kb/s [2 channel(s)] CBR\nNo. of audio streams .......................: 1\n\n*********************************** FREAKYFLICKS ************************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'\t","torrent":{"xt":"urn:btih:6e2341e63cdcd717a92067e3de983f26d797a22f","amp;dn":"%5B1993%5D+A+Terceira+Margem+do+Rio+-+Nelson+Pereira+dos+Santos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e2341e63cdcd717a92067e3de983f26d797a22f","infoHashBuffer":{"type":"Buffer","data":[110,35,65,230,60,220,215,23,169,32,103,227,222,152,63,38,215,151,162,47]},"announce":[],"urlList":[]}}