{"title":"Under The Dome Episode 1 (720p).mp4","uid":10720824,"size":355759074,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6e271a2a5bfcbc9427b53162b66ce8f4c4c8197a&amp;dn=Under+The+Dome+Episode+1+%28720p%29.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"regishare","files":1,"time":1407479984,"description":"\n\nDale &quot;Barbie&quot; Barbara (Mike Vogel) buries a man's body in the woods of Chester's Mill. As he is leaving the town, an invisible barrier descends on the borders of the township, trapping everyone inside. Local newspaper reporter Julia Shumway (Rachelle Lefevre), who was investigating mysterious propane deliveries before the barrier appeared, takes a special interest in Barbie after he saves the life of teenager Joe McAlister (Colin Ford), whose parents are trapped out of town. Town councilman James &quot;Big Jim&quot; Rennie (Dean Norris) makes an emergency radio announcement, while police chief Duke Perkins (Jeff Fahey) and his deputy Linda Esquivel (Natalie Martinez) try to quell the rise of panic in the town. Big Jim's unstable son Junior (Alexander Koch) kidnaps Angie McAlister (Britt Robertson) when he begins to suspect she had an affair with Barbie. Carolyn Hill (Aisha Hinds) and her partner Alice Calvert (Samantha Mathis) are passing through Chester's Mill with their daughter Norrie (Mackenzie Lintz) when the barrier appears and Norrie has what they think is an epileptic seizure. A link between Big Jim, Duke and the stockpiled propane is revealed. Julia takes Barbie into her home, where he realizes the man he murdered and buried was her husband, Peter. Duke suggests to Linda that the entire town is being punished and is about to reveal a dark secret about the town when his pacemaker explodes as he approaches the barrier. The U.S. military descends upon Chester's Mill as the world learns of the unprecedented phenomenon.","torrent":{"xt":"urn:btih:6e271a2a5bfcbc9427b53162b66ce8f4c4c8197a","amp;dn":"Under+The+Dome+Episode+1+%28720p%29.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e271a2a5bfcbc9427b53162b66ce8f4c4c8197a","infoHashBuffer":{"type":"Buffer","data":[110,39,26,42,91,252,188,148,39,181,49,98,182,108,232,244,196,200,25,122]},"announce":[],"urlList":[]}}