{"title":"Osho_The Last Testament_Vol3-05_To hell with Bhagwan.avi","uid":14027314,"size":729118912,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:6e370cbd186c710c1e4429e9d442f2b2a6b914f3&amp;dn=Osho_The+Last+Testament_Vol3-05_To+hell+with+Bhagwan.avi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"drugarica","files":1,"time":1458934709,"description":"\nThe Last Testament vol3-05- to hell with Bhagwan\r\n26 September 1985 pm in Sanai Grove\r\n\r\ntext can be red here:\n\r\nINTERVIEWS WITH: SCOTT MILLER, NBC, CHANNEL 8, PORTLAND,\r\nOREGON; AND TOM PAULU, LONGVIEW DAILY NEWS, SEATTLE,\r\nWASHINGTON, USA\r\n\r\n1.INTERVIEW WITH SCOTT MILLER, NBC, CHANNEL 8, PORTLAND\r\n\r\nQ: THINGS YOU'VE BEEN SAYING HAVE MEANT A LOT OF CHANGES FOR YOUR SANNYASINS. SPECIFICALLY: WEAR ANY COLOR YOU LIKE, DON'T WEAR YOUR MALA IF YOU DON'T WANT TO. YOU GOT ANY OTHER CHANGES IN MIND FOR YOUR SANNYASINS?\r\nA: I don't know.\r\nQ: NOTHING RIGHT AT THE MOMENT?\r\nA: Anything is possible.\r\nQ: NOTHING YOU'D LIKE TO SHARE WITH US RIGHT NOW, THOUGH?\r\nA: No.\r\nQ: WHY DID YOU CHOOSE THIS MOMENT? WHY DID YOU CHOOSE THIS MOMENT WHEN IT WOULD SEEM THAT YOU WOULD NEED SOMETHING TO BIND EVERYBODY TOGETHER -- LIKE CLOTHING AND MALAS -- TO SAY, &quot;DON'T WORRY ABOUT THAT ANY MORE, YOU DON'T HAVE TO DO IT&quot;?\r\nA: This was the right moment to do it. I want my people to be absolutely free individuals. I don't want them to be Rajneeshees. They have to be themselves.\r\n..........................\r\nINTERVIEW WITH TOM PAULU, LONGVIEW DAILY NEWS, SEATTLE, WASHINGTON\r\n\r\nQ: YOU EXPECT MOST PEOPLE TO STOP WEARING RED?\r\n\r\nA: I don't expect; only few, not most. Mostly nobody goes out. And I have left it to them. It is their decision. If they want to go in red, that is their freedom. Who I am to decide for them?\r\n..............\r\n\r\nQ: YOU COMMENTED THAT THERE'S A POSSIBILITY YOU WOULD PATCH THINGS UP WITH SHEELA. A FEW DAYS AGO THERE WAS AN INTERVIEW IN THE GERMAN MAGAZINE STERN IN WHICH SHE WAS QUOTED AS SAYING, &quot;THE HELL WITH BHAGWAN.&quot;DO YOU STILL THINK THAT YOU COULD REPAIR YOUR RELATIONSHIP WITH HER?\r\n\r\nA: No, there is no need. I can go to hell. I don't see any harm in it. In fact, hell is full of the best people of the world. Only heaven is dull.\r\nIf she had said, &quot;Heaven with Bhagwan,&quot; then I would have objected because whom do you expect to meet in heaven? You cannot meet Byron, Shelley, Vincent van Gogh, Picasso, Dostoevsky, Walt Whitman. All these people you will meet in hell. And I love good company! So she was perfectly right. There is no problem....\r\nDownload book Osho_The Last Testament vol3..http://www.oshorajneesh.com/download/osho-books/western_mystics/The_Last_Testament_Volume_3.pdf","torrent":{"xt":"urn:btih:6e370cbd186c710c1e4429e9d442f2b2a6b914f3","amp;dn":"Osho_The+Last+Testament_Vol3-05_To+hell+with+Bhagwan.avi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e370cbd186c710c1e4429e9d442f2b2a6b914f3","infoHashBuffer":{"type":"Buffer","data":[110,55,12,189,24,108,113,12,30,68,41,233,212,66,242,178,166,185,20,243]},"announce":[],"urlList":[]}}