{"title":"YOOtheme club Sixth Avenue theme (May 2015)","uid":11921719,"size":31639239,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:6ea5eef8db6a36ef287f1c6f9eab46d689b84c14&amp;dn=YOOtheme+club+Sixth+Avenue+theme+%28May+2015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":1,"time":1431650278,"description":" Sixth Avenue! This posh magazine style theme has a very elegant, minimalistic design approach with a lot of love for detail. This makes it perfect for your blog or news website.\n\nPages\n\nTo give you a better impression of what is possible with our themes and Widgetkit 2, we have recently started to add custom pages the each release. They present different widgets and their usecases in a context that thematically fits each theme. Sixth Avenue comes with customized About, Features, Services and Blog pages as well as a Gallery to create a beautiful portfolio and a magazine like Dynamic Blog.\n\nNew Widgets\n\nSixth Avenue makes use of our highly anticipated new Widgetkit 2.3 release! It presents three new widgets: Slider, Parallax and Slideset! All three can be spotted on the frontpage of Sixth Avenue. Watch out for the Widgetkit 2.3 release early next week.\n\nTheme Features\n\nSixth Avenue allows you to apply a full width dropdown to the main navigation. The dropdown can be triggered on hover or on click. As usual, you can adjust the number of columns and the dropdown width in the Warp administration. To easily highlight block sections, you can apply different background colors and paddings through the Warp administration. Additionally, this theme offers the Offset option that will pull panels up for a more dynamic layout.\n\nA lot of details, like overlays, custom animations, drop caps and the beautiful typography give this theme its individuality. As usual, Sixth Avenue comes with 6 style variations.\n\nOptional full width dropdown and fixed main menu\nCustom article layout\nBlock offset option\nOptional drop cap for articles\nNew Slider, Parallax and Slideset widgets\nDemo pages built with Widgetkit 2\nFull UIkit components styling\n6 pre-built style variations\nEasy customizer and LESS integration\nWooCommerce support","torrent":{"xt":"urn:btih:6ea5eef8db6a36ef287f1c6f9eab46d689b84c14","amp;dn":"YOOtheme+club+Sixth+Avenue+theme+%28May+2015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ea5eef8db6a36ef287f1c6f9eab46d689b84c14","infoHashBuffer":{"type":"Buffer","data":[110,165,238,248,219,106,54,239,40,127,28,111,158,171,70,214,137,184,76,20]},"announce":[],"urlList":[]}}