{"title":"Harry Potter and the Chamber of Secrets_extended edition_x264man","uid":4316964,"size":950001760,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6edfbc5315271d80fbf87ffbb631c2cca511a83a&amp;dn=Harry+Potter+and+the+Chamber+of+Secrets_extended+edition_x264man&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"x264man","files":5,"time":1217146823,"description":"Film name: Harry Potter and the Chamber of Secrets\n\n\n\nOriginal Runtime: 161 min\n\n\n\nNew Runtime: 172 min\n\n\n\nAmount of time Cut/Added: 11 min added\n\n\n\nCuts removed/added/extended:\n\n\n\n\n\n\nRestored Scenes:\n\n\n\n\n* Extended scene of Dobby and the cake.\n\n\n\n* Extended flying car scene when they are taking off from King&amp;#039;s Cross\n\n\n\n* Extended scene in Borgin and Burke&amp;#039;s where Lucius and Draco Malfoy come in and Harry has to hide. Lucius has come in to see some of his dark arts materials due to all the raids. (This is a more chilling introduction to Lucius.) Immediately followed by ...\n\n\n\n* Another Borgin and Burke&amp;#039;s scene where Borgin catches Harry on his way out\n\n\n\n* Harry finds Filch&amp;#039;s Kwikspell letter when he is leaving Snape&amp;#039;s office upon arrival at Hogwarts.\n\n\n\n* Extended introduction of Colin Creevy where he says he&amp;#039;s muggleborn.\n\n\n\n* Lockhart&amp;#039;s pop quiz ... all about himself.\n\n\n\n* Extended Qudditch scene where the rogue bludger goes through the crowd.\n\n\n\n* Extended Dueling Club scene where Justin introduces himself as a muggleborn.\n\n\n\n* Additional scene after Harry finds out he&amp;#039;s parseltounge. Harry reflects on who he is up a hill over looking the lake.\n\n\n\n* Extended study hall scene Harry overhears the Ernie, Hannah, &amp; other Hufflepuffs talking about him.\n\n\n\n* Additional scene where Fred and George tease Harry about being the heir of Slytherin and even Harry begins to doubt himself.\n\n\n\n* Hermione says she got the slytherin robes from the laundry when she is brewing the polyjuice potion.\n\n\n\n* Crabbe and Goyle meet Ron and Harry dressed like them after waking up from the sleeping draught.\n\n\n\n* Harry and Ron visit Hermione in hospital (after the cat incident.) They have found Tom Riddle&amp;#039;s diary and Ron says he recognises the name off a trophy. Leads into ...\n\n\n\n* Extended scene of Harry writes in the diary.\n\n\n\n* Harry wakes up Ron to tell him Hagrid opened the Chamber of Secrets.\n\n\n\n* Additional scene where Harry bumps into Harid on the corridor and Hagrid says he&amp;#039;s been up to Dumbledore&amp;#039;s office about the pheasant killings.\n\n\n\n* Harry gets his invisibility cloak out his trunk and covers Ron and himself with it before going to Hagrid&amp;#039;s hut.\n\n\n\n(The only scene not restored was the additional scene in the forest where Ron and Harry find the Ford Anglia. It ruined the surprise return of the car to save them.\n\n\n\n\n\n\n\n\n\nUse mplayer or mplayer frontends like smplayer or kmplayer for smooth playback. \n","torrent":{"xt":"urn:btih:6edfbc5315271d80fbf87ffbb631c2cca511a83a","amp;dn":"Harry+Potter+and+the+Chamber+of+Secrets_extended+edition_x264man","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6edfbc5315271d80fbf87ffbb631c2cca511a83a","infoHashBuffer":{"type":"Buffer","data":[110,223,188,83,21,39,29,128,251,248,127,251,182,49,194,204,165,17,168,58]},"announce":[],"urlList":[]}}