{"title":"Xenonauts (build 19 stable)","uid":9213231,"size":4658318026,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6f978d457c1eca86c0d74ebd5695edee9f229494&amp;dn=Xenonauts+%28build+19+stable%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Heliopios","files":-1,"time":1384823708,"description":"Xenonauts is a strategy turn-based tactics science fiction video game in development for Microsoft Windows, Mac OS X and Linux. It is the maiden title of Goldhawk Interactive, a London-based independent game studio, due for release in late 2013 / early 2014. The player takes the role of the commander of a clandestine organization known as the Xenonauts, attempting to defeat an alien invasion of Earth in the alternate history year 1979. The game is inspired by 1994's UFO: Enemy Unknown.\nIt has been confirmed that the game will retain the fundamental mechanics of the early X-COM games, in this case considered to be a real-time global air control and strategic management and research component of the game, coupled with turn-based ground combat where the player controls a squad of soldiers and vehicles against the alien forces on a tactical scale. Soldiers will develop their attributes through combat experience, and it has been confirmed (and demonstrated) that terrain in the ground combat maps will be destructible.\nXenonauts reached beta and launched on Steam Early Access in June 2013. A tentative release date of the end of 2013 was announced in September 2013, although the developer conceded that the title may be delayed until early 2014 if additional polish is required.","torrent":{"xt":"urn:btih:6f978d457c1eca86c0d74ebd5695edee9f229494","amp;dn":"Xenonauts+%28build+19+stable%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f978d457c1eca86c0d74ebd5695edee9f229494","infoHashBuffer":{"type":"Buffer","data":[111,151,141,69,124,30,202,134,192,215,78,189,86,149,237,238,159,34,148,148]},"announce":[],"urlList":[]}}