{"title":"The Cake Sale - The Cake Sale [2006][EAC/FLAC]","uid":10649381,"size":236544472,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:708d24ba2d8e26139aabf97e2c732f1ff5f02d95&amp;dn=The+Cake+Sale+-+The+Cake+Sale+%5B2006%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":-1,"time":1406588883,"description":"FLAC / Lossless / Log 100%/ Cue\nLabel/Cat#: Oxfam #1\nCountry: IRE\nYear: December 18, 2006\nGenre: americana,folk\nFormat: CD,Album\n\n\n\n\n\n1. Last Leaf (Dave Geraghty): Sung by Lisa Hannigan\n2. Vapour Trail (Paul Noonan): Sung by Josh Ritter\n3. Black Winged Bird (Emm Gryner): Sung by Nina Persson\n4. Some Surprise (Paul Noonan): Sung by Gary Lightbody and Lisa Hannigan\n5. All The Way Down (Glen Hansard): Sung by Gemma Hayes\n6.Too Many People (Ollie Cole): Sung by Glen Hansard\n7. Good Intentions Rust (Conor Deasy): Sung by Conor Deasy\n8. Needles (Damien Rice): Sung by Lisa Hannigan\n9. Aliens (Matt Lunson): Sung by Neil Hannon\n\n\n\nThe Cake Sale was devised by Brian Crosby of Irish indie-rockers Bell X1 as a collective and concept album benefiting the Oxfam organization's Make Trade Fair campaign and their other poverty relief projects. With a roll call that includes Gary Lightbody (Snow Patrol), Glen Hansard (The Frames/ONCE), Nick Seymour (Crowded House), Nina Persson (The Cardigans), and solo artists like Gemma Hayes and Josh Ritter, The Cake Sale features an incredible list of talented songwriters and performers who have donated their publishing royalties from the project to benefit Oxfam's worthy global causes\n\nRecorded in Dublin throughout last year, the bones of The Cake Sale's tracks were laid down by Bell X1 duo Crosby and Paul Noonan along with Crowded House bassist Nick Seymour and drummer Graham Hopkins. Much like the case of Gary Lightbody and Lisa Hannigan's &quot;Some Surprise,&quot; lead vocals for much of the album were recorded in different studios around the globe. Despite the disparate location of the musicians, the resulting record is a cohesive collection of songs from a group that made it a point not to fall victim to charity compilation album cliches. &quot;We wanted to make an album that benefited this great cause but also one whose songs related to each other in a relevant way,&quot; says Crosby. Mission accomplished.","torrent":{"xt":"urn:btih:708d24ba2d8e26139aabf97e2c732f1ff5f02d95","amp;dn":"The+Cake+Sale+-+The+Cake+Sale+%5B2006%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"708d24ba2d8e26139aabf97e2c732f1ff5f02d95","infoHashBuffer":{"type":"Buffer","data":[112,141,36,186,45,142,38,19,154,171,249,126,44,115,47,31,245,240,45,149]},"announce":[],"urlList":[]}}