{"title":"fbe38a0813bfea3688304c1725b9fc77c5aea14c","uid":10442786,"size":380698702,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:711c5c0104b7c17faa7db06c1d45a61a85ddf9b9&amp;dn=fbe38a0813bfea3688304c1725b9fc77c5aea14c&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dickspic","files":-1,"time":1403917101,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Epitaph #267742\nCountry: USA\nYear: February 13, 2006\nGenre: Alternative/Indie Rock,Indie Rock,Post-Hardcore,Emo\nFormat: CD, Album,\n\n[b]\n\n1.\tYou Can Run, but We'll Find You (4:06)\n2.\tSurrender (4:47)\n3.\tMy Mannequin Can Dance (3:55)\n4.\tGoody, Like Two Shoes (7:09)\n5.\tMonsters (4:03)\n6.\tSay It Like You Mean It (4:21)\n7.\tPortrait (4:25)\n8.\tSinging Bridges (We All Fall) (5:11)\n9.\tFiction (3:25)\n10.\tWhat a Sight (4:27)\n11.\tI Wish You Were Here (15:45)\n\n\n\nSeeing as many bands are on-fire one album and completely fizzled out the next, it was almost too easy to expect next to nothing for Matchbook Romance's follow-up Epitaph release. Stories and Alibis was a decent album in the ranks of all the other post-hardcore/emo-esque records that came out in the early 2000s, but no song on that album could at all prepare listeners for the ambition the band showcases on Voices. What awaits unsuspecting ears is a moody, intense, dramatic, and orchestrated second full-length tour de force. From the awesomely creepy claymation-type exterior artwork to the shadowy atmosphere that permeates each song, this is one cohesive, dark record that manages to be quietly epic and ambitious without seeming too overdone and indulgent. Weary piano notes introduce the somber, stalker-themed &quot;You Can Run, But We'll Find You,&quot; a sweeping song that soon escalates to such lengths that visions of English rockers Muse become increasingly apparent. This comparison -- especially in Andrew Jordan's now richer, deeper vocal style -- will remain fresh in the mind as &quot;Surrender&quot; bursts next, one of the record's most straightforward rockers, guitars and drums briefly battling it out mid-song, before the soaring final chorus kicks in with &quot;Don't waste your breath/ Save your tears for somebody who believes.&quot; Lyrics hinting of deception, regret, fear, and love give a sense that Voices is the soundtrack to a disturbing romance movie where the night finds its subjects battling demons -- both in reality and in their heads. In this sense, Matchbook Romance has achieved a passionate urgency that makes their songs -- even the slower ones -- aggressive without having to rely on harsh breakdowns or screamy backgrounds. Almost halfway through the album, the memorable &quot;Monsters&quot; appears and proves to be a soaring, clap-happy anthem with eerie guitar picking that should have your flight instincts kicking in -- if only so much dancing wasn't going on instead. The addition of string sections brings a gentle, melancholy essence to many songs -- from the well-crafted, seven-minute &quot;Goody, Like Two Shoes&quot; to the affectionate, sun-emerging-from-behind-the-clouds, redemption love song of &quot;What a Sight.&quot; There's also a hidden acoustic song that surfaces around the 11:30 mark of the last track that, while not critical, is worth at least one listen through to finish things off. Unexpectedly, Matchbook Romance has managed with Voices to take the dramatic qualities of Muse and combine them with the smooth intensity of the Alkaline Trio and My Chemical Romance, distinctly reinventing themselves from emo novelties into genuine rock contenders. ","torrent":{"xt":"urn:btih:711c5c0104b7c17faa7db06c1d45a61a85ddf9b9","amp;dn":"fbe38a0813bfea3688304c1725b9fc77c5aea14c","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"711c5c0104b7c17faa7db06c1d45a61a85ddf9b9","infoHashBuffer":{"type":"Buffer","data":[113,28,92,1,4,183,193,127,170,125,176,108,29,69,166,26,133,221,249,185]},"announce":[],"urlList":[]}}