{"title":"Ambient Drone (More) - Stars Of The Lid, Aix Em Klemm, A. Cauthe","uid":4698652,"size":2033650149,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:71482fdcde4cd55b7dbfdf9f6a4112e1d7f8cf38&amp;dn=Ambient+Drone+%28More%29+-+Stars+Of+The+Lid%2C+Aix+Em+Klemm%2C+A.+Cauthe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"takepills","files":-1,"time":1233644723,"description":"Sleepytime ZZzzz....\n\nThis is a remake torrent of the other &quot;(ambient, drone) stars of the lid, andrew cauthen&quot; torrent without the doubled up stars of lid tracks (almost doubled the size whoops). Also an extra album from &quot;Aix Em Klemm&quot; (stars of the lid), and  Bonus tracks from Jonas Lindgren and friends. A great intro into ambient, drone music I'd say.  There are tons more artists out there (you are one of them) if you know of anyone else, write them in comments below and upload their stuff to pirate bay/ link it. Thanks! Enjoy!!!! :) \n\n8 ambient/ drone albums from &quot;Stars of the Lid&quot;\n1 ambient/ drone album from &quot;Aix Em Klemm&quot; (stars of the lid)\n7 ambient/ drone albums from &quot;Andrew Cauthen / Take Pills Die / Rumored High Speed Rail Hub&quot;\nAlso tracks from &quot;Jonas Lindgren/ Dead Letters Spell Dead Words/ Critikal&quot;\n\nStars Of The Lid:\n1. And The Refinement Of The Decline\n2. Avec Laudenum\n3. Carte-De-Visite\n4. Gravitational Pull Vs. The Desire For An Aquatic Life\n5. Music For Nitrous Oxide\n6. Per Aspera Ad Astra\n7. The Ballad Orchestra\n8. Tired Sounds Of Stars Of The Lid\n\nAix Em Klemm (Stars Of The Lid):\n1. Aix Em Klemm\n\nAndrew Cauthen / Take Pills Die / Rumored High Speed Rail Hub:\n1. [tpdm008] 02.10.08 Sweater Kittens\n2. [tpdm041] 04.04.29 The New You\n3. [tpdm063] 05.08.26 Standing Stone\n4. [tpdm069] 05.12.02 There Are Better Ways To Kill Yourself You Know\n5. [tpdm071] 05.12.25 Country\n6. [tpdm082] 07.04.16 Everyone Here Is Me\n7. [tpdm083] 07.04.23 Dead Sea Parting\n\nJonas Lindgren, Dead Letters Spell Out Dead Words, Normal Music, Ubeboet, Critikal, Militant Fields:\nVarious Tracks\n\n-- - - - -  - - - -- - - -- - - - - -- - - - -- - - -- - -- - -- - - -- - -- - --- - -- - - --  - - -- - - -- \n\nIf you would like to hear more, download logic express or cubase or whatever... and MAKE IT YOURSELF!!! (you can get it off thepiratebay)! Don't live vicariously through us, but do let us inspire you. This lifestyle is all about taking responsibility for yourself (diy) and doing what you feel. Stop condemning yourself and others and just start doing it. Love yourself, you are good enough. Skill is boring. Just start doing it, record it, and put it on the archive.org and pirate bay. Then when you get a feel for yourself, you can go even further to get out the take pills die death cult and quit your job and get a life! The world is waiting for you. \n\nAlso remember that when you do start actually producing life/ living things from your new alive reality, don't kill it or turn it back into take pills die death cult corpses by trying to sell it. Don't be a terrorist.  Give everything away for free, Wealthiest way to be. Maybe watch &quot;zeitgeist addendum&quot;. everything awesome is free. Buying is dying.\n\nOne more thing: If you have an internet connection at your house, don't be a terrorist, FREE IT! share it with everyone (no passwords). Or at least do this if you want the human race to survive. Nobody is going to steal your stuff or hack your things if you free your wifi, because #1 nothing you have really matters. #2 you are not that cool., nobody is, we are all dorks. It won't slow down your network. If it does than at least you are setting a good example and god will provide so don't worry. You will have more than enough. Be grateful and happy. Maybe stop locking your doors too. and unlock your mind and heart too. You have to give to receive. Your programmers may have made you hate yourself since birth, but now you can end that old shit programming. SHARE!!! This is all i ask. Do or die. Everyone deserves everything just for being alive. A chain is only as strong as it's weakest link. When you hate or hoard, you feed the demons. Working is for lazy people. Play is pay. http://whywork.org\n\n...Sweet Dreams :o ZZzzz...\n\nfor more vist Take Pills Die Records. IDM, Ambient, Avant Garde, Experimental Electronic Folk Music. Quit Your Job And Get A Life! http://takepillsdie.blogspot.com  and Tons more great stuff on http://archive.org \t\t ..thank you! :) \n","torrent":{"xt":"urn:btih:71482fdcde4cd55b7dbfdf9f6a4112e1d7f8cf38","amp;dn":"Ambient+Drone+%28More%29+-+Stars+Of+The+Lid%2C+Aix+Em+Klemm%2C+A.+Cauthe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71482fdcde4cd55b7dbfdf9f6a4112e1d7f8cf38","infoHashBuffer":{"type":"Buffer","data":[113,72,47,220,222,76,213,91,125,191,223,159,106,65,18,225,215,248,207,56]},"announce":[],"urlList":[]}}