{"title":"Kingsway Music Library Vol. 6","uid":15626550,"size":214393258,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:715e701a8957d311e2ccff2c1067594afba0fed5&amp;dn=Kingsway+Music+Library+Vol.+6&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"kulou00","files":17,"time":1471915239,"description":"The Kingsway Music Library is a collection of 15 original samples (hassle free sample clearance) created by multi genre music producer and composer, Frank Dukes. Frank has been composing original samples for the industries top producers including Jake One, Illmind, Cardiak, and more.\r\nNever have another record shelved due to sample clearance issues!\r\nThe Kingsway Music Library was created for the sample based producer, DJ, and beatmaker who wants original music to chop, flip, and arrange into headbanging beats without the hassle of digging through endless stacks of vinyl or worrying about sample clearance issues.\r\nThe Kingsway samples were recorded to 1 inch tape at 30 IPS, using an onslaught of rare vintage gear and instruments that the average beatmaker, producer, &amp; DJ don't have access to.\r\nAs a heavy collector of records and former sampling beat maker, Frank has an intimate knowledge of what makes a great sample and what makes a dope beat. These samples were created using extreme attention to detail specifically with the beatmaker and producer in mind.\r\nKingsway Music Library was composed and created using top notch studio musicians recorded through NEVE or NEVE equivalent pre-amps and mic'd using vintage mics (some of which are worth upwards of $20k). The recording and equipment used to create this unique music library is also the same equipment used on classic 60's psych, prog rock, and soul library music people have been sampling since the inception of hip hop music.\r\nInstruments featured in these samples:\r\nRare Vintage Synths: Yamaha CS80, Memorymoog, Korg Monopoly, Polymoog and more\r\nVintage Drums\r\nVintage Guitar Amps\r\nVintage Bass Amps\r\nVintage Basses\r\nVintage Guitars\r\nPianos\r\nBrass\r\nStrings, etc.\r\n*Samples will be delivered in HQ 16-Bit .WAV files","torrent":{"xt":"urn:btih:715e701a8957d311e2ccff2c1067594afba0fed5","amp;dn":"Kingsway+Music+Library+Vol.+6","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"715e701a8957d311e2ccff2c1067594afba0fed5","infoHashBuffer":{"type":"Buffer","data":[113,94,112,26,137,87,211,17,226,204,255,44,16,103,89,74,251,160,254,213]},"announce":[],"urlList":[]}}