{"title":"Materials Kinetics Fundamentals [2015] [PDF]","uid":12719155,"size":5998535,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:71df632bd96dcf8c3658b2e8b7ae6aad22ed7571&amp;dn=Materials+Kinetics+Fundamentals+%5B2015%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"NoctDeath","files":2,"time":1446975690,"description":"Title: Materials Kinetics Fundamentals \r\nAuthor: Ryan O'Hayre \r\nFormat: PDF \r\nHardcover: 312 pages \r\nPublisher: Wiley; 1 edition (January 12, 2015) \r\nLanguage: English \r\nISBN: 9781118972892 \r\n\r\n\r\nMaterials Kinetics Fundamentals is an accessible and interesting introduction to kinetics processes, with a focus on materials systems. Designed for the undergraduate student, this book avoids intense mathematics to present the theory and application of kinetics in a clear, reader-friendly way. Students are first introduced to the fundamental concepts of kinetics, with illustrated diagrams, examples, text boxes, and homework questions that impart a unified, intuitive understanding. Further chapters cover the application of these concepts in the context of materials science, with real-world examples including silicon processing and integrated circuit fabrication, thin-film deposition, carbon-14 dating, steel degassing, energy conversion, and more. Instructor materials including PowerPoint presentations, a test bank, and more are available through the companion website, providing a complete resource for the undergraduate materials science student.\r\n\r\nAt its core, kinetics deals with rates, telling us how fast something will take place for example, how fast water will evaporate, or how fast molten silicon will solidify. This book is designed to provide students with an introduction to kinetics' underlying principles, without rigorous math to distract from understanding. * Understand universally important kinetic concepts like diffusion and reaction rate * Model common kinetic processes both quantitatively and qualitatively * Learn the mechanisms behind important and interesting materials systems * Examine the behaviors, properties, and interactions of relevant solid materials\r\n\r\nThere are a large number of books on chemical kinetics, but there are far fewer that focus on materials kinetics, and virtually none that provide an accessible, introductory-level treatment of the subject. Materials Kinetics Fundamentals fills that need, with clear, detailed explanations of these universal concepts","torrent":{"xt":"urn:btih:71df632bd96dcf8c3658b2e8b7ae6aad22ed7571","amp;dn":"Materials+Kinetics+Fundamentals+%5B2015%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71df632bd96dcf8c3658b2e8b7ae6aad22ed7571","infoHashBuffer":{"type":"Buffer","data":[113,223,99,43,217,109,207,140,54,88,178,232,183,174,106,173,34,237,117,113]},"announce":[],"urlList":[]}}