{"title":"The Republic of Plato","uid":7271222,"size":1307590,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7239cac120f0799f896d518ddd6f7a76e00eee7d&amp;dn=The+Republic+of+Plato&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"djthiago1","files":-1,"time":1337057665,"description":"The Republic is a Socratic dialogue written by Plato around 380 BC concerning the definition of justice and the order and character of the just city-state and the just man. The dramatic date of the dialogue has been much debated and though it must take place some time during the Peloponnesian War, &quot;there would be jarring anachronisms if any of the candidate specific dates between 432 and 404 were assigned&quot;. It is Plato's best-known work and has proven to be one of the most intellectually and historically influential works of philosophy and political theory. In it, Socrates along with various Athenians and foreigners discuss the meaning of justice and examine whether or not the just man is happier than the unjust man by considering a series of different cities coming into existence &quot;in speech&quot;, culminating in a city ruled by philosopher-kings; and by examining the nature of existing regimes. The participants also discuss the theory of forms, the immortality of the soul, and the roles of the philosopher and of poetry in society.","torrent":{"xt":"urn:btih:7239cac120f0799f896d518ddd6f7a76e00eee7d","amp;dn":"The+Republic+of+Plato","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7239cac120f0799f896d518ddd6f7a76e00eee7d","infoHashBuffer":{"type":"Buffer","data":[114,57,202,193,32,240,121,159,137,109,81,141,221,111,122,118,224,14,238,125]},"announce":[],"urlList":[]}}