{"title":"Panzer.Corps-TiNYiSO","uid":6606368,"size":520316777,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7242b51d97c612bcf97a06dd15bbfd3d5438a336&amp;dn=Panzer.Corps-TiNYiSO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SnowCrash03","files":-1,"time":1313414311,"description":"TiNYiSO\n-=- Proudly Presents -=-\n\nPanzer Corps (c) Matrix Games\n\nRelease On : 19 July 2011 Disk Amount/Format : 1 CD ISO\nType of Game : Strategy Media Protection : Serial Auth\n\nRelease Information:\n\nPanzer Corps Wehrmacht is a brand new turn-based strategy game that\nreinvents a classic genre. Produced and developed by a team of experts\nand brought to perfection by a community of hundreds of fans, the game\nhas evolved over 2 years to become what can be defined as a modern\nclassic!\n\nSet in World War II, Panzer Corps Wehrmacht puts the player in charge of\nAxis armies, taking their core force with them through the entire war.\nThe use of combined-arms tactics requires each general to make use of the\nstrengths and exploit the weaknesses of their opponents.\n\nIts multiplayer mode, an improved version of Slitherine's award winning\nPBEM++ system, allows players to easily find opponents anywhere in the\nworld enjoy playing them with none of the hassle.\n\nPanzer Corps Wehrmacht is designed to replicate the feeling of a classic\nwargame, but brings it up to 21st century standards and to a whole new\ngeneration of gamers.\n\nFeatures:\n\n400 unit types, divided into 19 unit classes with 20 detailed parameters\nto indentify units abilities, 17 terrain types affecting gameplay in\nvarious way.\n\nCampaign: all 26 scenarios are combined into a large campaign tree with\nseveral entry points at various stages of the war. Depending on the\noutcome of each battle the player will be faced with different challenges\nand progress along different parts of the campaign tree;\n\nNations: all major and many minor nations are represented: Germany, Italy,\nPoland, France, Great Britain, USA, USSR, Norway, Belgium, Netherlands,\nAlbania, Romania, Greece and more.\n\nCore units that travel with you throughout the campaign gaining experience\nand that can be upgraded as new weapon technologies become available.\nUnits gain awards and heroes as they distinguish themselves.\n\nINSTALL:\nBurn/mount, install, type anything lots of 111's as serial during install,\ncopy crack, play!\n\n\n\nGreetz: LARGEiSO and MEDIUMiSO\n\n(C) E/dfs\n&quot; SIZE DOES NOT MATTER! &quot;","torrent":{"xt":"urn:btih:7242b51d97c612bcf97a06dd15bbfd3d5438a336","amp;dn":"Panzer.Corps-TiNYiSO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7242b51d97c612bcf97a06dd15bbfd3d5438a336","infoHashBuffer":{"type":"Buffer","data":[114,66,181,29,151,198,18,188,249,122,6,221,21,187,253,61,84,56,163,54]},"announce":[],"urlList":[]}}