{"title":"Bring it on 3 Again(2004NLsubs)2Lions-Team","uid":5095996,"size":2443994987,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:72c48ecc3e416fcd44730d49a15e21d0eae63e33&amp;dn=Bring+it+on+3+Again%282004NLsubs%292Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rocco64","files":-1,"time":1253571359,"description":"Verenigde Staten\nKomedie\n90 minuten\n\ngeregisseerd door Damon Santostefano\nmet Anne Judson-Yager, Bree Turner en Faune A. Chambers\n\n \n\nNederlands:\n\nZe was geweldig als cheerleader, maar nu gaat ze naar de universiteit, en daar wordt op een hoger niveau opgetreden. Ze krijgt een dikke ordner met regels en de aanvoerder van de cheerleaders maakt haar duidelijk dat als ze bereid is alles op te geven, dat ze dan mogelijk haar opvolgster wordt. Ze wil er aanvankelijk volledig voor gaan, maar als haar kamergenoot volledig wordt vernederd door de aanvoerder, besluiten ze samen uit het team te stappen en zelf een nieuw team op te richten voor andere sporten dan football.\nEen inwisselbaar vervolg op deel 1. Twee meiden gaan naar college, en willen ook bij het cheerleader team van de universiteit, dat al 7 jaar op rij kampioen werd. De Hoofd-Cheerleader voert een ijzeren schrikbewind uit op haar team als een soort drill-commandant van het leger. Het botst uiteraard al snel en de meiden besluiten hun eigen team op te richten en de compititie aan te gaan. De film kenmerkt zich net als deel ÃƒÂ©ÃƒÂ©n door goed akteerwerk, en veel ontzettend goed &quot;dance-moves&quot; waardoor je enerzijds een beld krijgt hoe fanatiek Amerikaanse meisjes opgaan in het &quot;cheerleaden&quot; en hoe ver het gaat dat ze daar ook de beste in zijn, anderzijds ook hoe de invloed van succes doordraaft richting sponsering van succesvolle (commerciele) doeleinden, ten koste van culturele zaken op zo'n universiteit. Ongeloofwaardig is dan wel dat de cultuur figuren die hun subsidie verliezen ten koste van het sportteam en de cheerleaders verolgens is het team van de meiden meedoen. Voor de rest gewoon een leuke film, die goed verteerbaar is.\n\n\nEngels:\n\nCollege newcomer Whittier tries out for and joins her new college cheerleading squad to relive her high school days as head cheerleader. But when she and her best friend Monica are unable to stand being around the tyrannical and snobbish squad captain, Tina, Whittier and Monica quit and vow to form their own cheerleading squad made up of college campus misfits and social outcasts for a competition to see which squad will represent the college for the national cheerleader championship.\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DivX \nBron : Retail\n \nOndertitels : Nederlands (instelbaar)\n \nGenre : Komedie\n\n\n \nDeel 1 vind je hier : &lt;a href=&quot; http://www.2lions.ons-forum.nl/viewtopic.php?f=35&amp;t=12625&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.2lions.ons-forum.nl/viewtopic.php?f=35&amp;t=12625&lt;/a&gt;\n\n\n\n\n\n\n\n\n************************************************\n\nKlik op ÃƒÂ©ÃƒÂ©n van de plaatjes om te downloaden. Veel Plezier.\n\n************************************************\n\n** Na het downloaden blijven seeden A.U.B \n** After downloading seed please\n\n\n\n\n\n******************************************\n\nBrought to you by Rocco van\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n******************************************[/center]","torrent":{"xt":"urn:btih:72c48ecc3e416fcd44730d49a15e21d0eae63e33","amp;dn":"Bring+it+on+3+Again%282004NLsubs%292Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72c48ecc3e416fcd44730d49a15e21d0eae63e33","infoHashBuffer":{"type":"Buffer","data":[114,196,142,204,62,65,111,205,68,115,13,73,161,94,33,208,234,230,62,51]},"announce":[],"urlList":[]}}