{"title":"Some kind of wonderful[1987][DvDrip][Eng][MustWatch][BandwidthWa","uid":4123173,"size":733983602,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:72e32c0d60789f1c4eb8cdb4a4e53cf2db177fdc&amp;dn=Some+kind+of+wonderful%5B1987%5D%5BDvDrip%5D%5BEng%5D%5BMustWatch%5D%5BBandwidthWa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"bandwidthwasters","files":2,"time":1207664970,"description":"IMDB Rating : 6.6/10 (6,214 votes)\n\n\nA young tomboy, Watts, finds her feelings for her best friend, Keith, run deeper than just friendship when he gets a date with the most popular girl in school. Unfortunately, the girl&amp;#039;s old boyfriend, who is from the rich section of town, is unable to let go of her, and plans to get back at Keith.\n\n\nUser Comments on IMDB\n\nIt&amp;#039;s refreshing to have a movie about teens in love that doesn&amp;#039;t rely upon sex to gain the viewer&amp;#039;s interest. I love this movie, have probably seen it a a few dozen times, especially in the original, unedited version (that wasn&amp;#039;t shortened to fit into a two-hour TV time-slot). It&amp;#039;s a classic story, but told from a timeless perspective---the movie first ran in 1987, yet there&amp;#039;s extremely little in it that would make it seem &quot;dated.&quot;\n\nMary Stuart Masterson is, as always, superb in her performance. While this is one of her early films, it shows her enormous ability and potential. She plays a playful, feisty, street-smart character that also has a sensitive, shy, and deeply loving side. Mary Stuart&amp;#039;s kissing scene is one of the most wonderfully romantic and intense kissing scenes on film that I&amp;#039;ve seen, yet it has an innocent quality that makes it all the more special.\n\nEric Stoltz and Lea Thompson give excellent performances as well, with good acting and both are able to highlight dialogue with subtle nuances. However, I feel that Mary Stuart&amp;#039;s character is the most interesting and emotionally sensitive, enough that she&amp;#039;ll bring tears to your eyes. This is an excellent film. It came out at a time when there were a lot of teen movies (Pretty in Pink, The Breakfast Club, etc.), but this is a story that never grows old and is a pleasure to watch again.\nWas the above comment useful to you?","torrent":{"xt":"urn:btih:72e32c0d60789f1c4eb8cdb4a4e53cf2db177fdc","amp;dn":"Some+kind+of+wonderful%5B1987%5D%5BDvDrip%5D%5BEng%5D%5BMustWatch%5D%5BBandwidthWa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72e32c0d60789f1c4eb8cdb4a4e53cf2db177fdc","infoHashBuffer":{"type":"Buffer","data":[114,227,44,13,96,120,159,28,78,184,205,180,164,229,60,242,219,23,127,220]},"announce":[],"urlList":[]}}