{"title":"AFRICA - Drums of Death - African Voodoo Funeral (Ghana)","uid":4389154,"size":58941996,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:72ec8cd8e97cb93a4623abf49cbf51942b4bf202&amp;dn=AFRICA+-+Drums+of+Death+-+African+Voodoo+Funeral+%28Ghana%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starinar","files":9,"time":1221077474,"description":"CLICK ON starinar TO GET MORE TRIBAL AND INDIGENOUS MUSIC.\nBE A MEMBER OF A GLOBAL SeeDeRS TRIBE. MoRE CoMING SooN. ENJoY!\n\n\nDrums of Death (African Voodoo Funeral)\n\nSELECTIONS: PARAGO / AKOM / ADOVA 1 / ADOVA 2 / ATKOWE 1 / ATKOWE 2 / ATKOWE 3\nThese field recordings, captured by Mark Seidenfeld in November of 1996 during \na Vaudou (Voodoo) funeral in the African village of Sogakope, Ghana, does a \ngreat service to the western world by bringing the intensity, anger, joy and \npure passion of the ceremony to western culture. The emotions conjured by \nthese recordings is difficult to express, suffice it to say that the somber \ntone of a European funeral or even the joyous wail of a New Orleans jazz funeral \nare indeed worlds away. Seidenfeld was only permitted to record these wonderful \nperformances on the condition that he participate in the ceremony, and the results \nare perhaps the best of the tribal field recordings that I've encountered. A row \nof seven drummers are complimented by the village women who join in on wooden \nclappers, poignantly augmented by the angry wails of their native death songs. \nThe large main drum is the source of improvisation and is played by tow men; \none on the skin and the other beating sticks on the drum's wooden body. A treasure \nfor those interested in the ways and origins of Voodoo, or for anyone with the \ndesire to explore the brilliant music of other cultures. (Japanese Import)\n\n========================================================================== \n\n   \nDrums of Death\n1997   \n\n#  Song Name     \n1  Parago (5:33)      \n2  Akom (5:33)      \n3  Adova 1 (4:24)      \n4  Adova 2 (2:08)      \n5  Atokwe 1 (5:47)      \n6  Atokwe 2 (2:54)      \n7  Atokwe 3 (22:43)      \n \n \n Album Review   \n \nNot the sort of thing one would immediately identify with John Zorn, this superb \nrecording was nonetheless issued on his Avant label in 1997. It consists of field recordings made the previous year by Mark Seidenfeld during a funeral procession of the Ewe people in central Ghana, and is a hugely exciting helping of riveting, passionate drum work. There are seven primary drummers accompanied by many villagers on small percussion and occasional vocalizing. While five of the drummers maintain traditional (and usually quite complex) rhythms, the two manning the largest drum are free to improvise, one on the skin, one on its wooden sides. The firestorm these musicians are able to conjure up can be nothing short of incredible, with intricate rhythmic matrices getting subsumed into passionate pounding that explodes orgasmically. The disc leads off with six intense, shorter pieces before concluding with a 23-minute marathon that will leave the listener breathless. The rhythmic and timbral richness in works like this should be required listening for any aficionado of &quot;the beat&quot; -- here is the beat in all its uncluttered, raw splendor. Highly recommended. ~ Brian Olewnick, \nAll Music Guide  \n \n Album Credits    \n \n Ikue Mori  Design  \n Kazunori Sugiyama  Associate Producer  \n Allan Tucker  Mastering  \n John Zorn  Executive Producer  \n Mark Seidenfeld  Producer, Engineer, Liner Notes, Photography  \n Drums Of Death  Main Performer  \n","torrent":{"xt":"urn:btih:72ec8cd8e97cb93a4623abf49cbf51942b4bf202","amp;dn":"AFRICA+-+Drums+of+Death+-+African+Voodoo+Funeral+%28Ghana%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72ec8cd8e97cb93a4623abf49cbf51942b4bf202","infoHashBuffer":{"type":"Buffer","data":[114,236,140,216,233,124,185,58,70,35,171,244,156,191,81,148,43,75,242,2]},"announce":[],"urlList":[]}}