{"title":"Zenith 2016 - Tom Horn","uid":10333213,"size":2715506,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:739bcd473a7584eaa573e66b28466d5700184a18&amp;dn=Zenith+2016+-+Tom+Horn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"starxteel","files":1,"time":1402438749,"description":"What even the best researchers of the Illuminati and veiled fraternities such as the Freemasons were never able to fully decipher is spelled out herein for the first time. The power at work behind global affairs and why current planetary powers are hurriedly aligning for a New Order from Chaos is exposed. Most incredibly, one learns how ancient prophets foresaw and forewarned of our time.\nInternationally acclaimed investigative author Thomas Horn uncovers what you can expect to unfold in the coming days, and, more importantly, what you can do to be prepared for the arrival of the kingdom of Antichrist.\n\nAbout the author:\nTom Horn is an internationally recognized lecturer, radio host and best selling author of several books including his newest books, Petrus Romanus: The Final Pope Is Here, Forbidden Gates and Apollyon Rising 2012. He is a well-known columnist whose articles have been referred to by writers of the L. A. Times Syndicate, MSNBC, Christianity Today, New Man Magazine, World Net Daily, News Max, White House Correspondents and dozens of newsmagazines and press agencies around the globe. He has been interviewed by US Congressmen and Senators on his findings as well as featured repeatedly in major media including top-ten talk shows, America's Morning News for The Washington Times, The 700 Club, The Harvest Show, Coast to Coast AM, Prophecy in the News, and the Southwest Radio Church to name a few. Thomas received the highest degree honorary doctorate bestowed in 2007 from legendary professor Dr. I.D.E. Thomas for his research into ancient history, and has been endorsed by such national leaders as Dr. James Kennedy.","torrent":{"xt":"urn:btih:739bcd473a7584eaa573e66b28466d5700184a18","amp;dn":"Zenith+2016+-+Tom+Horn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"739bcd473a7584eaa573e66b28466d5700184a18","infoHashBuffer":{"type":"Buffer","data":[115,155,205,71,58,117,132,234,165,115,230,107,40,70,109,87,0,24,74,24]},"announce":[],"urlList":[]}}