{"title":"Working For A Nuclear Free City - Jojo Burger Tempest (2010)","uid":6523423,"size":611603528,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:73d604c7d2cc6d4d30dcd81c9b4000012e5b9034&amp;dn=Working+For+A+Nuclear+Free+City+-+Jojo+Burger+Tempest+%282010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"insinuendo","files":23,"time":1310074606,"description":"Working For A Nuclear Free City - Jojo Burger Tempest (2010) [FLAC]\n\nMusic : Indie : Lossless\n\nReview\nby Ned Raggett\nThis Manchester-based quartet's excellent debut, in its own way, falls into the line of noted post-punk luminaries that the city has been known for over the years. Unlike the recent rash of groups that feel content to only rework the gothier monumentalism of Joy Division and its many followers, though, Working for a Nuclear Free City take more overt cues from the dance side of the city's history -- not just Section 25 and A Certain Ratio, but the full-on industrial hysteria typified by the Hacienda. After a brief atmospheric introduction, the album kicks into mesmerizing full gear with &quot;Troubled Son,&quot; at once as thick and druggy as Happy Mondays at its most gone and as crisp and pulsing as early 808 State. On balance the album is a captivating revisioning of the dance/rock promise of the city's late-'80s sound if it followed a much different but parallel path to Oasis' rock-uber-alles approach -- in particular, the percussion is multifaceted and often dramatic in place of a stolid if powerful plod. The circular breakdown concluding &quot;Dead Fingers Talking&quot; and the quick, skittering full-on funk drumming on &quot;Innocence&quot; (an even better take on psych/funk than the Stone Roses' ultimate high point &quot;Begging You&quot;) in particular shows this utterly welcome approach. When they do work in a more straightforward rock mode, the results can be equally gripping -- the flow and charge of &quot;Over&quot; is just astonishing, the best reworking of early Spiritualized's sound since that band itself. For all that, straight-up atmospherics aren't forgotten either, with numerous short pieces softly breaking the album's flow, sometimes instrumental and sometimes, as with &quot;England,&quot; with a few quick vocal parts. &quot;Quiet Place,&quot; meanwhile, is a contextual surprise and a half, a sweet and serene combination of softly sung vocals and electronica/shoegaze that finds its own unique place.\n\n &lt;a href=&quot; http://www.allmusic.com/album/working-for-a-nuclear-free-city-r861572/review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/album/working-for-a-nuclear-free-city-r861572/review&lt;/a&gt;\n\n\n\nDisc One\n1. Do A Stunt 2:44\n2. Silent Times 3:18\n3. Autoblue 3:30\n4. Alphaville 4:39\n5. Pachinkno 3:36\n6. Faster Daniel Faster 3:01\n7. A Black Square With Four Yellow Stars 2:03\n8. Black Rivers 3:50\n9. Float Bridges 3:07\n10. The King And June 2:06\n11. B.A.R.R.Y. 4:05\n12. Little Lenin 3:36\n13. Inokashira Park 2:42\n14. Low 3:45\n15. Burning Drum 3:11\n16. Brown Owl 3:31\n17. Buildings 2:16\n\nDisc Two\n1. Jojo Burger Tempest","torrent":{"xt":"urn:btih:73d604c7d2cc6d4d30dcd81c9b4000012e5b9034","amp;dn":"Working+For+A+Nuclear+Free+City+-+Jojo+Burger+Tempest+%282010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73d604c7d2cc6d4d30dcd81c9b4000012e5b9034","infoHashBuffer":{"type":"Buffer","data":[115,214,4,199,210,204,109,77,48,220,216,28,155,64,0,1,46,91,144,52]},"announce":[],"urlList":[]}}