{"title":"Cannabis Collection - Super High Me","uid":7360542,"size":4010182656,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:771dc87eeaa6374a7c95f7cb623b4e23fc0ba24d&amp;dn=Cannabis+Collection+-+Super+High+Me&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GRNS3","files":-1,"time":1339947599,"description":"\nThe Cannabis Collection - a series of educative and entertaining info dvd's\n\nPlease enjoy, share with friends and seed :)\n\n\nSuper High Me\n\nSuper High Me is a 2007 documentary film about the effects of smoking cannabis for 30 days. The documentary stars comedian Doug Benson. The documentary's name and its poster are plays on the 2004 documentary Super Size Me.\nSuper High Me documents Benson avoiding alcohol and cannabis for a cleansing period and then smoking and otherwise consuming cannabis every day for 30 days in a row.[1] Benson says that Super High Me is &quot;Super Size Me with cannabis instead of McDonalds&quot;.[2] The film also includes interviews with marijuana activists, dispensary owners, politicians and patients who are part of the medical marijuana movement. The DVD was released on April 20, 2007.\n\nBenson took various tests to gauge his physical and mental health both before 30 days of not smoking cannabis, and after doing so for 30 days straight. Benson's physician concluded that the effects on Benson's health from his use of cannabis were generally inconsequential. The greatest changes noted were in his weight (Benson gained eight pounds during his &quot;high&quot; month). His sperm count actually increased, contrary to the expectations of medical studies. His overall score on an SAT test increased (mostly verbal), although, it was mentioned that his mathematical skills were significantly reduced. The one effect that Benson was surprised at by the end of the smoking month was that he was sure that he would be sick of smoking cannabis for a continuous extended period and that he felt like he was going to need an extended break afterwards. He instead felt perfectly fine with his continued casual smoking with no apparent, acquired disdain of any kind. In the end credits, the movie was dedicated to Michelle Benjamin, a friend of the filmmakers' who was killed in a traffic accident involving a drunk driver.\n\nCheck this account for updates regularly :)\n","torrent":{"xt":"urn:btih:771dc87eeaa6374a7c95f7cb623b4e23fc0ba24d","amp;dn":"Cannabis+Collection+-+Super+High+Me","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"771dc87eeaa6374a7c95f7cb623b4e23fc0ba24d","infoHashBuffer":{"type":"Buffer","data":[119,29,200,126,234,166,55,74,124,149,247,203,98,59,78,35,252,11,162,77]},"announce":[],"urlList":[]}}