{"title":"Alfie 1966 Michael Caine DvDRip x264 AAC-miKem","uid":8514875,"size":1063823946,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:777b913471a99427cefcdebd09d6a1c332831572&amp;dn=Alfie+1966+Michael+Caine+DvDRip+x264+AAC-miKem&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"mikem777","files":6,"time":1369697784,"description":"Alfie (1966)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0060086&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0060086&lt;/a&gt;\n\nSAMPLE file included\n\nFor Alfie, the only real life is sex life; only then can he kid himself he is living. Sex is not used as the working-class boy's way to 'the top'. Executive status has no appeal for Alfie. Nor has class mobility. He is quite content to stay where he is, as long as the 'birds' are in 'beautiful condition', as he assures us they are in one of the candid, over-the-shoulder asides to the camera which the film carries over from &quot;Tom Jones&quot;. The film shows how much of the 'swinging 60's' quality of London life was a male creation, and through the dominance of the fashion photographers, a male prerogative.\n\nGreat period piece dealing with universal questions. This movie has long been one of my favorites. It is one of the few quintessentially &quot;60's&quot; movies, using filming methods that were quite unusual at the time (the direct dialogue between the main character and the audience, for example). While its style is clearly confined to that era, and England in particular, its subject matter is profoundly universal. The subjects of love and devotion, or more accurately their opposites, philandering and infidelity, are treated with a unique sensitivity in the script. Michael Caine is at once both lovable and detestable, perfectly characterizing the age-old dynamic between the need for love and the need for physical pleasure. But this is not a feel-good movie, it is a movie that explores the difficult decisions that confront a person as they mature in both life and love, and it conveys the basic feelings that are present in all human beings, regardless of outward appearances.\n\nH.264, 720 x 434, Millions\nAAC, 2 channels, 48000 Hz\n1,287.54 kbit/s\n1024 x 434 pixels (Actual)\nRuntime: 114 min \n\ntags: comedy, drama, sex, london, england, courage, promiscuity, relationship, british, Michael Caine, 1960s","torrent":{"xt":"urn:btih:777b913471a99427cefcdebd09d6a1c332831572","amp;dn":"Alfie+1966+Michael+Caine+DvDRip+x264+AAC-miKem","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"777b913471a99427cefcdebd09d6a1c332831572","infoHashBuffer":{"type":"Buffer","data":[119,123,145,52,113,169,148,39,206,252,222,189,9,214,161,195,50,131,21,114]},"announce":[],"urlList":[]}}