{"title":"Bread - Series 5","uid":8847670,"size":4535232654,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:786c455b4e259a0e6e8943e976ca0a9edfc44b54&amp;dn=Bread+-+Series+5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"theleatherjacket","files":13,"time":1377442467,"description":"Thought I would give people a bank holiday treat, here's series 5 in all it's glory. The episodes are complete but the Xmas special is missing, I don't think I've ever seen a repeat broadcast.\n\nplease do yourselves and everyone else a favour, seed at least once and give the torrent a chance, we all know how hard these episodes are to find!\n\nWhen series 5 is up and running I will get to the rest, i have limited bandwidth so seed it or lose it! I never re-seed!\n\nAll episodes are tv-rips, but good quality and sound, no-one should be disappointed.\n\nEnjoy!\n\n(any requests for rare British stuff, let me know)\n\nEpisodes:\n\n1. First Broadcast: Sun 10th September 1989\n\nAdrian becomes a hero by accident and, despite warnings, starts to embellish his role in the proceedings. Billy is troubled by his forthcoming divorce, Joey gets a worrying letter from the Inland Revenue and Aveline has a check up after failing to become pregnant...\n\n2. First Broadcast: Sun 17th September 1989\n\nJoey visits the taxman to plead his case but his words fall on deaf ears, Aveline suggests to Oswald that he should have a sperm count and Billy attends court to get his divorce. But all troubles are briefly forgotten when the family go to the airport to meet Jack who has returned home from America.\n\n3. First Broadcast: Sun 24th September 1989\n\nJack soon gets back into the swing of buying and selling but the piano he buys causes more trouble than it is worth. Joey tells his mother about his debt and the family agree to pull together to help him. Meanwhile, Aveline is making every effort to get pregnant and creating problems for Oswald.\n\n4. First Broadcast: Sun 1st October 1989\n\nWhen Adrian helps Jack to recover his stolen piano, they come into conflict with Yizzel and his mate - once again. Lilo Lill has taken a job in service to be near Freddie, whilst Freddie has sold his flat in order to pay Joey's debt.\n\n5. First Broadcast: Sun 8th October 1989\n\nAveline is causing concern for everybody as she continues to believe in her phantom pregnancy. Adrian is concerned that Magdalena has not replied to his letter, Billy hears that Julie has a new lover and Jack goes for a job as a handyman at the 'big house'...\n\n6. First Broadcast: Sun 15th October 1989\n\nMongy, the family dog, has been accused of biting a little girl and the police are called in to investigate. Billy changes his image in order to make Julie jealous, Jack gets a bumper wage packet thanks to his eccentric boss and Oswald is being pressurised to have a fertility test.\n\n7. First Broadcast: Sun 22nd October 1989\n\nAveline has good news about Oswald's sperm count, Adrian finally hears from Magdalena and Joey's loyalty to the family drives a bigger wedge between him and Roxy. Meanwhile, Shifty is in trouble with Yizzel and his mate over money, so he steals their car and heads for London - again!\n\n8. First Broadcast: Sun 29th October 1989\n\nJack arrives home drunk and is whisked in to Grandad's house to avoid a confrontation with his mother ... and the vicar! Aveline decides to put her desire for a baby on hold while she returns to modelling and Nellie meets her admirer in the park.\n\n9. First Broadcast: Sun 5th November 1989\n\nJack inherits Mrs. Cumberland's dog in her will but the animal is causing quite a stir in the Boswell household. When it disappears Jack becomes the benificiary of a piece of good fortune - in the shape of Rachael. Billy decides he needs a new look and Freddie gets a new problem to deal with when Lilo Lill announces she has stopped taking the pill!\n\n10. First Broadcast: Sun 12th November 1989\n\nJack is smitten with Rachael, Adrian is meeting Magdalena at the airport, Billy is trying to impress Julie with his new look and Joey is away with Roxy. Mrs Boswell is happy for her sons but has a word of warning for them all ... meanwhile Aveline has become empowered and Lilo Lill has taken over the allotment!\n\n11. First Broadcast: Sun 19th November 1989\n\nAdrian announces that he is having a second book of poems published but his news is trumped by Aveline's announcement that she is in the &quot;glossies&quot;. Their good news is overshadowed when Billy has to be rushed to hospital with a deep cut to his finger.\n\n12. First Broadcast: Sun 26th November 1989\n\nAveline is finally pregnant but the timing is not to her liking now she has made the &quot;glossies&quot;. Meanwhile, Grandad has been robbed, but his possessions are replaced when all the family rally round.\n\n13. First Broadcast: Sun 3rd December 1989\n\nIt's Ma Boswell's birthday and she waits by the phone for Derek to ring and make her day. A surprise visit from Roxy causes Joey problems but he is surprised by his mother's reaction when he finally admits the relationship to her.","torrent":{"xt":"urn:btih:786c455b4e259a0e6e8943e976ca0a9edfc44b54","amp;dn":"Bread+-+Series+5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"786c455b4e259a0e6e8943e976ca0a9edfc44b54","infoHashBuffer":{"type":"Buffer","data":[120,108,69,91,78,37,154,14,110,137,67,233,118,202,10,158,223,196,75,84]},"announce":[],"urlList":[]}}