{"title":"Say Anything - Say Anything (2009) [FLAC] ","uid":6327837,"size":345088584,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7928a6844f43f5d63a85538585767a1a87f95f9a&amp;dn=Say+Anything+-+Say+Anything+%282009%29+%5BFLAC%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1303174453,"description":"Clocking in at 46 minutes -- nearly half the running time of 2007s In Defense of the Genre -- Say Anythings fourth album is both trim and tuneful, with Max Bemis devoting more focus than ever to the tightening of his quirky, unchained pop songs. &quot;Focus&quot; is a relative term, of course; the frontman still finds time to run wild throughout this disc, rearranging conventional song structures like Picasso and sampling from multiple genres -- emo, rock, punk-pop, R&amp;B, even doo wop -- with greedy glee. The choruses boast stronger hooks this time around, though, which lends heft to Say Anythings musical mish-mash, and the bands willingness to break rules is what makes this album so refreshing. Arriving at the tail-end of 2009, a year in which most emo-pop was compressed, polished, and wholly indebted to Top 40 radio, Say Anything is as unpredictable as they come, boasting 13 tracks that sound dangerous and delicious at the same time. &quot;There are babies with guns beheading their friends in shopping malls around the world, yet somehow the Kings of Leon still have time to write songs about girls,&quot; Bemis sing at the beginning of &quot;Mara and Me,&quot; adding &quot;I dont suck much less&quot; in a guttural scream. Its this combination of self-loathing and pop culture critique that fuels most of the album, and Bemis distances himself from his contemporaries by briefly embracing their tricks -- the palm-muted guitar chords, the &quot;whoa oh oh&quot; background vocals, the dramatic delivery -- before turning them on their heads, whether that means adding pizzicato strings to &quot;Do Better&quot; or circus-styled keyboard to the aforementioned &quot;Mara and Me.&quot; This is an impulsive album, an odd piece of work that manages to be puzzling without alienating the listener.\n\nReleased: 2009\nGenre: Rock\nStyle: Indie, Alternative\nQuality: Lossless\nCodec: FLAC\n\nTracks:\n\n 1. Fed to Death\n 2. Hate Everyone\n 3. Do Better\n 4. Less Cute\n 5. Eloise\n 6. Mara and Me\n 7. Crushd\n 8. She Wont Follow You\n 9. Cemetery\n 10. Property\n 11. Death for My Birthday\n 12. Young Dumb and Stung\n 13. Ahh...Men","torrent":{"xt":"urn:btih:7928a6844f43f5d63a85538585767a1a87f95f9a","amp;dn":"Say+Anything+-+Say+Anything+%282009%29+%5BFLAC%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7928a6844f43f5d63a85538585767a1a87f95f9a","infoHashBuffer":{"type":"Buffer","data":[121,40,166,132,79,67,245,214,58,133,83,133,133,118,122,26,135,249,95,154]},"announce":[],"urlList":[]}}