{"title":"Design in the usa (Art History).pdf","uid":9253925,"size":15826351,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7b35b683ddfc659b8670fc54557e9d2bdfb7c4a2&amp;dn=Design+in+the+usa+%28Art+History%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"STBGD","files":-1,"time":1385518292,"description":"Series: Oxford History of Art\n252 pages\nFormat: pdf\nPublisher: Oxford University Press, USA (July 28, 2005)\nLanguage: English\nISBN-10: 0192842196\nISBN-13: 978-0192842190\n\nFrom the Cadillac to the Apple Mac, the skyscraper to the Tiffany lamp, the world in which we live has been profoundly influenced for over a century by the work of American designers. But the product is only the end of a story that is full of fascinating questions. What has been the social and cultural role of design in American society? To produce useful things that consumers need? Or to persuade them to buy things they don't need? Where does the designer stand in all of this? And how has the role of design in America changed over time, since the early days of the young Republic?\nJeffrey Meikle explores the history of American design, from the hand-crafted furniture and artifacts of the early nineteenth century, through the era of industrialization and the mass production of the machine age, to the information-based society of the present, covering everything from the Arts and Crafts movement to Art Deco, modernism to post-modernism, the MOMA to the Tupperware bowl. Beautifully illustrated, Design in the USA also includes suggestions for further reading, a timeline, and a list of relevant museums and web sites. It is an excellent source of information for anyone seeking to uncover the imagination and industry behind American design.","torrent":{"xt":"urn:btih:7b35b683ddfc659b8670fc54557e9d2bdfb7c4a2","amp;dn":"Design+in+the+usa+%28Art+History%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b35b683ddfc659b8670fc54557e9d2bdfb7c4a2","infoHashBuffer":{"type":"Buffer","data":[123,53,182,131,221,252,101,155,134,112,252,84,85,126,157,43,223,183,196,162]},"announce":[],"urlList":[]}}