{"title":"Secret Wars v1 Repacked No Ads [drknark]","uid":6334236,"size":212530564,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7bdac84adc3c0df4e589b6d5f2e63bf8da215412&amp;dn=Secret+Wars+v1+Repacked+No+Ads+%5Bdrknark%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"drknark83","files":-1,"time":1303403007,"description":"Secret Wars v1 Repacked No Ads\n\nThe series was conceived by Marvel Comics' Editor-in-chief Jim Shooter:\n\n    Kenner had licensed the DC Heroes. Mattel had He-Man, but wanted to hedge in case superheroes became the next big fad. They were interested in Marvel's characters, but only if we staged a publishing event that would get a lot of attention, and they could build a theme around. Fans, especially young fans often suggested to me 'one big story with all the heroes and all the villains in it', so I proposed that. It flew. Mattel thought that kids responded well to the word &quot;secret&quot;, so after a couple of working names bit the dust, we called the story 'Marvel Super Heroes Secret Wars'.'\n\nCrossover titles include The Amazing Spider-Man; Avengers; Captain America; Hulk; Iron Man; The Thing; Fantastic Four; Marvel Team-Up; Thor and Uncanny X-Men\n\nRepacked: Changed all names of images contained in CBR archives to be consistent, to make sure all readers will get them all in the correct order. Removed duplicate double pages. Combined split 2-page spreads. All files packed in CBR format. Ads removed. \n\nAll files sourced from the Complete Marvel Chronology Project, courtesy of PeteThePIPster.\n\nAll files are named with year and month of release, if you put my packs in the same folder you will automatically have a chronological collection.\n\nTAKING REQUESTS: PM your Marvel requests to drknark at\n\nFormat: CBR\nPublisher: Marvel\nRelease Dates: May 1984 - Apr 1985\nIssues: #1-#12","torrent":{"xt":"urn:btih:7bdac84adc3c0df4e589b6d5f2e63bf8da215412","amp;dn":"Secret+Wars+v1+Repacked+No+Ads+%5Bdrknark%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bdac84adc3c0df4e589b6d5f2e63bf8da215412","infoHashBuffer":{"type":"Buffer","data":[123,218,200,74,220,60,13,244,229,137,182,213,242,230,59,248,218,33,84,18]},"announce":[],"urlList":[]}}