{"title":"Disney movie - Candleshoe (1977) Jodie Foster","uid":4512308,"size":731998255,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7c6271c8f314d02f8f31ccf99246c507fad11f03&amp;dn=Disney+movie+-+Candleshoe+%281977%29+Jodie+Foster&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"cowboy23","files":2,"time":1226834701,"description":"Another great disney adventure movie from the 70&amp;#039;s, if you haven&amp;#039;t seen it I highly recommend it.\n\nPLOT-\n\nCon-artist, Harry Bundage discovers that there is a great treasure located somewhere around the residence where Lady St. Edmund lives - the estate of &quot;Candleshoe&quot;.\n\nHarry recruits American Jodie Foster, who until then was a street kid, into the plot employing her to pose as Lady St. Edmund&amp;#039;s estranged granddaughter. Lady St. Edmund, however, is poor and owes money in back taxes to the government. Priory, her butler (who is forced to pose as a gardener and gentleman Colonel), as well as some local orphan children, help keep the estate finances one step ahead of the government by selling produce made on the estate. All of this happens under the nose of Lady St. Edmund. Initially Casey enters the con attempting to find the location of the treasure but, over time, her affections turn towards that of the household and Lady St. Edmund. She eventually joins them in attempting to undercover Lady St. Edmund&amp;#039;s treasure for the benefit of Candleshoe and not Bundage.\n\nThe four clues revealed in the hunt for the treasure are:\n\n* For the sunrise student there is treasure among books.\n* The paths of glory lead but to the grave. (A reference to the poem &quot;Elegy Written in a Country Churchyard&quot; by Thomas Gray.)\n* He followed the eclipse for riches and fame, and if ye would prosper, do ye the same.\n* Underfoot, in the great hall. Look high, look low, discover all. ","torrent":{"xt":"urn:btih:7c6271c8f314d02f8f31ccf99246c507fad11f03","amp;dn":"Disney+movie+-+Candleshoe+%281977%29+Jodie+Foster","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c6271c8f314d02f8f31ccf99246c507fad11f03","infoHashBuffer":{"type":"Buffer","data":[124,98,113,200,243,20,208,47,143,49,204,249,146,70,197,7,250,209,31,3]},"announce":[],"urlList":[]}}