{"title":"Colleen Ward et. al.- 2001 - Psychology of Culture Shock (386p)","uid":11285822,"size":2938844,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7d0e32af9022bd06f275b061a011df95610a2340&amp;dn=Colleen+Ward+et.+al.-+2001+-+Psychology+of+Culture+Shock+%28386p%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Inua1","files":1,"time":1414279132,"description":"Psychology Culture Shock \nby Ward, Colleen, Stephen Bochner, Furnham, Adrian - 2001\n\nCrossing cultures can be a stimulating and rewarding adventure. It can also be a stressful and bewildering experience. This thoroughly revised and updated edition of Furnham and Bochner's classic Culture Shock (1986) examines the psychological and social processes involved in intercultural contact, including learning new culture-specific skills, managing stress and coping with an unfamiliar environment, changing cultural identities and enhancing intergroup relations. \n\nThe book describes the ABCs of intercultural encounters, highlighting Affective, Behavioural and Cognitive components of cross-cultural experience. It incorporates both theoretical and applied perspectives on culture shock and a comprehensive review of empirical research on a variety of cross-cultural travellers, such as tourists, students, business travellers, immigrants and refugees. Minimising the adverse effects of culture shock, facilitating positive psychological outcomes and discussion of selection and training techniques for living and working abroad represent some of the practical issues covered.\n\nThe Psychology of Culture Shock will prove an essential reference and textbook for courses within psychology, sociology and business training. It will also be a valuable resource for professionals working with culturally diverse populations and acculturating groups such as international students, immigrants or refugees.\n\nISBN 0415162351 \nISBN13: 9780415162357","torrent":{"xt":"urn:btih:7d0e32af9022bd06f275b061a011df95610a2340","amp;dn":"Colleen+Ward+et.+al.-+2001+-+Psychology+of+Culture+Shock+%28386p%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d0e32af9022bd06f275b061a011df95610a2340","infoHashBuffer":{"type":"Buffer","data":[125,14,50,175,144,34,189,6,242,117,176,97,160,17,223,149,97,10,35,64]},"announce":[],"urlList":[]}}