{"title":"Michael Crichton, Richard Preston - 2011 - Micro (Unabridged)","uid":7171108,"size":199006520,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7d467626f778ed58d5206548a3a557fc7f9166b9&amp;dn=Michael+Crichton%2C+Richard+Preston+-+2011+-+Micro+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"WentloogWhix","files":106,"time":1333966020,"description":"Three men are found dead in a locked second-floor office in Honolulu. There is no sign of struggle, though their bodies are covered in ultra-fine, razor-sharp cuts. With no evidence, the police dismiss it as a bizarre suicide pact. But the murder weapon is still in the room, almost invisible to the human eye. In Cambridge, Massachusetts, seven graduate students at the forefront of their fields are recruited by a pioneering microbiology start-up company. Nanigen MicroTechnologies sends them to a mysterious laboratory in Hawaii, where they are promised access to tools that will open up a whole new scientific frontier. But this opportunity of a lifetime will teach them the true cost of existing at the cutting-edge...The group becomes prey to a technology of radical, unimaginable power and is thrust out into the teeming rainforest. Armed only with their knowledge of the natural world, the young scientists face a hostile wilderness that threatens danger at every turn. To survive, they must harness the awe-inspiring creative - and destructive - forces of nature itself.\n\nMP3 32kbps Unabridged. Read by John Bedford Lloyd","torrent":{"xt":"urn:btih:7d467626f778ed58d5206548a3a557fc7f9166b9","amp;dn":"Michael+Crichton%2C+Richard+Preston+-+2011+-+Micro+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d467626f778ed58d5206548a3a557fc7f9166b9","infoHashBuffer":{"type":"Buffer","data":[125,70,118,38,247,120,237,88,213,32,101,72,163,165,87,252,127,145,102,185]},"announce":[],"urlList":[]}}