{"title":"A Brief History of the English Monarchs - Carolly Erickson (2012","uid":8998456,"size":532369828,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7d55d527e7ee218586f8dd5adf8b5184168df9db&amp;dn=A+Brief+History+of+the+English+Monarchs+-+Carolly+Erickson+%282012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Robin1966","files":4,"time":1380916150,"description":"Audio Books : History : MP3/Variable : English\n\n\nA Brief History of Brief Lives of the English Monarchs (Audiobook) By Carolly Erickson, read by Roger Davis\nUnabridged edition 2013 | 14 hours and 6 mins | ISBN: n/a | ASIN: B00BQLSIK6 | M4A@82 kbps | 507 MB\n\nThis audiobook contains sharp and enjoyable new portraits of the English kings and queens. Hunchbacked Richard III, the Virgin Queen Elizabeth I, the grieving widow Victoria, and the romantic who gave up his throne for love, Edward VIII - often the colourful kings and queens of England seem like mere caricature, while less familiar rulers like William IV or Henry VI have faded into the shadows of history.\n\nCarolly Erickson's sensitive and revealing portrayals bring new life to the big names, and light up some of our most neglected but intriguing royals. Here is the puny Charles I, nervous, tense and socially awkward, the frail slight Richard II, melancholic and sad, the homosexual James I with his handsome favourites, and the stuttering William II. Every monarch from William the Conqueror to Elizabeth II is covered. Award-winning historian Erickson tells the human stories with her characteristic blend of authenticity, engaging style and psychological insight.\n\n\nCarolly Erickson is a distinguished historian and the author of The First Elizabeth, Great Catherine, Alexandra, and a dozen other prize winning biographies. Her PhD in medieval history from Columbia University, New York, led her to six years as a college professor then to a career as a full-time writer.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:7d55d527e7ee218586f8dd5adf8b5184168df9db","amp;dn":"A+Brief+History+of+the+English+Monarchs+-+Carolly+Erickson+%282012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d55d527e7ee218586f8dd5adf8b5184168df9db","infoHashBuffer":{"type":"Buffer","data":[125,85,213,39,231,238,33,133,134,248,221,90,223,139,81,132,22,141,249,219]},"announce":[],"urlList":[]}}