{"title":"Dale brown, plan of attack","uid":4118835,"size":1022330368,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7d8695d3251ab7d45c4d141f5ccab0fe319a9489&amp;dn=Dale+brown%2C+plan+of+attack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"hater-hater","files":12,"time":1207442088,"description":"In Air Battle Force, Dale Brown introduced U.S. Air Force aerial warfare expert Major General Patrick McLanahan and his air combat unit of the future. Armed with a force of these robotic planes, the general and a handful of commandos were secretly deployed to the oil-rich nation of Turkmenistan to stop a Taliban invasion. And though the Americans won the battle, the war is far from over...\n\nTo punish McLanahan and his fleet of robot warplanes for their audacity, Russian president General Anatoliy Gryzlov decides to do the unthinkable: a sneak attack on America-unlike anything ever believed possible-that devastates her strategic air forces.\n\nMcLanahan has collected information that not only foretold the Russians&amp;#039; daring plan, but also gave him the data he needs to plan a counterstrike that could stop the Russian war machine dead in its tracks. But Patrick is no longer in charge of Air Battle Force, and the Russian sneak attack has left the embattled U.S. president with few options: retaliate with every weapon in his arsenal, even if it triggers a global thermonuclear war, or to a cease fire on Russia&amp;#039;s terms... ","torrent":{"xt":"urn:btih:7d8695d3251ab7d45c4d141f5ccab0fe319a9489","amp;dn":"Dale+brown%2C+plan+of+attack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d8695d3251ab7d45c4d141f5ccab0fe319a9489","infoHashBuffer":{"type":"Buffer","data":[125,134,149,211,37,26,183,212,92,77,20,31,92,202,176,254,49,154,148,137]},"announce":[],"urlList":[]}}