{"title":"Sex and Crime by Oliver Markus","uid":10130999,"size":3892305,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7d8af84b97c7148cb0634e4a6592b0846c3a9276&amp;dn=Sex+and+Crime+by+Oliver+Markus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GrumpyMac","files":-1,"time":1399882120,"description":"Sex and Crime is an autobiographical book that follows the incredible life of Oliver, a teenage hacker in Aachen, Germany, who is the victim of traumatic childhood abuse and suffers from PTSD. He falls in love with an American girl online, and spends many hours on the phone with her every day for a year, until he moves in with her in New York. After his crazy adventures as a New York cab driver, he becomes a successful cartoonist and goes on to be an Internet millionaire. A painful divorce throws him into a deep, almost suicidal depression, until he falls in love with a heroin addict and he ends up moving to Fort Myers, Florida. As his life spirals more and more out of control, Oliver gets sucked deeper and deeper into the dark world of drug addiction and prostitution.\n\n\n&quot;Fans of BREAKING BAD and ORANGE IS THE NEW BLACK are going to love this book.&quot;\n\n&quot;A fascinating glimpse into the dark world of prostitution and drug addiction.&quot;\n\n&quot;It's a snapshot of the mental health crisis in America. After reading this book, I realized that we are all a little crazy. Some more than others.&quot;\n\n&quot;If you liked THE PERKS OF BEING A WALLFLOWER, SILVER LININGS PLAYBOOK or ZOO STATION, you're going to get hooked on this book.&quot;\n\n&quot;FORREST GUMP meets 50 SHADES OF GREY.&quot;\n\n&quot;One of the rare books that is not only highly entertaining, but also profound and deeply moving.&quot;\n\n&quot;Love is an addiction. And we are all addicted. This book explains why addicts do what they do. Sometimes with painfully brutal honesty, but always with empathy and compassion.&quot; ","torrent":{"xt":"urn:btih:7d8af84b97c7148cb0634e4a6592b0846c3a9276","amp;dn":"Sex+and+Crime+by+Oliver+Markus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d8af84b97c7148cb0634e4a6592b0846c3a9276","infoHashBuffer":{"type":"Buffer","data":[125,138,248,75,151,199,20,140,176,99,78,74,101,146,176,132,108,58,146,118]},"announce":[],"urlList":[]}}