{"title":"Motorcycle Mania 2","uid":3294506,"size":3556228108,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7e89d8676f3fc37a72bda711bd38bd573b90392c&amp;dn=Motorcycle+Mania+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"kenny123","files":14,"time":1109252019,"description":"Motorcycle Mania 2 DVD\n\nWho is the talented motorcycle designer riding 1,400 miles non-stop from Long Beach, California to Sturgis, South Dakota? To serious bikers the answer is obvious. His chopper's 40 degree rake, the six-shooter risers, the 5-inch stretch and the Maltese Cross-shaped filter cover give him away. It's Jesse James, the star of the original Motorcycle Mania! Follow Jesse along his journey to Sturgis, home of the Black Hills Classic, which is according to Jesse the biggest and most important annual biker event. Last year 800,000 bikers came out for the event, and this year will mark the 16th anniversary of Jesse's trip to the legendary gathering.\n\nWatch Jesse build his own Sturgis Special for the journey as you flashback to the months preceding the Classic. Meet some interesting characters in the shops where Jesse buys materials . like Sugar Bear, an older gentleman who was one of the creators of the '60s chopper look. Plus, join Jesse with his famous and very large customer, Los Angeles Lakers center, Shaquille O'Neal! After seeing Jesse's work in Motorcycle Mania 1, Shaq decided he had to have a Jesse James cycle. Plus, see Jesse and crew work feverishly to finish this special project for Shaq as well as one for professional wrestler Bill Goldberg. Then see and hear the finished products as Jesse rides off to Sturgis to showcase his latest masterpiece.","torrent":{"xt":"urn:btih:7e89d8676f3fc37a72bda711bd38bd573b90392c","amp;dn":"Motorcycle+Mania+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e89d8676f3fc37a72bda711bd38bd573b90392c","infoHashBuffer":{"type":"Buffer","data":[126,137,216,103,111,63,195,122,114,189,167,17,189,56,189,87,59,144,57,44]},"announce":[],"urlList":[]}}