{"title":"The Doors (30th Anniversary Collection) (3 Movies in 1) [DVDRip]","uid":6262301,"size":1487515690,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:7ec271280728eafdb3afce2f9514bcf118bf862d&amp;dn=The+Doors+%2830th+Anniversary+Collection%29+%283+Movies+in+1%29+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"NUUDLZ","files":4,"time":1300789060,"description":"\n\nXVID, 512x384, Qf= 0.22, AC3 (192 kbs), 28 tracks\n\nThe Doors - 30th Anniversary Collection. A stunning audio visual collection that showcases one of the most influential bands of the 20th century.\n\n1. The Doors: Live at The Hollywood Bowl\nFilmed during the Forth of July weekend, 1968, The Doors perform their most critically acclaimed music before a standing room only crowd.\n\n2. The Doors: Dance on Fire\nAn all-live video collection of live and televised performances, promotional clips and rare behind-the-scenes footage.\n\n3. The Doors: The Soft Parade and Retrospective\nThis historical music video features as its centrepiece The Doors' last televised appearance, aired on PBS in 1969.\n\nFEATURES:\n\n* The Doors 30th Anniversary DVD Collection.\n* Includes:\no Live at Hollywood Bowl.\no Dance on Fire.\no The Soft Parade and Retrospective\n* Experience the powerful performances of Jim Morrisson and The Doors.\n* A must have for any fan of the poetic, intense psychedelic rock of The Doors.\n\nReview From Link\n\nThe Doors are one of the greatest bands of all time and this DVD marks the 30th Anniversary of Jim Morrison's death. I must be perfectly honest in saying that I am no great Doors fan but this DVD has aspects that were very enjoyable for me. If you are a Doors fan then this DVD is a must-have - for the music, the snippets of Jim Morrison's poetry, and the odd interview piece spread throughout the features.\n\nThe Doors with Jim Morrison only produced music for a few years between 1967 and 1971. In this short time they created some of the most memorable songs of their generation. In fact, there are very few people even now who don't know the tune to at least one Doors song. This DVD spans these few years before Morrison's premature death in Paris. I just wonder how much more material we would have seen from the Doors over the years if this terrible tragedy had not occurred.\n\nThis DVD combines three different features to present the 30th Anniversary Collection. The first feature on the disc is The Doors - Live at the Hollywood Bowl. This concert was recorded during the summer of 1968 at the peak of the Doors musical career. The second feature, entitled Dance on Fire, was released in 1985 and, as far as I can tell, is a montage of video clips of the Doors most memorable songs. The songs are separated with Morrison's poems and writings, some of which are quite unusual. Finally, we are presented with The Soft Parade that was released in 1987, another montage of songs.\n\nDance on Fire was by far the most enjoyable feature on this DVD with a selection of great songs. The songs found on The Soft Parade were mostly unknown to me, but as I am not a great fan this is not surprising. The live concert was intriguing, providing a great glimpse of what the live concert scene was like in the late sixties. ","torrent":{"xt":"urn:btih:7ec271280728eafdb3afce2f9514bcf118bf862d","amp;dn":"The+Doors+%2830th+Anniversary+Collection%29+%283+Movies+in+1%29+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ec271280728eafdb3afce2f9514bcf118bf862d","infoHashBuffer":{"type":"Buffer","data":[126,194,113,40,7,40,234,253,179,175,206,47,149,20,188,241,24,191,134,45]},"announce":[],"urlList":[]}}