{"title":"Kenneth Barrett - 22 Walks in Bangkok (2014).","uid":10138659,"size":65242900,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7f636552f88ba8ad4c9390189cbd6b7b1f82b388&amp;dn=Kenneth+Barrett+-+22+Walks+in+Bangkok+%282014%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SectorVector","files":-1,"time":1399974440,"description":"\n22 Walks in Bangkok: Exploring the City's Historic Back Lanes and Byways,\n\nby Kenneth Barrett \n\n  \nISBN-13: 9780804843430 \nPublisher: Tuttle Publishing\nPublication date: 2/18/2014\nPages: 352\n\n\nTake a series of unforgettable strolls down the back lanes of historic Bangkok!\n\nBangkok is one of the world's greatest cities and a leading tourist destination, visited by millions each year. But it can be a bewildering place also. First-time visitors, not knowing what to expect, encounter endless boulevards connected by a vast maze of tiny side streets. A stroll down any of these lanes can reveal fascinating surprises -- beautiful palaces and mansions, shophouses and shrines, restaurants and markets. But how to find your way through the maze?\n\n\n22 Walks in Bangkok helps you discover hidden gems found throughout the city by presenting each neighborhood as a distinct village -- explaining how it evolved, and describing its historic landmarks in detail.\n\n\nAuthor Ken Barrett is a long-time Bangkok resident and experienced journalist, and he introduces the important temples, churches, shrines and mosques in loving detail, sketching their history and distinctive features. The reader is skillfully guided through the old neighborhoods of Bangkok from the center to the periphery, along narrow lanes and byways rarely seen by foreigners.\n\n\n22 Walks in Bangkok leads the visitor on a unique journey of discovery and enables you to appreciate this fascinating city in new and exciting ways.\n\n\nAuthor:\n======\nKenneth Barrett has been a journalist for his entire career -- at various times specializing in travel, food, media criticism, humor, business and industry. He has edited numerous magazines and business newspapers and is also a photographer who has been on assignment to over 60 countries, predominantly in Asia but also to parts of the Middle East and South America.\n\n\nAmazon: 4.5/5.0\n\n-_-","torrent":{"xt":"urn:btih:7f636552f88ba8ad4c9390189cbd6b7b1f82b388","amp;dn":"Kenneth+Barrett+-+22+Walks+in+Bangkok+%282014%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f636552f88ba8ad4c9390189cbd6b7b1f82b388","infoHashBuffer":{"type":"Buffer","data":[127,99,101,82,248,139,168,173,76,147,144,24,156,189,107,123,31,130,179,136]},"announce":[],"urlList":[]}}