{"title":"Master Musicians of Tanzania~Mateso (Triple Earth) [FLAC] {MKOP}","uid":7678009,"size":337099434,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7f9cedbc4cd210e196b205976adea148a43c03d7&amp;dn=Master+Musicians+of+Tanzania%7EMateso+%28Triple+Earth%29+%5BFLAC%5D+%7BMKOP%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mudmashers","files":11,"time":1348753720,"description":"Master Musicians of Tanzania~Mateso (suffering) (Triple Earth Records) [FLAC] {MKOP}\n\nHukwe Zawose, or Dr. Hukwe Zawose to give him his full title, is probaby Tanzania's greatest musical treasure. Growing up in Doduma, he was a cattle herder with plenty of time to himself and a love of the countryside that's evident in his music and his championing of folk traditions. His initial instrument was the ilimba, or large thumb piano, which his older brother also played. He then added the stringed izeze, his father's instrument. His gifts were quickly evident and he began going around the villages as a musician. He recalls, &quot;when I was a young man my voice was so sweet that people would often cry when I sang. In fact, sometimes I would hear myself and even I would cry, wondering what I had done to deserve such a precious gift.&quot; Eventually, Julius Nyerere, the first president of the newly independent country, heard about him and summoned him to the capital, Dar Es Salaam. There, the young man found favor with his traditionally based music and became a founding member of the Master Musicians of Tanzania, a group also known as the National Music Ensemble of Tanzania. The band was based at the Bagayomo College of the Arts and even as he was playing with them, Zawose was developing his own wagogo style, mixing traditional stories with political lyrics in Swahili. By now he'd become a master of the thumb piano, with a huge sound to match his remarkable voice -- reportedly he has a five-octave vocal range. He'd also become prolific in areas beyond music, fathering a total of 15 children by four wives, and playing in a duo with one of his sons, Charles Zawose. \n\nBy the mid-'80s, Zawose and son were touring outside Africa; at the end of the decade with the Master Musicians; he then released Art of Hukwe Ubi Zawose in Japan, a record that brought him to the attention of world music enthusiasts for its stylish singing and playing. Folkloric and acoustic, it offered the kind of insight to Tanzanian music that none of the pop bands of the coast could match. It was followed by Tanzania Yetu and Mateso on the English indie Triple Earth, and Zawose left his ensemble behind to make his home in London, becoming an established part of the WOMAD festival circuit, which he still regularly plays. That, in turn, led to his first solo disc, 1996's Chibite, which one critic called &quot;a startling music stripped down to raw elements.&quot; After that, Zawose returned to Tanzania, although he continued to tour regularly around the globe. He was in no hurry to release another album, and it wasn't until 2001 that Mkuki Wa Rocho appeared on the small Womad Select label in a limited pressing. Zawose, an honorary Doctor of Music, continued to play, but spent his later years teaching music in his native land. He passed away in December of 2003 at the age of 65. ~Biography by Chris Nickson (Allmusic)\n\n01. Tanzania Yetu\n02. Sisi Vijana\n03. Nhongolo\n04. Kononze,Mbijili\n05. Ulele Mwana Lelo Zaina\n06. Chisanga\n07. Mateso\n08. Lukunzi\n09. Tumuunge Mikono\n10. Mateso (Instr. Reprise)\n\nMusic Keep On Playing*Thank You Seeders","torrent":{"xt":"urn:btih:7f9cedbc4cd210e196b205976adea148a43c03d7","amp;dn":"Master+Musicians+of+Tanzania%7EMateso+%28Triple+Earth%29+%5BFLAC%5D+%7BMKOP%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f9cedbc4cd210e196b205976adea148a43c03d7","infoHashBuffer":{"type":"Buffer","data":[127,156,237,188,76,210,16,225,150,178,5,151,106,222,161,72,164,60,3,215]},"announce":[],"urlList":[]}}