{"title":"Unlocker 1.8.9","uid":5431329,"size":220731,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7f9e7d6049c6193709ea8fb6c54baed27a03cb75&amp;dn=Unlocker+1.8.9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"olofolleola4","files":-1,"time":1268423243,"description":"Copied from Unlocker Homepage:\n\n\nEver had such an annoying message given by Windows?\n\n\n&quot;Error Deleting File or Folder\n\nCannot delete Folder: It is being used by another person or program.\n\nClose any programs that might be using the file and try again.&quot;\n\n\nIt has many other flavors:\n\nCannot delete file: Access is denied\nThere has been a sharing violation.\nThe source or destination file may be in use.\nThe file is in use by another program or user.\nMake sure the disk is not full or write-protected and that the file is not currently in use. \n\n\nUnlocker is the solution!\n\n1. Simply right click the folder or file and select Unlocker\n2. If the folder or file is locked, a window listing of lockers will appear\n3. Simply click Unlock All and you are done!\n\n\nDonate\n\nUnlocker is completely free and will always remain free, which means you can use it free of charge for any purposes. If you are satisfied with Unlocker and want to help Unlocker improve or motivate the development of other quality programs, any amount of donation small or large will be welcome and gratefully appreciated.\n\n\nChangelog:\n\n\nUnlocker 1.8.9 - 8/3/2010\n\nThe rumors of me not working on Unlocker have been greatly exaggerated.\nI have been very busy with pushing the envelope at work, MBA studies during evenings and week-ends, and life during the time left.\n\nStill, I finally had a little time to address all the reported issues on Unlocker, and Unlocker now supports Windows 7. From a x64 stand point, it took me a couple of hours to get it fully working on my machine. I still have to sign the driver which might require a lot of paperwork, but hopefully it will not take long.\nFor the impatient kind, I can provide alpha versions :)\n\nInterestingly, now that I have a x64 machine, I had no alternative than to get Unlocker working. Despite the increased number of ersatz, none of them really did the job and I really had a motivation to get Unlocker working.\n\nFinally, I addressed the topic of false positives with Unlocker on my blog.\nThere is no malware in Unlocker and there will never be.\nAnd for the record I am not the only one having similar issues.\n\n\nFixed bug: Handles should not be missing anymore on Windows7.\n\nFixed bug: Potential conflict with regular explorer use when opening multiple files or other shell extensions such as 7-zip.\n\nFixed bug: UI should now appear properly when done from clean install.\n\nFixed bug: No hangs due to looping junctions should happen anymore.\n\nFixed bug: Deleting junctions will not erase original files anymore.\n\nFixed bug: Managing your computer on Windows 7 will not crash anymore.\n\nFixed bug: Bitmap handles should not leak anymore from the shell extension.\n\nFixed bug: Many other potential sources of bugs and crashes.\n\n\nImproved behavior: When deleting files they will be sent first to the recycle bin if possible, only if not possible more abrasive deletion will be used.\n\nImproved behavior: Unlocker can be started directly from the start menu to browse to the desired file or folder.\n\n\nPromotional feature: Added fully optional shortcuts to eBay during the installation. Simply untick &quot;eBay shortcuts&quot; in the choose components page during install if you do not wish to have those.\n\n\nED2K Link:\ned2k://|file|unlocker1.8.9.exe|220731|D01B1E60B07D660F862FA1D186A80629|h=LBEQDLYJVVHSU5C63WZXSU7HV6URXXHU|/\n\n\n\nComments from the uploader (olofolleola4):\nHere is some links if you cannot download it through this torrent:\nupload box  .  com  /  files  /  d681343ebb\nrapid share  .  com  /  files  /  362493637  /  unlocker1.8.9.exe","torrent":{"xt":"urn:btih:7f9e7d6049c6193709ea8fb6c54baed27a03cb75","amp;dn":"Unlocker+1.8.9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f9e7d6049c6193709ea8fb6c54baed27a03cb75","infoHashBuffer":{"type":"Buffer","data":[127,158,125,96,73,198,25,55,9,234,143,182,197,75,174,210,122,3,203,117]},"announce":[],"urlList":[]}}