{"title":"Mac OS X Lion FINAL RETAIL (2011) [Multilengual]","uid":6584114,"size":3752383024,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:7fb0fa95752ed4d8bb64e44f2bed1d3b870bdfe3&amp;dn=Mac+OS+X+Lion+FINAL+RETAIL+%282011%29+%5BMultilengual%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"webchella","files":1,"time":1312541339,"description":"Mac OS X Lion FINAL RETAIL (2011) [Multilengual]\n &lt;a href=&quot;\nhttp://www.apple.com/macosx/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.apple.com/macosx/&lt;/a&gt;\n\n--------\nEnglish:\n--------\nCategory: MAC Software \nLanguage: All including English, Spanish, Catalan, etc. \n\nDescription: \n------------- \nOS X Lion is the new major version of Mac OS X desktop operating system more advanced in the world. Includes over 250 new features that will transform how you interact with your Mac Touch, slide and move the way through its fluid applications Multi-Touch gestures make everything feel more natural and direct. Full screen applications take advantage of every pixel on the screen - perfect for reading email, surfing the web or browse photos. Launchpad gives you instant access to all applications on your Mac in a stunning new design where you can quickly find and open any application with one click. And Mission Control brings together state, full-screen applications, desktop, and spaces in a unified experience. With a gesture, zoom, desktop, showing a panoramic view of everything that runs on your Mac and it is easy to navigate anywhere with a click. \n\nMinimum requirements: \n------------------- \nIntel Core 2 Duo, i3, i5 and i7 \n2GB RAM \nMac OS X 1.6.6 \n7GB free hard disk will \n\nAS recording to DVD: \n-------------------------- \nYou go to the unzipped file, right click and &quot;show package contents&quot; We went into the folder Contents / SharedSupport and find the file of 3.74 GB InstallESD.dmg, we go to &quot;Disk Utility&quot; and recorded it. Success! \n\nINSTALL AS FROM 0: \n------------------------- \nNecessarily have to create a DVD as I have described. Once created, insert it, we click the icon Lion DVD, here are installed, we leave those 20 minutes to install and restarting by pressing ALT, we give RECOVER HD, then Disk Utility and erase the disk where we will install the main\n\n\n--------\nEspaÃƒÂ±ol:\n--------\nCategoria: Software MAC\nIdioma: Todos incluidos Ingles, EspaÃƒÂ±ol, Catalan etc\n\nDescripcion:\n-------------\nOS X Lion es la nueva gran versiÃƒÂ³n de Mac OS X, el sistema operativo de escritorio mÃƒÂ¡s avanzado del Mundo. Incluye mÃƒÂ¡s de 250 nuevas caracterÃƒÂ­sticas que transformarÃƒÂ¡n la forma en que interactÃƒÂºas con tu Mac. Toque, deslizar y desplazar el camino a travÃƒÂ©s de sus aplicaciones con fluidos gestos Multi-Touch hacen que todo se siente mÃƒÂ¡s natural y directo. Aplicaciones a pantalla completa aprovechan cada pixel de la pantalla - perfecto para leer el correo electrÃƒÂ³nico, navegar por la web o navegar por las fotos. Launchpad le da acceso instantÃƒÂ¡neo a todas las aplicaciones de tu Mac en un diseÃƒÂ±o nuevo e impresionante, donde puedes encontrar rÃƒÂ¡pidamente cualquier aplicaciÃƒÂ³n y abrir con un solo clic. Y MisiÃƒÂ³n Control reÃƒÂºne a exponer a pantalla completa, aplicaciones, escritorio, y espacios en una experiencia unificada. Con un gesto, su zoom de escritorio, que muestra una vista panorÃƒÂ¡mica de todo lo que se ejecuta en tu Mac y lo que es fÃƒÂ¡cil navegar a cualquier lugar con un clic. \n\nRequisitos mÃƒÂ­nimos:\n-------------------\nProcesador Intel core 2 Duo, i3, i5 o i7\n2Gb de memoria RAM\nMac OS X 1.6.6\n7GB libre en le disco duro\n\nCOMO LO GRABO EN UN DVD:\n-------------------------- \nTe vas al archivo descomprimido, boton derecho y &quot;mostrar contenido del paquete&quot; Entramos en la carpeta Contents / SharedSupport y buscamos el archivo InstallESD.dmg de 3,74 GB, nos vamos a &quot;utilidad de disco&quot; y lo grabamos. Listo!\n\nCOMO LO INSTALO DESDE 0:\n-------------------------\nDeberemos crear obligatoriamente un DVD como ya he descrito. Una vez creado, lo insertamos, le damos click al icono de Lion del DVD, le damos a instalar, le dejamos esos 20 min que instale y al reiniciar PULSAMOS ALT, le damos a RECOVER HD, luego a Utilidad de discos y borramos el disco principal donde vamos a instalarlo\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:7fb0fa95752ed4d8bb64e44f2bed1d3b870bdfe3","amp;dn":"Mac+OS+X+Lion+FINAL+RETAIL+%282011%29+%5BMultilengual%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fb0fa95752ed4d8bb64e44f2bed1d3b870bdfe3","infoHashBuffer":{"type":"Buffer","data":[127,176,250,149,117,46,212,216,187,100,228,79,43,237,29,59,135,11,223,227]},"announce":[],"urlList":[]}}