{"title":"EnigmaT Set Rips { Cuts } - March 30th, 2014","uid":9852205,"size":1559803364,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7fd58fca1ccfe3e00be7368958ef40e6d40222fe&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+March+30th%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"EnigmaT","files":170,"time":1396164403,"description":"4B - Bomboclat (Cut From Claessen Set)-enTc\nA.L.A.M.I. - Lucky Way (Original Mix) (Cut From Indayo Set)-enTc\nA.Shine - Sky (Yuji Ono Remix) (Cut From BT Set)-enTc\nAdiva - Tabu (Cut From Pit Set)-enTc\nAfrojack &amp; Martin Garrix - ID (-LiVe- Cut From Tiesto Set)-enTc\nAicos - Feeling of the Valley (Original Mix) (Cut From Angel Ace Set)-enTc\nAlex Kidd (USA) - Kingdom Tribe (ABGT 072 Rip)-enTc\nAlex MORPH &amp; Woody Van Eyden - A Night Outside (ASOT 656 Rip)-enTc\nAlex Sonata - Hybrid (ABGT 072 Rip)-enTc\nAlexZideyn - My Lost Angel (Airzoom Orchestral Mix) (Cut From Uplift Set)-enTc\nALI feat. Tristan Jackson - Higher (Instrumental Mix) (Cut From Anderson Set)-enTc\nAllen Watts - Fallen (UDM Remix) (Cut From Photographer Set)-enTc\nAmir Hussain - Boundless (Matt Skyer Remix) (Cut From Photographer Set)-enTc\nAmir Hussain - Boundless (Matt Skyer Remix) (Cut From Romel Set)-enTc\nAmir Hussain - Boundless (Matt Skyer Remix) (Cut From Suzy Set)-enTc\nAndain - Promises (Project 46 Bootleg) (Cut From Karanda Set)-enTc\nAndrea Mazza feat. Hysteria - This Perfect Night (Fabio XB Remix) (Cut From Bobina Set)-enTc\nAndrew Rayel - Power of Elements (Club Mix) (ASOT 656 Rip)-enTc\nAtaraxia - Hydrostatic (Cut From Uplift Set)-enTc\nAtaraxia - Hydrostatic (Original Mix) (Cut From Allen&amp;Envy Set)-enTc\nAudien - Hindsight (ABGT 072 Rip)-enTc\nAudien feat. Ruby Prophet - Circles (Kevin Charm Bootleg) (Cut From Organ Set)-enTc\nB.Exp - Visions (Original Mix) (Cut From Anderson Set)-enTc\nBLAST88 - Calypso (Original Mix) (Cut From GO Set)-enTc\nBlister 13.0 - Sin Ojos (Oliver Prime Remix In Green) (Cut From Solarstone Set)-enTc\nBogdan Vix and Renee Stahl - Forever (Mike Danis Remix) (Cut From GO Set)-enTc\nBoyce Avenue - Titanium (Brian Laruso's Touching Your Soul Edit) (Cut From Shah Set)-enTc\nChris Lake feat. Jareth - Helium (Merk &amp; Kremont Remix) (Cut From Karanda Set)-enTc\nCloudriver - Sylvia (Cut From Tangle Set)-enTc\nD&amp;S - Our Legs (Original Club Mix) (Cut From Oakenfold Set)-enTc\nD05 - Alkaline (Original Mix) (Cut From Anderson Set)-enTc\nD05 - Cadence (Original Mix) (Cut From Anderson Set)-enTc\nDaft Punk - Technologic (AnGy KoRe Bootleg Remix) (Cut From Sherry Set)-enTc\nDaga - Happiness Is A Choice (Jayeson Andel Remix) (Cut From Broaders Set)-enTc\nDaniel Portman &amp; Leventina - Who's Laughin (Cut From Karanda Set)-enTc\nDanny Stubbs Feat. Issa - Voices In The Dark (Ahmet Atasever Remix) (Cut From Shah Set)-enTc\nDave Joy - First Impression (Liam Wilson Remix) (Set Rip)-enTc\nDavey Asprey - Anima (Cut From Bobina Set)-enTc\nDavid Guetta &amp; Showtek feat. Vassy - BAD (Twoloud Edit) (Cut From Xabi Set)-enTc\nDenise Rivera - Perfect Ending (Kaimo K Remix) (ASOT 656 Rip)-enTc\nDigital Affliction - Valkyrie (Original Mix) (Cut From Above Clouds Set)-enTc\nDigital X - Profile (Original Mix) (Cut From Sherry Set)-enTc\nDirkie Coetzee - Kissing Her Tears (Matt Chowski Remix) (Cut From Dirkie Set)-enTc\nDis Play - Untitled (ABGT 072 Rip)-enTc\nDJ Geri - Nostalgia (Original Mix) (Cut From Anderson Set)-enTc\nDreamy - Lost In Open Eyes (Skyvol Remix) (Cut From Indayo Set)-enTc\nDuckfront - Juicymouse (Original Mix) (Cut From Organ Set)-enTc\nEdelways - Ray Of Hope (Aiera Remix) (Cut From Aurosonic Set)-enTc\nEDX - Cool You Off (ABGT 072 Rip)-enTc\nElfsong - Seldarine (Almar Remix) (Cut From GO Set)-enTc\nErick Strong &amp; Hydrogenio - Juggernaut (Denis Kenzo Remix) (Cut From Feel Set)-enTc\nFarzam - Uplifter Monster (Original Mix) (Cut From Cosmic Heaven Set)-enTc\nFerdy - Intention (Pole Folder Remix) (Cut From Barone Set)-enTc\nFiddler - Tomorrow (Cut From Barone Set)-enTc\nFirebird &amp; Quatri - Last Trip (Original Mix) (Cut From Feel Set)-enTc\nFrank Dattilo - Armageddon (Emanuele Congeddu Remix) (Cut From Romel Set)-enTc\nFrank Dattilo - White Devil (Original Mix) (Cut From Tero A Set)-enTc\nFred V &amp; Grafix - Recognise (Panda Remix) (ABGT 072 Rip)-enTc\nFredd Moz - Aquarius (Stephane Badey Remix) (Cut From Kineica Set)-enTc\nGareth Emery - Firebird (ABGT 072 Rip)-enTc\nGareth Emery - Long Way Home (ABGT 072 Rip)-enTc\nGarrido &amp; Hanski feat. Erin - Run (Original Mix) (Cut From Anderson Set)-enTc\nGhoeyash - The Rising Sun (Cut From Barone Set)-enTc\nHassen B &amp; A.L.A.M.I - Knights Templar (Cut From Uplift Set)-enTc\nHaxxy - Event Horizon (Original Mix) (Cut From Anderson Set)-enTc\nHaxxy - One Choose (Original Mix) (Cut From Anderson Set)-enTc\nHaxxy - The Book Of Colors (Original Mix) (Cut From Anderson Set)-enTc\nHaxxy - You And I (Original Mix) (Cut From Anderson Set)-enTc\nHernan Cerbello - The Right Pace (Ocean Gaya Remix) (Cut From Solarstone Set)-enTc\nHolbrook &amp; SkyKeeper - Flame Before the Dawn (-OvErSpAmMeD- GDJB Rip)-enTc\nHoyaa - Northlander (Nab Brothers Remix) (Cut From Angel Ace Set)-enTc\nID - ID (Kinetica Remix) (Cut From OzzyXPM Set)-enTc\nInner Peace - Ataraxia (Manuel Rocca Remix) (Cut From Rocca Set)-enTc\nIntrinity - Night Light (Original Mix) (Cut From Anderson Set)-enTc\nIoan Gamboa - Vibrations (Cut From Barone Set)-enTc\nIzzy Meusen &amp; V Rios - Tamriel (Original Mix) (Cut From Organ Set)-enTc\nJames Dymond - Siren's Song (ASOT 656 Rip)-enTc\nJames Wlliams - Inspired (Cut From Photographer Set)-enTc\nJordi Roure - Kobenhavn (Original Mix) (Cut From Angel Ace Set)-enTc\nJorn van Deynhoven - New Horizons (Mark Sixma Remix) (ASOT 656 Rip)-enTc\nJourneyman - Spend It All (ABGT 072 Rip)-enTc\nKam Delight &amp; Audiocells - New Europe (ASOT 656 Rip)-enTc\nKam Delight &amp; Audiocells - New Europe (Original Mix) (Cut From GO Set)-enTc\nKash Trivedi &amp; Steve Haines - OneBeat (Pierre O &amp; Thomas Evans Remix) (Cut From Camz Set)-enTc\nKevin Crowley - Brave The Storm (Cut From Lazarus Set)-enTc\nKheiro &amp; Medi Present Subimpact - Lotus Of The Nile (Draft) (Cut From Uplift Set)-enTc\nKiholm &amp; Kris O'Neil feat. Max'C - Live For Love (Kiholm Big Room Mix) (Set Rip)-enTc\nKiholm - Young &amp; Free (Set Rip)-enTc\nKinetica - ID (Cut From OzzyXPM Set)-enTc\nKinetica - ID (Set Rip)-enTc\nKura - Sabotage (Cut From Ferry Set)-enTc\nLas Salinas &amp; Sue McLaren - Break This Spell (Bryan Kearney Remix) (ASOT 656 Rip)-enTc\nLazarus - Diamonds (UDM Remix) (Cut From Lazarus Set)-enTc\nLifted Emotion - Love Around The World (Frank Duffel Remix) (Cut From OzzyXPM Set)-enTc\nLinkin Park - Castle Of Glass (Adam Seller Bootleg) (Cut From RAM Set)-enTc\nLoobosh &amp; Laucco - Czechoslovakia (Andy Elliass Remix) (Cut From Above Clouds Set)-enTc\nLostep - Burma (Hazem Beltagui Private Mix) (ASOT 656 Rip)-enTc\nLove N Frequency - Dont Look Back (Cut From Aurosonic Set)-enTc\nLustral - So Lonely (The Space Brothers Remix) (Cut From Sherry Set)-enTc\nM.I.K.E. Push - Astrolab (GDJB Rip)-enTc\nMark Knight - The Return Of Wolfy (ABGT 072 Rip)-enTc\nMarkus Schulz &amp; Venom One featuring Chris Madin - Revolution (Remember the Revolution Mix) (GDJB Rip)-enTc\nMarkus Voorn &amp; Nikolauss - Midnight Romance (Marcel Kenenberg Remix) (Cut From Kenenberg Set)-enTc\nMax Freegrant - Olya (The Anniversary Rework) (Cut From Anderson Set)-enTc\nMaxem &amp; Guido Vannes - Sunset Beach (Johan De Kock Remix) (Cut From Anderson Set)-enTc\nMaxem feat. Ann - My Wall (Kenneth Cruz Remix) (Cut From Anderson Set)-enTc\nMimram - I Am Here For You (Original Mix) (Cut From Solarstone Set)-enTc\nMimram - I'm Here For You (Cut From Tydi Set)-enTc\nMostfa &amp; Mostfa - Everlasting (Original Mix) (Cut From Tero A Set)-enTc\nMOTi - ID (-LiVe- Cut From Tiesto Set)-enTc\nNessai - Likeness Within (Hypaethrame Remix) (Cut From Cosmic Heaven Set)-enTc\nNew World Punx vs. Mr. Pit vs. Jochen Miller - Pullover Melody (Mr. Pit Approach) (Set Rip)-enTc\nNick Callan - Smile Me (Dan Stone Remix) (ASOT 656 Rip)-enTc\nNick Sentience &amp; Nick The Kid - Polarise (Cut From Team140 Set)-enTc\nNick Sentience - Scientific Advancement (Chris Voro Remix) (Cut From Oakenfold Set)-enTc\nNico Parisi &amp; Gai Barone - UNTITLED (Cut From Barone Set)-enTc\nNico Schinco - Unearthed (Cut From Tydi Set)-enTc\nOliver M - Groovebird (Slider N Turner Remix) (Cut From Grube Set)-enTc\nOrigin - Odin (Original Mix) (Cut From OzzyXPM Set)-enTc\nOrjan Nilsen - The Late Anthem (Way Too Late Mix) (ASOT 656 Rip)-enTc\nOsvaldo Nugroho - Hamelin Piper (Original Mix) (Cut From MORPH Set)-enTc\nOutcasted - Arcadian (Hypaethrame Remix) (Cut From Indayo Set)-enTc\nPassion Pit &amp; Tiesto vs. Woodkid - Run Boy, Run Away (Stereoshock Edit) (-LiVe- Cut From Tiesto Set)-enTc\nPaul Oakenfold - Toca Me (Benjani Remix) (Cut From Oakenfold Set)-enTc\nPeetu S - Protective Custody (Original Mix) (Cut From Sherry Set)-enTc\nPhi Phi &amp; Airwave - The Horn (Cut From Barone Set)-enTc\nPhilippe El Sisi &amp; Abstract Vision feat. Jilliana Danise - This Time (Classical Mix) (Cut From Photographer Set)-enTc\nProtoculture - Music Is More Than Mathematics (ASOT 656 Rip)-enTc\nQulinez feat. Cara Salimando - Rising Like The Sun (Tony Junior Remix) (Cut From Xabi Set)-enTc\nRonski Speed &amp; Shannon Hurley - Summer Away Ends (GDJB Rip)-enTc\nSage - Roxanne (Cut From Barone Set)-enTc\nSergey Franc - Magnum (-Short- Cut From Solarstone Set)-enTc\nSergey Nevone - Unhappy Marionette (Original Mix) (Cut From Above Clouds Set)-enTc\nSergey Nevone - Unhappy Marionette (Original Mix) (Cut From Romel Set)-enTc\nSimon Moon, Naeba &amp; Sky Sound - Sunset In The Morning (New Era Remix) (Cut From Anderson Set)-enTc\nSimpkin - Mind Magic (Original Mix) (-Short- Cut From Oakenfold Set)-enTc\nSmooth Vision &amp; Alaris - Drowning (Original Mix) (Cut From Anderson Set)-enTc\nSnade - The Distance Of The Night (Outer Space Remix) (Cut From Sty Set)-enTc\nSoarsweep - Between Empires (ASOT 656 Rip)-enTc\nSolarstone - Presence Of The Past (Ambient Mix) (Cut From Solarstone Set)-enTc\nSound Quelle - Allous (3dub Remix) (Cut From Feel Set)-enTc\nSpencer Hardwick - Nebulae (Original Mix) (Cut From Nadz Set)-enTc\nStephane Badey - Cronos (Original Mix) (Cut From Bowdidge Set)-enTc\nStereojackers vs. Mark Loverush feat. Seri - Come &amp; Go (George Acosta Remix) (Cut From Claessen Set)-enTc\nSunlight Project - 3 Meters Above The Sky (Original Mix) (Cut From Shah Set)-enTc\nSunset Heat &amp; Sunstar pres. Devious Minds - Into Her Eyes (Original Mix) (Cut From Angel Ace Set)-enTc\nT4L - Good Nightmare (Original Mix) (Cut From Sherry Set)-enTc\nTangle - Halcyon (Original Mix) (Set Rip)-enTc\nThomas Hayes - Some Things Never Change (Original Mix) (Cut From Anderson Set)-enTc\nTiesto - Footprints (All Over The World) (-LiVe- Cut From Tiesto Set)-enTc\nTiesto - Maximal Grazy (-LiVe- Cut From Tiesto Set)-enTc\nTiesto feat. C.C. Sheffield - Escape Me (Zaken Remix) (-LiVe- Cut From Tiesto Set)-enTc\nTiesto feat. Icona Pop - Let's Go (-LiVe- Cut From Tiesto Set)-enTc\nTiesto feat. Matthew Koma - Wasted (-LiVe- Cut From Tiesto Set)-enTc\nTiesto vs MOTi - ID (-LiVe- Cut From Tiesto Set)-enTc\nTiesto vs. Dzeko &amp; Torres - ID (-LiVe- Cut From Tiesto Set)-enTc\nToby TranzTonic &amp; DJ T.H. feat Justyna Kotwas - Always In My Mind (Frank Waanders Remix) (Cut From Suzy Set)-enTc\nToby TranzTonic &amp; DJ T.H. feat. Justyna Kotwas - Always In My Mind (Frank Waanders Dub Mix) (Cut From Saux Set)-enTc\nTom8 - Loneliness (Another World Uplifting Mix) (Cut From andY Set)-enTc\nTommy Johnson Feat. Nanje Nowack - Burn The Sun (ASOT 656 Rip)-enTc\nTriston &amp; Dave-PL - Dojo (Cut From Ferry Set)-enTc\nType 41 - Mythology (Dimension Remix) (ASOT 656 Rip)-enTc\nVandit Knights - Break The Spell (-OvErSpAmMeD- Cut From Feel Set)-enTc\nVitaly Otto - Zero Gravity (Beatsole Remix) (Cut From Feel Set)-enTc\nWach - Carthage (ASOT 656 Rip)-enTc\nWalden - Toranian (ABGT 072 Rip)-enTc\nWitness45 - Fato (Alter Future Remix) (GDJB Rip)-enTc\nYves Deruyter - Back to Earth (Hughes &amp; Ballantine Drop'em Rework) (Cut From OzzyXPM Set)-enTc\nZiger Feat. Stephano Prunebelli - Shadows (Blusoul Earthly Mix) (Cut From Barone Set)-enTc\nZuubi - Pink Clouds (Original Mix) (Cut From Anderson Set)-enTc\n","torrent":{"xt":"urn:btih:7fd58fca1ccfe3e00be7368958ef40e6d40222fe","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+March+30th%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fd58fca1ccfe3e00be7368958ef40e6d40222fe","infoHashBuffer":{"type":"Buffer","data":[127,213,143,202,28,207,227,224,11,231,54,137,88,239,64,230,212,2,34,254]},"announce":[],"urlList":[]}}