{"title":"The Iron Wall.AVI","uid":3615521,"size":1139078656,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:809cd54bfe447ea2710ccf0e2568834f9b111ddc&amp;dn=The+Iron+Wall.AVI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gromit1948","files":1,"time":1171157619,"description":"This is a copy of the DVD &quot;The Iron Wall&quot; from: &lt;a href=&quot;\nhttp://www.theironwall.ps/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theironwall.ps/index.html&lt;/a&gt;\n\nPlease order a copy, give a donation of do something else to help the cause of freedom for \n\nPalestine.\n\nThe website description on the film is as follows: &quot;In 1923 Vladimir Jabotinsky, leading \n\nintellectual of the Zionist movement and father of the right wing of that movement, wrote: \n\n&quot;Zionist colonization must either stop, or else proceed regardless of the native population. \n\nWhich means that it can proceed and develop only under the protection of a power that is \n\nindependent of the native population - behind an IRON WALL, which the native population cannot \n\nbreach.&quot;\n\nFrom that day these words became the official and unspoken policy of the Zionist movement and \n\nlater the state of Israel. Settlements were used from the beginning to create a Zionist \n\nfoothold in Palestine. \n\nAfter 1967 and the occupation of the West Bank and Gaza, the aim of the settlement movement \n\nbecame clear - create facts on the ground and make the creation of a Palestinian state \n\nimpossible. Thirty nine years of occupation and the policy started showing results. There are \n\nnow more than 200 settlements and outposts scattered throughout the West Bank blocking the \n\ngeographic possibility of a contiguous Palestinian territory.\n\nThe Iron Wall documentary exposes this phenomenon and follows the timeline, size, population of \n\nthe settlements, and its impact on the peace process. This film also touches on the latest \n\nproject to make the settlements a permanent fact on the ground - the wall that Israel is \n\nbuilding in the West Bank and its impact on the Palestinian&amp;#039;s peoples. \n\nSettlements and related infrastructures are impacting every aspect of life for all Palestinians \n\nfrom land confiscation, theft of natural resources, confiscation of the basic human rights, \n\ncreation of an apartheid-like system, to the devastating impact in regards to the future of the \n\nregion and the prospect of the peace process. \n\nPalestinians and Israelis began the peace process based on a very simple principle: land for \n\npeace. Settlements destroy that principle and create a land with no peace.&quot;\n\nThe video is XVID 29 fps 355 kbps with 12 bit sample size 720x480 pixels\nThe audio LAME MP3 at 128 kbps\nThe duration is 52 minutes\n","torrent":{"xt":"urn:btih:809cd54bfe447ea2710ccf0e2568834f9b111ddc","amp;dn":"The+Iron+Wall.AVI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"809cd54bfe447ea2710ccf0e2568834f9b111ddc","infoHashBuffer":{"type":"Buffer","data":[128,156,213,75,254,68,126,162,113,12,207,14,37,104,131,79,155,17,29,220]},"announce":[],"urlList":[]}}