{"title":"Stossel.2014.06.05.[Popular Nonsense].Fox Business.CF.avi","uid":10318631,"size":341147774,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:81026f571e65fe3e14d049026e9426024fec2f53&amp;dn=Stossel.2014.06.05.%5BPopular+Nonsense%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"skJGZV6z","files":-1,"time":1402279690,"description":"----------\n\nSTOSSEL - [Popular Nonsense] - Fox Business Network\n2014, June 5, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\n\nLESSONS FROM HOLLYWOOD: New Fox News Channel contributor (and former &quot;Clueless&quot; actress) Stacey Dash says that in Hollywood, &quot;only certain opinions are OK as long as they're aligned with the opinions of the liberals.&quot; Christian Toto of Breitbart.com calls Hollywood a &quot;bubble society.&quot; That leads to popular nonsense like this year's Godzilla movie, which the director says is &quot;really about global warming.&quot; Huh?\n\nNONSENSE NEWS: Are the New York Times' news pages liberal? The recently fired editor claims they are not. Bill Kristol of The Weekly Standard, who had a Times column for a year, says they are.\n\nUNPAID INTERNS: Obama and his bureaucrats say unpaid internships &quot;exploit&quot; students and are illegal. My former intern, Zoelle Mallenbaum, who now works for Neil Cavuto, debates Raphael Pope-Sussman, who says &quot;unpaid internships should be banned because they are anti-meritocratic.&quot; I say internships are great. Why else would companies hire a twenty-something nobody for eighty-something days? Internships may not pay but they are not without profit. One of my interns went on to win a Pulitzer Prize.\n\nCOMMON CORE: Lots of people on the left and the right are furious about Common Core, the movement to standardize what's taught in schools. Lindsey Burke of the Heritage Foundation explains why.\n\nMODERN MARXISM: Thomas Piketty's book &quot;Capital in the Twenty-First Century&quot; suggests we &quot;fix&quot; income inequality with a tax on assets, plus an 80% income tax on rich people. Mike Konczal of the Roosevelt Institute says this is a good start. But libertarian economist Mark Scousen says taxing capital is a terrible idea.\n\nVIOLENT VIDEO GAMES: Activist Jack Thompson says violent video games inspire mass shootings. The problem is: there's no good evidence for that, and in fact, as video game use increased, youth violence decreased.\n\nMY TAKE: Most of us struggle to run our own lives. We can't pay attention to everything. It's logical to believe politicians should plan our lives and our economy. But this belief is the worst kind of popular nonsense! Government creates new problems without solving the old ones.\n\n9PM ET on Fox Business Network","torrent":{"xt":"urn:btih:81026f571e65fe3e14d049026e9426024fec2f53","amp;dn":"Stossel.2014.06.05.%5BPopular+Nonsense%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81026f571e65fe3e14d049026e9426024fec2f53","infoHashBuffer":{"type":"Buffer","data":[129,2,111,87,30,101,254,62,20,208,73,2,110,148,38,2,79,236,47,83]},"announce":[],"urlList":[]}}