{"title":"Laughter &amp; Pain  ( Extreme BDSM-art, featuring Lystra )","uid":3645994,"size":105672912,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:8158f426b69042f7cf6e76ce0114018a52952753&amp;dn=Laughter+%26+Pain++%28+Extreme+BDSM-art%2C+featuring+Lystra+%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"jamaicainn","files":2,"time":1174692787,"description":"Laughter &amp; Pain  ( Extreme BDSM-art, featuring Lystra )\n\nCodec: RealPlayer\nResolution:  640 x 480\nDuration:  00.31:06\n\nScreens: &lt;a href=&quot;\nhttp://www.imagefap.com/gallery.php?gid=562008&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagefap.com/gallery.php?gid=562008&lt;/a&gt;\n\n\nSynopsis:\n\nThick shackles, heavy bilbos, and the Horse create a stark contrast to Lystra&amp;#039;s willowy physique. her guileless face, and her wide eyes. PD establishes the theme very early. One foot for tickling, one foot for caning - a euphemism for the blending of pain and pleasure as he draws Lystra into a spiral of sensory overload, a dark ecstasy - the severing of Self. With bilbos and shackles bolted to a single thick beam, Lystra&amp;#039;s bent over, straining her back. A cane smacks the sole of her foot. She is ordered not to flinch. Not to make a face. PD bargains with Lystra - one more stroke and he&amp;#039;ll ease her position. She agrees, taking the bite of the cane with a little smile held tight upon her face. But after he releases her and she lies back in relief, he whips her cunt. And she writhes, trying to protect her pretty little pussy. But it&amp;#039;s useless all this thrashing back and forth. Besides, PD&amp;#039;s suddenly very kind and sweet. Touch yourself, he says. Rub yourself. And the cane beats her foot. Her fingertips slip back and forth over her pussy, at first hesitant then faster. She comes. The eroticism of misery. With her legs spread by the shackles, he hoists her upward, off balance. The repeated slap of cane on flesh. Her face has frozen like a bleak landscape over which has been fastened a mask of smiles. She wants to please him. It&amp;#039;s clear. She can learn anything to survive. He staples a dildo to the beam. She&amp;#039;s ordered to sit. Penetrated, she sucks plastic cock, fingering herself again. Then with metal locked around her waist and crotch, and a long wooden dildo inside of her, she&amp;#039;s told to kneel. But it&amp;#039;s impossible with that wooden thing coming out her cunt. As impossible as when she&amp;#039;s lying on the floor and told to get up. Even the taser can&amp;#039;t make her move. Now sitting on the Horse with metal stocks at her neck and wrists, ankle stocks hold her legs open. He gently spreads her labia and ass cheeks for maximum effect. And still, she mustn&amp;#039;t frown from pain. Little Lystra&amp;#039;s getting weak, flailing. A vibrator adds to the brew. And he canes her ass. She explodes in orgiastic ecstasy. He ramps up the vibrator, pushing it deeper into her pussy. She rides it unwilling. Shuddering.\n\n","torrent":{"xt":"urn:btih:8158f426b69042f7cf6e76ce0114018a52952753","amp;dn":"Laughter+%26+Pain++%28+Extreme+BDSM-art%2C+featuring+Lystra+%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8158f426b69042f7cf6e76ce0114018a52952753","infoHashBuffer":{"type":"Buffer","data":[129,88,244,38,182,144,66,247,207,110,118,206,1,20,1,138,82,149,39,83]},"announce":[],"urlList":[]}}