{"title":"Watchmen - DC Heroes RPG Pack","uid":4820285,"size":299440362,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:82c6f4b9499ddcb169f815b87a200330fa4bfbbf&amp;dn=Watchmen+-+DC+Heroes+RPG+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Aetherflare","files":10,"time":1238741756,"description":"Watchmen - DC Heroes Role Playing Game Pack\nBundled by Aetherflare\n\n//Notes\n\nMy goal with this package was to include all of the Watchmen adventure modules and the sourcebook in one package, along with anything someone may need if they wish to actually play them. I'm not altogether familiar with the DC Heroes system or the books themselves at this time, but hopefully this will be all you need to explore the Watchmen universe using the DC Heroes system. The Watchmen adventure modules would have been written to utilize the First Edition of the DC Heroes Role Playing Game, but I've included the third, most recent (and final) edition just in case you feel experimental.\n\nEven if you aren't interested in playing the game, the material in the Watchmen modules and sourcebook bring an interesting insight into the Watchmen universe, and has been approved by both Alan Moore and Dave Gibbons. Definitely something a Watchmen fan shouldn't be without!\n\nI did not scan these materials, merely gathered them from a myriad of collections from all over the internet. Many thanks to those who took the effort to scan and share the material!\n\nI am also aware that the sizes of some of the pages of Taking out the Trash are a little wacky, but don't worry, everything is easily readable with some zooming in/out.\n\n//Package Contents\n(All files in PDF format, except for the Readme.)\n\nDC Heroes Role Playing Game and Material\n-- DC Heroes Role Playing Game - 1st Edition (1985)\n-- DC Heroes Role Playing Game - 3rd Edition (1993)\n-- DC Heroes Role Playing Game - Character Sheet\n-- DC Heroes Role Playing Game - Chart\n-- DC Heroes Role Playing Game - Game Master's Screen\nWatchmen Adventure Modules and Sourcebook\n-- Adventure Module 1 - Who Watches the Watchmen? (1987)\n-- Adventure Module 2 - Taking out the Trash (1987)\n-- The Watchmen Sourcebook (1990)\nReadMe.txt","torrent":{"xt":"urn:btih:82c6f4b9499ddcb169f815b87a200330fa4bfbbf","amp;dn":"Watchmen+-+DC+Heroes+RPG+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82c6f4b9499ddcb169f815b87a200330fa4bfbbf","infoHashBuffer":{"type":"Buffer","data":[130,198,244,185,73,157,220,177,105,248,21,184,122,32,3,48,250,75,251,191]},"announce":[],"urlList":[]}}