{"title":"Virtual.Dark.Angel.Season.3.with.printer.friendly.versions[from","uid":4208162,"size":1845581,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:82d8175e097a65b2e6719b50e0dc7cb787bf0da3&amp;dn=Virtual.Dark.Angel.Season.3.with.printer.friendly.versions%5Bfrom+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"twinkyman","files":5,"time":1211915799,"description":"\nFox decided to drop this great show after only 2 seasons.  This left many unanswered questions and many angry and disappointed fans.  But through the hard work of a group of dedicated fans we now have a virtual season 3.  Instead of watching the show you can read it instead.  Each episode takes about as long, maybe a little longer, to read than it would to watch a real episode, and they?re all excellent =)  These writers did a fantastic job in bringing the fans of Dark Angel the answers that they were craving!  Great job Virtual Dark Angel Team, and thanks a lot!!!\n\n\nThis is a virtual season 3 for Dark Angel from www.virtualdarkangel.com  It contains all 22 episodes from the virtual season 3 in compact rich text documents.  There is also a printer friendly copy of each episode formatted to fit onto as few pages as possible.  Non-printer-friendly versions are around 25 or 30 pages while the printer-friendly versions are only 8 or 10 so you can see the need for this if you want to print these =)  You can download pdfs of each episode online or read the episodes online but here I have packaged them all together in a much smaller package, along with printer-friendly versions.\n\nI highly recommend visiting www.virtualdarkangel.com for the other extra stuff there!\n\n\n***YES THIS IS FOR REAL!!***  \n\n***Please check out the first Episode &quot;Labyrinth&quot; if you&amp;#039;re skeptical.  This is legit, I hate hackers and viruses too!  =)\n\nEnjoy!\n","torrent":{"xt":"urn:btih:82d8175e097a65b2e6719b50e0dc7cb787bf0da3","amp;dn":"Virtual.Dark.Angel.Season.3.with.printer.friendly.versions%5Bfrom+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82d8175e097a65b2e6719b50e0dc7cb787bf0da3","infoHashBuffer":{"type":"Buffer","data":[130,216,23,94,9,122,101,178,230,113,155,80,224,220,124,183,135,191,13,163]},"announce":[],"urlList":[]}}