{"title":"Need for Speed Hot Pursuit [PAL][Spanish][Xbox360][www.consolasa","uid":5962784,"size":7331476257,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:837141b0e64194501c3de2a81c16867e0ebea43a&amp;dn=Need+for+Speed+Hot+Pursuit+%5BPAL%5D%5BSpanish%5D%5BXbox360%5D%5Bwww.consolasa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"consolasatope","files":76,"time":1290011427,"description":"Need for Speed Hot Pursuit te pondrÃƒÂ¡ al volante de los algunos de los coches mÃƒÂ¡s espectaculares del mundo en un escenario completamente inÃƒÂ©dito con estructura de mundo abierto. Creado por Criterion, el galardonado estudio responsable de la saga Burnout, Hot Pursuit redefinirÃƒÂ¡ el gÃƒÂ©nero de la conducciÃƒÂ³n para toda una nueva generaciÃƒÂ³n.\nExperimentarÃƒÂ¡s velocidades de vÃƒÂ©rtigo, takedowns, y escapadas alucinantes cuando compitas con tus amigos en el Need For Speed mÃƒÂ¡s interconectado de la historia. Gracias a la innovadora aproximaciÃƒÂ³n de Autolog a la competiciÃƒÂ³n social, tu experiencia de juego en Hot Pursuit se extenderÃƒÂ¡ mÃƒÂ¡s allÃƒÂ¡ de la consola hasta la web, redes sociales, y mÃƒÂ³viles, redirigiendo continuamente tu forma de jugar hacia una experiencia ÃƒÂºnica y diferente.\nCargado de acciÃƒÂ³n, el juego te desafÃƒÂ­a a convertirte en el mejor policÃƒÂ­a o corredor del paÃƒÂ­s. Por primera vez en un Need For Speed, podrÃƒÂ¡s desarrollar completamente tu perfil en cualquier lado de la ley. A final de aÃƒÂ±o, ya seas un corredor nato o un policÃƒÂ­a con olfato de sabueso, asegÃƒÂºrate de poner a punto todos tus sentidos porque el mayor desafÃƒÂ­o al volante de un coche estÃƒÂ¡ a punto de comenzar.\n\nCaracterÃƒÂ­sticas:\nCarrera: Por primera vez en la historia de Need for Speed, los jugadores van poder desarrollar su perfil como policÃƒÂ­as o perseguidos. Hot Pursuit poseeun modo para un jugador muy completo y bien definido y una experiencia multijugador de infarto en todos los modos de juego disponibles. Tanto si juegas online con amigos, superando los retos que te propongan o en modo individual, ganarÃƒÂ¡s recompensas que te permiten desbloquear nuevos coches, armas y equipamiento.\nNeed For Speed Autolog: En Need for Speed Hot Pursuit, tus amigos van a formar parte de tu experiencia al volante. Need for Speed Autolog es un revolucionario sistema que conecta tu juego y el de tus contactos, permitiÃƒÂ©ndoos comparar y compartir vuestros avances, fotos, logros, etc. Need for Speed Autolog te propone retos automÃƒÂ¡ticamente basÃƒÂ¡ndose en lo que tÃƒÂº y tus amigos hacÃƒÂ©is, creando, de esta manera una experiencia social ÃƒÂºnica.\nArmas y equipamiento: Intensidad de la competiciÃƒÂ³n completamente mejorada. Los jugadores podrÃƒÂ¡n usar diferentes armas a medida que el nivel de las carreras va en aumento. Tanto si escapas de la policÃƒÂ­a como si persigues a los corredores mÃƒÂ¡s veloces, tendrÃƒÂ¡s todo lo necesario para poner tu adrenalina al lÃƒÂ­mite.\nCoches: En Hot Pursuit, cada coche supera al anterior. Experimenta la emociÃƒÂ³n de conducir los coches mÃƒÂ¡s deseados a velocidades de vÃƒÂ©rtigo Siente el poder de atrapar a los delincuentes a bordo del Lamborghini Reventon que conduce la policÃƒÂ­a o el peligro de burlar a la ley en un supercoche como el Pagani Zonda Cinque.\nCondado de Seacrest: Toda la acciÃƒÂ³n de Need for Speed Hot Pursuit se desarrolla en California. CorrerÃƒÂ¡s por la costa, el desierto, bosques y regiones montaÃƒÂ±osas. La libertad que proporciona correr por Seacrest harÃƒÂ¡ que la experiencia de la persecuciÃƒÂ³n sea la mÃƒÂ¡s intensa que se ha visto en un juego de carreras.\n\n","torrent":{"xt":"urn:btih:837141b0e64194501c3de2a81c16867e0ebea43a","amp;dn":"Need+for+Speed+Hot+Pursuit+%5BPAL%5D%5BSpanish%5D%5BXbox360%5D%5Bwww.consolasa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"837141b0e64194501c3de2a81c16867e0ebea43a","infoHashBuffer":{"type":"Buffer","data":[131,113,65,176,230,65,148,80,28,61,226,168,28,22,134,126,14,190,164,58]},"announce":[],"urlList":[]}}