{"title":"Classic TV Serials: Yes Minister, Season One","uid":4375323,"size":1284747311,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:837569df7286dbae1ebef1f2981dc11932e25d38&amp;dn=Classic+TV+Serials%3A+Yes+Minister%2C+Season+One&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dnayak","files":8,"time":1220379972,"description":"Classic TV Serials: Yes Minister, Season One \n\nYes Minister is a multi-award winning satirical British sitcom written by Antony Jay and Jonathan Lynn that was first transmitted by BBC television and radio between 1980 and 1984, split over three seven-episode series. \n\nSet in the private office in Whitehall of a British government cabinet minister, the series follows the ministerial career of Jim Hacker MP, played by Paul Eddington. His various struggles to formulate and enact legislation or effect departmental changes are opposed by the will of the British Civil Service, in particular his Permanent Secretary (senior civil servant), Sir Humphrey Appleby, played by Nigel Hawthorne. His Principal Private Secretary Bernard Woolley, played by Derek Fowlds is usually caught between the two, although heavily influenced by Sir Humphrey. \n\nVideo size: 512x384 \nAudio: 32000hz, 16bps, 2ch \n\nSeries One (1980) \n01. Open Government - The new Minister's idealistic commitment to open the windows of his department faces its first hurdle: Sir Humphrey and the Civil Service. \n\n02. The Official Visit - Jim Hacker welcomes the visit of the new President of Buranda, an old university chum who has his own agenda. \n\n03. The Economy Drive - Hacker plans to slim down the civil service ÃƒÂ¢?? but Sir Humphrey forces him to set a personal example. \n\n04. Big Brother - Sir Humphrey drags his feet over a new National Integrated Database. \n\n05. The Writing On The Wall - The threat of the abolition of the DAA forces Hacker and Sir Humphrey to work together. \n\n06. The Right To Know - A threatened badger colony demonstrates that Sir Humphrey must be selective in what he tells his Minister. \n\n07. Jobs For The Boys - Hacker is kept in the dark over a doomed building project, and discovers that it takes two to quango. \n[Wikipedia] \n\nEnjoy! and please SEED!! Thanks.\n\nMy other torrents: http://thepiratebay.se/user/dnayak/","torrent":{"xt":"urn:btih:837569df7286dbae1ebef1f2981dc11932e25d38","amp;dn":"Classic+TV+Serials%3A+Yes+Minister%2C+Season+One","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"837569df7286dbae1ebef1f2981dc11932e25d38","infoHashBuffer":{"type":"Buffer","data":[131,117,105,223,114,134,219,174,30,190,241,242,152,29,193,25,50,226,93,56]},"announce":[],"urlList":[]}}