{"title":"iWin Glyph-Pictowords-Home Sweet Home 2-The Hidden Prophecies of","uid":4737828,"size":126101212,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:83b33c3be591387a87ec12547687872f64f026f2&amp;dn=iWin+Glyph-Pictowords-Home+Sweet+Home+2-The+Hidden+Prophecies+of&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"no_cr","files":4,"time":1235398652,"description":"Home Sweet Home 2: Kitchens and Baths\n\nHome Sweet Home 2: Kitchens and Baths will give you the chance to unleash your hidden talents as an Interior Designer. You choose the furniture, patterns, and colors to create a masterpiece that will blow your client away. Home Sweet Home 2: Kitchens and Baths puts you in the designer hot seat!\nCategory: Action, Time Management, Tycoon \nRelease Date:Ã‚Â 02/07/2009\n\nGame Description:\nYou move into your new home and every room is perfect. Every room, except one. Here is the blank canvas for your vision but you lack the know-how. Who do you call? The Home Sweet Home: Kitchens and Baths team! \nWith simple controls, a fun graphical style, and an easy to use interface, Home Sweet Home 2: Kitchens and Baths allows you to nurture your creative side. Remember, a house is not a home until it is a Home Sweet Home! \n\nPictowords\n\nPictowords isn't your father's word game, it's an exciting new twist on a classic! Pictures + Letters + Your Quick Wit = Pictowords! \nCategory: Game Show / Word, Kids, Steals &amp; Deals \nRelease Date:Ã‚Â 02/02/2009\n\nGame Description:\nHow quickly can you combine pictures and letters to create words? Test your wits and vocabulary with Pictowords! Each level offers fun pictures which you must blend with other pictures and letters to make words. Solve them all to earn bonus points! Pictowords is a fun new twist on classic word games.\n\nGlyph\n\nSave a dying world by assembling ancient glyphs in this epic puzzle adventure. Harness the powers of the Elements as you explore 255 dazzling levels in 5 different worlds.\nCategory: Action, Arcade, Match-3, Puzzle \nRelease Date:Ã‚Â 01/30/2009\n\n\nGame Description:\nWelcome to Glyph! In this unique puzzle adventure, the world of Kuros is dying. As a descendant of the Elemental Masters, it is up to you to restore Kuros to its once beautiful state by harnessing the powers of Wood, Fire, Water, Metal and Aether. Powerful and ancient Glyphs hold the key to restoring Kuros to its former beauty. Break through layers of rock by matching Guardstones and uncover the mystery of the Glyphs. Featuring 14 unique interactive objects, power-ups with 3 boost levels, high score posting and 125 custom levels, Quest Mode will keep any puzzle fan busy. The fast-paced Action Mode will challenge your skills and reflexes with 130 additional levels of game play. See if you can save Kuros, before it's too late!\n\nThe Hidden Prophecies of Nostradamus\n\nThe Hidden Prophecies of Nostradamus... What secrets lie hidden in the lines of the 942 quatrains? What disasters do they warn us of? Are they a window to the future? A roadmap to the moods of fate? Play The Hidden Prophecies of Nostradamus and all these questions will be answered.\nCategory: Hidden Object, Release Date:Ã‚Â 01/03/2009\n\nGame Description:\nThe Hidden Prophecies of Nostradamus. Through the centuries the world's greatest scholars have studied and debated the prophecies of Nostradamus. Now it's your turn. \n\nWhat secrets lie hidden in the lines of the 942 quatrains? What disasters do they warn us of? Are they a window to the future? A roadmap to the moods of fate? \n\nNow there is hope. A deck of ancient tarot cards can lead you to the missing fragments of Nostradamus' crystal ball. With the crystal ball in hand, perhaps the meaning behind The Hidden Prophecies of Nostradamus will become clear.","torrent":{"xt":"urn:btih:83b33c3be591387a87ec12547687872f64f026f2","amp;dn":"iWin+Glyph-Pictowords-Home+Sweet+Home+2-The+Hidden+Prophecies+of","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83b33c3be591387a87ec12547687872f64f026f2","infoHashBuffer":{"type":"Buffer","data":[131,179,60,59,229,145,56,122,135,236,18,84,118,135,135,47,100,240,38,242]},"announce":[],"urlList":[]}}