{"title":"[Kung Fu] The Storm Riders 1 aka Wind Cloud 1  (1998) - DVD/Rmvb","uid":3697209,"size":391684063,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:83be1d5ed5db1b0487c3c29a1950345f4249274a&amp;dn=%5BKung+Fu%5D+The+Storm+Riders+1+aka+Wind+Cloud+1++%281998%29+-+DVD%2FRmvb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"JamesKees","files":7,"time":1180125286,"description":"The Storm Riders 1 aka Wind Cloud 1 (1998)\n\nHKFlix Says:  \t4 Stars\n\nBreathtaking special effects, fights, setpieces, and scenery make this film a visual feast.\n\nAvg. Rating: \t\n  3.6 / 5 (based on 21 ratings).\n\nPlot:\tStorm Riders is a riveting martial arts film about the friendship and rivalry between two swordsmen, Wind and Cloud, brought up together by a warlord to help him fulfill a prophesy of ruling the world. Caught between them is the one woman they both love.\n\nOverview:\tThe long anticipated new film Storm Riders (Fung Won) which features two top pop stars, Dior Cheng Yi Kin, Aaron Kwok, was released in Hong Kong to great acclaim and eager audiences. It took over a year to produce. The film is adopted from the popular cartoon &quot;Fung Won&quot; and is a classic sword fight movie with many amazing special effects (the reason it has taken so long to make).\n\nWarlord Conquer (Sonny Chiba) is told that if he can locate and train two boys with particular star charts then his Conqueror Clan will be invincible for ten years. Conquer finds the two boys, but is obliged to get violent when their parents prove old-fashioned about forking over their sole heirs.\n\nConquer brings them up as his own, along with his legitimate son Frost and daughter Charity. Ten years pass, and our two orphans are mighty warriors. Wind (Ekin Cheng) is obedient but Cloud (Aaron Kwok) is a bit of a brooder, especially when Conquer announces the marriage of Charity (Kristy Yeung) to Wind. Nothing causes a war in the world of martial arts like a love triangle and, before you can say &quot;Whirling Water Attack&quot;, Cloud is storming the wedding to steal the bride.\n\nEventually, the two boys unite and fight Conquer. Despite the presence of big name actors and actresses, possibly the biggest star of this film is special effects company Centro, which set new standards for the future of Hong Kong Cinema.\n\nCast: \tDior Cheng Yee-Kin (Ekin Cheng)  ||  Kam Sui  ||  Anthony Wong  ||  Alex Fong  ||  Lawrence Cheng  ||  Roy Cheung  ||  Yeung Wan  ||  Kristy Yeung  ||  Zi Wong  ||  Dat Lee  ||  Zing Tsui  ||  Aaron Kwok  ||  Michael Tse  ||  Chi Ng  ||  Jason Chu  ||  Yiu Lai  ||  Shu Qi (Hsu Chi  ||  Shu Kei)  ||  Deon Lam\n\n_________________\nIf this torrent link is dead or not well seeded, PM me for a re-seed\n","torrent":{"xt":"urn:btih:83be1d5ed5db1b0487c3c29a1950345f4249274a","amp;dn":"%5BKung+Fu%5D+The+Storm+Riders+1+aka+Wind+Cloud+1++%281998%29+-+DVD%2FRmvb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83be1d5ed5db1b0487c3c29a1950345f4249274a","infoHashBuffer":{"type":"Buffer","data":[131,190,29,94,213,219,27,4,135,195,194,154,25,80,52,95,66,73,39,74]},"announce":[],"urlList":[]}}