{"title":"Purcell - Dido and Aeneas, an English baroque opera","uid":4055082,"size":139678196,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:83ce0352c26ed3314d33a53b7ca631eb7abe582c&amp;dn=Purcell+-+Dido+and+Aeneas%2C+an+English+baroque+opera&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"YowzaTheBear","files":27,"time":1204328350,"description":"Dido and Aeneas\nAn English baroque opera in three acts\n\nComposed by Henry Purcell (c. 1659 - 1695)\n\nLibretto by Nahum Tate (1652 - 1752),  British Poet Laureate 1692-1715\nEdition:  Oxford University Press, ed. Ellen T. Harris\n\nPerformed by St James&amp;#039;s Singers, St James&amp;#039;s Baroque Players\nConducted by Ivor Bolton\n\nDella Jones as Dido or Elissa, Queen of Carthage\nPeter Harvey as Aeneas, a Trojan Prince\nDonna Deam as Belinda, Dido&amp;#039;s sister\nSusan Bickley as the Sorceress\nNicola Jenkin as First Witch, \nMelanie Marshall as Second Witch\nCaroline Ashton as Second Woman and Spirit\nAndrew Murgatroyd as Sailor\n\nRecorded:  June - July, 1989 at Petersham Church, Richmond, Surrey, UK\n\nLabel: Teldec, 1993\nMaster DDD, total time 58:13\nmp3 @ 320 kbps\n\nFrom Wikipedia:\n\nIt is based on a story from the fourth book of Virgil&amp;#039;s Aeneid, of the legendary Queen of Carthage Dido and the Trojan refugee Ã†neas. When Ã†neas and his crew are shipwrecked in Carthage, he and the queen fall in love. However, Ã†neas must soon leave to found Rome. Dido cannot live without him and awaits death.\n\nCharacters\n\n    * Dido - (or Elissa) Queen of Carthage - soprano\n    * Belinda - Dido&amp;#039;s sister and handmaid - light soprano\n    * Second Woman - Another Handmaiden - mezzo-soprano (soprano)\n    * Ã†neas - Trojan Prince - tenor\n    * Sorceress - mezzo-soprano (counter-tenor)\n    * First Witch/Enchantress - soprano\n    * Second Witch/Enchantress - soprano\n    * Spirit - in form of Mercury - soprano (counter-tenor or tenor)\n    * First Sailor - tenor\n    * Chorus - SATB, all members at one point or another represent courtiers, witches, cupids, and sailors\n\nSynopsis\n\nAct 1: The opera opens with Dido in her court with her attendants. Belinda is trying to cheer up Dido, but Dido is full of sorrow, saying &amp;#039;Peace and I are strangers grown&amp;#039;. Belinda believes the source of this grief to be the Trojan Ã†neas, and suggests that Carthage&amp;#039;s troubles could be resolved by a marriage between the two. Dido and Belinda talk for a time, and then Belinda and the Second Woman have a duet. The court then again tries to raise Dido&amp;#039;s spirits, followed by Aeneas entering the court. He is at first received coldly by Dido, but she eventually accepts his proposal of marriage.\n\nAct 2 - Scene 1: The scene changes to the cave of the Sorceress. She is plotting the destruction of Carthage and its queen, and calls in her companions to help her in her evil plans. She plans to disguise herself as Mercury, someone that Aeneas will surely listen to, and tempt him to leave Dido and head back to Troy. This would leave Dido heart-broken, and she would surely die. The chorus join in with terrible laughter, and the Enchantresses decide to conjure up a storm to make Dido and her train leave the grove and head back to the palace. When the spell is prepared, the witches vanish in a thunderclap.\n\nAct 2 - Scene 2: Dido and Ã†neas are in a grove during the middle of a hunt, accompanied by their train. They stop there to take in its beauty. A lot of action is going on, with attendants carrying goods from the hunt and a picnic possibly taking place, and Dido and Aeneas are together within the activity. This is all stopped when Dido hears a distant thunder, prompting Belinda to tell the servants to prepare for a return to shelter as soon as possible. As every other character leaves the stage, Ã†neas is stopped by the Sorceress who is disguised as Mercury. This pretender Mercury brings the command of Jove that Ã†neas is to wait no longer in beginning his task of creating a new Troy on Latin soil. Ã†neas consents to the wishes of what he believes are the gods, but is not happy that he will have to leave Dido. He then goes off-stage to prepare to leave Carthage.\n\nAct 3: The scene opens in Carthage&amp;#039;s harbour with the preparations being made for the departure of the Trojan fleet. The sailors sing a song, which is followed shortly by the Sorceress and her companions&amp;#039; sudden appearance. The group is happy with how well their plan has worked, and the Sorceress sings a solo describing her further plans for the destruction of Ã†neas &quot;on the ocean&quot;. All the characters begin to clear the stage after a dance in three sections, and then disperse. The scene changes back to the palace. Dido and Belinda enter, shocked at Aeneas&amp;#039; disappearance. Dido is distraught and Belinda comforts her. Suddenly Aeneas returns, but Dido is full of fear before Ã†neas speaks, and his words only serve to confirm her suspicions. She derides his reasons for leaving, and even when Ã†neas says he will defy the gods and not leave Carthage, Dido rejects him for having once thought of leaving her. After Dido forces Ã†neas to leave, she states that &amp;#039;Death must come when he is gone.&amp;#039; The opera and Dido&amp;#039;s life both slowly come to a conclusion, as the Queen of Carthage sings her last aria, &quot;When I am laid in Earth.&quot; The chorus and orchestra then conclude the opera once Dido is dead by ordering the &quot;cupids to scatter roses on her tomb, soft and gentle as her heart. Keep here your watch, and never never never part.&quot;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Dido_and_Aeneas&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Dido_and_Aeneas&lt;/a&gt;\n\nFor works by other classical and baroque composers, click on my username.","torrent":{"xt":"urn:btih:83ce0352c26ed3314d33a53b7ca631eb7abe582c","amp;dn":"Purcell+-+Dido+and+Aeneas%2C+an+English+baroque+opera","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83ce0352c26ed3314d33a53b7ca631eb7abe582c","infoHashBuffer":{"type":"Buffer","data":[131,206,3,82,194,110,211,49,77,51,165,59,124,166,49,235,122,190,88,44]},"announce":[],"urlList":[]}}