{"title":"Marvel NOW! Week 15 (darkhomr) [TPB]","uid":8201244,"size":441462647,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:84284c564d4bf8d88905121479f2a412f18d17fc&amp;dn=Marvel+NOW%21+Week+15+%28darkhomr%29+%5BTPB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"dadrkhomr","files":13,"time":1362020923,"description":"Starting the week of February 27, 2013 I will be posting the ongoing adventures in the Marvel NOW! storyline. Each week I will be posting the current week's Marvel NOW titles. \n\nIncluded in this pack will be all Marvel comics and  Marvel NOW comics.  What will NOT be included is Disney stuff, TV stuff, and the kids books. Those will be included (when available) in my Zero Day pack.\n\nMy release packs are as follows: \n\nDC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\nMarvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\nTotal Marvel (All Marvel Universe comics, released on Thursday, based on scanners release times)\nZero Day (Marvel, DC and Independent comics, released between Saturday night and Sunday afternoon)\nIndependent Scanners (from scanners not affiliated with groups, released on Mondays)\nDC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\nTotal Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\n\n[IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/aa5-1_zpsdb00ee75.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/ffour4_zps1316aedc.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/gotg01_zps6a1ccc93.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/ya2_zps3333a7e0.jpg[/IMG]\n\n\nAvengers Arena #5 (CBR 2/27/2013)\n\nThe Braddock Academy vs. . . themselves? \n\nAvenging Spider-Man #17 (CBR 2/27/2013)\n\nTHE SUPERIOR AGE CONTINUES as the Superior Spider-Man faces the future. . . the FUTURE FOUNDATION, that is. The Superior Spider-Man is forced to work with the FF as the literal future comes crashing in on them, threatening to destroy the Foundation itself and expose Spider-Man's ultimate secret!  PLUS! The Superior Spider-Man doesn't like kids. \n\nFF #4 (CBR 2/27/2013)\n\nIt's Valentine's Day at the Baxter Building! So why does that spell trouble for She-Hulk? \n\nGambit #9 (CBR 2/27/2013)\n\nGambit's hot on the heels of the lady thief who first crossed his path in issue #1!  But what secret is she hiding that may just spell doom for our hero? And how will he manage to steal her away from the horde of super villains she's surrounded herself with? \n\nGuardians of the Galaxy #0.1 (CBR 2/27/2013)\n\nMove over Avengers the Guardians got this. Star-Lord. Gamora. Drax. Rocket Raccoon. Groot. and the Invincible Iron Man?! The Marvel Universe just got bigger as the legendary cosmic epic returns in the hands of superstar creators Brian Michael Bendis (Avengers, All-New X-Men) and Steve McNiven (Civil War; Old Man Logan). In this special prelude issue meet the man behind the Guardians: Star-Lord and discover how this child of Earth became the leader of the rag-taggiest of teams in all the Galaxy.  All setting the stage for next month's historic Guardians of the Galaxy #1. This is the start of something big, Marvel fans. \n\nHawkeye #8 (CBR 2/27/2013)\n\nCherry's got a gun. And she looks good in it. Hawkeye gets distracted. Just like you are right now. \n\nJourney Into Mystery #649 (CBR 2/27/2013)\n\nGuest starring the Superior Spider-Man + a collection of superstars from the MU firmament!  Ancient Viking Monsters? Eerily Familiar Freaks? Whatever they are, they're invading Midgard!  Sif and her three hench-Berzerkers slither back to Earth in time to help put down this new assault. But can the berserkers keep their bloodlust in check? \n\nThunderbolts #5 (CBR 2/27/2013)\n\nThe return of the gamma-powered MADMAN! The Thunderbolts first mission is going off the rails! Can the team trust the Red Hulk to lead them? \n\nUncanny Avengers #4 (CBR 2/27/2013)\n\nRed Skull and his S-Men move forward their take over of New York. A member of the Uncanny Avengers joins the S-Men! When the chips are down, the fight all but lost, one Avenger must rise and face the terrible might of The Omega Skull! \n\nUncanny X-Men #2 (CBR 2/27/2013)\n\nThere is a mole on Cyclops' team, but who is it? When you hunt the UNCANNY X-MEN you use Sentinels, but when you find out WHO'S DOING THE HUNTING your jaw will drop! \n\nX-Men Legacy #6 (CBR 2/27/2013)\n\nThe groundbreaking first arc of X-MEN: LEGACY ends here!  Discovering a plot to assassinate one of the X-Men that he inadvertently put into motion, Legion infiltrates the Jean Grey School for Higher Learning-but after their last run-in, will the X-Men accept his help?  Meanwhile, Legion learns that the demon lurking in the depths of his psyche has a familiar face. \n\nYoung Avengers #2 (CBR 2/27/2013)\n\nHas Wiccan made a horrible mistake that comes back to bite everyone on their communal posteriors? Spoilers: Yes.  Does this guest star the Uncanny Avengers? Spoilers: Also Yes.  A figure from Loki's past emerges. Friend? Foe? What will it be? Spoilers: It's Foe.  And much more from Marvel's most critically acclaimed book. Yes, we're saying it's critically acclaimed and it's not even out yet. We are very bad. \n\n","torrent":{"xt":"urn:btih:84284c564d4bf8d88905121479f2a412f18d17fc","amp;dn":"Marvel+NOW%21+Week+15+%28darkhomr%29+%5BTPB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84284c564d4bf8d88905121479f2a412f18d17fc","infoHashBuffer":{"type":"Buffer","data":[132,40,76,86,77,75,248,216,137,5,18,20,121,242,164,18,241,141,23,252]},"announce":[],"urlList":[]}}