{"title":"Microsoft Windows XP Home SP3 January 2012 + SATA Drivers","uid":6961201,"size":673644544,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:84fa77468e651e66a18930af8847bab2096c896a&amp;dn=Microsoft+Windows+XP+Home+SP3+January+2012+%2B+SATA+Drivers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"x1Ninja","files":1,"time":1326762478,"description":"This is my first Windows torrent, and I hope there will be some more coming soon.\n\nI have integrated all the latest updates up until 10th January 2012, with SATA Drivers.\n\nDescription:\nPacked with multimedia features Windows XP Home Edition aims to unlock the full potential of your personal computer. It also looks great, with rounded window corners, larger and more detailed icons, and a clean-look desktop.\n\nThe best thing about Windows XP is that, as it belongs to the Windows NT/2000 product family, it\\'s designed from the ground up for reliability, security, and networking. XP home users will soon see the benefits of this. The dreaded Windows crash and reboot cycle really is much less common with XP, and provided the hardware is up to scratch, XP performance is better too. The downside is that using a different codebase can make compatibility with old applications less good. Business applications normally run fine, but older games, Midi software and system utilities may well cause problems.\n\nXP is more customisable than previous versions, including visual themes that let you change the whole appearance of Windows in an instant. Fast User Switching is a neat feature for computers used by more than one person--it lets another user log on without killing the other user\\'s session, and when you switch back, running applications and open documents are as you left them. This is impressive, but what really counts is that XP properly understands how to deal with multiple users. Each user has their own special folders, like My Documents, which cannot be seen by other users. And for those with more than one computer, the Network Setup wizard simplifies setting up a network.\n\nWindows XP has many strong multimedia features. The new Media Player lets you copy music from CD to hard disk, create your own playlist and write your own music CDs if you have a CD Writer. You can also playback DVD video (but only if a hardware or software DVD decoder is already installed) and play MP3 audio files and MPEG videos (but sadly not the popular Real Media formats). Admittedly, Media Player does nothing that you cannot also do with free alternatives, but it is slick and nicely integrated. There is also Windows Movie Maker, a basic tool for capturing and editing videos, which is fun to use although too limited for serious work.\n\nInstallation:\n1. Mount or Burn ISO\n2. Following on-screen instruction\nSteps After Installation:\n3. Click Start &gt; Activate Windows &gt; Activate Online (DO NOT REGISTER WITH MICROSOFT, YOU MAY MESS IT UP FOR EVERYONE ELSE).\n\nYou might be wondering why I said not to register with microsoft, although the license key I used is OEM, we don\\'t want microsoft picking up on it and blacklisting it :D","torrent":{"xt":"urn:btih:84fa77468e651e66a18930af8847bab2096c896a","amp;dn":"Microsoft+Windows+XP+Home+SP3+January+2012+%2B+SATA+Drivers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84fa77468e651e66a18930af8847bab2096c896a","infoHashBuffer":{"type":"Buffer","data":[132,250,119,70,142,101,30,102,161,137,48,175,136,71,186,178,9,108,137,106]},"announce":[],"urlList":[]}}