{"title":"Brian &quot;Head&quot; Welch - Save Me from Myself: How I Found","uid":7072060,"size":348714169,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:85227360f83c4bbcc20f9157052d4d3c96832173&amp;dn=Brian+%26quot%3BHead%26quot%3B+Welch+-+Save+Me+from+Myself%3A+How+I+Found+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"xxdudeitsmexx","files":1,"time":1330712045,"description":"This is the audiobook for &quot;Save Me from Myself: How I Found God, Quit Korn, Kicked Drugs, And Lived To Tell My Story&quot; - By Brian &quot;Head&quot; Welch.\n\n&quot;The amazing true story of an out-of-control rock star, his devastating addiction to drugs, and his miraculous redemption through Jesus Christ.\n\nIn February 2005, more than ten thousand people in Bakersfield, California, watched as Brian &quot;Head&quot; Welch--the former lead guitarist of the controversial rock band Korn--was saved by Jesus Christ. The event set off a media frenzy as observers from around the world sought to understand what led this rock star out of the darkness and into the light.\n\nNow, in this courageous memoir, Head talks for the first time about his shocking embrace of God and the tumultuous decade that led him into the arms of Jesus Christ. Offering a backstage pass to his time with Korn, Head tells the inside story of his years in the band and explains how his rock star lifestyle resulted in an all-consuming addiction to methamphetamines. Writing openly about the tour bus mayhem of Ozzfest and The Family Values tour, he provides a candid look at how the routine of recording, traveling, and partying placed him in a cycle of addiction that he could not break on his own.\n\nSpeaking honestly about his addiction, Head details his struggles with the drug that ultimately led him to seek a higher power. Despite his numerous attempts to free himself from meth, nothing--not even the birth of his daughter--could spur him to kick it for good. Here Head addresses how, with the help of God, he emerged from his dangerous lifestyle and found a path that was not only right for his daughter, it was right for him.\n\nDiscussing the chaotic end to his time in Korn and how his newfound faith has influenced his relationship with his daughter, his life, and his music, Head describes the challenging but rewarding events of the last two years, exposing the truth about how his moments of doubt and his hardships have only deepened his faith.\n\nCandid, compelling, and inspirational, &quot;Save Me from Myself&quot; is a rock 'n' roll journey unlike any other.&quot;\n\nDon't forget to seed, and I will be uploading Tim Tebow's book, &quot;Through My Eyes&quot; soon, for those interested!","torrent":{"xt":"urn:btih:85227360f83c4bbcc20f9157052d4d3c96832173","amp;dn":"Brian+%26quot%3BHead%26quot%3B+Welch+-+Save+Me+from+Myself%3A+How+I+Found+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85227360f83c4bbcc20f9157052d4d3c96832173","infoHashBuffer":{"type":"Buffer","data":[133,34,115,96,248,60,75,188,194,15,145,87,5,45,77,60,150,131,33,115]},"announce":[],"urlList":[]}}