{"title":"Solitaire Spirit - Les Powles.epub","uid":9482291,"size":2533925,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8566311d421733ee278b51d883b9e74f33ac78d0&amp;dn=Solitaire+Spirit+-+Les+Powles.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1389818940,"description":"Les Powles only had 8 hours of sailing experience when he decided to sail solo around the world. Many novices would be content to just dream of such an adventure, and maybe get as far as a solo Channel crossing a couple of years down the line. Not so Les Powles, one of the twentieth century's most extraordinary and eccentric sailors.\n\nLes was in his 50s when he built himself a yacht with little prior knowledge of boatbuilding. Remarkably he made it across the Atlantic, though his navigation skills didn't match his boatbuilding abilities. His first landfall was Brazil. He'd been aiming for Barbados - 100 miles north, and in a different hemisphere!\n\nThree complete solo circumnavigations followed, all of them full of incident. The last one saw him given up for dead when he hadn't been heard from for four months. His boat had been damaged in a storm, he'd lost all communications and had virtually run out of food. When he sailed up the Lymington River (aged 70) in a skeletal state his arrival caused a media frenzy. Lymington Marina subsequently gave him a free berth for life.\n\nA terrific achiever who has beaten the odds, Les Powles tells his story in a lively, entertaining, humorous and compelling way. It will resonate with sailors and non sailors alike, and may inspire one of them to become the twenty-first century's Les Powles.","torrent":{"xt":"urn:btih:8566311d421733ee278b51d883b9e74f33ac78d0","amp;dn":"Solitaire+Spirit+-+Les+Powles.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8566311d421733ee278b51d883b9e74f33ac78d0","infoHashBuffer":{"type":"Buffer","data":[133,102,49,29,66,23,51,238,39,139,81,216,131,185,231,79,51,172,120,208]},"announce":[],"urlList":[]}}