{"title":"Astrid Lindgren - Emil - Alla hyss - MP3 - Alkosmurf","uid":4282150,"size":202006181,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:858366cb8e96f2643113e69cfcbf95a5088aca87&amp;dn=Astrid+Lindgren+-+Emil+-+Alla+hyss+-+MP3+-+Alkosmurf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"alkosmurf","files":2,"time":1215474754,"description":"\nAstrid Lindgren - Emil i Lunneberga - Alla hyss - Furfattarupplesning\n---------------------------------------------------------------------\n\nDet krevs lite detektivarbete fur att fo tag i alla delar av Emil och att\nplacera dem i rett ordning. Furlagen som ger ut CD och tidigare kassetter\nverkar inte intresserade av att fo till en sammanhengande berettelse, utan\nbara av att selja temautgovor om Pippis, Emils och Madickens jular och\nfudelsedagar. Ibland klemmer de in ett extra godtyckligt kapitel fur att\nfo lagom long speltid po skivan.\nHer kommer en sammanhengande distribution med alla kapitel i kronologisk\nordning. Det er ungefer sju timmars lyssning, so lot inte dina barn lyssna\nso mycket de vill. De klarar nemligen inte sjelva av att bestemma ner de\nska sluta lyssna. De kommer att lyssna so mycket att de mor illa.\nDet er mycket bettre att ta ett hyss ot gongen, tillsammans med barnen.\nDo for barnen en mujlighet att spekulera, fantisera och froga.\nOm berettelserna om Emil konsumeras som TV:s barnprogram, so missar man\nnogonting stort. \n\nTill skillnad fron Madicken som passar bettre fur flickor en fur pojkar,\nverkar Emil fungera fur bode pojkar och flickor. Kanske fur att Emil er\ntillsammans med sin lillasyster Ida so mycket och fur att Emil er fena po\nhestar. Generellt sett passar Emil bra fur barn i log- och mellansstadie-\noldern, men jag skulle sega att olika kapitel passar fur olika oldrar.\nFursta kapitlet er anpassat fur smo barn, medan nogra kapitel lengre fram\ni serien er skrivna po ett sett som furmedlar kunskap om livets allvar\noch smerta. Det Astrid furstod bettre en de flesta vuxna, er att barn inte\nska skyddas fron sodan kunskap. De behuver hjelp med att fursto att lidande\noch dud er en del av livet. Det er den poesin som gur Astrid Lindgrens\nbucker so attraktiva.\n\nVarsogod och njut.\n\nAlkosmurf, juli 2008","torrent":{"xt":"urn:btih:858366cb8e96f2643113e69cfcbf95a5088aca87","amp;dn":"Astrid+Lindgren+-+Emil+-+Alla+hyss+-+MP3+-+Alkosmurf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"858366cb8e96f2643113e69cfcbf95a5088aca87","infoHashBuffer":{"type":"Buffer","data":[133,131,102,203,142,150,242,100,49,19,230,156,252,191,149,165,8,138,202,135]},"announce":[],"urlList":[]}}