{"title":"Gabrielle Lord - Complot 365 (compleet 12-delig), NL Ebook(ePub)","uid":6426942,"size":17016620,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:85cf0c018a6e5a194a630ccdef5dc1c8a13b24c0&amp;dn=Gabrielle+Lord+-+Complot+365+%28compleet+12-delig%29%2C+NL+Ebook%28ePub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"MeMar","files":-1,"time":1306507505,"description":"Gabrielle Lord - Complot 365 (compleet 12-delig), NL Ebook(ePub), DMT \nAuteur: Gabrielle Lord\nNederlands\nGenre: Jeugd / Actie\nUitgever: Kluitman\nJaren van uitgifte: 2009 + 2010\n &lt;a href=&quot;\nhttp://nl.wikipedia.org/wiki/Gabrielle_Lord&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nl.wikipedia.org/wiki/Gabrielle_Lord&lt;/a&gt; &lt;a href=&quot;\nhttp://boekbeschrijvingen.nl/lord-gabrielle/lord.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://boekbeschrijvingen.nl/lord-gabrielle/lord.html&lt;/a&gt; &lt;a href=&quot;\nhttp://www.bol.com/nl/p/nederlandse-boeken/complot-365-januari-voordelig-eerste-deel-van-12-delen/1001004007636538/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bol.com/nl/p/nederlandse-boeken/complot-365-januari-voordelig-eerste-deel-van-12-delen/1001004007636538/index.html&lt;/a&gt;\n\nMaak dat je wegkomt. Duik onder en hou je gedeisd tot 31 december volgend jaar. Alsjeblieft! 365\n dagen. Je hebt nog 365 dagen.\n\nWat zou jij doen als er een verwarde man op je af komt met deze waarschuwing? Callum Ormond \nweet niet wat hij er mee aanmoet. Wat is er over 365 dagen? En waarom moet hij in godsnaam \nonderduiken? Zou het iets te maken hebben met de mysterieuze dood van zijn vader?\nAl gauw wordt het Callum pijnlijk duidelijk dat hij de waarschuwing maar beter serieus kan nemen. \nZijn rustige en overzichtelijke wereld verandert in een sneltreinvaart in een totale nachtmerrie. De \nwoorden van de vreemde boodschapper blijven als een mantra in zijn hoofd rondspoken:'Ze zullen \nop je jagen! 365 dagen lang!'\n\nDeze torrent bevat de volgende boeken:\n\nGabrielle Lord - Complot 365 - 01 Januari.epub\nGabrielle Lord - Complot 365 - 02 Februari.epub\nGabrielle Lord - Complot 365 - 03 Maart.epub\nGabrielle Lord - Complot 365 - 04 April.epub\nGabrielle Lord - Complot 365 - 05 Mei.epub\nGabrielle Lord - Complot 365 - 06 Juni.epub\nGabrielle Lord - Complot 365 - 07 Juli.epub\nGabrielle Lord - Complot 365 - 08 Augustus.epub\nGabrielle Lord - Complot 365 - 09 September.epub\nGabrielle Lord - Complot 365 - 10 Oktober.epub\nGabrielle Lord - Complot 365 - 11 November.epub\nGabrielle Lord - Complot 365 - 12 December.epub\n\nJanuari\n\nCallum lijkt te zijn beland in een achtbaan, een nachtmerrie die maar doorgaat. Wat wordt er bedoeld met \nde Ormond Singulariteit? \n\n\nFebruari\n\nAlleen en op de vlucht... Wie kun je vertrouwen?\n\nCallum Ormond wordt door de politie gezocht voor poging tot moord op zijn zusje. Tegelijkertijd wordt hij \nopgejaagd door twee criminele bendes die allebei hetzelfde willen: de Ormond Singulariteit. Wat dat precies \nis? Callum heeft geen idee. Maar wat het ook is, hij zal de komende 11 maanden moeten vechten voor zijn leven.\n\nNog 334 dagen... \n\nMaart\n\nCallum zit nu twee maanden ondergedoken. Inmiddels begint hij er aan te wennen wat het betekent om altijd \nover je schouder te moeten kijken. Om afhankelijk te zijn van mensen van wie je niet zeker weet of je ze \nkunt vertrouwen.\n\nOndertussen weet hij nog steeds niet wat zijn vader hem heeft willen vertellen voor hij stierf. Dus zit er \nmaar ÃƒÂ©ÃƒÂ©n ding op: als hij zijn belagers te slim af wil zijn, zal hij de originele tekst van het Ormond \nRaadsel moeten vinden.\n\nNog 306 dagen... \n\n\nApril\n\nCallum is volkomen uitgeput. Hij heeft dagen door de wildernis gezworven, achtervolgd door criminelen en \nbeschoten door het leger.\n\nBij een benzinestation kan hij eindelijk zijn telefoon weer opladen. Maar als hij Boges belt, heeft zijn \nvriend een verschrikkelijk bericht voor hem: 'Ze hebben Gabi opgegeven, Cal. Ze trekken de stekker eruit! \nJe moet komen om ze tegen te houden.'\n\nCallum kan zich niet langer verschuilen. Het leven van zijn zusje staat op het spel.\n\nNog 275 dagen... \n\n \n\nMei\n\nCallum ontwaakt in een kale ruimte met een stekende pijn in zijn nek. Hij komt tot de ontdekking dat zijn \nidentiteit is gestolen en dat hij is opgesloten in een inrichting. En nog veel erger: hij is zijn rugzak \nkwijt! Alle aanwijzingen die hij nodig heeft om het raadsel rond zijn familie op te lossen zijn in ÃƒÂ©ÃƒÂ©n \nklap verdwenen.\n\nHoe komt hij hier in godsnaam weg? Contact met de buitenwereld is onmogelijk. En niemand gelooft wie hij \nwerkelijk is...\n\nNog 235 dagen... \n\n\nJuni\n\nCallum kan maar aan ÃƒÂ©ÃƒÂ©n ding denken: het Ormond-juweel. Als hij dit mysterieuze sieraad wil zien te bemachtigen \nheeft hij hulp nodig van mensen op wie hij kan rekenen.\n\nMaar wie kan hij vertrouwen? Zijn vriend Boges is okÃƒÂ©, dat weet hij zeker. Maar Winter Frey? Hoe betrouwbaar \nis zij?\n\nNog 205 dagen... \n\n\nJuli\n\nCallum heeft ze eindelijk allebei in handen: het Ormond-juweel en het raadsel over zijn familie. Hij hoopt \nnu snel achter het geheim van zijn familie te komen, ook al wordt hij harder opgejaagd dan ooit.\n\nHet is duidelijk dat zijn achtervolgers hem voor zijn zestiende verjaardag, 31 juli, dood willen hebben. \nMaar waarom? Hoe eerder Callum daar achter komt, hoe beter...\n\nNog 184 dagen... \n\n\nAugstus\n\nHet is dan toch gebeurd. Callum is gearresteerd op verdenking van meerdere pogingen tot moord en... het \nkidnappen van Gabi: zijn eigen zusje! Hij kan zijn onschuld alleen bewijzen door Gabi te bevrijden uit \nde handen van haar ontvoerders.\n\nGelukkig ligt hij op een bewaakte ziekenhuiskamer en zit hij niet in een cel in de gevangenis. Als hij \nwil ontsnappen, moet hij het nu doen...\n\nNog 153 dagen... \n\n\nSeptember\n\nDe afgelopen 8 maanden is Callum Ormond constant op de vlucht geweest. Voor de politie, die hem er van \nverdenkt dat hij zijn eigen zusje Gabi heeft proberen te vermoorden. En voor de criminele bendes van \nVulkan Sligo en Oriana de la Force. Zij zijn - net als Callum - op jacht naar de waarheid achter de \nOrmond-singulariteit, voordat deze aan het eind van het jaar zijn geldigheid verliest.\n\n\n\nOktober\n\nBeschrijving\nDe afgelopen 9 maanden is Callum Ormond constant op de vlucht geweest. Voor de politie, die hem er van \nverdenkt dat hij zijn eigen zusje Gabi heeft proberen te vermoorden. En voor de criminele bendes van \nVulkan Sligo en Oriana de la Force. Zij zijn - net als Callum - op jacht naar de waarheid achter de \nOrmond-singulariteit, voordat deze aan het eind van het jaar zijn geldigheid verliest.\n\nMet nog 3 maanden te gaan, heeft Callum meer vragen dan antwoorden. Toch zal hij het complot waarin hij \nverzeild is geraakt voor 31 december moeten ontrafelen\n\n\nNovember\n\nDe afgelopen 10 maanden is Callum Ormond constant op de vlucht geweest. Voor de politie, die hem er van \nverdenkt dat hij zijn eigen zusje Gabi heeft proberen te vermoorden. En voor de criminele bendes van \nVulkan Sligo en Oriana de la Force. Zij zijn - net als Callum - op jacht naar de waarheid achter de \nOrmond-singulariteit, voordat deze aan het eind van het jaar zijn geldigheid verliest.\n\nMet nog 2 maanden te gaan, heeft Callum meer vragen dan antwoorden. Toch zal hij het complot waarin \nhij verzeild is geraakt voor 31 december moeten ontrafelen.\n\n\nDecember\n\nDe afgelopen 11 maanden is Callum Ormond constant op de vlucht geweest. Voor de politie, die hem er \nvan verdenkt dat hij zijn eigen zusje Gabi heeft proberen te vermoorden. En voor de criminele bendes \nvan Vulkan Sligo en Oriana de la Force. Zij zijn - net als Callum - op jacht naar de waarheid achter \nde Ormond-singulariteit, voordat deze op 31 december zijn geldigheid verliest.\n\nNog 31 dagen te gaan...\n\n\nCategorie: Beeld\nFormaat: ePub\nTaal: Nederlands \nGenre:  Jeugd / Actie\n\nDeze boeken worden u aangeboden door:\n\nDUTCH MOVIE THEATER\n\n","torrent":{"xt":"urn:btih:85cf0c018a6e5a194a630ccdef5dc1c8a13b24c0","amp;dn":"Gabrielle+Lord+-+Complot+365+%28compleet+12-delig%29%2C+NL+Ebook%28ePub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85cf0c018a6e5a194a630ccdef5dc1c8a13b24c0","infoHashBuffer":{"type":"Buffer","data":[133,207,12,1,138,110,90,25,74,99,12,205,239,93,193,200,161,59,36,192]},"announce":[],"urlList":[]}}