{"title":"[Ebook-Ita-Fantasy-Pdf]Christopher Paolini - Brisingr[survivalof","uid":5152038,"size":2592336,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:867221286d5f721b8ef7de5e24bc027b5055d3c0&amp;dn=%5BEbook-Ita-Fantasy-Pdf%5DChristopher+Paolini+-+Brisingr%5Bsurvivalof&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mitimex","files":1,"time":1257617398,"description":"\n\nUna fanciulla da liberare. Un fratello da combattere. Un'ereditÃƒÂ  da reclamare. Molte cose sono cambiate nella vita di Eragon da quando l'uovo della dragonessa Saphira ÃƒÂ¨ comparso dal nulla sulla Grande Dorsale: suo zio ÃƒÂ¨ stato ucciso, Brom il cantastorie si ÃƒÂ¨ sacrificato per proteggerlo dai terribili Ra'zac, il fratello che non sapeva di avere si ÃƒÂ¨ rivelato uno dei suoi peggior nemici. Molte cose sono cambiate, altre no: Galbatorix soffoca ancora AlagaÃƒÂ«si con la sua tirannia, e il giovane Cavaliere e la sua dragonessa rimangono l'ul speranza di detronizzarlo. Ma Eragon ÃƒÂ¨ davvero all'altezza di questo compito? battaglia delle Pianure Ardenti, Murtagh e Castigo si sono dimostrati avversar pericolosi; il sangue di cui si ÃƒÂ¨ macchiato tormenta le sue notti insonni; l'a che gli era stata donata non ÃƒÂ¨ piÃƒÂ¹ nelle sue mani. E non c'ÃƒÂ¨ tempo di tornare elfi, non c'ÃƒÂ¨ tempo di riposare, non c'ÃƒÂ¨ tempo di trovare una nuova spada: Kat ÃƒÂ¨ nelle mani di Galbatorix, e per salvarla bisogna entrare nell'Helgrind, dove orribili sacrifici umani vengono compiuti tutti i giorni... Christopher Paolini conduce ancora il lettore nella terra dove i draghi esistono, dove la magia ÃƒÂ¨ l'unica speranza di umani, elfi e nani contro tiranni e creature demoniache, in questo che ÃƒÂ¨ il terzo volume delle avventure del Cavaliere dei draghi. EtÃƒÂ  di lettura: da 11 anni.\n","torrent":{"xt":"urn:btih:867221286d5f721b8ef7de5e24bc027b5055d3c0","amp;dn":"%5BEbook-Ita-Fantasy-Pdf%5DChristopher+Paolini+-+Brisingr%5Bsurvivalof","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"867221286d5f721b8ef7de5e24bc027b5055d3c0","infoHashBuffer":{"type":"Buffer","data":[134,114,33,40,109,95,114,27,142,247,222,94,36,188,2,123,80,85,211,192]},"announce":[],"urlList":[]}}