{"title":"Quantico.[ebook].","uid":6243362,"size":8567644,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:868072c7f2ad322517aaac92d705344f7f683594&amp;dn=Quantico.%5Bebook%5D.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zurera","files":-1,"time":1300148619,"description":"En un futuro inquietantemente cercano, el terrorismo estÃƒÂ¡ fuera de control. La CÃƒÂºpula de la Roca de JerusalÃƒÂ©n ha saltado por los aires en una acciÃƒÂ³n terrorista, y, como represalia, miles de personas han muerto en otro gran ataque a los Estados Unidos. La experimentaciÃƒÂ³n con nuevas armas en remotos laboratorios es un hecho; nadie se siente a salvo.\n\n\n\nEn este contexto, el FBI deberÃƒÂ¡ tratar con una nueva amenaza. Un misterioso estadounidense que se hace llamar John Brown ha contactado con los seÃƒÂ±ores de la droga en Guatemala, con los colonos judÃƒÂ­os en Israel y con los terroristas islÃƒÂ¡micos iraquÃƒÂ­es. Su propÃƒÂ³sito: intentar venderles un virus capaz de exterminar a poblaciones enteras. William Griffin, Fouad Al-Husam y Jane Rowland, tres agentes que estÃƒÂ¡n acabando su adiestramiento en Quantico, la Academia del FBI, encuentran en este caso su primer desafÃƒÂ­o. En su caza al terrorista, los jÃƒÂ³venes agentes unen fuerzas con una veterana experta en bioterrorismo. Pero la trama que descubren -y el hombre al que persiguen- demuestra ser mucho mÃƒÂ¡s peligrosa de lo que cualquiera habrÃƒÂ­a pensado. La gran amenaza se cierne sobre la civilizaciÃƒÂ³n; estÃƒÂ¡ escalofriantemente cerca... Nunca una lectura habÃƒÂ­a sido tan reveladora de lo que nos acecha en el futuro.","torrent":{"xt":"urn:btih:868072c7f2ad322517aaac92d705344f7f683594","amp;dn":"Quantico.%5Bebook%5D.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"868072c7f2ad322517aaac92d705344f7f683594","infoHashBuffer":{"type":"Buffer","data":[134,128,114,199,242,173,50,37,23,170,172,146,215,5,52,79,127,104,53,148]},"announce":[],"urlList":[]}}