{"title":"Dave Brubeck - 1958 - Newport 1958 (2009) FLAC","uid":9098273,"size":383629941,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:87f658fb365e9460e1470f16b741fbb64c7c18c2&amp;dn=Dave+Brubeck+-+1958+-+Newport+1958+%282009%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eika256","files":-1,"time":1382729902,"description":"Dave Brubeck - 1958 - Newport 1958 (2009)\n\nThis 1958 set by the Dave Brubeck Quartet comes from the Newport Jazz Festival on a day which served as a tribute to Duke Ellington, with each band playing a set primarily drawn from Ellington's vast repertoire. Alto saxophonist Paul Desmond and drummer Joe Morello are in top form, as is bassist Joe Benjamin (who first worked with Ellington in 1951 and was his regular bassist from 1970 to 1974) who substitutes for Eugene Wright. The inspired choice of &quot;Jump for Joy&quot; makes for some of the most magical moments, while &quot;Perdido&quot; provides an extended workout for Desmond and Brubeck. &quot;Liberian Suite Dance No. 3&quot; is oddly described in the liner notes as coming from Black, Brown and Beige though it is actually one movement of Ellington's Liberian Suite, which was premiered in late 1947 and quickly dropped from his repertoire. Brubeck's &quot;The Duke,&quot; an elegant tribute to Ellington that showcases Desmond's lyrical alto and the exciting finale of &quot;C Jam Blues&quot; (the latter spotlighting Morello are also highlights. &quot;Take the 'A' Train&quot;, omitted from the album credits, is heard as a one chorus tag at the conclusion. It is a bit odd that several tracks were re-recorded several weeks later without explanation in the notes, evidently due to the audio problems which plagued Ellington's own set from that evening at Newport, though the applause is dubbed in at the conclusion of these selections. Long out of print, this somewhat rare LP has only been reissued on CD in Japan. It is frustrating that this is not an expanded reissue, as separate sets were performed for radio broadcast (presumably for the Voice of America) and commercial release during the Newport engagement. (AllMusic)\n\nTrack list:\n01. Things Ain't What They Used To Be - Things Ain't What They Used To Be\n02. Jump For Joy - Jump For Joy\n03. Perdido - Perdido\n04. The Duke - The Duke\n05. Liberian Suite - Dance No.3 - Liberian Suite - Dance No.3\n06. Flamingo - Flamingo\n07. C Jam Blues - C Jam Blues\n08. Pilgrim`s Progress - Pilgrim`s Progress\n\nPersonnel:\nPaul Desmond (as)\nDave Brubeck (p)\nJoe Benjamin (b on #1-7)\nNorman Bates (b on #8)\nJoe Morello (d on #1-7)\nJoe Dodge (d on #8)\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:87f658fb365e9460e1470f16b741fbb64c7c18c2","amp;dn":"Dave+Brubeck+-+1958+-+Newport+1958+%282009%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87f658fb365e9460e1470f16b741fbb64c7c18c2","infoHashBuffer":{"type":"Buffer","data":[135,246,88,251,54,94,148,96,225,71,15,22,183,65,251,182,76,124,24,194]},"announce":[],"urlList":[]}}