{"title":"Foundation XML and E4X for Flash and Flex","uid":9848876,"size":4172868,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:882f8cf6f115bde3586c458b9cf236c05c5d4c6b&amp;dn=Foundation+XML+and+E4X+for+Flash+and+Flex&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"xXGalaxyXx","files":-1,"time":1396120207,"description":"2009 | 493 Pages | ISBN: 1430216344 | PDF | 4 MB\n \nXML is the lingua franca of the Web. All designers and developers working in a web environment need a sound understanding of XML and its role in application development. Many software packages and organizations allow for the exchange of data using an XML format. Web services and RSS feeds are now commonplace. \nFor those working with Flash and Flex, a thorough understanding of XML is particularly important. XML documents are one option for the data provided to SWF applications. Flash and Flex can load, display, and modify XML content. These applications can also send XML content to other applications for updating or for use in different situations. \nActionScript 3.0 introduced some fundamental changes to the way in which Flash and Flex applications work with XML. One significant change is that XML is now a native data type. ActionScript 3.0 also introduced new classes and a different framework for working with external documents. These changes are based on the E4X ECMAScript standard, and they streamline and simplify the process for working with XML in Flash and Flex. \nIn Foundation XML and E4X for Flash and Flex, Sas Jacobs gives you an introduction to XML and E4X. She explores the XML and XMLList classes and explains E4X expressions, providing examples for both Flash and Flex. In addition to explaining how to incorporate XML documents in Shockwave Flash applications, Sas shows you approaches specific to Flash and Flex and explores real-world usage. The book finishes with two case studies. In the first, you will learn how to consume and display information and images from Flickr using Flash. In the second, you will work with Adobe Kuler in Flex. \nWhether you are a designer or developer, this book will help you work with XML and make the transition from ActionScript 2.0 to ActionScript 3.0. It will also provide you with an excellent grounding if you are new to Flash and Flex. ","torrent":{"xt":"urn:btih:882f8cf6f115bde3586c458b9cf236c05c5d4c6b","amp;dn":"Foundation+XML+and+E4X+for+Flash+and+Flex","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"882f8cf6f115bde3586c458b9cf236c05c5d4c6b","infoHashBuffer":{"type":"Buffer","data":[136,47,140,246,241,21,189,227,88,108,69,139,156,242,54,192,92,93,76,107]},"announce":[],"urlList":[]}}