{"title":"Gaspar NoÃƒÂ© - Une ExpÃƒÂ©rience D'hypnose TÃƒÂ©lÃƒÂ©visuelle","uid":4762168,"size":48317621,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:88dbc25335e48e9720d91df77c3266d6218a5a9d&amp;dn=Gaspar+No%C3%83%C2%A9+-+Une+Exp%C3%83%C2%A9rience+D%5C%27hypnose+T%C3%83%C2%A9l%C3%83%C2%A9visuelle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"FuckFCC","files":1,"time":1236733940,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0344511/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0344511/&lt;/a&gt;\n\nGaspar NoÃƒÂ© - Une ExpÃƒÂ©rience D'hypnose TÃƒÂ©lÃƒÂ©visuelle (Short Film 1995)\n'A Hypnosis Experience of Television'\n\nWith: Marie-France and Alain Ganas\nMusic: Etienne Charry\nDirector of photography: Jean Poisson \n\nDirector: Gaspar NoÃƒÂ©\nWriter: Gaspar NoÃƒÂ© (writer)\nGenre: Short \nRuntime: 27 min\nCountry: France\nLanguage: French\nColor: Color \n\nThe opinion of Chris &amp; www.whofficial.com lesitedeGaspardNoÃƒÂ©\n\nExperience ... begins with a black background on which white scrolls Warning: the show that follows is intended to positively program your conscious and your subconscious with a variety of subliminal messages visual and audible. And indeed that is exactly what is to follow, this means that you're watching a television at home. This program was filmed with the system hypnocamera ... we wish you well and thanks to our experience, we will help you realize you ... set the center of the screen, and do not let any more thoughts you entertain.\nA doctor appears in black suit, the hypnotherapist Carnac, which is for you (you the viewer). Is a music genre TV show, the only scenery behind him is a red curtain (with variations of light intensities). Carnac the doctor tells you a brief introduction about what hypnosis can speak (to you the viewer) in the manner of a guru. Look at me, I am here to guide you, I know who you are, I know you, I know what is wrong, I know what you need, you need love, you see your face ne ment not, you can not hide, I see you both as you see me, I watch you, you do more gutters. Look me in the eyes.\nAt this time appears very quickly a very close eye on her. It's like a subliminal image, ie an image that is so fast that we will not realize it but the brain it has collected and stored.\nAnd now you leave me no more than a glance, there are only you and me and we will make a trip together.\nThen follows a speech with his voice that dictates how you behave (the set of eyes, stand still with hands on knees).\nYou feel more and more heavy, I will count up 7 and you go to sleep.\nWe heard a sound like a deaf vombrissement and a hiss of particles that invade you (the audience that you obey the doctor).\nYou heard my voice as you sleep and pronfondÃƒÂ©ment.\nThere is a small music and you reach a level of hypnosis as you commanded the doctor.\nI will make you the happiest of people, a warm belly spreads in your body, your mind is controlled entirely by me, now empty your mind, your reality is changing.\nThe curtain behind him slowly becomes purple, then blue.\nThe world is not what you think about it, life is a dream.\nThe curtain becomes green.\nYou is not what you believed to be, become what you are.\nThe curtain becomes yellow, then red again.\nIt took approximately 18min30sec from the beginning, and this time he announced that his voice will be replaced by Marie-France. His image will flash a little (like subliminal image) appears and then Marie-France, a blonde woman of about thirty, black-legged serious. You (your audience) spoke on the same tone that the doctor previously, with a voice quiet yet firm so that you obey.\n12 Consider your desires that you want to receive.\nPoints of light are moving curtain you.\nIt is a wonderful years ahead, you can achieve everything.\nYou (your audience) is then repeated after her sentences are like commands, one after the other, it drives you and makes you repeat her high voice at home.\nI am a human being and I forgive.\nI built a future of joy and happiness.\nI am free to become all that I am able to devenir.A From that moment my life working very well.\nI too deserve the good things of life.\nThe effort and audacity raise mountains.\nConclusion: the future is beautiful and full of surprises, here is your resolutions, you'll build your future, your assets are your strength and tone your intelligence.\nOn the curtain, as there are halos of light moving, rays coming toward you.\nI will count up 7 and you'll wake up full of confidence and optimism, very well the hypnosis session is over, a great day lies before you, this is the start of a fabulous period you are already being built.\nThen the film finished by an &quot;it was a television experience, with soft music genre heavenly atmosphere on a purple background.\n\nThere are no credits at the beginning or end with the usual particulars such as names of a production company, the director, writer, actors ... Nor is it mentioned that Gaspard NoÃƒÂ© who made this film.\nThis was announced at the beginning (the show that follows is intended to positively program your conscious and your subconscious with messages sublimaux various visual and audio) is exactly what happens during the film! Apparently you could say it's a long sequence plan still more than 25 minutes, no camera movement takes place, the viewer is focused on what happens in this case that a hypnotist (you) talking about. If at the beginning his words are smiling, we are very quickly aware of what he says. These are words of small talk between localities and common speech guru new-age cult. This resembles in its short time in one medium-length film, and that is the length of this film that almost forces to do what we demand the screen. It's so unusual and well done that the game takes If you experience a day of &quot;An experience of hypnosis television&quot; perhaps you verify that this is true until you are more relaxed and happy to have been had!\n","torrent":{"xt":"urn:btih:88dbc25335e48e9720d91df77c3266d6218a5a9d","amp;dn":"Gaspar+No%C3%83%C2%A9+-+Une+Exp%C3%83%C2%A9rience+D%5C%27hypnose+T%C3%83%C2%A9l%C3%83%C2%A9visuelle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88dbc25335e48e9720d91df77c3266d6218a5a9d","infoHashBuffer":{"type":"Buffer","data":[136,219,194,83,53,228,142,151,32,217,29,247,124,50,102,214,33,138,90,157]},"announce":[],"urlList":[]}}