{"title":"Discografia de Enya[MP3][Celtic]","uid":4628271,"size":1436977939,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8a86f8dd2357efd6b9375966c3e081b12bcdda7b&amp;dn=Discografia+de+Enya%5BMP3%5D%5BCeltic%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"webchella","files":370,"time":1231287952,"description":"Enya, cuyo nombre real es Eithne N'' Bhraonein, naciÃƒÂ³ el 17 de Mayo de 1961 en Dore, Gweedore, Irlanda. Tras estudiar piano clÃƒÂ¡sico por varios aÃƒÂ±os, pasÃƒÂ³ a ser integrante del grupo Clannad antes de embarcarse en una carrera como solista que la bendijo - inesperadamente- con un singular reconocimiento gracias a su single 'Orinoco Flow' en 1988.\n\nHija de un conocido mÃƒÂºsico irlandÃƒÂ©s, Leo Brennan (Brennan es algo asÃƒÂ­ como la traducciÃƒÂ³n de Bhraonein en galÃƒÂ©s), Enya tuvo la suerte de llegar al mundo dentro en un seno familiar caracterizado por su verdadera pasiÃƒÂ³n hacia la mÃƒÂºsica. Su madre tambiÃƒÂ©n se dedicaba a este Arte, y en 1968 dos de sus hermanos y tres de sus tÃƒÂ­os formaron el grupo An Clann As Dobhar.\n\nEl nombre fue al poco tiempo acortado por Clannad y otra integrante de la familia, la arpista y vocalista Meire Brennan, se plegÃƒÂ³ al proyecto. Enya apoyÃƒÂ³ a la banda con los teclados en 1980 y compartiÃƒÂ³ parte de su ÃƒÂ©xito grabando con ellos varios temas para la televisiÃƒÂ³n, lo cual les abriÃƒÂ³ las puertas. Sin embargo, Enya, quien solÃƒÂ­a decir que tenÃƒÂ­a poco tiempo para dedicarse a la mÃƒÂºsica pop, nunca se sintiÃƒÂ³ del todo cÃƒÂ³moda con el grupo, asÃƒÂ­ que lo abandona amistosamente en 1982.\n\nSus primeras grabaciones aparecieron en la serial de 1985, dirigida por David Puttnam, 'The Frog Prince' ('El PrÃƒÂ­ncipe Rana'). Al aÃƒÂ±o siguiente Enya grabÃƒÂ³ la mÃƒÂºsica para la serial de la BBC 'The Celts' ('Los Celtas'), que dos aÃƒÂ±os despuÃƒÂ©s presenta como su album debut, tambiÃƒÂ©n del mismo nombre. Su estilo tan etÃƒÂ©reo de cantar, tanto en galÃƒÂ©s como en inglÃƒÂ©s, y su forma de instrumentar los temas con los sintetizadores, no fue del todo apreciado al principio. Sin embargo, al aÃƒÂ±o siguiente Enya firma un contrato con WEA Records y presenta su segunda producciÃƒÂ³n, 'Watermark'. El album generÃƒÂ³ una sorpresa tremenda, y gracias a 'Orinoco Flow (Sail Away)', recibe todas las ovaciones, ademÃƒÂ¡s de un nada envidiable 5to. lugar en los charts del Reino Unido. Trabajando con sus colaboradores de siempre, Roma Ryan (quien le compone las letras) y Nicky Ryan (su productor), Enya prosiguiÃƒÂ³ ubicando mÃƒÂ¡s obras suyas en los rankings britÃƒÂ¡nicos, como ser 'Evening Falls' y 'Storms In Africa Part II'. El album tambiÃƒÂ©n causÃƒÂ³ un profundo impacto en los cÃƒÂ­rculos estadounidenses, recibiendo varios discos de platino y la categorizaciÃƒÂ³n de Artista New Age.\n\nLos dos aÃƒÂ±os siguientes mantuvo un bajo perfil desde un punto de vista artÃƒÂ­stico, si bien durante ese periodo realizÃƒÂ³ un trabajo conjunto con Sinead O'Connor. En 1991 regresa a los charts con 'Shepherd Moons', que hacia mediados de los 90's vendiÃƒÂ³ 10 millones de copias. Nuevamente, logra conquistar a los norteamericanos, y en 1993 gana un Grammy dentro de la categorÃƒÂ­a 'Mejor Album New Age'.\n\nSu tercera colecciÃƒÂ³n, 'The Memory Of Trees' (1995) no despertÃƒÂ³ tanto interÃƒÂ©s como los anteriores, pero de alguna manera su mÃƒÂºsica, tan cÃƒÂ¡lida y ambiental, sigue siendo su fuerte. Mientras otras influencias culturales juegan un importante rol en este album, son las melodÃƒÂ­as celtas las que se destacan aquÃƒÂ­, que sin dudas son su polo atractivo y diferencial.\n\nDos aÃƒÂ±os despuÃƒÂ©s lanza 'Paint the Sky with Stars: The Best of Enya' una colecciÃƒÂ³n de 16 magistrales obras, 14 de las cuales repasa lo mÃƒÂ¡s comercial de 'The Celts', 'Watermark', 'Shepherd Moons' y 'Memory of The Trees', a lo que agrega dos nuevos bonus tracks: 'Only If...' y 'Pain the Sky with Stars'\n\nA fines del mes de Noviembre del 2000, Enya retornÃƒÂ³ al firmamento discogrÃƒÂ¡fico con su nuevo single, 'Only Time', y su primer album de estudio en cinco aÃƒÂ±os, 'A Day Without Rain'.\n\nDurante toda su trayectoria, vendiÃƒÂ³ 44 millones de discos en todo el mundo, poniÃƒÂ©ndose a la par de Cher, Tina Turner, Madonna y Whitney Houston desde un sentido netamente comercial. SÃƒÂ³lo en el Reino Unido se impuso con 3.5 millones de copias, y mÃƒÂ¡s de 12 millones en los Estados Unidos, siendo 'Paint The Sky With Stars' una de las 100 producciones mÃƒÂ¡s vendidas en ese paÃƒÂ­s.\n\nEstos datos permitieron convertir a Enya en la solista que mÃƒÂ¡s discos supo vender en la historia discogrÃƒÂ¡fica de Irlanda.\n\n\n\n\n1984 The Frog Prince\n1987 The celte\n1988 Watermark\n1991 Shepherd Moons\n1995 The memory Of Trees\n1997 Paint The Sky With Stars\n1997 A Box Of Dreams 3 CD\n2000 A Day without Rain\n2001 El SeÃƒÂ±or de los Anillos\n2004 The Magic Of\n2005 Sumiregusa\n2006 Amarantine\n2008 And winter came \n     Oniy time 4 CD Collection\n     Curiosidades\n     Remixes\n     Singles ","torrent":{"xt":"urn:btih:8a86f8dd2357efd6b9375966c3e081b12bcdda7b","amp;dn":"Discografia+de+Enya%5BMP3%5D%5BCeltic%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a86f8dd2357efd6b9375966c3e081b12bcdda7b","infoHashBuffer":{"type":"Buffer","data":[138,134,248,221,35,87,239,214,185,55,89,102,195,224,129,177,43,205,218,123]},"announce":[],"urlList":[]}}