{"title":"Tales of the Black Freighter - From the Pages of Watchmen","uid":4663597,"size":8934189,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:8a93395ca8d45dd03bf1c544aebc5e2bebdb2894&amp;dn=Tales+of+the+Black+Freighter+-+From+the+Pages+of+Watchmen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"brodahisou","files":-1,"time":1232483664,"description":"Alan Moore and Dave Gibbons Watchmen features a story within a story in the form of Tales of the Black Freighter, a fictional comic book from which scenes appear in issues three, five, eight, nine, ten, and eleven. The fictional comic's story, &quot;Marooned&quot;, is read by a black youth in New York City. Moore and Gibbons conceived a pirate comic because they reasoned that since the characters of Watchmen experience superheroes in real life, &quot;they probably wouldn't be at all interested in superhero comics.&quot; Gibbons suggested a pirate theme, and Moore agreed in part because he is &quot;a big [Berthold] Brecht fan&quot;: the Black Freighter alludes to the song &quot;SeerÃƒÂ¤uberjenny&quot; (&quot;Pirate Jenny&quot;) from Brecht (and Kurt Weill)'s Threepenny Opera. Moore theorized that since super-heroes existed, and existed as &quot;objects of fear, loathing, and scorn, the main super-heroes quickly fell out of popularity in comic books, as we suggest. Mainly, genres like horror, science fiction, and piracy, particularly piracy, became prominent--with EC riding the crest of the wave.&quot; Moore felt that &quot;the imagery of the whole pirate genre is so rich and dark that it provided a perfect counterpoint to the contemporary world of Watchmen&quot;. The writer expanded upon the premise so that its presentation in the story would add subtext and allegory. The supplemental article detailing the fictional history of Tales of the Black Freighter at the end of issue five credits real-life artist Joe Orlando as a major contributor to the series. Moore chose Orlando because he felt that if pirate stories were popular in the Watchmen universe that DC editor Julius Schwartz might have tried to lure the artist over to the company to draw a pirate comic book. Orlando contributed a drawing designed as if it were a page from the fake title to the supplemental piece.\n\n&quot;Marooned&quot; tells the story of a young mariner cast adrift at sea, making his way to his hometown to warn its inhabitants of the coming of the Black Freighter. During his journey he is &quot;forced by the urgency of his mission to shed one inhibition after another&quot;, including using the bodies of his dead shipmates as a make-shift raft and mistakenly killing innocent people as he makes his way to town. When he finally returns home, believing it to already be under the occupation of the ship's crew, he accidentally attacks his own wife in their darkened home. Afterward, he returns to the sea shore, where he finds the Black Freighter; he swims out to sea and climbs aboard the ship. Moore has said that the story of The Black Freighter ends up specifically describing &quot;the story of Adrian Veidt&quot;. Richard Reynolds states that just like Veidt, the protagonist of &quot;Marooned&quot; &quot;hopes to stave off disaster by using the dead bodies of his former comrades as a means of reach his goal&quot;. Moore has said that &quot;Marooned&quot; can also be used as a counterpoint to other parts of the story, such as Rorschach's capture and Dr. Manhattan's self-exile on Mars.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:8a93395ca8d45dd03bf1c544aebc5e2bebdb2894","amp;dn":"Tales+of+the+Black+Freighter+-+From+the+Pages+of+Watchmen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a93395ca8d45dd03bf1c544aebc5e2bebdb2894","infoHashBuffer":{"type":"Buffer","data":[138,147,57,92,168,212,93,208,59,241,197,68,174,188,94,43,235,219,40,148]},"announce":[],"urlList":[]}}