{"title":"'N Sync - It's Gonna Be Me (2nafish)","uid":5375518,"size":168265732,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8aedefd96c9a3733ce1c5f2e5f2048688d8e8e36&amp;dn=%5C%27N+Sync+-+It%5C%27s+Gonna+Be+Me+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1266565307,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;It's Gonna Be Me&quot; is a song by 'N Sync, released as the second single from their 2000 album No Strings Attached. The lyrics are addressed to a woman with apparent attachment issues, connected with bad experiences from previous relationships. The singer assures her that &quot;I'm not like them&quot;, and that he's prepared to wait for her to overcome her problems. When she is ready to love someone again, he maintains, &quot;It's gonna be me&quot;.\n\nThe song was the only Billboard Hot 100 number-one hit for 'N Sync. It topped the chart for 2 straight weeks.\n\nIt has been certified Gold by the RIAA.\n\nThe music video was shot on April 27, 2000, and it was directed by Wayne Isham. It was released on MTV's &quot;Making the Video&quot;, the music video for the song begins in a large toy store, with &quot;Bye Bye Bye&quot; playing in the background. Each group member is an animated plastic doll version of himself in a box similar to their album cover. They punch through the plastic front of their boxes and try to attract the attention of the girl shopping (Kim Smith) so they can be bought. Army men swing down, invade their boxes, and laugh at them when they are bought.\n\nNext, the boys spot a set of Barbie-like dolls and go hang out with them. The Barbies drop a net on them, and again tease them when they are bought and 'N Sync is not.\n\nFinally, the group gets back to their shelf and does a dance for the shopping girl. She buys them, and upon scanning, each doll becomes the real-life version.\n\nAll of this is interspersed with the band in a color-lit room singing and dancing with the lights changing colors.\n\nKim Smith also appears as the puppeteer in &quot;Bye Bye Bye.&quot;\n\nAfter the success of the video, dolls like those portrayed by the band were created. They also had strings attached as a reference to the group's smash hit video &quot;Bye Bye Bye&quot;.\n\nThe video debut on TRL on May 23, 2000.\n\nNo Strings Attached is the second studio album (fourth overall) by American boy band 'N SYNC, released on March 21, 2000. By selling more than 2.4 million copies in its debut week, the album set a U.S. one-week sales record.\n\nBefore the release of No Strings Attached, 'N Sync's second album, the band acrimoniously split from their old management and signed to Jive Records. The ensuing legal battle caused No Strings Attached to be delayed several times; initially, the album was slated to arrive as early as the fourth quarter of 1999. In December 2009, Billboard had named No Strings Attached as the album of the 2000s decade with selling more than 10 millions, following Thriller from Michael Jackson as the album of the 1980s and Jagged Little Pill from Alanis Morissette as the album of the 1990s.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:8aedefd96c9a3733ce1c5f2e5f2048688d8e8e36","amp;dn":"%5C%27N+Sync+-+It%5C%27s+Gonna+Be+Me+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8aedefd96c9a3733ce1c5f2e5f2048688d8e8e36","infoHashBuffer":{"type":"Buffer","data":[138,237,239,217,108,154,55,51,206,28,95,46,95,32,72,104,141,142,142,54]},"announce":[],"urlList":[]}}