{"title":"Kings of Leon - Only By the Night (2008) [24 bit FLAC] [vinyl]","uid":8056863,"size":885685816,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8b863d2fcc460afc735f7600758a6c688c8d34a3&amp;dn=Kings+of+Leon+-+Only+By+the+Night+%282008%29+%5B24+bit+FLAC%5D+%5Bvinyl%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"politux","files":-1,"time":1358987405,"description":"\n  Kings of Leon - Only By the Night (2008) [24 bit FLAC] [vinyl]\n\n  Released: 2008\n  Duration: 45:41\n  Genre: Pop/Rock\n  Style: Alternative, Southern Rock\n  Codec: FLAC\n  Bit Rate: ~ 2,600 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n  Cover: Front\n\n  Side A\n  01. Closer\n  02. Crawl\n  03. Sex On Fire\n  \n  Side B\n  04. Use Somebody\n  05. Manhattan\n  06. Revelry\n\n  Side C\n  07. 17\n  08. Notion\n  09. I Want You\n\n  Side D\n  10. Be Somebody\n  11. Cold Desert\n  12. Frontier City\n\n  With 2007's Because of the Times, Kings of Leon ventured out of the garage and into the arena. Tracks like &quot;Black Thumbnail&quot; and &quot;Camaro&quot; were bold, anthemic rock songs that built upon the barnyard stomp of Youth &amp; Young Manhood, and Because of the Times topped the U.K. charts upon its debut, officially crowning the Kings as rock &amp; roll royalty in the process. Only by the Night arrived one year later, marking the band's fastest turnaround between albums; it also furthered the epic sound that Times introduced, flaunting a set of ringing guitars and radio-ready melodies that pushed the band away from the Allman Brothers' camp. If anything, much of the album took up residence in U2's cathedral, particularly during the one-two-three punch of &quot;Sex on Fire,&quot; &quot;Use Somebody,&quot; and &quot;Manhattan.&quot; Appropriately, Only by the Night became a U2-sized smash on both sides of the Atlantic, selling some six million copies worldwide while firmly pushing the band into the mainstream.\n\nLike many big-sounding albums, Only by the Night is a polarizing piece of work, one that targets new fans at the expense of those who wish Kings of Leon had never shaved their beards or discovered post-'70s rock. To rope in the skeptics, the strongest tracks are pushed toward the album's first half. &quot;Crawl&quot; flexes the band's rock &amp; roll muscle, melding Led Zeppelin-styled crunch with the experimental guitar buzz of U2's Achtung Baby, while &quot;Sex on Fire&quot; makes up for its goofy title with a meteoric chorus tailored to Caleb's voice. (He sounds fantastic throughout the record, even if his vocals continue to be garbled by some untraceable accent, as if he's auditioning for the Jodie Foster role in a Broadway adaptation of Nell.) \n\n  Rounding out the hit-filled segment are &quot;Use Somebody&quot; and &quot;Manhattan,&quot; where Matthew Followill cloaks his guitar riffs in reverb and bassist Jared Followill takes the spotlight sporadically, popping up for quick melodic fills before ducking back into the mix. While past Kings of Leon albums concerned themselves with alcohol, women, and other hedonistic themes, those two songs are nothing but pop/rock grandeur, and Caleb howls their hopeful lyrics like Bono's American-born cousin. Only by the Night focuses on textures and experimentation during the album's latter half, but most songs still deliver some sort of Technicolor melody, from &quot;Notion&quot; (one of the only tracks featuring piano) to the unexpected chorus of &quot;Be Somebody.&quot; Taken as a whole, Only by the Night targets the audience that approved Kings of Leon's sonic shift in 2007, leaving older fans free to damn these tracks for their consciously grand approach. Yes, the album is often cheesy. Yes, some of the more popular songs lost their luster after endless months of radioplay. But Only by the Night remains a potent Kings of Leon record, and the guys have never defined their ambition so clearly.","torrent":{"xt":"urn:btih:8b863d2fcc460afc735f7600758a6c688c8d34a3","amp;dn":"Kings+of+Leon+-+Only+By+the+Night+%282008%29+%5B24+bit+FLAC%5D+%5Bvinyl%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b863d2fcc460afc735f7600758a6c688c8d34a3","infoHashBuffer":{"type":"Buffer","data":[139,134,61,47,204,70,10,252,115,95,118,0,117,138,108,104,140,141,52,163]},"announce":[],"urlList":[]}}