{"title":"[SoM]Dune[DvdRip-DivX5-Ita-AC3]","uid":4442675,"size":1144084480,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8ba8a67333c6a5dd006361debaf0a54f7ddda79b&amp;dn=%5BSoM%5DDune%5BDvdRip-DivX5-Ita-AC3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"mitimex","files":1,"time":1223898976,"description":"Siamo nel 10191, il pianeta Dune ÃƒÂ© ambito da tutti perchÃƒÂ¨ su di esso vi cresce una pianta che fa allungare la vita. I saggi Fremen, ai quali ÃƒÂ© affidato il pianeta, vengono sterminati dagli Harkonnen. Solo il giovane Paul rimarrÃƒÂ  in vita e difenderÃƒÂ  il suo pianeta.\nPer chi ancora non lo sapesse, Dune ÃƒÂ¨ tratto dal celebre romanzo omonimo di Frank Herbert. Chi si fosse perso questo capolavoro (e i suoi infiniti sequel!) corra SUBITO in libreria; c&amp;#039;ÃƒÂ¨ sicuramente un&amp;#039;edizione nuovissima che vi aspetta!\nPer quanto riguarda il film che state per vedere, posso solo aggiungere che si tratta del mio primo DVD (non avevo neanche il lettore!) e la tecnica con cui ÃƒÂ¨ stato realizzato risente del tempo. Merita comunque di essere visto... e rivisto e rivisto etc! Ogni volta scoprirete particolari, anche fondamentali, che vi erano sfuggiti. Se avete letto il libro (e lo do per scontato) non resterete affatto delusi.\n\nIl primo popolare capitolo del Ciclo di Dune di Herbert era sempre stato considerato da alcuni tra i libri &quot;impossibili&quot; da tradurre sul grande schermo, non solo a causa della grande quantitÃƒÂ  di effetti speciali necessari (che nel 1984 non sfruttavano ancora le tecniche digitali ed erano assai costosi) ma soprattutto per la notevole complessitÃƒÂ  della trama e per il particolare stile narrativo utilizzato da Herbert nel suo romanzo, largamente basato su monologhi interiori, profondo e dotato di diversi piani di lettura, con un intreccio che coinvolge un gran numero di personaggi differenti.\nQuello di David Lynch non era stato il primo tentativo di portare Dune sul grande schermo: nei vent&amp;#039;anni trascorsi dall&amp;#039;uscita del libro vi erano stati vari progetti regolarmente falliti, tra i quali quello piÃƒÂ¹ avanzato si doveva ad Alejandro Jodorowsky, il quale aveva coinvolto vari artisti divenuti poi famosi, da Moebius a HR Giger, proponendo persino Salvador DalÃƒÂ¬ per il ruolo dell&amp;#039;Imperatore.\nFu il produttore Dino De Laurentiis ad affidare la regia al giovane David Lynch, che volle occuparsi anche della sceneggiatura collaborando con lo stesso Frank Herbert. Costata nel 1984 la notevole cifra di 44 milioni di dollari, Dune ÃƒÂ¨ stata considerata una delle produzioni di fantascienza piÃƒÂ¹ spettacolari e dispendiose della storia del cinema.","torrent":{"xt":"urn:btih:8ba8a67333c6a5dd006361debaf0a54f7ddda79b","amp;dn":"%5BSoM%5DDune%5BDvdRip-DivX5-Ita-AC3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ba8a67333c6a5dd006361debaf0a54f7ddda79b","infoHashBuffer":{"type":"Buffer","data":[139,168,166,115,51,198,165,221,0,99,97,222,186,240,165,79,125,221,167,155]},"announce":[],"urlList":[]}}