{"title":"Schindler's List","uid":3860773,"size":16796772459,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8bb47cc625bf3cc370276cda1679a45a0058f3ae&amp;dn=Schindler%5C%27s+List&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"kosmonova","files":52,"time":1193477800,"description":"Schindler&amp;#039;s List  (1993)\n\nRUNNING TIME:  \t185 min.\n\nCOUNTRY: \tUnited States\n\nDIRECTOR: \tSteven Spielberg\n\nSCREENWRITER: \tSteven Zaillian\n\nCOMPOSER:       John Williams\n\nCINEMATOGRAPHER: Janusz Kaminski\n\nCAST: Liam Neeson,  Ben Kingsley,  Ralph Fiennes,  Caroline Goodall,  Jonathan Sagalle,  Embeth Davidtz\n\nSTUDIO/PRODUCER: Universal Pictures presents an Amblin Entertainment production\n\nGENRE: \t   Drama\n\nSYNOPSIS: Based on a true story, Steven Spielberg&amp;#039;s Schindler&amp;#039;s List stars Liam Neeson as Oskar Schindler, a German businessman in Poland who sees an opportunity to make money from the Nazis&amp;#039; rise to power. He starts a company to make cookware and utensils, using flattery and bribes to win military contracts, and brings in accountant and financier Itzhak Stern (Ben Kingsley) to help run the factory. By staffing his plant with Jews who&amp;#039;ve been herded into Krakow&amp;#039;s ghetto by Nazi troops, Schindler has a dependable unpaid labor force. For Stern, a job in a war-related plant could mean survival for himself and the other Jews working for Schindler. However, in 1942, all of Krakow&amp;#039;s Jews are assigned to the Plaszow Forced Labor Camp, overseen by Commandant Amon Goeth (Ralph Fiennes), an embittered alcoholic who occasionally shoots prisoners from his balcony. Schindler arranges to continue using Polish Jews in his plant, but, as he sees what is happening to his employees, he begins to develop a conscience. He realizes that his factory (now refitted to manufacture ammunition) is the only thing preventing his staff from being shipped to the death camps. Soon Schindler demands more workers and starts bribing Nazi leaders to keep Jews on his employee lists and out of the camps. By the time Germany falls to the allies, Schindler has lost his entire fortune ? and saved 1,100 people from likely death. Schindler&amp;#039;s List was nominated for 12 Academy Awards and won seven, including Best Picture and a long-coveted Best Director for Spielberg, and it quickly gained praise as one of the finest American movies about the Holocaust.\n\nRegion: PAL\n   \nLanguage: Dolby Digital 5.1: English, Spanish. Dolby Digital DTS: Spanish\n\n\nSubtitles: English, Spanish, Portuguese, Polis.\n\n\nDVD9=&gt;DVD9\n\nDVDDecripter\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0108052/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0108052/&lt;/a&gt;","torrent":{"xt":"urn:btih:8bb47cc625bf3cc370276cda1679a45a0058f3ae","amp;dn":"Schindler%5C%27s+List","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bb47cc625bf3cc370276cda1679a45a0058f3ae","infoHashBuffer":{"type":"Buffer","data":[139,180,124,198,37,191,60,195,112,39,108,218,22,121,164,90,0,88,243,174]},"announce":[],"urlList":[]}}