{"title":"Craig B. Stanford - Meat-Eating and Human Evolution [2001][A]","uid":10462247,"size":24101844,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8d0225a117c1ad4a0a75be628b1a9633b0e5268e&amp;dn=Craig+B.+Stanford+-+Meat-Eating+and+Human+Evolution+%5B2001%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Anette14","files":-1,"time":1404146264,"description":"Description\nProduct Details\nBook Title: Meat-Eating and Human Evolution (Human Evolution Series)\t\nBook Author: Craig B. Stanford (Editor), Henry T. Bunn (Editor)\nSeries: Human Evolution Series\nHardcover: 384 pages\nPublisher: Oxford University Press; 1 edition (June 14, 2001)\nLanguage: English\nISBN-10: 0195131398\nISBN-13: 978-0195131390\n\n===================================================================================\nBook Description\nPublication Date: June 14, 2001 | ISBN-10: 0195131398 | ISBN-13: 978-0195131390 | Edition: 1\nWhen, why, and how early humans began to eat meat are three of the most fundamental unresolved questions in the study of human origins. Before 2.5 million years ago the presence and importance of meat in the hominid diet is unknown. After stone tools appear in the fossil record it seems clear that meat was eaten in increasing quantities, but whether it was obtained through hunting or scavenging remains a topic of intense debate. This book takes a novel and strongly interdisciplinary approach to the role of meat in the early hominid diet, inviting well-known researchers who study the human fossil record, modern hunter-gatherers, and nonhuman primates to contribute chapters to a volume that integrates these three perspectives. Stanford's research has been on the ecology of hunting by wild chimpanzees. Bunn is an archaeologist who has worked on both the fossil record and modern foraging people. This will be a reconsideration of the role of hunting, scavenging, and the uses of meat in light of recent data and modern evolutionary theory. There is currently no other book, nor has there ever been, that occupies the niche this book will create for itself.\n\n===================================================================================\nReviews\n&quot;A series of fascinating and scholarly essays, designed for students but accessible to the general reader, explore issues such as whether hunting and meat consumption were the crucible of human intelligence or held society together.&quot;--New Scientist\n\n&quot;Stanford and Bunn attacked head-on the problem of where, when, and why meat eating appeared by assembling a group of leading anthropologists, archaeologists, and primatologists to discuss the issue at a Wenner-Gren Foundation-sponsored meeting in 1998. Their edited book is the best summary yet of the evidence for meat consumption by hominids. ... The book ... will appeal to anyone interested in human evolution, especially interdisciplinary studies...&quot;--Choice\n\n===================================================================================\nAbout the Author\nCraig B. Stanford is at University of Southern California. Henry T. Bunn is at University of Wisconsin.\n===================================================================================","torrent":{"xt":"urn:btih:8d0225a117c1ad4a0a75be628b1a9633b0e5268e","amp;dn":"Craig+B.+Stanford+-+Meat-Eating+and+Human+Evolution+%5B2001%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d0225a117c1ad4a0a75be628b1a9633b0e5268e","infoHashBuffer":{"type":"Buffer","data":[141,2,37,161,23,193,173,74,10,117,190,98,139,26,150,51,176,229,38,142]},"announce":[],"urlList":[]}}