{"title":"Marcus Roberts - 1999 - In Honor Of Duke FLAC","uid":8778024,"size":363256647,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8d5e70b1a4e2a1ffe33f2d92234919f03c3874e7&amp;dn=Marcus+Roberts+-+1999+-+In+Honor+Of+Duke+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eika256","files":-1,"time":1375609733,"description":"Marcus Roberts - 1999 - In Honor Of Duke FLAC\n\nIn Honor of Duke, a tribute to Duke Ellington lovingly performed by the Marcus Roberts Trio, displays two facets of Roberts' performing style. One is his unrepentant traditionalism. Roberts likes his jazz pure, and delving into Ellington's music provided a whole palette of bits to shine and rearrange without having to cross any musical boundaries. This album also shows off Roberts' technical virtuosity -- he is an expert arranger and an extremely gifted pianist, and he has surrounded himself with the kind of musicians who can make his interpretations communicate the delicacy and energy of the compositions they are based on. Roberts actually makes it his goal to make the trio a more balanced showcase for all of its musicians. &quot;Rickitick Tick,&quot; the first track on In Honor of Duke, shows off this style. The bass and drums lead the song, and when the piano line comes in, it simply fills out the arrangement instead of relegating the rhythm lines to the background. Drummer Jason Marsalis and bassist Roland Guerin never fully sink into the roles of accompanists; instead, they weave in and out of solos throughout the album in a seamless manner. Most of the album stays with the traditional trio format; however, for tracks four and five, Antonio Sanchez is brought in as percussionist and drummer, respectively, to lend a deeper texture and a Latin flavor to the songs. Sanchez, who has sparkled as a member of pianist Danilo Perez's trio, is a fine addition to the formula Roberts has concocted. Roberts isn't really breaking any new ground here, but you may not care. The music is lush and the musicianship is precise, making for a very enjoyable album for Ellington fans and jazz fans in general. (AllMusic)\n\nTrack list:\n01 - Rickitick Tick\n02 - There It Is\n03 - The Feeling Of Something New\n04 - Take A Chance\n05 - Groove Until You Move\n06 - In Honor Of Duke\n07 - On Two Separate Occasions\n08 - Promises, Promises\n09 - Wild Kingdom\n10 - Duke De Suite\n11 - The Beauty Of The Spirit\n12 - Nothin' Like It\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:8d5e70b1a4e2a1ffe33f2d92234919f03c3874e7","amp;dn":"Marcus+Roberts+-+1999+-+In+Honor+Of+Duke+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d5e70b1a4e2a1ffe33f2d92234919f03c3874e7","infoHashBuffer":{"type":"Buffer","data":[141,94,112,177,164,226,161,255,227,63,45,146,35,73,25,240,60,56,116,231]},"announce":[],"urlList":[]}}