{"title":"Classic albums: Metallica - Metallica","uid":4611134,"size":4670836736,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8e03f46385079ae84d108055cc090f1241f7b9ef&amp;dn=Classic+albums%3A+Metallica+-+Metallica&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"evil.ways92","files":1,"time":1230598391,"description":"Nel 1991 i Metallica provocarono un album epocale, senza titolo e dalla copertina completamente nera. Quel disco, detto il &quot;Black Album&quot;, ÃƒÂ¨ divenuto il piÃƒÂ¹ grande successo della band ed insieme un punto di rottura con il loro passato metal, facendo loro perdere buona parte dei fan della prima ora per guadagnarne probabilmente dieci volte tanto, grazie ad un sound meno duro ed a qualche brano piÃƒÂ¹ lento del solito.\nIn questo DVD scoprirete cosa accadde durante le sedute di registrazione di quello che ÃƒÂ¨ diventato, nel bene e nel male, un pezzo di storia del rock; oltre a brani di interviste dell'epoca, Lars Ulrich, James Hetfield ed il produttore Bob Rock vi renderanno infatti partecipi dei loro ricordi, rivelando particolari interessanti ed inediti, come le tensioni tra Rock ed il batterista, i mille problemi incontrati nella registrazione dell'album, lo svolgimento delle sedute di registrazione ed altro ancora.\nIl sonoro ÃƒÂ¨ ottimo ed anche se non sono contenute vere e proprie canzoni, avrete la possibilitÃƒÂ  di sentire il materiale dei Metallica nella loro forma piÃƒÂ¹ grezza, con estratti da canzoni, video e demo.\n\nIl DVD contiene la storia della produzione del famosissimo album dei Metallica attraverso esclusive interviste, foto e performance d'archivio e contributi del produttore Bob Rock e dei membri della band James Hetfield, Lars Ulrich, Kirk Hammett e Jason Newsted. Il video narra tutta la storia soffermandosi sulle tracce principali dell'album, ovvero Enter Sandman, Sad But True, Holier Than Thou, The Unforgiven, Wherever I May Roam e Nothing Else Matters.","torrent":{"xt":"urn:btih:8e03f46385079ae84d108055cc090f1241f7b9ef","amp;dn":"Classic+albums%3A+Metallica+-+Metallica","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e03f46385079ae84d108055cc090f1241f7b9ef","infoHashBuffer":{"type":"Buffer","data":[142,3,244,99,133,7,154,232,77,16,128,85,204,9,15,18,65,247,185,239]},"announce":[],"urlList":[]}}