{"title":"Historical Dictionary of Lithuania {BBS}","uid":7326257,"size":2447512,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8e39947c97e8dab4ab7e81b057a2b0b28ce614a3&amp;dn=Historical+Dictionary+of+Lithuania+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1338762997,"description":"The Lithuanian people have undergone historic changes quite different from those of other European nations. In earlier centuries geography provided strategic advantage and opportunities for expansion but in recent times the country has more often experienced location as a geopolitical curse. After constantly losing territory and shrinking in size, the country disappeared in 1795. However, after World War I a popular national movement led to the restoration of Lithuania as an independent state. World War II and its bloody aftermath brought foreign occupation as well as genocide, mass murder, and destruction unparalleled in the country's modern history. The restoration of independence in 1990 has fundamentally altered Lithuania's geopolitical reality. Integration into the European Union and the North Atlantic Treaty Organization promise a new level of security for the Lithuanian state in the 21st century even as the social and economic transformations present both promising opportunities and difficult challenges.\n\nThe second edition of the Historical Dictionary of Lithuania will serve as a useful introduction to virtually all aspects of Lithuania's historical experience, including the country's relations with its neighbors. This is done through a chronology, an introductory essay, an extensive bibliography, and over 300 cross-referenced dictionary entries on significant persons, places, and events; institutions and organizations; and political, economic, social, cultural, and religious facets.\n\n\n\nHardcover: 428 pages\nPublisher: Scarecrow Press; 2nd Edition edition (February 7, 2011)\nLanguage: English\nISBN-10: 0810849143\nISBN-13: 978-0810849143","torrent":{"xt":"urn:btih:8e39947c97e8dab4ab7e81b057a2b0b28ce614a3","amp;dn":"Historical+Dictionary+of+Lithuania+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e39947c97e8dab4ab7e81b057a2b0b28ce614a3","infoHashBuffer":{"type":"Buffer","data":[142,57,148,124,151,232,218,180,171,126,129,176,87,162,176,178,140,230,20,163]},"announce":[],"urlList":[]}}