{"title":"Ian Dowbiggin - A Merciful End. The Euthanasia Movement in Moder","uid":10394906,"size":2225407,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8eef413b810e54f8a60a141db018a992b7864684&amp;dn=Ian+Dowbiggin+-+A+Merciful+End.+The+Euthanasia+Movement+in+Moder&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1403256041,"description":"Description\nProduct Details\nBook Title: A Merciful End: The Euthanasia Movement in Modern America\t\nBook Author: Ian Dowbiggin\nHardcover: 272 pages\nPublisher: Oxford University Press; 1 edition (January 9, 2003)\nLanguage: English\nISBN-10: 0195154436\nISBN-13: 978-0195154436\n\n===================================================================================\nBook Description\nPublication Date: January 9, 2003 | ISBN-10: 0195154436 | ISBN-13: 978-0195154436 | Edition: 1\nWhile it may seem that debates over euthanasia began with Jack Kervorkian, the practice of mercy killing extends back to Ancient Greece and beyond. In America, the debate has raged for well over a century.\nNow, in A Merciful End, Ian Dowbiggin offers the first full-scale historical account of one of the most controversial reform movements in America. Drawing on unprecedented access to the archives of the Euthanasia Society of America, interviews with important figures in the movement today, and flashpoint cases such as the tragic fate of Karen Ann Quinlan, Dowbiggin tells the dramatic story of the men and women who struggled throughout the twentieth century to change the nation's attitude--and its laws--regarding mercy killing. In tracing the history of the euthanasia movement, he documents its intersection with other progressive social causes: women's suffrage, birth control, abortion rights, as well as its uneasy pre-WWII alliance with eugenics. Such links brought euthanasia activists into fierce conflict with Judeo-Christian institutions who worried that &quot;the right to die&quot; might become a &quot;duty to die.&quot; Indeed, Dowbiggin argues that by joining a sometimes overzealous quest to maximize human freedom with a desire to &quot;improve&quot; society, the euthanasia movement has been dogged by the fear that mercy killing could be extended to persons with disabilities, handicapped newborns, unconscious geriatric patients, lifelong criminals, and even the poor. Justified or not, such fears have stalled the movement, as more and more Americans now prefer better end-of-life care than wholesale changes in euthanasia laws.\nFor anyone trying to decide whether euthanasia offers a humane alternative to prolonged suffering or violates the &quot;sanctity of life,&quot; A Merciful End provides fascinating and much-needed historical context.\n\n===================================================================================\nEditorial Reviews\nFrom Publishers Weekly\nBefore the 20th century, &quot;few Americans... felt that there was a need to legalize euthanasia,&quot; writes Dowbiggin, a professor of history at Canada's University of Prince Edward Island. But as the 20th century progressed, the impact of such scientific thinkers as Darwin and Spencer led to popular endorsements of various theories of eugenics that undercut religious beliefs about the sacredness of human life and promoted popular support not only for a right to die, but for the killing of the feebleminded and infirm. By 1939 &quot;roughly 40 percent of all Americans polled said they supported legalizing government-supervised mercy-killing of the terminally ill.&quot; Dowbiggin has brought together a wealth of social history, medical knowledge and political analysis to elucidate the complex history of U.S. movements that endorsed mercy killing and the ever-shifting public sentiments that they engendered. It was the horrendous misuse of euthanasia under Nazism that shifted both the tone and the content of public discourse. Dowbiggin's clear, nuanced prose untangles the complicated interweaving of these arguments, and he is not afraid to fault the morally dubious arguments of some euthanasia partisans, who made little distinction between mercy killing and the harshest forms of eugenics. Most of Dowbiggin's arguments are illustrated through a history of the Euthanasia Society of America (founded in 1938) and chronicles its evolving positions and high profile cases such as the 1976 New Jersey Supreme Court decision to let Karen Ann Quinlin's parents remove her from a respirator. The final two chapters cover Kevorkian and AIDS-related issues, among other pivot points. Without shying away from making his own ethical judgments, Dowbiggin offers an intellectual and moral approach to a cultural flash point.\n\n===================================================================================\nFrom The New England Journal of Medicine\nEuthanasia is one of the most controversial bioethical issues in many Western societies. The Netherlands and Belgium have recently legalized euthanasia as a medical act under specific conditions, particularly the persistent voluntary request of the patient. In other countries, the question of what physicians are allowed to do in caring for people at the end of their lives is a recurrent theme on the moral agenda of public and political debate. In A Merciful End, Dowbiggin shows that at least since the late 19th century, active euthanasia or mercy killing has been advocated as an acceptable policy. He carefully outlines how, from the start, diverse motives and approaches have been at work. History can therefore explain some of the complexities and ambiguities of the recent debate. In the early decades of the 20th century, euthanasia emerged as a public health measure in the broader context of Progressivism. Euthanasia was advocated as an individual right and, at the same time, as a socially beneficial practice. In this respect, it was closely intertwined with the eugenics movement. The freedom to choose death coincided with the evolutionary duty to die. Dowbiggin describes the 1915 Bollinger case, in which a handicapped newborn did not receive surgery, to demonstrate the connection among mercy killing, social reformation, and utilitarian goals. Between 1920 and 1940, social support for euthanasia increased in American society, with growing media attention and frequent mercy-killing trials, and culminated in the 1938 establishment of the Euthanasia Society of America. In this period, euthanasia was associated not only with eugenics and sterilization laws but also with early advocates of birth control and the women's movement. It was part of the broader agenda against traditional ethics and organized religion of humanism, an ideology that developed in the 1940s. Dowbiggin shows how this agenda combines the argument in favor of individual autonomy with the argument that euthanasia saves taxes and satisfies biologic requirements for social engineering. Voluntary and involuntary euthanasia were necessarily connected, and it was exactly this connection that discredited the movement in the subsequent period (1940 to 1960) when the Nazi atrocities became known. In the 1960s, the use of life-prolonging medical technology instigated a new cultural interest in death, terminal illness, and relief of suffering. Euthanasia again began to dominate the public agenda, but this time, as expressed in catchphrases like the &quot;right to die&quot; and &quot;death with dignity,&quot; the emphasis was primarily on patient autonomy and individual rights. However, the focus was ambiguous: for many, euthanasia referred to the right to refuse treatment; but for proponents of the euthanasia movement there was no distinction between passive and active euthanasia. Dowbiggin describes the resulting change of tactics: if &quot;letting die&quot; was ethically permissible and in need of legalization, the logical next step should be legalizing active euthanasia. But even within the euthanasia movement itself, the historic legacy continued to be divisive. The focus on individual choice, as exemplified in the advocacy of living wills, was often combined with social justifications, such as the need to eliminate &quot;accidents of nature.&quot; This double focus finally destroyed the unity of the movement and led to the founding of new organizations (e.g., the Hemlock Society in 1980) and the emergence of palliative care. Dowbiggin's book is a lively and readable demonstration that the commitment to relieve human suffering has a long history and that the issue of euthanasia tends to reduce the complexities involved. Nobody will reject the notion of death with dignity, but disagreement will persist over what it entails. Is it active or passive euthanasia or both? Is euthanasia voluntary, nonvoluntary, or involuntary -- or all three? Such disagreement is not accidental but intrinsic, as this book shows. Self and society, individual freedom and the common good, are necessarily related. Henk A.M.J. ten Have, M.D., Ph.D.\n\n===================================================================================\nReviews\n&quot;A 'must read' book on the history of euthanasia and physician-assisted suicide.... If you wonder why 'living wills' and health care 'power of attorney' won support at the ballot box but physician-assisted suicide proposals mostly failed, this book explains all.&quot;--Baltimore Sun\n\n&quot;Utterly fair and evenhanded. Instead of arguing the issue pro or con, he provides an exhaustively researched and objective history of euthanasia advocacy in the United States.... Dowbiggin's history provides a fascinating study in how little the movement and its tactics have actually changed over the years. Indeed, the book's narrative discloses a remarkably clear and consistent pattern, both in the strategy and substance of euthanasia advocacy, from its inception to today.&quot;--First Things\n\n&quot;A Merciful End is a masterful historical account of the transformation of the tiny and elitist American eugenics and euthanasia movements of the first half of the 20th Century into the much more complex 'right to die' mass movement that closed out the century. Dowbiggin's balanced, well-documented, and insightful history is a must read for anyone who wants to understand why living will and health care proxy laws were enacted in all 50 states, while physician-assisted suicide laws succeeded only in Oregon, and active euthanasia laws had no success at all.&quot;--George J. Annas, Professor of Health Law, Boston University Schools of Law, Medicine, and Public Health, and author of The Rights of Patients\n\n&quot;A deeply researched, well-written, and admirably well-balanced book on the highly contentious subject of euthanasia in 20th century American life. A skilled historian, he makes clear that the issue has a considerable history in the United States, dating to early in this century. He also places arguments over euthanasia, past and present, in a broad historical social and cultural context, relating these debates to a range of other claims for personal 'rights,' such as birth control and abortion. And he brings these debates into our 21st century--all in an admirably lean and clearly organized compass. This is a book that should engage readers interested in social, intellectual, cultural, legal, and medical history.&quot;--James T. Patterson, Professor of History, Brown University, and author of Dread Disease: Cancer and Modern American Culture\n\n&quot;In a fascinating and comprehensive analysis of the American euthanasia movement, Dowbiggin rectifies the historical record, demonstrating that the ideological justification for euthanasia lies not in the advanced medical technologies of the late 20th century, but in the social Darwinism, eugenics, and utilitarianism of the late 19th century.&quot;--Ezekiel J. Emanuel, M.D.\n\n===================================================================================\nAbout the Author\nIan Dowbiggin is Professor of History at the University of Prince Edward Island.\n===================================================================================","torrent":{"xt":"urn:btih:8eef413b810e54f8a60a141db018a992b7864684","amp;dn":"Ian+Dowbiggin+-+A+Merciful+End.+The+Euthanasia+Movement+in+Moder","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8eef413b810e54f8a60a141db018a992b7864684","infoHashBuffer":{"type":"Buffer","data":[142,239,65,59,129,14,84,248,166,10,20,29,176,24,169,146,183,134,70,132]},"announce":[],"urlList":[]}}