{"title":"Light Scattering from Polymer Solutions and Nanoparticle Dispers","uid":15445300,"size":3487198,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8f413b1dacfe5be907bab019b7db241e0ce7b76f&amp;dn=Light+Scattering+from+Polymer+Solutions+and+Nanoparticle+Dispers&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"clouderone","files":1,"time":1469873755,"description":"Light Scattering from Polymer Solutions and Nanoparticle Dispersions - Wolfgang Schärtl (Springer, 2007).pdf\r\n\r\nLight scattering is a very powerful method to characterize the structure of polymers and nanoparticles in solution. Recent technical developments have strongly enhanced the possible applications of this technique, overcoming previous limitations like sample turbidity or insufficient experimental time scales. However, despite their importance, these new developments have not yet been presented in a comprehensive form. In addition, and maybe even more important to the broad audience, there lacks a simple-to-read textbook for students and non-experts interested in the basic principles and fundamental techniques of light scattering. As part of the Springer Laboratory series, this book tries not only to provide such a simple-to-read and illustrative textbook about the seemingly very complicated topic of light scattering from polymers and nanoparticles in dilute solution, but also intends to cover some of the newest technical developments in experimental light scattering","torrent":{"xt":"urn:btih:8f413b1dacfe5be907bab019b7db241e0ce7b76f","amp;dn":"Light+Scattering+from+Polymer+Solutions+and+Nanoparticle+Dispers","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f413b1dacfe5be907bab019b7db241e0ce7b76f","infoHashBuffer":{"type":"Buffer","data":[143,65,59,29,172,254,91,233,7,186,176,25,183,219,36,30,12,231,183,111]},"announce":[],"urlList":[]}}