{"title":"Microsoft Cortana for Android v1.2.0.745 APK (Cracked) | TPB_1","uid":13204510,"size":15727709,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:8fa75d6f5b95b72b87b095f34f0c0549d482258e&amp;dn=Microsoft+Cortana+for+Android+v1.2.0.745+APK+%28Cracked%29+%7C+TPB_1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":1,"time":1452579902,"description":"Microsoft Cortana for Android\r\n\r\nCortana for Android is the latest development in Microsoft’s reach outside of its own ecosystem and details of the digital assistant’s July arrival were released in a blog post by Marcus Ash, program manager for Cortana.\r\n\r\nCortana is an app with which you can use your voice to make a call, send a text message, search the web, or open an app.\r\n\r\nFeatures\r\n\r\nSchedule a meeting\r\nSet a reminder for an important task\r\nSend automatic replies for callers when you don’t want to be disturbed\r\nCheck your location\r\nGet up-to-date traffic and weather info\r\nWith the power of Bing behind her, Cortana gets to know you and looks out for you. She’ll keep track of things that interest you, make helpful suggestions, remind you of meetings and appointments and help you stay closer to the people who matter most.\r\nCortana continually learns about your interests, friends and favorite things – and just like a real assistant, records it in her notebook. She’ll ask you questions and tailor her suggestions over time to make them ever more personal.\r\nJust like a real person has your back, so does Cortana. She’ll help you stay on top of things, whether that means alerting you about a flight delay, reminding you to pick up something from the store or to leave early for work because of traffic delays.\r\nCortana is the only personal smartphone assistant with people based reminders. That means she can remind you to congratulate a friend on his promotion when he calls, or to send your mom a birthday card. Thoughtfulness is just a voice command away.\r\nCortana has a great personality. She can chat with you like a real person, is funnier than most of your friends and will root for your favorite team with you. Go ahead, try to stump her, just be ready for what she might say!\r\nYou can do all this using your voice, with only a minimum of fiddling with the touch screen to distract you from other activities.\r\nHow To Install ?\r\n\r\nDownload and Install Cracked APK From the Links Given Below\r\nDone, Enjoy ! :)","torrent":{"xt":"urn:btih:8fa75d6f5b95b72b87b095f34f0c0549d482258e","amp;dn":"Microsoft+Cortana+for+Android+v1.2.0.745+APK+%28Cracked%29+%7C+TPB_1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fa75d6f5b95b72b87b095f34f0c0549d482258e","infoHashBuffer":{"type":"Buffer","data":[143,167,93,111,91,149,183,43,135,176,149,243,79,12,5,73,212,130,37,142]},"announce":[],"urlList":[]}}