{"title":"CastleStorm-FANiSO","uid":8772634,"size":457033587,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:903f7a6ca26b896daa2ea2053be30c94a25b4521&amp;dn=CastleStorm-FANiSO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AN0NYMOUS142857","files":33,"time":1375489362,"description":"P R E S E N T S\n\nCastleStorm (c) Zen Studios\n\nSupplied By: A Friend Diskettes: 1 CD\nCracked By: A Friend Game Type: Action, Strategy\nPackaged By: A Friend Released On: August 2013\n\nWelcome to the world of CastleStorm, a super genre mashup of 2D physics\ndestruction mashed with tower defense brawler! CastleStorm was born out of\nthe fond childhood memory of building and destroying LEGO castles\n\nThe clouds bring rumors of war...It's Knights vs. Vikings in CastleStorm\nwhere medieval warfare meets 2D physics-based destruction! Controlling the\nbattle in real time, players will harness the power of medieval artillery\nmanage a fearsome ground attack, and cast powerful spells! CastleStorm\nfeatures a story-driven solo campaign, a custom castle editor, online\nmultiplayer, co-op modes, and more. Building castles and knocking them\ndown has never been so much fun!\n\nCastleStorm is a physics based tower destruction game, combining elements\nof real time strategy, resource management, and a beautiful blend of\nchallenging gameplay scenarios\n\nMultiplayer battles and Co-Op. CastleStorm features multiple modes of\nmultiplayer action for both local and online play:\n\n1 vs. 1 split-screen mode, simply try and beat your opponent\nSurvival Co-op: Two players team up to fight off waves of\nenemies together! One player will control the ballista, the\nother controls ground forces\nLast Stand Co-op: Both players control a hero and\nfight off endless waves of enemies together!\n\nBuild your own castle! CastleStorm features a tower construction editor\nallowing players to construct their own custom castles that will be used\nin battle. Castles must be constructed wisely, as choices determine which\ntypes of troops and resources will be available during battle!\n\nTwelve incredibly beautiful environments and a comical story. Sir Gareth\nleads his troops into battle against the raging Vikings to recover the\nstolen gem and bring peace to the realm!\n\nMultiple paths to victory. You can choose how to defeat your enemy\nCapture the flag, destroy their castle, or complete another predetermined\nlevel objective in order to claim victory. Each level features multiple\nobjectives, each with their own rewards!\n\nAn arsenal that would make any medieval warrior proud! Harness the power\nof medieval ballista weaponry, and launch an assortment of explosive\nweapons including Morningstars, Apple Grenades, Homing Eagles, and even\nflying sheep to defeat an onslaught of enemies trying to capture your flag\nand destroy your castle. Deploy a fearsome ground attack of swordsmen\nknights, and donkey riders in order to protect your castle gates, and if\nall else fails, call upon powerful spells to help keep the enemy at bay\n\nYou've won the battle, now power up so you can win the war! As you power\nup in CastleStorm, new weapons and troop classes become available for use\nin battle\n\nInstall\n\n1.) Unpack\n2.) Burn or mount\n3.) Play the game\n\nLETZ ROCK - LETZ DOPE - LETZ KICK!","torrent":{"xt":"urn:btih:903f7a6ca26b896daa2ea2053be30c94a25b4521","amp;dn":"CastleStorm-FANiSO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"903f7a6ca26b896daa2ea2053be30c94a25b4521","infoHashBuffer":{"type":"Buffer","data":[144,63,122,108,162,107,137,109,170,46,162,5,59,227,12,148,162,91,69,33]},"announce":[],"urlList":[]}}