{"title":"Software Architecture (Advanced Topics in Science and Technology","uid":4720160,"size":20402567,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9043d235dda9dd9ab3c0d033ff7d6dd49ab4f625&amp;dn=Software+Architecture+%28Advanced+Topics+in+Science+and+Technology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":9,"uploader":"VasiaZozulia","files":1,"time":1234476560,"description":"Part of the new series, Advanced Topics in Science and Technology in China, this book aims to introduce the theoretical foundations, various sub-fields, current research, and practical methods of software architecture. Readers can acquire basic knowledge of software architecture, including why software architecture is necessary, how we can describe a system s architecture with formal language, what architecture styles are popular in practice, and how we can apply software architecture to the development of systems. Case studies, data, illustrations, and other materials released within the past 5 years will be used to show the latest developments in software architecture. \n\nDr. Qin Zheng is doctoral mentor of the computer science and technology departments at Tsinghua and Xi an Jiaotong Universities. He has been Associate Dean of the School of Software, Tsinghua University, and Chair of the Institute of E-commerce, Xi an Jiaotong University. He has been a visiting scholar at several universities in the United States.","torrent":{"xt":"urn:btih:9043d235dda9dd9ab3c0d033ff7d6dd49ab4f625","amp;dn":"Software+Architecture+%28Advanced+Topics+in+Science+and+Technology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9043d235dda9dd9ab3c0d033ff7d6dd49ab4f625","infoHashBuffer":{"type":"Buffer","data":[144,67,210,53,221,169,221,154,179,192,208,51,255,125,109,212,154,180,246,37]},"announce":[],"urlList":[]}}