{"title":"Zomblog Series by T.W. Brown.zip","uid":8845625,"size":3161246,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:90b0f519239a80e78f1e7519a445bee149f9045f&amp;dn=Zomblog+Series+by+T.W.+Brown.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"420weedman","files":1,"time":1377373834,"description":"Zomblog 01\nISBN: 9781449962203\nPublished: Jan 2009\nSamuel Todd is a regular guy: ...Failed husband... ...Loving father... ...Dutiful worker... ...Aspiring rockstar.\nHe had no idea if anyone would care, or take the time, to read his daily blog entries about his late night observations. But what started as an open monologue of his day-to-day life became a running journal of the firsthand account detailing the rising of the dead and the downfall and and degradation of mankind...\n\nZomblog 02\nISBN: 9780984537259\nPublished: Dec 2010\nMeredith Gainey is a survivor...and determined to retain that status as the zombie apocalypse wipes out most of humanity.\nUnable to accept an existence behind walls and fences, she finds herself in constant danger...and she wouldn't have it any other way.\n\nZomblog 03: The Final Entry\nISBN: 9781936730087\nPublished: Apr 2012\nIt has been over two years since the dead began to walk. The shattered remnants of civilization continue desperately to try and rebuild society...for better or for worse. As far as Meredith Gainey is concerned, they can do it without her help. Fixated on a mysterious radio message, she sets out on an unlikely adventure.\nThis time she is joined by her dog and an unlikely companion. Eric Grayfeather. On her journey, she will encounter everything that is good and bad about humanity. Everything from a group of children who have no trust left in adults, to an all-female clan who lure men to their doom using themselves as live bait.\nIt's all there, and it only serves to prove Meredith's point that maybe the world would be a better place without humans. As always, she documents her travels, allowing you to see the dead world through her eyes. \n\nZomblog 04: Snoe\nISBN: 9781936730711\nPublished: Oct 2012\nIt has been almost twenty years since the dead rose...\nSnoe Gainey has grown up in a world where the walking dead are simply a part of life. Raised by her adoptive mother, she has spent her entire life trying to distance herself from the legacy left by her mother. A name from the past rises from the ashes and sends Snoe on a journey where she will discover more about herself in a few weeks than she has during the first eighteen years of her life.\nSnoe discovers a dead world that leaves her with more questions while offering few answers. As everything she holds dear is stripped away, she must come to terms with just who she is...\n\nZomblog 05: Snoe's War\nISBN: 9781936730872\nPublished: Jun 2013\nSnoe Gainey has spent her life trying to carve out her own identity in a post-apocalyptic world where her birth mother and father are two of the most infamous--if not notorious--individuals of the time.\nRaised by her adoptive mothers, she has done all she can to find her way in an unforgiving world. The rise of a splinter faction that seeks to bring about a so-called New America, and led by an enemy from the past, has shattered everything that she knew and most everything that she thought she knew about herself.\nNow, she seeks to free her friends and family from the clutches of a rising force that wants her to pay for the past sins of her birth mother. To fight back, she must embrace what she has steadfastly denied for most of her life.\nThis is... Snoe's War","torrent":{"xt":"urn:btih:90b0f519239a80e78f1e7519a445bee149f9045f","amp;dn":"Zomblog+Series+by+T.W.+Brown.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90b0f519239a80e78f1e7519a445bee149f9045f","infoHashBuffer":{"type":"Buffer","data":[144,176,245,25,35,154,128,231,143,30,117,25,164,69,190,225,73,249,4,95]},"announce":[],"urlList":[]}}