{"title":"Hoang Thuy Linh Have Sex With Viet-Dart....FFF","uid":3860529,"size":47481797,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:90db1214d045ec45bea51e7ce3a54bca0504e926&amp;dn=Hoang+Thuy+Linh+Have+Sex+With+Viet-Dart....FFF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"FatFuckFrank","files":1,"time":1193459446,"description":"Vietnam state television on Monday binned a popular nightly teenage TV soap after its star was apparently featured in an online amateur sex clip.\n\nHoang Thuy Linh, 19, the lead actress of &quot;Vang Anh&amp;#039;s Diary,&quot; found herself at the center of a storm when Internet users downloaded the five-minute footage late last week from a video-sharing website and started circulating it.\n\nAngry parents called for Linh, who appears to be the woman in the clip, to be sacked, while some fans jumped to her defense saying the film, shot by mobile telephone camera, had been published to harm her reputation.\n\nOn Monday, Vietnam Television (VTV) decided to cancel the show, an interactive youth drama that offers lessons on teenage issues and allows viewers to vote on moral and lifestyle questions by mobile text message and email.\n\n&quot;The show &amp;#039;Vang Anh&amp;#039;s Diary&amp;#039; will stop broadcasting,&quot; said VTV in a brief online statement. &quot;It is the decision of the management of VTV as well as the proposal of Hoang Thuy Linh, the actress for the role of Vang Anh in the show.&quot;\n\nThe soap, in its second season, had been controversial in the communist country, praised by some for addressing youth issues but criticized by others for focusing on the concerns of the fashionable urban middle-class elite.\n\n\nlater/FFF","torrent":{"xt":"urn:btih:90db1214d045ec45bea51e7ce3a54bca0504e926","amp;dn":"Hoang+Thuy+Linh+Have+Sex+With+Viet-Dart....FFF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90db1214d045ec45bea51e7ce3a54bca0504e926","infoHashBuffer":{"type":"Buffer","data":[144,219,18,20,208,69,236,69,190,165,30,124,227,165,75,202,5,4,233,38]},"announce":[],"urlList":[]}}