{"title":"Kunt u mij de weg naar Hamelen vertellen, meneer(DTS)(DD5.1) 2Li","uid":5330225,"size":7618766057,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:918ad533efbcf7e4625eb69dc56a518ee34c8123&amp;dn=Kunt+u+mij+de+weg+naar+Hamelen+vertellen%2C+meneer%28DTS%29%28DD5.1%29+2Li&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Pioen","files":-1,"time":1265145285,"description":"Kunt u mij de weg naar Hamelen vertellen, meneer? (DTS)(DD5.1)(ISO)\n\n\nNederland\nMusical\n125 minuten\n\ngeregisseerd door Peter Blom\nmet RenÃƒÂ© van Kooten, Chantal Janzen en Loeki Knol\n\nHet is ondertussen al weer heel wat jaartjes geleden dat Bertram Bierenbroodspot, Lidwientje Walg, Aernout Koffij, Hildebrand Brom en de kinderen weer veilig terug zijn gekeerd in Hamelen, nadat de rattenvanger hen had meegevoerd naar een ver en vreemd land vol met kabouters, elfen, trollen, prinsen, reuzen, waternimfen en ander vreemd volk.\nOp een avond zit Lidwina haar dochtertje voor te lezen uit een sprookjesboek. Als ze bij het verhaal van De Rattenvanger Van Hamelen aankomt raakt ze overstuur en wil niet verder lezen. Maar haar dochtertje wil weten waarom niet. Het is toch slechts een sprookje? Dan vertelt Lidwina haar verhaal. Het was geen sprookje, maar het is echt gebeurd. Het boek vertelt niet verder over de kinderen die meegevoerd werden in de berg Bam. Lidwina weet wel wat er gebeurd is, ze was er zelf bij. En beetje bij beetje vertelt ze het hele verhaal aan haar dochtertje?\n\nDe stad Hamelen wordt werkelijk overspoeld door de ratten en wat men ook probeert, de ratten willen niet weg. Dan verschijnt er plotseling iemand die de ratten kan verdrijven, maar hij vraagt een behoorlijke prijs. Burgermeester Walg gaat hiermee akkoord en die nacht pakt de vreemdeling zijn fluit en met een wonderlijk wijsje fluit hij alle ratten mee de stad uit. De financiÃƒÂ«le adviseur van de burgermeester fluistert hem in om de rattenvanger niks te geven. Wanneer de rattenvanger amper betaald wordt voor zijn diensten, wordt hij des duivels en die nacht klinkt er weer een wonderlijk wijsje en uit alle huizen komen de kinderen als in trance naar buiten. Ook de dochter van de burgermeester, Lidwientje, die met haar geliefde Bertram Bierenbroodspot bij de stadspoort hebben afgesproken raken in trance van de muziek. Ook de poortwachter Aernout Koffij en stadomroeper Hildebrand Brom worden meegevoerd, de stad uit en iedereen beland in de berg Bam. Eenmaal daar ontwaakt iedereen uit hun trance.\nWaar is de uitgang? Hoe komt men terug in Hamelen? In de berg komen ze de dwerg Gruizel Gruis van het Elvenbochtje tegen, een vreemd gedocht die met een vreemde tong spreekt. Het is hij die het gezelschap heeft weg gefloten. Gruizel wordt onder druk gezet om hen terug te fluiten naar Hamelen, maar kan dat niet. Dat kan alleen de heks Wenzela. Maar hoe komen ze daar? Aan Gruizel kunnen ze het niet meer vragen want die verdwijnt achter een van de drie deuren die in de grot zijn verschenen. Wanneer ons Hameler gezelschap door een van die deuren gaat komen ze terecht in een kasteel waar de bewoners nog nooit mensen hebben gezien. Weten zij soms de weg naar Wenzela? \n\n\nAudio Format.............: 5.1/2.0/DTS\nAudio Language...........: Nederlands\nSubtitles................: Geen\nFile Format..............: Part**.rar [ISO]\nAantal RAR Bestanden.....: 153\nSource Movie.............: DvD9\n\ninfo \nCategorie.....: Beeld \nFormaat.......: DVD9 \nBron..........: Retail\nGenre.........: Musical\nCover.........: Meegepost\nThanks........: noprobsteam  \n \n*****************************************\n\nBrought to you by \n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n      &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!  \n","torrent":{"xt":"urn:btih:918ad533efbcf7e4625eb69dc56a518ee34c8123","amp;dn":"Kunt+u+mij+de+weg+naar+Hamelen+vertellen%2C+meneer%28DTS%29%28DD5.1%29+2Li","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"918ad533efbcf7e4625eb69dc56a518ee34c8123","infoHashBuffer":{"type":"Buffer","data":[145,138,213,51,239,188,247,228,98,94,182,157,197,106,81,142,227,76,129,35]},"announce":[],"urlList":[]}}