{"title":"The Manga Guide to Databases.pdf","uid":5856810,"size":67484323,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:92660431f51e108c15d27de698a02be298afbf85&amp;dn=The+Manga+Guide+to+Databases.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"chimmychanga","files":-1,"time":1285652314,"description":"By Mana Takahashi, Shoko Azuma, Ltd. TREND-PRO-pro Co.\n\nPublished by No Starch Press in 2008\n\nPDF, 224 pages, English (1593271905)\n\n\nEditorial Reviews\nProduct Description\n\nWant to learn about databases without the tedium? With its unique combination of Japanese-style comics and serious educational content, The Manga Guide to Databases is just the book for you.\n\nPrincess Ruruna is stressed out. With the king and queen away, she has to manage the Kingdom of Kod's humongous fruit-selling empire. Overseas departments, scads of inventory, conflicting prices, and so many customers! It's all such a confusing mess. But a mysterious book and a helpful fairy promise to solve her organizational problems-with the practical magic of databases.\n\nIn The Manga Guide to Databases, Tico the fairy teaches the Princess how to simplify her data management. We follow along as they design a relational database, understand the entity-relationship model, perform basic database operations, and delve into more advanced topics. Once the Princess is familiar with transactions and basic SQL statements, she can keep her data timely and accurate for the entire kingdom. Finally, Tico explains ways to make the database more efficient and secure, and they discuss methods for concurrency and replication.\n\nExamples and exercises (with answer keys) help you learn, and an appendix of frequently used SQL statements gives the tools you need to create and maintain full-featured databases.\n\n(Of course, it wouldn't be a royal kingdom without some drama, so read on to find out who gets the girl-the arrogant prince or the humble servant.)\n\nThis EduManga book is a translation of a bestselling series in Japan, co-published with Ohmsha, Ltd., of Tokyo, Japan.\nProduct Details\n\n    * Paperback: 224 pages\n    * Publisher: No Starch Press; 1 edition (December 19, 2008)\n    * Language: English\n    * ISBN-10: 1593271905\n    * ISBN-13: 978-1593271909","torrent":{"xt":"urn:btih:92660431f51e108c15d27de698a02be298afbf85","amp;dn":"The+Manga+Guide+to+Databases.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92660431f51e108c15d27de698a02be298afbf85","infoHashBuffer":{"type":"Buffer","data":[146,102,4,49,245,30,16,140,21,210,125,230,152,160,43,226,152,175,191,133]},"announce":[],"urlList":[]}}