{"title":"Charley Pride - Country Charley Pride (1966) + Pride Of Country","uid":13848621,"size":404435993,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:92736714f5534fbe3e80737b2fcf29bb65d980b5&amp;dn=Charley+Pride+-+Country+Charley+Pride+%281966%29+%2B+Pride+Of+Country&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pucholoco","files":36,"time":1457899628,"description":"Charley Pride - Country Charley Pride (1966) + Pride Of Country Music (1967)\r\n             EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 383 Mb \r\n                     Full Artwork @ 300 dpi (jpg) -&gt; 22 Mb\r\n\r\n\r\nA few months back, in the British magazine Country Music People, someone asked why RCA now Sony did not do a complete albums set for Waylon Jennings and Charley Pride, just as has been done for Johnny Cash and John Denver. Waylon and Charley each recorded some 3 dozen original albums for RCA but whereas Waylon has had all but a half dozen or so reissued on CD, exactly the opposite is true for Charley and of the handful of albums reissued 3 were on the now defunct Koch label and are generally unavailable. This release of his first two albums from 1966 and 1967 is therefore immensely welcome. These were fantastic mid 60s period country albums, yes quite a few covers but great renditions of songs from great writers: Harlan Howard, Cindy Walker and Mel Tillis wrote the first 3 tracks. Co-producers were Chet Atkins, Bob Ferguson and Jack Clement who sadly passed away earlier this year. The latter wrote or co-wrote 7 of the songs.\r\n\r\nToward the end of his time with RCA in the mid 80s I thought Charley's albums had become a little formulaic and had lost the freshness so massively evident in these initial albums. I hope Music City Records garner good sales from this CD and that they continue with more sequential releases. If I could give it 6 stars I would, this is just great country music from a singer starting his career. If you have ever enjoyed any of Charley's work, buy this album and plead with Music City Records to issue more, much more!\r\n\r\nI have been critical of Music City reissues in the past (see my review of Charley's 'Did You Think To Pray') but this is a gem. These are Charley's first two albums from the outset of his career, when it was still a novelty for an Afro-American to be singing country music with steel and fiddle backings, and I doubt that he has ever sounded better. Standout tracks are his versions of 'Detroit City' - I always chuckle when I hear him change the line: &quot;I'll take my foolish pride&quot; from the original lyrics to &quot;I'll take old Charley Pride&quot; - and 'Green, Green Grass Of Home'. Apparently there was much soul-searching in the studio as to whether a black man should be singing about Mary's golden hair but courageously they went for it. Add in the fact that the CD booklet includes full session details for all 24 tracks and you can't go wrong with this 2-for-1 release. Now, can Music City do the same with his next two albums, 'Country Way' and 'Make Mine Country', please!\r\n\r\n\r\n--------------------------------------------------------------------------------\r\nTracklist:\r\n--------------------------------------------------------------------------------\r\n\r\nCountry Charley Pride (1966)\r\n\r\n01. Busted\r\n02. Distant Drums\r\n03. Detroit City\r\n04. Yonder Comes A Sucker\r\n05. Green, Green Grass Of Home\r\n06. That's The Chance I'll Have To Take\r\n07. Before I Met You\r\n08. Folsom Prison Blues\r\n09. The Snakes Crawl At Night\r\n10. Miller's Cave\r\n11. The Atlantic Coastal Line\r\n12. Got Leavin' On Her Mind\r\n\r\nPride of Country Music (1967)\r\n\r\n13. In The Middle Of Nowhere\r\n14. The Last Thing On My Mind\r\n15. Just Between You And Me\r\n16. Apartment #9\r\n17. Spell Of The Freight Train\r\n18. I Know One\r\n19. I'm Not The Boy I Used To Be\r\n20. A Good Woman's Love\r\n21. Silence\r\n22. Take Me Home\r\n23. Touch My Heart\r\n24. Best Banjo Picker\r\n\r\n*2013 RCA / Music City Records | 05310\r\n\r\n\r\n\r\nEnjoy and Sharing, Thanks!","torrent":{"xt":"urn:btih:92736714f5534fbe3e80737b2fcf29bb65d980b5","amp;dn":"Charley+Pride+-+Country+Charley+Pride+%281966%29+%2B+Pride+Of+Country","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92736714f5534fbe3e80737b2fcf29bb65d980b5","infoHashBuffer":{"type":"Buffer","data":[146,115,103,20,245,83,79,190,62,128,115,123,47,207,41,187,101,217,128,181]},"announce":[],"urlList":[]}}