{"title":"Andrews Sisters - V Disc Recordings","uid":4621346,"size":102214552,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:93179c79a4ab96d61ca27386f3eefd3ca2bf0732&amp;dn=Andrews+Sisters+-+V+Disc+Recordings&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LaughRiot","files":16,"time":1231043868,"description":"The Andrews Sisters: V-Disc Recordings\n\n320kbps\n\n\nV-Disc was a record label produced during the World War II era by special arrangement between the United States government and various private U.S. record companies. The records were produced for use of United States military personnel overseas. Many popular singers, big bands and orchestras of the era recorded special V-Disc records. These 12-inch, 78 rpm gramophone recordings were created between 1943 and 1949. The &quot;V&quot; stands for &quot;Victory&quot;.\nThe V-Disc project actually began in June 1941, six months before the United States' involvement in World War II, when Captain Howard Bronson was assigned to the Army's Recreation and Welfare Section as a musical advisor. Bronson suggested the troops might appreciate a series of records featuring military band music, inspirational records that could motivate soldiers and improve morale. By 1942, the Armed Forces Radio Service (AFRS) sent 16-inch, 33 rpm vinyl transcription discs to the troops, mostly radio shows with the commercials edited out. \n \n1. Is You Is or Is You Ain't My Baby? - The Andrews Sisters, Jordan, Louis [1] \n2. Straighten up and Fly Right - The Andrews Sisters, Mills, Irving \n3. Down in the Valley - The Andrews Sisters, Traditional \n4. Put That Ring on My Finger - The Andrews Sisters, Gillespie, Haven \n5. Three Caballeros - The Andrews Sisters, Cortazar, Ernesto \n6. Vict'ry Polka - The Andrews Sisters, Cahn, Sammy \n7. The Blonde Sailor - The Andrews Sisters, Parish, Mitchell \n8. (I'm Getting) Corns for My Country - The Andrews Sisters, Barry, Jean \n9. Lullaby of Broadway - The Andrews Sisters, Dubin, Al \n10. Don't Blame Me - The Andrews Sisters, Fields, Dorothy \n11. Boogie Woogie Bugle Boy - The Andrews Sisters, Prince, Hughie \n12. Sing a Tropical Song - The Andrews Sisters, Loesser, Frank \n13. Rhumboogie - The Andrews Sisters, Prince, Hughie \n14. Money Is the Root of All Evil - The Andrews Sisters, Krarmer, Alex \n15. Red River Valley - The Andrews Sisters, Traditional \n16. Medley of Andrews Sisters Hits - The Andrews Sisters,\n","torrent":{"xt":"urn:btih:93179c79a4ab96d61ca27386f3eefd3ca2bf0732","amp;dn":"Andrews+Sisters+-+V+Disc+Recordings","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93179c79a4ab96d61ca27386f3eefd3ca2bf0732","infoHashBuffer":{"type":"Buffer","data":[147,23,156,121,164,171,150,214,28,162,115,134,243,238,253,60,162,191,7,50]},"announce":[],"urlList":[]}}