{"title":"Jamie Oliver - Jamie's Kitchen (DVDRip h264 AAC)","uid":4726334,"size":890264502,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:93856628a3bc8d6946bf2886f962f5f02e2659ba&amp;dn=Jamie+Oliver+-+Jamie%5C%27s+Kitchen+%28DVDRip+h264+AAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"how_much","files":3,"time":1234778674,"description":"...from CDWow.com:\n\nJamie Oliver is opening his first restaurant, Fifteen, in London. And to prove his conviction that it's a passion for food and not formal academic qualifications that make a good cook, he's training fifteen unemployed youngsters to work as chefs in the kitchen.  All within seven months....And he's picked a busy year.  He's writing a new book, has business trips to juggle, a host of other commitments and most importantly of all, he's about to become a dad.\n\nHe's taking a huge risk, and regardless of whether the trainees can handle it, can Jamie? Or has he bitten off more than he can chew?\n\nHaving finally selected his fifteen trainee chefs, the first few weeks are hardly plain sailing. One is suspended and sent to anger management training, several have appalling attendance records and another leaves. And eleven out of the original fifteen trainees fail their first exam... The trainees can only get better - and they do. But will they cut the mustard by the time the restaurant opens for business?\n\nThis release features the original five part series first broadcast on Channel 4 PLUS the two follow-up episodes that catch up with Jamie and his trainees six months later.","torrent":{"xt":"urn:btih:93856628a3bc8d6946bf2886f962f5f02e2659ba","amp;dn":"Jamie+Oliver+-+Jamie%5C%27s+Kitchen+%28DVDRip+h264+AAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93856628a3bc8d6946bf2886f962f5f02e2659ba","infoHashBuffer":{"type":"Buffer","data":[147,133,102,40,163,188,141,105,70,191,40,134,249,98,245,240,46,38,89,186]},"announce":[],"urlList":[]}}