{"title":"Trine.v1.1.1.MacOSX","uid":6992683,"size":574112709,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:93bd71c716f3395b3acdad4efbbba679ee667bb2&amp;dn=Trine.v1.1.1.MacOSX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"User_01","files":-1,"time":1327763224,"description":"Trine is a beautiful fantasy action platformer with a fairytale-like atmosphere, following the journey of three heroes - a Wizard, a Knight and a Thief - in a quest to save the kingdom from evil. The gameplay is based on fully interactive physics - each character's different abilities and tactics can be used to invent new ways to battle an army of undead and overcome obstacles, and restore the balance of the world.\n\nMac System Requirements: \n\nOperating System: Mac OS X 10.6.5 or better\nProcessor: Intel Mac\nSystem Memory: 1 GB RAM\nGraphics: OpenGL 2.0 compatible video card with 256 MB shared or dedicated RAM (ATI or NVIDIA)\nNOTE: Please be advised that Trine does not run on Macs produced in 2006-2008 that use Intel graphics solutions. The game does run on all Macs from 2009 onwards. Macs with NVIDIA GeForce 9400M graphics may not achieve smooth gameplay.\nHard Drive: 600 MB\nOther: Keyboard, Mouse with Secondary click enabled (trackpad works but is probably too uncomfortable)\n\nIf you have any questions about the game or its compatibility with your Mac, or any other technical issues or feedback, please get in touch with us (Frozenbyte) and we'll help you out! You can also check out our Community Forums at http://frozenbyte.com/board/ .","torrent":{"xt":"urn:btih:93bd71c716f3395b3acdad4efbbba679ee667bb2","amp;dn":"Trine.v1.1.1.MacOSX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93bd71c716f3395b3acdad4efbbba679ee667bb2","infoHashBuffer":{"type":"Buffer","data":[147,189,113,199,22,243,57,91,58,205,173,78,251,187,166,121,238,102,123,178]},"announce":[],"urlList":[]}}