{"title":"Lost In Reefs - New Match 3 Game [h33t][Wendy99]","uid":4565550,"size":41277976,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:93ea554e0c60be7c8835f6d03f65f7103025953a&amp;dn=Lost+In+Reefs+-+New+Match+3+Game+%5Bh33t%5D%5BWendy99%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Wendys99","files":2,"time":1228857204,"description":"Lost In Reefs: Explore the Bosom of the Sea and Discover the Secrets of an Ancient City\n\n\nDeep beneath the ocean waves lie shipwrecks and ruins, \nand only fishes and crabs disturb their rest. But why \nare you here? What are you going to seek for? The ocean \nalways lured explorers seeking for the treasures and \nmysteries hidden at the bottom of the sea.\n\nYou are the only person who knows about the ancient \ncivilization of people and dragons, a mighty alliance \nof wisdom and power. A year ago you found some old scrolls \nwith scarcely discernible handwriting and were astounded \nby what you managed to read. The dragons really existed - \ngolden, silver, emerald green dragons; huge creatures flying \nacross the mountain ranges, breathing fire on enemy troops, \ncarrying enormous cargo, patrolling the borders, soaring high \nabove the clouds. The people were invincible together with \nthe dragons, but they could not resist the nature. \nAn earthquake destroyed the wonderful dragon city: \nAnd all that survived the earthquake sank to the bottom \nof the ocean.\nIt was impossible to forget about the secret knowledge \nthat was probably kept under the ancient ruins, so it was \ntime for you to organize an expedition. Now you have found \nthe right place! Start digging out and explore the buildings. \nYou must work hard - the Heart of the City is so close, but \ndifficult to discover...\n\nThe objective of the game is to build and explore the ancient \nundersea city, but not all the secrets of the older civilization \nare revealed at once. Be ready to new challenges and do not forget \nthat only the most skilled and persistent players will discover \nthe wonders of The Heart of the City. So do not hesitate and go ahead.\n\n\n","torrent":{"xt":"urn:btih:93ea554e0c60be7c8835f6d03f65f7103025953a","amp;dn":"Lost+In+Reefs+-+New+Match+3+Game+%5Bh33t%5D%5BWendy99%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93ea554e0c60be7c8835f6d03f65f7103025953a","infoHashBuffer":{"type":"Buffer","data":[147,234,85,78,12,96,190,124,136,53,246,208,63,101,247,16,48,37,149,58]},"announce":[],"urlList":[]}}