{"title":"Futanari Insanity Part 4 - Futa Sex Positions","uid":5310012,"size":293732286,"categoryP":"porn","categoryS":"pictures","magnet":"?xt=urn:btih:9443083829927f5b28fa5e9a709df806fe151605&amp;dn=Futanari+Insanity+Part+4+-+Futa+Sex+Positions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mr.MeanMittens","files":105,"time":1264528511,"description":"Futanari Insanity Part 4 - Futa Sex | From Pr0n_Glutton/black_dragon\n\nOPTIONAL: If you followed the optional instructions from Part 3, then when you are completely done with this torrent, Place &quot;Futa Sex&quot; in your &quot;Category Futa&quot; folder, as well as the folders from Part 1-3.\n\nI think one of the earliest ways I've organized my Futa is by what sexual position they were in. Whether it was a Solo Futanari, futanari Footjobs, or futanari blowjobs, I used that as a way to discern between otherwise &quot;uncategorizable&quot; futanari pictures. Looking through my folders now, I'm surprised I don't have folders for penetrations (anal, vaginal, double). But most of those are are sorted in folders listing the sexual partner (ie Futa on Male or Futa on Futa)\n\nThe following list show what positions are categorized. Asterisks (*) show folders with a high amount of pictures which are zipped while other folders are not zipped.\nFuta BJ (Blowjobs Obviously)\nFuta Feet * (Footjobs, footplay. I thought and wish I had more of these)\nFuta Frottage * (Docking, Double Penetration, Frottage, Cock2Cock, Grinding etc)\nFuta HJ * (Futa giving/recieving handjobs or jacking off)\nFuta Selfsuck * (autofellatio-Futa sucking their own dicks)\nFuta Sex Toy * (Dildoes and other Sex Toys)\nFuta Solo * (&quot;Ecchi&quot; solo futa or futa doing nothing much more than posing)\nFuta Titfuck/Hotdogging (Futa's Tittyfucking, Ass cheek fucking, or literally using penis like a hotdog/sausage)\nFxF * (Futa fucking/with Futa)\nFxM * (Futa fucking/with Male)\nFxW * (Futa fucking/with Woman)\nGroup * (3 or more sex partners with at least one futa)\nTentacles (Futa's fucked by tentacles - I never collected much)\n\nThere's also a folder called &quot;Futa Dickgirl Femdom ART&quot;. I can't remember where I got this from (some download site likely) and it has various futanari (not all Femdom)\n\nSome of these folders may have pics from other folders or even my other parts.\n\nIf you haven't read my last torrent description or readme, I normally sort futa by the artist name or it's influence (what game, anime, or show it parodies) and then any &quot;loose&quot; pics that I can't sort by artist or parody goes into one of my category folders. There are many category with sub categories.\n\nFI pt4 has more content than the last. I'm gradually increasing the size of the torrents I offer. I hate to see some of my folders have slim pickings, but I assure you lots more are coming.\n\nThis is just a small collection, but other categories might have gigs of content. I hope you enjoy this and be sure to leave feedback (Comments, Votes, Ratings Thanks, Seeds)\n\nPart 1: http://www.thepiratebay.se/torrent/5275304/Futanari_Insanity_-_Part_One\nPart 2: http://www.thepiratebay.se/torrent/5282529/Futanari_Insanity_Part_Two_-_Futa_Fluids\nPart 3: http://thepiratebay.se/torrent/5307485\n","torrent":{"xt":"urn:btih:9443083829927f5b28fa5e9a709df806fe151605","amp;dn":"Futanari+Insanity+Part+4+-+Futa+Sex+Positions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9443083829927f5b28fa5e9a709df806fe151605","infoHashBuffer":{"type":"Buffer","data":[148,67,8,56,41,146,127,91,40,250,94,154,112,157,248,6,254,21,22,5]},"announce":[],"urlList":[]}}