{"title":"[-FantasyMassage-] Ashley Adams [-Christian Girls First Cock-] -","uid":12256032,"size":429125862,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:94ce322c83a1a27d5d3259064cbe08e5c7f8d3b1&amp;dn=%5B-FantasyMassage-%5D+Ashley+Adams+%5B-Christian+Girls+First+Cock-%5D+-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Upl0ad3rR","files":1,"time":1440095936,"description":"[-FantasyMassage-] Ashley Adams [-Christian Girls First Cock-] --NEW-- 20-August-2015\n\n---:More From My Torrent's Here:---   &lt;a href=&quot;\nhttps://thepiratebay.se/user/Upl0ad3rR&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/Upl0ad3rR&lt;/a&gt;\n\n---:ScreeNshotS:---  &lt;a href=&quot;\nhttp://imgfresh.com/image/21193.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgfresh.com/image/21193.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgfresh.com/image/21194.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgfresh.com/image/21194.html&lt;/a&gt;\n\nIn the midst of intense home remodeling , Ashley Adam's mom hires Steven St Croix, a licensed masseur to help her daughter with the physical distress that came along with everything. Steven feels the least Ashley's boyfriend can do is give his girlfriend a nice massage, however Ashley is very reticent to have anyone touch her body as she is saving herself for marriage and stands by that theology. Steven knows she is a special client and is going to do everything in his power to make her as comfortable as possible...\n\nSteven asks politely if Ashley can remove her bra, coaxing her to reveal her luscious teen boobs, just to alleviate any oil from ruining her cute pink bra. Steven wants to know more about Ashley's commitment to save herself for her boy, asking as this is representative of an old mentality. How is she to know she is sexually compatible with her boyfriend? Ashley never thought about this before, the topic of sex never crossed her mind. She doesn't have a choice in the matter since this is an arranged marriage. However, Steven knows this is the perfect opportunity to fuck a tight virgin pussy. He proposes to show her a little thing or two and how good it feels to cum. Ashley couldn't resist her sexual temptations, with Steven's huge cock inches away from her face.\n\nSteven relieves all her years of sexual tension placing his hand in between her virgin legs, rubbing her pussy through her panties. Ashley wants more of Stevens hands touching her unadulterated lips, moaning with utmost sexual satisfaction and excitement. He squeezes his fingers inside her tight teen pussy with caution, making sure he doesn't hurt the teenager. He twists and turns his fingers in and out, teasing her virgin pussy, controlling her orgasm. Ashley can't hold it in any longer, sexually peaking passionately. Steven did his job and he thanks her for her services, but Ashley isn't done with her masseur just yet, She wants to see his cock but is too shy to touch it herself or even ask to have it inside of her. Steven takes control, as he shows her how to suck his cock. He shows her how to ride it too, and place herself in magnificent positions which result in him blowing a massive load of cum that covers half her stomach!","torrent":{"xt":"urn:btih:94ce322c83a1a27d5d3259064cbe08e5c7f8d3b1","amp;dn":"%5B-FantasyMassage-%5D+Ashley+Adams+%5B-Christian+Girls+First+Cock-%5D+-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94ce322c83a1a27d5d3259064cbe08e5c7f8d3b1","infoHashBuffer":{"type":"Buffer","data":[148,206,50,44,131,161,162,125,93,50,89,6,76,190,8,229,199,248,211,177]},"announce":[],"urlList":[]}}