{"title":"The Heretics  -  Rory Clements  (Unabridged)","uid":8649008,"size":335311011,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9575aadd72446848b30d530cfb1eace4eea0db41&amp;dn=The+Heretics++-++Rory+Clements++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Robin1966","files":3,"time":1373056057,"description":"Written by Rory Clements\nRead by Gareth Armstrong\nFormat: MP3\nBitrate: 64 Kbps\n\nFrom Rory Clements, winner of the Ellis Peters Historical Fiction Award, comes THE HERETICS, the fifth in his acclaimed John Shakespeare Elizabethan mystery series. 'Does for Elizabeth's reign what C. J. Sansom does for Henry VIII's' Sunday Times England may have survived the Armada threat of 1588, but when Spanish galleys land troops in Cornwall on a lightning raid seven years later, is it a dry-run for a new invasion? Or is there, perhaps, a more sinister motive? The Queen is speechless with rage.But as intelligencer John Shakespeare tries to get a grip on events, one by one his network of spies is horribly murdered. What has all this to do with Thomasyn Jade, a girl driven to the edge of madness by the foul rituals of exorcism? And what is the link to a group of priests held prisoner in bleak Wisbech Castle? From the pain-wracked torture rooms of the Inquisition in Seville to the marshy wastes of fenland, from the wild coasts of Cornwall to the sweat and sawdust of the Elizabethan playhouses, and from the condemned cell at Newgate to the devilish fantasies of a fanatic, THE HERETICS builds to a terrifying climax that threatens the life of the Queen herself. \n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:9575aadd72446848b30d530cfb1eace4eea0db41","amp;dn":"The+Heretics++-++Rory+Clements++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9575aadd72446848b30d530cfb1eace4eea0db41","infoHashBuffer":{"type":"Buffer","data":[149,117,170,221,114,68,104,72,179,13,83,12,251,30,172,228,238,160,219,65]},"announce":[],"urlList":[]}}