{"title":"ALEXANDER 2004 XVID Dvd Rip by vladtepes3176.avi","uid":5310241,"size":1409028096,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:96d5466a30f9beb79d972ce78d6113483ea78017&amp;dn=ALEXANDER+2004+XVID+Dvd+Rip+by+vladtepes3176.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"vladtepes3176","files":-1,"time":1264536352,"description":"This is a good DVD rip to XVID of the epic: Alexander 2004 at 1.31 GB. I follow a guide (PAKG) to rip and convert like AXXO. (you can see this in some of my other XVIDs for upload) \n\nWhile AXXO is famous for his 700MB high quality uploads, and I usually follow suit,  in this case I made this Upload of Alexander 1.31Gb as it is a 3 Hour film. \n\nA 700mb rip of it would not do the film justice. The 1.31 GB rip is the smallest file at the BEST quality that I could figure. PLEASE COMMENT! I would love to here your opinion.  \n\nI would say it is &quot;exactly&quot; the same quality as the other MOST popular upload of this film on the Internet:\n\nI bought the DVD in Taiwan and ripped it because as much shit people talk about this film, it is really a classic! Of course Oliver Stone attempts to attract attention with the homosexuality that might have occurred in the time the film is set to take place. (NOT PROVEN AT ALL!!)   \n\nIt is well acted by a whole lot of leading actors to bring to life the story of arguable the greatest military leader the world has ever seen. \nFORGET THE REVIEWS and WATCH FOR YOURSELF!! TRUST ME!\n\nI ripped this film because in this time and day when great bit torrent sites are being shut down and geniuses like AXXO are being target for their work I STRONGLY BELIEVE THAT THERE IS A NEED FOR MORE THAN 1 UPLOAD POSSIBILITY OUT THERE!\n\nSo download, PLEASE SEED and help this spread like the CLAP!\n\nThank you \nby vladtepes3176\n\nALEXANDER 2004\nDirected by Oliver Stone STARRING: Colin Farrell,Angelina Jolie,Val Kilmer,Anthony Hopkins and Jared Leto \n\nPLEASE DOWNLOAD AND SEED THIS (I have a FAST fiber connection that's stable and I always update the trackers. BUT YOU HAVE TO SEED as well! No Lechers!\n\nI worked hard on this\n\nThanks\n\nvladtepes3176 9no fucking Lechers!)\n\n\nPLOT:Conquering 90% of the known world by the age of 25, Alexander the Great led his armies through 22,000 miles of sieges and conquests in just eight years. Coming out of tiny Macedonia(Greece), Alexander led his armies against the mighty Persian Empire, drove west to Egypt, and finally made his way east to India. This film will concentrate on those eight years of battles, as well as his relationship with his boyhood friend and battle mate, Hephaestion. Alexander died young, of illness, at 33. Alexander's conquests paved the way for the spread of Greek culture (facilitating the spread of Christianity centuries later), and removed many of the obstacles that might have prevented the expansion of the Roman Empire. In other words, the world we know today might never have been if not for Alexander's bloody, yet unifying, conquest. Written by &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;dcbda9afa8b5b2e8e9ebeb9cbdb3b0f2bfb3b1&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nSEED!","torrent":{"xt":"urn:btih:96d5466a30f9beb79d972ce78d6113483ea78017","amp;dn":"ALEXANDER+2004+XVID+Dvd+Rip+by+vladtepes3176.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96d5466a30f9beb79d972ce78d6113483ea78017","infoHashBuffer":{"type":"Buffer","data":[150,213,70,106,48,249,190,183,157,151,44,231,141,97,19,72,62,167,128,23]},"announce":[],"urlList":[]}}