{"title":"HISTORY OF POP AND ROCK MUSIC - part 300","uid":6414126,"size":1094115252,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:970b8e429cedc5bbdce1a9e9bd9490f3a4b1d843&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+300&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1306106546,"description":"                   PART  300\n\n\n\n        AMOS MILBURNE -  Bad Bad Whiskey (1954)\n        LAVERN BAKER  -  Love Me Right In The Morning  (1954)\n        THE LARKS  -  The World is Waiting for Sunrise (1954)\n        THE FLAMINGOS  -  Jump Children (1959)\n        CHUCK BERRY   - Little Queenie  (1959)\n        THE PLATTERS   -  Only You  (1955)    \n        THE PLATTERS  - The Great Pretender (1955) \n\n\n\n        &quot;Bad, Bad Whiskey&quot; is a 1950 song by Amos Milburn. The song was initially a Maxwell Davis instrumental titled &quot;Bristol Drive&quot; which Amos adapted by blending in some liquid lyrics. &quot;Bad, Bad Whiskey&quot; became one of the most enduring &quot;Blues-in-a-bottle&quot; songs. The single would be the last time Amos Milburn to reach the number one position on the R&amp;B charts \n        LaVern Baker (1929-1997) was an American rhythm and blues singer.She began singing in Chicago clubs such as the Club DeLisa around 1946, often billed as Little Miss Sharecropper and first recorded under that name in 1949. She changed her name briefly to Bea Baker when recording for Okeh Records in 1951, and then became LaVern Baker when singing with Todd Rhodes and his band in 1952.\nBaker had a succession of hits on the R&amp;B charts over the next couple of years with her backing group The Gliders, including &quot;Bop-Ting-A-Ling&quot; (#3 R&amp;B), &quot;Play It Fair&quot; (#2 R&amp;B), and &quot;Still&quot; (#4 R&amp;B). At the end of 1956 she had another smash hit with &quot;Jim Dandy&quot; (#1 R&amp;B, #17 pop). It sold over one million copies, and was awarded a gold disc. Further hits followed for Atlantic, including the follow-up &quot;Jim Dandy Got Married&quot; (#7 R&amp;B), &quot;I Cried a Tear&quot; (#2 R&amp;B, #6 pop in 1959), &quot;I Waited Too Long&quot; (#5 R&amp;B, #3 pop, written by Neil Sedaka), &quot;Saved&quot; (#17 R&amp;B, written by Leiber and Stoller), and &quot;See See Rider&quot; (#9 R&amp;B in 1963).\n       &quot;The World Is Waiting for the Sunrise&quot; is a popular ballad with lyrics by Gene Lockhart and music ) by the concert pianist Ernest Seitz, who had conceived the refrain when he was 12. Embarrassed about writing popular music, Seitz used the pseudonym &quot;Raymond Roberts&quot; when the song was first published by Chappell in 1919. More than 100 versions have been recorded. Initially, it was recorded by both singers and instrumentalists, including Morton Downey, Fritz Kreisler, Ted Lewis, and John Steel. Later, as a popular vehicle for improvisation, it was recorded by many jazz musicians, among them Benny Goodman, Duke Ellington, Django Reinhardt, Mel Powell, Jess Stacy, and Jack Teagarden. A version made for Capitol in 1951 by guitarists Les Paul and Mary Ford was a million-seller. The Beatles recorded a home version on a Grundig tape recorder, sometime in the late 1950's.A version by doo-wop group the Larks is featured in the 1955 film &quot;Rhythm and Blues Revue&quot;. \n      &quot;Only You (And You Alone)&quot; (often shortened to &quot;Only You&quot;) is a pop song composed by Buck Ram. It was recorded most successfully by The Platters, with lead vocals by Tony Williams, in 1955.\nThe song held strong in the number-one position on the U.S. R &amp; B charts for seven weeks, and hit number five on the Billboard Hot 100 chart. It remained there for 30 weeks, beating out a rival cover version by a white band called The Hilltoppers. When the Platters track, &quot;The Great Pretender&quot; (which eventually surpassed the success of &quot;Only You&quot;), was released in the UK as Europe's first introduction to The Platters, \n      &quot;The Great Pretender&quot; is a popular song recorded by The Platters, with Tony Williams on lead vocals, and released as a single on November 3, 1955. The words and music were created by Buck Ram, the Platters' manager and producer who was a successful songwriter before moving into producing and management. The Great Pretender reached the number one position on both the R&amp;B and pop charts in 1956. In 2004, the song was voted 351st greatest song of all time by Rolling Stone.","torrent":{"xt":"urn:btih:970b8e429cedc5bbdce1a9e9bd9490f3a4b1d843","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+300","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"970b8e429cedc5bbdce1a9e9bd9490f3a4b1d843","infoHashBuffer":{"type":"Buffer","data":[151,11,142,66,156,237,197,187,220,225,169,233,189,148,144,243,164,177,216,67]},"announce":[],"urlList":[]}}