{"title":"Just a Pilgrim (2009) [Dynamite] [Black Bull]","uid":7829787,"size":168048272,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:971e47d1867f3589c48d4ba4f4a23ed07ee80389&amp;dn=Just+a+Pilgrim+%282009%29+%5BDynamite%5D+%5BBlack+Bull%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"blackcanary","files":-1,"time":1353021636,"description":"English | CBR | 233 Pages\n\nJust a Pilgrim (2009)\nPublisher:  Dynamite Entertainment\nPublication Date:  March 18, 2009\n\nWritten by Garth Ennis\nArt by Carlos Ezquerra\n\nDynamite Entertainment published this hardcover in 2009 which collects the five-issue Just a Pilgrim limited series written by Garth Ennis, with art by Carlos Ezquerra, and published by Black Bull in 2001 and the four issue sequel, Just a Pilgrim: Garden of Eden, published by Black Bull in 2002.  This volume also contains a complete cover gallery featuring the work of Tim Bradstreet, JG Jones, Glenn Fabry, and many more.\n\nThe series came about as Preacher was coming to a close, and according to Ennis he &quot;wanted to push the idea of the classic Western or action anti-hero a little bit more than I normally would, and that is where the religious fanaticism came from and also where the cannibalism came from.\n\nThe setting of the series is one in which the Sun experienced coronal expansion (referred to as 'The Burn') growing to the point where the Earth was scorched and the oceans evaporated, and only a few pockets of humanity have survived. The series is narrated by Billy Shepard, a child who is with a refuge group attempting to cross the now empty Atlantic Basin, in hopes of finding sources of water on the other side.\n\n[spoilers follow]\n\nJust a Pilgrim\nThe title character (never named, simply called Pilgrim) was a Green Beret prior to the burn. During one mission, he and his comrades were left adrift at sea in a lifeboat, and forced to resort to cannibalism to survive, with Pilgrim being the only survivor by the time help arrived. He was exonerated, but he had developed a taste for human flesh, and continued the practice after he escaped. He was eventually caught by the authorities. During his imprisonment, he was routinely visited by a priest, and eventually accepted God. When the burn happened, he was freed, though he was the only survivor in sight. Struck by the death of the holy man who tried to lead him to redemption, he took the preacher's cross and burned his faith into himself (the scar on his face).\n\nThe series begins some years later, when Pilgrim encounters the group of refugees and offers to show them the way. He helps defend them from a group of pirates who attack them during their trek. The Pirates are led by a man with no eyes, two hooks for hands and two peg legs. Pilgrim befriends Billy Shepard, a young boy who keeps a diary and sticks up for him. Most of the refugees do not trust Pilgrim, as their numbers keep dwindling and, according to a few, his stories do not make sense. Eventually, Pilgrim leads them in a climactic battle, revealing that he had knowingly used the refugees as bait to lure the pirates into a trap. The battle annihilates both the refugees and the pirates, and leaves Pilgrim the only survivor.\n\nJust a Pilgrim: Garden of Eden\nIn the sequel, Garden of Eden, Pilgrim comes across an oasis of sorts in a deep oceanic trench, where there is still plant life, and what may be the last remnants of humanity. The people are mainly scientists who have been building a space shuttle that is near completion which may be able to take them off planet to some more hospitable world. Pilgrim requests that they take the Bible with them when they leave. The group is threatened by the onslaught of sliders, mutated jellyfish which can possess the bodies of other organisms. Pilgrim assists the scientists in warding them off. Eventually, the sliders gain an upper hand, and raid the sanctuary. Almost everyone is killed. The shuttle is launched at the last minute, with only two survivors among the scientists (a male and a female), on board. Defending their escape, with an enemy's fingers literally in his eye, Pilgrim changes his mind and tells the woman to throw away the Bible, having had lost faith due to the deaths of so many innocent people. Pilgrim manages to ensure that the journal of Billy Shepard is taken instead.\n\nThe shuttle launches, the two survivors are safe with their genetic samples and the fate of Pilgrim is unknown.","torrent":{"xt":"urn:btih:971e47d1867f3589c48d4ba4f4a23ed07ee80389","amp;dn":"Just+a+Pilgrim+%282009%29+%5BDynamite%5D+%5BBlack+Bull%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"971e47d1867f3589c48d4ba4f4a23ed07ee80389","infoHashBuffer":{"type":"Buffer","data":[151,30,71,209,134,127,53,137,196,141,75,164,244,162,62,208,126,232,3,137]},"announce":[],"urlList":[]}}