{"title":"Billy Joe Shaver - Storyteller Live At The Bluebird 1992 [2007][","uid":8863791,"size":292047152,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:976e9658636bdfde5d5ec25f6cc4f135f76419c0&amp;dn=Billy+Joe+Shaver+-+Storyteller+Live+At+The+Bluebird+1992+%5B2007%5D%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":31,"time":1377843771,"description":"Artist:Billy Joe Shaver\nRelease:Storyteller Live At The Bluebird 1992 \nReleased: 2007\nLabel: Sugar Hill\nCatalog#: SHCD 4030\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle:country,americana\n\nimage\n\n\nSimply put, somebody -- mostly likely either songwriter Billy Joe Shaver or Sugar Hill -- had this tape lying around for the better part of 15 years. Only God really knows why. It's a live gig from 1992, by Billy Joe accompanied by his late son Eddy Shaver and Keith Christopher on acoustic guitars and bass, and sometimes singing backing vocals. Unfortunately, it's edited and not the complete concert -- maybe the folks at Sugar Hill felt like Shaver's fans wouldn't lay down for a double disc, or perhaps the other tracks got flubbed one way or another (not like any fans of Billy Joe would care). But what is here is simply stunning. It's not that the show is atypical of a great Shaver performance, the point is that it is. For that reason alone, Storyteller: Live at the Bluebird belongs on the shelf. It doesn't matter if you have a boatload of BJS recordings with the same songs on them; you don't have them done like this. From &quot;Georgia on a Fast Train&quot; to &quot;Wally the Wandering Gypsy and Me&quot; to &quot;Black Rose,&quot; &quot;The Cowboy Who Started the Fight,&quot; and &quot;Honky Tonk Heroes,&quot; to the truly chilling &quot;Moonshine and Indian Blood,&quot; &quot;Highway of Life,&quot; &quot;Live Forever,&quot; and the heartbreaking closer &quot;You Asked Me To,&quot; it's all gold. When you combine them with the introductions to the songs and his ranging folksy stories, which you can never hear too many times, and Eddy's picking, it's awe-inspiring. But there's something else that makes this set special. Todd Snider's liner notes (he was there at the Bluebird that night, driving from Memphis, bringing his fledgling band to hear the man), it appears that Shaver's then ex-wife Brenda was there in the front row to hear her son and her former husband play this gig (Shaver announces it himself in one of his stories). It's clear he's playing the gig for her, and you might have known something was up by the simple intensity in the deliveries. The pair reconciled for the third time sometime after this set. Both Brenda and Eddy are gone now. Shaver lost them both, and his mama, in the same year. But the intimacy and straight-ahead no-bullshit focus in delivering these songs is something that Shaver can doe better than literally anybody. The sound is fine, it conveys what's happening on that stage without a net. It would be impossible to recommend this one highly enough. We also owe a special thanks to Snider (no slouch himself when it comes to songwriting) for giving us the play by play from memory.","torrent":{"xt":"urn:btih:976e9658636bdfde5d5ec25f6cc4f135f76419c0","amp;dn":"Billy+Joe+Shaver+-+Storyteller+Live+At+The+Bluebird+1992+%5B2007%5D%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"976e9658636bdfde5d5ec25f6cc4f135f76419c0","infoHashBuffer":{"type":"Buffer","data":[151,110,150,88,99,107,223,222,93,94,194,95,108,196,241,53,247,100,25,192]},"announce":[],"urlList":[]}}