{"title":"The Serpent and the Pearl - Kate Quinn.epub","uid":9482280,"size":605133,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:97c26b3c11be7e0ed466ad38a31de73513fe429d&amp;dn=The+Serpent+and+the+Pearl+-+Kate+Quinn.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1389818646,"description":"One powerful family holds a city, a faith, and a woman in its grasp--from the national bestselling author of &quot;Daughters of Rome&quot; and &quot;Mistress of Rome.&quot;\nRome, 1492. The Holy City is drenched with blood and teeming with secrets. A pope lies dying and the throne of God is left vacant, a prize awarded only to the most virtuous--or the most ruthless. The Borgia family begins its legendary rise, chronicled by an innocent girl who finds herself drawn into their dangerous web...\nVivacious Giulia Farnese has floor-length golden hair and the world at her feet: beauty, wealth, and a handsome young husband. But she is stunned to discover that her glittering marriage is a sham, and she is to be given as a concubine to the ruthless, charismatic Cardinal Borgia: Spaniard, sensualist, candidate for Pope--and passionately in love with her.\nTwo trusted companions will follow her into the Pope's shadowy harem: Leonello, a cynical bodyguard bent on bloody revenge against a mysterious killer, and Carmelina, a fiery cook with a past full of secrets. But as corruption thickens in the Vatican and the enemies begin to circle, Giulia and her friends will need all their wits to survive in the world of the Borgias.","torrent":{"xt":"urn:btih:97c26b3c11be7e0ed466ad38a31de73513fe429d","amp;dn":"The+Serpent+and+the+Pearl+-+Kate+Quinn.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97c26b3c11be7e0ed466ad38a31de73513fe429d","infoHashBuffer":{"type":"Buffer","data":[151,194,107,60,17,190,126,14,212,102,173,56,163,29,231,53,19,254,66,157]},"announce":[],"urlList":[]}}