{"title":"R-Wipe &amp; Clean 11.4.2127 Corporate (Install  + Portable)","uid":14992153,"size":17748917,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:99b625a053e60d54a1430eedfbe841c0ad6287b2&amp;dn=R-Wipe+%26amp%3B+Clean+11.4.2127+Corporate+%28Install++%2B+Portable%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"jovo_bih","files":1,"time":1466331189,"description":"R-Wipe &amp; Clean 11.4.2127 Corporate (Install  + Portable)\r\n\r\nAbout this release\r\n\r\nRelease date: 18/06/2016\r\nOS: Windows XP/7/8/8.1/10 (x86/x64)\r\nInstall: run setup, unpack crack archive and follow instructions from readme file\r\nPortable: registered, simply unpack and run executable\r\n\r\nNew R-Wipe &amp; Clean supports Windows 10, 8.1, and 8, removes traces from more than 600 third-party applications, including Microsoft Office 2016 and Skype(!), and supports all recent versions of Microsoft Edge, Internet Explorer, Mozilla/Mozilla Firefox, Opera, Safari, Flock, Netscape, AOL, MSN, Google Chrome, SeaMonkey, BT Yahoo!, Konqueror, and K-Meleon, as well as the Google, Windows Live, Yahoo!, and MSN toolbars. \r\n\r\nAbout R-Wipe &amp; Clean\r\n\r\nR-Wipe &amp; Clean is a complete R-Tools solution to wipe useless files and maintain your computer privacy. It irretrievably deletes private records of your online and off-line activities, such as temporary Internet files, history, cookies, autocomplete forms and passwords, swap files, recently opened documents lists, Explorer MRU (most recently used) lists, temporary files, and traces from more than 300 third-party applications, thus freeing up your disk space. The utility wipes files and unused disk space using either fast or secure-erase algorithms. All files and folders may be entered in wipe lists to erase them in a single procedure. Supports both the FAT and NTFS file systems. You can combine separate wiping and cleaning tasks and launch them to begin erasing immediately or set them to begin erasing procedures as a background task at predefined times or events. \r\n\r\nFeatures\r\n\r\n- Verify beforehand the data selected for irretrievable wiping.\r\n- Wipe and delete temporary Internet files.\r\n- Wipe and delete &quot;cookies,&quot; small files that Web sites store on your computers for identification purposes. Your favorite cookies may be safely kept.\r\n- Wipe and delete Flash cookies, small files that Web sites create on your computer.\r\n- Wipe and delete Java and Microsoft VM logs.\r\n- Clean autocomplete forms for log-ins, user names, passwords, and other personal information entered at Web sites and keywords entered on search engines.\r\n- Clean &quot;history,&quot; the list of visited Web sites.\r\n- Clean the list of recently opened documents.\r\n- Clean the list of opened file history.\r\n- Clean Windows clipboard content.\r\n- Wipe and delete temporary files created by Windows and other programs.\r\n- Clean system Registry traces, such as the run list, search results, mapped network drives, attached peripheral devices, and the last opened Registry key.\r\n- Clean &quot;MFUs,&quot; which are lists of most frequently used programs, Start Menu links and icons, Control Panel items, Web pages saved as Favorites, and Internet Explorer buttons.\r\n- Wipe .dat files (even locked) to remove any leftovers after incorrect Windows shutdowns.\r\n- Wipe and delete off-line content.\r\n- Clean activity traces from more than 300 third-party applications, including Microsoft Office and other standard Windows apps, as well as numerous other popular programs. Installed applications are detected automatically.\r\n- Create customized wipe lists to clean activity traces from any application that R-Wipe &amp; Clean currently does not support. Such wipe lists may include application working and temporary folders and files, and Registry keys.\r\n- Wipe Windows swap files.\r\n- Wipe and delete invalid desktop shortcuts, ones that are on your desktop but are not linked to any existing objects.\r\n- Clean Windows Event Logs\r\n- Wipe Windows built-in firewall logs.\r\n- Clean links to recent network folders.\r\n- Wipe auxiliary temporary files, such as set-up temporary and log files, memory dump files, and old Check Disk files.\r\n- Wipe and delete Prefetch traces.\r\n- Wipe and delete defragmentation lists.\r\n- Clean stored Explorer view settings.\r\n- Clean stored application descriptions.\r\n- Wipe and delete cached icons and fonts.\r\n- Clean various logs of Windows' update system.\r\n- Wipe and delete WMI, diagnostics, and security management logs.\r\n- Clean stored network passwords.\r\n- Clean cached shell extensions.\r\n- Clean stored addresses of unread mail.\r\n- Clean stored FTP folders.\r\n- Clean stored Start Menu order.\r\n- Clean stored cached wallpapers.\r\n\r\nHomepage http://www.r-wipe.com/","torrent":{"xt":"urn:btih:99b625a053e60d54a1430eedfbe841c0ad6287b2","amp;dn":"R-Wipe+%26amp%3B+Clean+11.4.2127+Corporate+%28Install++%2B+Portable%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99b625a053e60d54a1430eedfbe841c0ad6287b2","infoHashBuffer":{"type":"Buffer","data":[153,182,37,160,83,230,13,84,161,67,14,237,251,232,65,192,173,98,135,178]},"announce":[],"urlList":[]}}