{"title":"New ebook packs for August 2014 CORRECTED","uid":11259444,"size":9222847675,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9a4582a9b0e37d92889964f0e6e71a4b824fbf02&amp;dn=New+ebook+packs+for+August+2014+CORRECTED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"muppetlvr","files":49,"time":1413942893,"description":"New ebook packs for August 2014\n\nThese are the original ebook packs released by the group known as The NERDs\n\nSEE THE INCLUDED INDEX FILE FOR CONTENTS, Index 2014-08.txt\n\nA list of the complete collection 2003-2013 is also included for reference.\nYou can view these text files quickly by setting them to Priority High.\n\nIf you aren't familiar with NERDs ebooks, sample a single day from a smaller, more recent torrent by setting other files in the torrent to Priority &quot;do not download&quot;.\n\nThe complete collection from 2003 through 2013 contains over 300,000 ebooks, is over 326GB RAR'd, would be double that otherwise and will not be posted in any other format.  The RAR file naming convention is purposely to evade DMCA crawlers.\n\nThese torrents are an expression of appreciation to the NERDs for making all these wonderful ebooks available, providing missing and broken files as needed and giving me their blessing to redistribute them here.\n\nThese torrents are being posted anonymously via VPN for obvious reasons.  If these reasons aren't obvious to you, then you shouldn't be torrenting.\n\nInstead of complaining about the torrent, try rereading the above description.  Everything about these torrents is done for a reason, not without thought.\n\nEither you're familiar with NERDs ebooks and delighted at the opportunity to back fill your collection, or you're lucky enough to discover them now while they're still available, or you can whine and complain and miss the boat.  Your choice.\n\nEnjoy\n\nPS. Thanks to everyone for all the nice comments and feedback on the September torrent, and special thanks to everyone that has contributed their bandwidth and resources to help seed.  Another special thanks to all the Nerds for all their hard work keeping the rest of us supplied with great ebooks","torrent":{"xt":"urn:btih:9a4582a9b0e37d92889964f0e6e71a4b824fbf02","amp;dn":"New+ebook+packs+for+August+2014+CORRECTED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a4582a9b0e37d92889964f0e6e71a4b824fbf02","infoHashBuffer":{"type":"Buffer","data":[154,69,130,169,176,227,125,146,136,153,100,240,230,231,26,75,130,79,191,2]},"announce":[],"urlList":[]}}