{"title":"Margaret C. Jacob - Practical Matter. Newton's Science in the Se","uid":10427710,"size":1579662,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9a791641f7199a5eaa22b76b0d7b638ecca7392f&amp;dn=Margaret+C.+Jacob+-+Practical+Matter.+Newton%27s+Science+in+the+Se&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1403726498,"description":"Description\nProduct Details\nBook Title: Practical Matter: Newton's Science in the Service of Industry and Empire, 1687-1851 (New Histories of Science, Technology, and Medicine)\t\nBook Author: Margaret C. Jacob (Author), Larry Stewart (Author)\nSeries: New Histories of Science, Technology, and Medicine\nHardcover: 216 pages\nPublisher: Harvard University Press; First Edition edition (January 2, 2005)\nLanguage: English\nISBN-10: 0674014979\nISBN-13: 978-0674014978\n\n===================================================================================\nBook Description\nPublication Date: January 2, 2005 | ISBN-10: 0674014979 | ISBN-13: 978-0674014978 | Edition: First Edition\nMargaret Jacob and Larry Stewart examine the profound transformation that began in 1687. From the year when Newton published his Principia to the Crystal Palace Exhibition of 1851, science gradually became central to Western thought and economic development. The book aims at a general audience and examines how, despite powerful opposition on the Continent, a Newtonian understanding gained acceptance and practical application. By the mid-eighteenth century the new science had achieved ascendancy, and the race was on to apply Newtonian mechanics to industry and manufacturing. They end the story with the temple to scientific and technological progress that was the Crystal Palace exhibition. Choosing their examples carefully, Jacob and Stewart show that there was nothing preordained or inevitable about the centrality awarded to science. &quot;It is easy to forget that science might have been stillborn, or remained the esoteric knowledge of court elites. Instead, for better and for worse, science became a centerpiece of Western culture.&quot;\n\n===================================================================================\nReviews\nPractical Matter presents a popular argument for strong continuities between the Scientific Revolution and the industrial transformation whose machines and symbols populated the Crystal Palace in 1851.--David Philip Miller (Historical Studies in the Physical and Biological Sciences)\n\n[Practical Matter] is a highly ambitious and provocative survey of the cultural history of science and industry...While Jacob and Stewart embrace a comparative perspective and offer occasional forays to describe the developing relation between science and industry on the Continent and in the colonies, these additional studies serve mainly to underscore the pioneering precedent set by British natural philosophers and manufacturers in forging the requisite &quot;cultural matrix&quot; and &quot;technical knowledge&quot; for industrialization. Practical Matter resolutely avoids many of the commonplaces of the scholarship on the Industrial Revolution.--Fredrik Albritton Jonsson (Journal of Modern History 2007-02-01)\n\nThis ambitious little book reviews how Newton's disciples promoted themselves and their inventions throughout Europe . . . By concentrating on utility, Jacob and Stewart have refreshingly revived some voices of the period's practical reformers . . . Writing small books on big subjects is extremely hard, but there is a great demand amongst teachers and readers for short, accessible stories about the history of science.--Patricia Fara (Minerva 2005-12-01)\n\n===================================================================================\nAbout the Authors\nMargaret C. Jacob is Distinguished Professor of History, University of California, Los Angeles.\nLarry Stewart is Professor of History, University of Saskatchewan, Canada.\n===================================================================================","torrent":{"xt":"urn:btih:9a791641f7199a5eaa22b76b0d7b638ecca7392f","amp;dn":"Margaret+C.+Jacob+-+Practical+Matter.+Newton%27s+Science+in+the+Se","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a791641f7199a5eaa22b76b0d7b638ecca7392f","infoHashBuffer":{"type":"Buffer","data":[154,121,22,65,247,25,154,94,170,34,183,107,13,123,99,142,204,167,57,47]},"announce":[],"urlList":[]}}