{"title":"Hacker TRUEFRENCH DVDRIP 2015","uid":13500978,"size":1463425144,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9a8a56b361e05eb2b738c81d27a7bb8866ddac32&amp;dn=Hacker+TRUEFRENCH+DVDRIP+2015&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"annuaireweb","files":1,"time":1455196120,"description":"Blackhat.2015.SUBFORCED.TRUEFRENCH.BRRiP.XviD-SANCTUAiRE\r\n\r\nÀ Hong Kong, la centrale nucléaire de Chai Wan a été hackée. Un logiciel malveillant, sous la forme d’un outil d’administration à distance ou RAT (Remote Access Tool), a ouvert la porte à un autre malware plus puissant qui a détruit le système de refroidissement de la centrale, provoquant la fissure d’un caisson de confinement et la fusion de son coeur. Aucune tentative d’extorsion de fonds ou de revendication politique n’a été faite. Ce qui a motivé cet acte criminel reste un mystère. Un groupe de hauts gradés de l’APL (Armée populaire de libération chinoise) charge le capitaine Dawai Chen, spécialiste de la défense contre les cyberattaques, de retrouver et de neutraliser l’auteur de ce crime. À Chicago, le Mercantile Trade Exchange (CME) est hacké, provoquant l’inflation soudaine des prix du soja. Carol Barrett, une agente chevronnée du FBI, encourage ses supérieurs à associer leurs efforts à ceux de la Chine. Mais le capitaine Chen est loin de l’idée qu’elle s’en était faite. Formé au MIT, avec une parfaite maîtrise de l’anglais, l’officier chinois insiste pour que ses homologues américains libèrent sur le champ un célèbre hacker détenu en prison : Nicholas Hathaway","torrent":{"xt":"urn:btih:9a8a56b361e05eb2b738c81d27a7bb8866ddac32","amp;dn":"Hacker+TRUEFRENCH+DVDRIP+2015","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a8a56b361e05eb2b738c81d27a7bb8866ddac32","infoHashBuffer":{"type":"Buffer","data":[154,138,86,179,97,224,94,178,183,56,200,29,39,167,187,136,102,221,172,50]},"announce":[],"urlList":[]}}