{"title":"Faith and Power in Japanese Buddhist Art (Art Ebook).pdf","uid":15232288,"size":14137516,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9c087f62f1aa1f885cdb07895ff41a6ec8c93e8a&amp;dn=Faith+and+Power+in+Japanese+Buddhist+Art+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"STBGD","files":1,"time":1467840698,"description":"Faith and Power in Japanese Buddhist Art, 1600-2005\r\n2008 | 353 Pages | 0824831918 | PDF | 13 MB\r\n\r\nFaith and Power in Japanese Buddhist Art explores the transformation of Buddhism from the premodern to the contemporary era in Japan and the central role its visual culture has played in this transformation. Although Buddhism is generally regarded as peripheral to modern Japanese society, this book demonstrates otherwise. Its chapters elucidate the thread of change over time in the practice of Buddhism as revealed in temple worship halls and other sites of devotion and in imagery representing the religion's most popular deities and religious practices. It also introduces the work of modern and contemporary artists who are not generally associated with institutional Buddhism and its canonical visual requirements but whose faith inspires their art. The author makes a persuasive argument that the neglect of these materials by scholars results from erroneous presumptions about the aesthetic superiority of early Japanese Buddhist artifacts and an asserted decline in the institutional power of the religion after the sixteenth century. She demonstrates that recent works constitute a significant contribution to the history of Japanese art and architecture, providing evidence of Buddhism's persistent and compelling presence at all levels of Japanese society and its evolution in response to the needs of new generations of supporters both within and beyond its orthodox institutions. The book is divided into two chronological sections. The first explores Buddhism in an earlier period of Japanese art (1600-1868), emphasizing the production of Buddhist temples and imagery within the larger political, social, and economic concerns of the time. It surveys the important and representative Buddhist sites and the attraction of the faith to both the authoritative shogunal regime and private citizens. The second section addresses Buddhism's visual culture in modern Japan (1868-2005), specifically the relationship between Buddhist institutions prior to World War II and the increasingly militaristic national government that had initially persecuted them. Following this, the author looks at a concurrent development: the transformation of sacred imagery from icon into art, which in turn stimulated the emergence of a new form of Buddhism dominated by nondenominational practitioners, including secular artists with a personal affinity for Buddhism. The final chapters focus on Buddhist sites and imagery after the war, introducing some of the most distinctive recent sites of worship and the new makers of Buddhist art, who range from traditional workshops and devout laypersons to artists, as both makers and patrons of Buddhist devotional art. This accessible and well-researched volume can be read with profit by scholars and students of Japanese art, history, and religion, as well as by anyone with an interest in Buddhism or Japanese culture","torrent":{"xt":"urn:btih:9c087f62f1aa1f885cdb07895ff41a6ec8c93e8a","amp;dn":"Faith+and+Power+in+Japanese+Buddhist+Art+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c087f62f1aa1f885cdb07895ff41a6ec8c93e8a","infoHashBuffer":{"type":"Buffer","data":[156,8,127,98,241,170,31,136,92,219,7,137,95,244,26,110,200,201,62,138]},"announce":[],"urlList":[]}}