{"title":"Daryl.Hall.Live.from.Daryl's.House.E28.Toots and The Maytals.","uid":5377579,"size":307920095,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9c69e3a1839e18b72d3f1155162612e4a1fdb1c7&amp;dn=Daryl.Hall.Live.from.Daryl%5C%27s.House.E28.Toots+and+The+Maytals.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"PhillySoul","files":16,"time":1266623410,"description":"Toots and The Maytals\n\nDaryl Hall took his groundbreaking web series to sunny Jamaica this month, where he hooked up with legendary reggae group Toots and the Maytals for the 28th and most recent edition of Live From Daryl's House, available starting Feb. 15. The shoot took place at the home of famed reggae DJ &quot;Native&quot; Wayne Jobson in Ocho Rios, where Daryl and Toots Hibbert teamed on an incredible eight-song set that featured Toots and the Maytals classics like &quot;Time Tough,&quot; &quot;Reggae Got Soul,&quot; &quot;Funky Kingston,&quot; &quot;Sweet and Dandy,&quot; &quot;Dog War,&quot; &quot;Monkey Man&quot; and &quot;54-46 Was My Number,&quot; a song Toots wrote after serving a prison sentence for marijuana possession in the mid-'60s, along with a rock steady take on Hall and Oates' &quot;You Make My Dreams Come True,&quot; recently popularized by its use in the film (500) Days of Summer. As on all episodes, there was a chef preparing food for everyone, in this case, Suzanne Couch, who joins Daryl and Toots for &quot;Sweet and Dandy.&quot;\n\nFrederick &quot;Toots&quot; Hibbert grew up singing gospel in the church choir, moving to Kingston, Jamaica, when he was 13, where he eventually formed the Maytals, who recorded for legendary Studio One producer Clement &quot;Coxsone&quot; Dodd, accompanied by the famed studio band the Skatalites. The band went on to work with Prince Buster, Byron Lee and Leslie Kong.","torrent":{"xt":"urn:btih:9c69e3a1839e18b72d3f1155162612e4a1fdb1c7","amp;dn":"Daryl.Hall.Live.from.Daryl%5C%27s.House.E28.Toots+and+The+Maytals.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c69e3a1839e18b72d3f1155162612e4a1fdb1c7","infoHashBuffer":{"type":"Buffer","data":[156,105,227,161,131,158,24,183,45,63,17,85,22,38,18,228,161,253,177,199]},"announce":[],"urlList":[]}}