{"title":"Workingmans.Death.2005.PAL.DVDR","uid":4166454,"size":4681561601,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:9d0714763d287a36319ba2dd8ea0ab813b650944&amp;dn=Workingmans.Death.2005.PAL.DVDR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"BhangWalla","files":-1,"time":1209642702,"description":"Workingman's Death\n\n &lt;a href=&quot;\nhttp://workingmansdeath.com/about_en.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://workingmansdeath.com/about_en.html&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0478331/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0478331/&lt;/a&gt;\n\nYear.............: 2005, DVD-release 11th May 2007\nIMDB-link........: http://www.imdb.com/title/tt0478331\nCountry..........: Austria / Germany\nAudio............: Dolby 6.1\nSubtitles........: German, German for Hearing Impared, Turkish, English, French, Spanish, Italian, Portugesian, Danish, Polish, Estonian, Lithuanian\nVideo Format.....: 4:3 Letterbox\nDVD Source.......: DVD9\nDVD Format.......: PAL / Region: 0\nLanguages........: Pashtun, Yoruba, German, English, Ibo, Indonesian, Mandarin, Russian\n\nPlay time........: 122 min\nExtras...........: 24 min\n\nAudio Commentary Tracks have been removed to improve video quality.\n\n-------------------------------------------------------------------\n\nSynopsis:\n\nThe toil of the workingman is the fascinating subject for this documentary from Austrian director Michael Glawogger. Taking five groups of workers from five different countries, Glawogger looks at the perils of being a coal miner in the Ukraine, a slaughterhouse worker in Nigeria, a sulfur miner in Indonesia, a ship-breaker in Pakistan, and a steel worker in China. Some of the conditions these men work in will come as a shock to the average office worker, and provides viewers with an important perspective on the harsh treatment meted out to certain factions of the workforce.\n\nAustrian director Michael Glawogger divides his documentary into a number of extended vignettes. In Heroes, college graduates can't find work in the desolate post-Soviet period in the Ukraine. So they descend upon abandoned, frigid coal mines. There they imperil their lives squeezing into crumbling tiny crawl spaces, in order to extract bits of coal to sell and eke out a subsistence. The free lance miners are embittered and demoralized, and Glawogger contrasts them with images from the past of optimistic, radiant Soviet coal miner collectives.\n\nIn the chapter Ghosts, Glawogger moves on to Indonesia, where workers wind their way up and down the surreal, treacherous basin of a volcano under a punishing sun, gathering sulfur in overloaded, creaky bamboo baskets. The plumes of sulfur gas are visually captivating, yet unimaginably disturbing in the unspoken poisonous toll they are simultaneously inflicting on these impoverished workers' lives.\n\nOther episodes include the casual carnage of an unsanitary open air livestock slaughterhouse in Nigeria, with blood and entrails flowing unheeded through the city streets. Then in Pakistan, despairing migrant workers engage in the dangerous labor of dismantling gigantic oil carriers, while praying to Allah that they'll survive the task. The documentary concludes at a vast, defunct German steel mill that has been unbelievably transformed into an amusement park, complete with a light show. Meanwhile, young couples seek out remote corners among the rusty former smelting furnaces, to engage in a little sex.\n\nWhile the experience of Workingman's Death is rich in visual material for contemplation or just plain wonder, there is at the same time a gnawing feeling of voyeuristic objectification of these workers. It's as if the leisure class were sitting back and whimsically beholding their house servants sweating away at domestic tasks.\n\nPlease help seed,\n\nMore related material:    &lt;a href=&quot;\nhttp://thepiratebay.se/user/BhangWalla&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/BhangWalla&lt;/a&gt;","torrent":{"xt":"urn:btih:9d0714763d287a36319ba2dd8ea0ab813b650944","amp;dn":"Workingmans.Death.2005.PAL.DVDR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d0714763d287a36319ba2dd8ea0ab813b650944","infoHashBuffer":{"type":"Buffer","data":[157,7,20,118,61,40,122,54,49,155,162,221,142,160,171,129,59,101,9,68]},"announce":[],"urlList":[]}}