{"title":"The Strategic Nimzo-Indian (Ivan Sokolov)","uid":8792886,"size":16566222,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9d174e57a2065994821c2017fc3abdaa49aba729&amp;dn=+The+Strategic+Nimzo-Indian+%28Ivan+Sokolov%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"OmeGa15","files":-1,"time":1375995935,"description":"The Nimzo-Indian Defence continues to be one of the most important chess openings, an immensely popular choice both at club level as well as with almost all top players. It is a solid but flexible opening which gives rich tactical and positional play with winning chances for both sides.\n\nIn this ground-breaking and well-structured book, one of today's greatest Nimzo-Indian experts, Ivan Sokolov, presents a complete guide to the important 4.e3(Rubinstein) Variation and clearly explains the plans and counterplans for both sides.\n\nThe Rubinstein is the historical main line and the most consistently popular. It requires a through positional understanding and Sokolov, renowned author of Winning Chess Middlegames: An Essential Guide to Pawn Structures, clearly presents the ideas, structures and plans in the various continuations.\n\nBesides in-depth explanations of strategy and concepts The Strategic Nimzo-Indian also contains quite a few new ideas and previously unknown resources for both Black and White. Ivan Sokolov not only provides you with crucial up-to-date information and strategic lessons in the Nimzo-Indian Defence; after studying this book you will have become a better allround chess player as well.","torrent":{"xt":"urn:btih:9d174e57a2065994821c2017fc3abdaa49aba729","amp;dn":"+The+Strategic+Nimzo-Indian+%28Ivan+Sokolov%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d174e57a2065994821c2017fc3abdaa49aba729","infoHashBuffer":{"type":"Buffer","data":[157,23,78,87,162,6,89,148,130,28,32,23,252,58,189,170,73,171,167,41]},"announce":[],"urlList":[]}}