{"title":"Gion no Shimai aka Sisters of the Gion - Kenji Mizoguchi (1936)","uid":4836655,"size":1397051433,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9d547e927e1b582c2a9f80b4b5d43aac58884eb2&amp;dn=Gion+no+Shimai+aka+Sisters+of+the+Gion+-+Kenji+Mizoguchi+%281936%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"lllTgolll","files":4,"time":1239343538,"description":"Sisters of the Gion follows the parallel paths of the independent, unsentimental Omocha (Isuzu Yamada) and her sister, the more tradition-minded Umekichi (Yoko Umemura), both geishas in the working-class district of Gion. Mizoguchi's film is a brilliantly shot, uncompromising look at the forces that keep many women at the bottom rung of the social ladder.\n\n\nConsidered to be one of the best pre-war films by the acclaimed Japanese director Kenji Mizoguchi, Sisters of the Gion is a story of two sisters, both Geisha girls in the Gion section of Kyoto, who have very different attitudes toward men. Umekichi (Yoko Umemura) is traditional and loyal to her patrons while her sister Omocha (Isuzu Yamada) is a pragmatist who uses men to her advantage even if it means deception and lies. Ultimately it seems to make no difference as both girls are trapped in an existence that provides little satisfaction. Running just over an hour, this is a lovely film that presents a fascinating portrait of Japanese life before the war showing streets that look like narrow passageways, elevated tatami rooms used for drinking tea and smoking pipes, and buildings no higher than two stories.\n\nIn the film, Umekichi is devoted to a bankrupt businessman, Shimbei Furusawa (Benkei Shiganoya) who comes to live with them after an argument with his wife. Omocha is unhappy with this arrangement, telling Umekichi she should have no use for a man who doesn't support them. She convinces an antique dealer Jurakuso (Fumio Okura) to give her money to pay off Furusawa so that Jurakuso can become Umekichi's patron, but she ends up pocketing half of the money herself. On hearing that he is in love with her, Omocha persuades Kimura (Taizo Fukami), a textile clerk, to steal the company's materials to enable her sister to wear an acceptable kimono for a party of wealthy patrons.\n\nVÃƒÂ­deo: XviD 720x520 23,976 fps 2458 Kb/s - AR: 1.38 (DVDRip)\nAudio: JaponÃƒÂ©s (VO) AC3 192 Kb/s\nIMDB : http://www.imdb.com/title/tt0027672/\nSoft subs:Eng Esp Pt-br\n\n*********************************** FREAKYFLICKS **********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'","torrent":{"xt":"urn:btih:9d547e927e1b582c2a9f80b4b5d43aac58884eb2","amp;dn":"Gion+no+Shimai+aka+Sisters+of+the+Gion+-+Kenji+Mizoguchi+%281936%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d547e927e1b582c2a9f80b4b5d43aac58884eb2","infoHashBuffer":{"type":"Buffer","data":[157,84,126,146,126,27,88,44,42,159,128,180,181,212,58,172,88,136,78,178]},"announce":[],"urlList":[]}}