{"title":"Serpent in the Staglands (GOG)","uid":11973667,"size":390696313,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9e8055805e19ab3373b46471909cf7a27ed507af&amp;dn=Serpent+in+the+Staglands+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"-Virtus-","files":3,"time":1432944034,"description":"== About the game:\nA campaign within the world of Vol, a fully realized setting inspired by the late bronze age in a Transylvanian landscape, with unique politics, races and gods steeped in history. Featuring a chosen party of five, you role-play Necholai, a minor god of a celestial body who descends to the Staglands for a moonlit festival only to find the way home blocked and immortality slipping away. Seeking answers and aid, you take on a mortal body and the guise of a traveling Spicer. This isn't a story of good and evil, saving the world or being a hero, it's about intrigue and your adventure of survival in a harsh land.\nWhile the game rolls the dice for you, you'll traverse the Staglands on a path narrated by your own wits and choices. A tabletop inspired experience with adventure-game like navigation, Serpent in the Staglands offers no auto-populating map markers, checklist quest grinding and rigid story exposition.\n\nExamine hand-drawn maps in your inventory for secret locations, diagrams of foreign languages, note encounters of interest in your in-game journal and figure out on your own how best to smuggle Spices. Roleplay, investigate, and pray to the RNG god when combat begins. \n\n\n== Features:\nParty-based, real time with pause combat focused on macro tactical decisions and creative party skill combinations\nClassless role-playing system: create builds via any combination of magic, combat and aptitude skills available to create or find up to 5 unique characters\nNon-linear storyline to uncover and explore through dialogue, clue and puzzles\n\n\n== Version:\nGame v2 with official GOG patch to v3 or GOG setup 2.0.0.1 from May 28, 2015 \nand patch to v3 from May 29\n\n\n== Version changes:\nPatch version 3 :\n*Using the Aptitude-quickbook cursor and clicking away/on the ground, character could no longer move\n*Fixed starting cinematic issues\n*monsters commanded with Nobility could turn invisible if too far away\n*some various other small issues.\n\n\n== Instructions:\n1. It's a GOG version, just launch setup, click options to chose location and accept EULA, install \n2. Extract patch.zip, open &quot;Patch_Instructions.pdf&quot; and follow official Instructions \nPlay - Enjoy - Seed - give me what I need\nSpeed! Yeah!\n\n\n== System Requirements:\nMinimum:\nProcessor: 2.4 GHz Pentium IV or equivalent AMD Athlon processor \nVideo card: 512 MB+\nSystem memory:: 3 GB RAM \nOperating system: Windows XP / Vista / 7 / 8\nHard disk drive: 3 GB available space\n\n\nLinks:\nVisit website! http://serpentinthestaglands.com/  \n\n\n              If you enjoyed the game then share with others by seeding!\n                       Support game development and buy the game!\nGame made by \nWhalenought Studios","torrent":{"xt":"urn:btih:9e8055805e19ab3373b46471909cf7a27ed507af","amp;dn":"Serpent+in+the+Staglands+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e8055805e19ab3373b46471909cf7a27ed507af","infoHashBuffer":{"type":"Buffer","data":[158,128,85,128,94,25,171,51,115,180,100,113,144,156,247,162,126,213,7,175]},"announce":[],"urlList":[]}}