{"title":"Clash Of The Titans","uid":4669475,"size":733474816,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9e831b0e44edf8c8306bf464fa629745098480cc&amp;dn=Clash+Of+The+Titans&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eyesofflys","files":1,"time":1232684060,"description":"                                       (PLOT)\nKing Acrisius of Argos expresses anger towards Zeus for impregnating his daughter, Princess Danae. He then casts Danae and her infant son Perseus out to sea in a wooden chest. Unknown to everyone, a white bird who witnessed everything was really Poseidon, who informs Zeus of Acrisius' unfaithfulness. Zeus orders Poseidon to release the Kraken to destroy Argos by flooding the entire kingdom. While Acrisius and his kingdom are left completely devastated, Danae and Perseus are safely brought to the island of Seriphos where they live a happy life and Perseus grows up to manhood.\n\nCalibos - the spoiled son of Thetis, the goddess of the Sea - was a handsome young man destined to marry Princess Andromeda, the daughter of Queen Cassiopeia and heir to the rich city of Joppa and eventually all of Phoenicia. Zeus entrusted Calibos to care for the Wells of the Moon; Calibos instead hunted, trapped and killed everything that lived there, including Zeus' sacred herd of flying horses, leaving only the stallion Pegasus alive. As punishment, Zeus transforms Calibos into a monster and he is shunned and forced to live as an outcast in the swamps and marshes. Thetis, furious at her son's fate, vows that if Calibos cannot marry Andromeda, then no other man will either.\n\nEqually infuriated by Zeus' total devotion for his own son, Thetis uses her Godly powers to remove Perseus from his island home on Seriphos to Joppa. Befriended by the scholar and playwright Ammon, Perseus learns of Andromeda and her plight: she cannot marry unless her suitor successfully answers a riddle, which is given to her by Calibos. Any suitor that fails to answer the riddle correctly is burned at the stake. Using a number of gifts given to him by the gods, including the winged horse Pegasus and a helmet given to him by Athena that renders its wearer invisible, he discovers the answer to the riddle. Calibos nearly captures him, but Perseus cuts off his hand with a sword (another divine gift, this one from the goddess Aphrodite).\n\nAt the next ceremony for a new suitor, Perseus enters, answers the riddle correctly and presents Calibos' severed hand, winning Andromeda's hand in marriage. At the Temple to Thetis, Calibos prays to his mother Thetis to take vengeance on Perseus for cutting off his hand. Thetis tells Calibos that she cannot do that because Perseus is protected by Zeus, but she can take vengeance on Joppa. At the wedding, held in the temple of Thetis, Queen Cassiopeia compares Andromeda's beauty to that of Thetis herself, which angers the goddess. The statue of Thetis collapses and its head comes to life demanding Andromeda as a sacrifice to a sea monster (the Kraken, a modern addition to the myth; the Greek version had Cetus as the sea monster) in 30 days, and still a virgin; otherwise, the Kraken will destroy Joppa.\n\n \nThe gorgon Medusa from the filmPerseus seeks a way to defeat the Kraken, the last of the Titans, who were the race of monsters that pre-dated the gods. When Zeus commands Athena to give Perseus her owl, she instead orders Hephaestus to build the mechanical owl Bubo as an aid for Perseus. Bubo leads Perseus to the Stygian Witches, three blind women who disclose that the only hope of survival in combat against the Kraken is by using the head of another monster, Medusa the Gorgon. Medusa was once a beautiful woman, but because she dared to make love with Poseidon in Aphrodite's temple, she was transformed by Aphrodite into a horrible monster. Meeting Medusa's gaze will turn any living creature to stone, including the Kraken. She makes her home on the Isle of the Dead, which lies across the River Styx, at the very edge of the Underworld. Perseus travels there and kills her, removing her head, though he must contend with Calibos (who has replaced his lost hand with a trident-like blade) along the way - whom he finally kills with Aphrodite's sword.\n\nJust as Andromeda is about to be sacrificed to the Kraken, Perseus appears astride Pegasus and turns the Last Titan to stone with Medusa's head, which is then cast into the ocean where it can do no more damage. Perseus frees Andromeda and they live happily together. The hero and heroine become constellations at the decree of Zeus, who does the same for Pegasus and Cassiopeia.\n\n(Cast)\nHarry Hamlin - Perseus \nMaggie Smith - Thetis \nClaire Bloom - Hera \nUrsula Andress - Aphrodite \nJudi Bowker - Andromeda \nBurgess Meredith - Ammon \nSian Phillips - Cassiopeia \nLaurence Olivier - Zeus \nJack Gwillim - Poseidon \nNeil McCarthy - Calibos \n\nDirected by Desmond Davis \nProduced by Ray Harryhausen\nCharles H. Schneer \nWritten by Beverley Cross \nStarring Laurence Olivier\nHarry Hamlin\nMaggie Smith\nUrsula Andress \nMusic by Laurence Rosenthal \nCinematography Ted Moore \nEditing by Timothy Gee \nDistributed by MGM\nWarner Bros. (DVD) \nRelease date(s) June 12, 1981 \nRunning time 118 min \nCountry United States \nLanguage English \nBudget $15 million \n\nWidth 720\nHeight 416\nDuration 1:57:55\nFrame Rate 23 FPS\nCompression Xvid\n\nEnjoy.","torrent":{"xt":"urn:btih:9e831b0e44edf8c8306bf464fa629745098480cc","amp;dn":"Clash+Of+The+Titans","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e831b0e44edf8c8306bf464fa629745098480cc","infoHashBuffer":{"type":"Buffer","data":[158,131,27,14,68,237,248,200,48,107,244,100,250,98,151,69,9,132,128,204]},"announce":[],"urlList":[]}}