{"title":"Dark Shadows comics","uid":6545193,"size":1089466536,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:9eebff65643052ac215788a99e8a39c86298d289&amp;dn=Dark+Shadows+comics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"JoeEDangerously","files":1,"time":1310825929,"description":"All 35 issues of the original Dark Shadows Gold Key comic series, the complete run of the comic strip, (in B&amp;W) and The Gold Key Digest. (&quot;The Interrupted Voyage&quot;)  Technical difficulties forced me to delete the former torrent and start again with this one. It's the same file with the same content, but now archived for easier UL/DL. Sorry about that, but it's just one archive, so you'll probably save a little time overall. I must reiterate: please seed. I am the only seed 75%-80% of the time and traffic is very high. I put in A LOT of work to get this done. I had to cobble together issues from about half a dozen sources. I DL'ed all the parts and every strip individually, took parts of other torrents, and got some missing and corrupted pages from very generous people who allowed me to use their personal scans and material on their sites to complete this project. It took about 3 weeks of intensive searching, DL'ing, repairing files, organizing them, searching out the unusable portions, etc. Look, I'm not fishing for thanks. I'm just trying to get across how much work was put into this because I could not get the files because nobody would seed them. We all like Dark Shadows. You wouldn't be here if you didn't. Let's all do our part to make sure this material gets into the fans' hands. We all love DS, so let's come together and just sacrifice a little bandwidth for a little while. I just want everyone who is a DS fan to be able to read this rare material.    Enjoy and please seed.  Dangerously yours,  -Joe E Dangerously","torrent":{"xt":"urn:btih:9eebff65643052ac215788a99e8a39c86298d289","amp;dn":"Dark+Shadows+comics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9eebff65643052ac215788a99e8a39c86298d289","infoHashBuffer":{"type":"Buffer","data":[158,235,255,101,100,48,82,172,33,87,136,169,158,138,57,200,98,152,210,137]},"announce":[],"urlList":[]}}