{"title":"Developmental Neurobiology {BBS}","uid":7501593,"size":16851874,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9f5bcdf073b97d71afe544717eac35905d14c1e7&amp;dn=Developmental+Neurobiology+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1344038724,"description":"Developmental Neuroscience is one of the six core disciplines in Neuroscience, and yet no single volume, non-textbook reference exists on the market that provides researchers with more in-depth, high-level information on developmental neurobiology.  Currently, anyone interested in the field at a higher level must sift through review articles published frequently and the more specific handbooks that focus on aspects of development rather than the field as a whole.\n\nThis reference is the first of its kind to fill this need. It pulls together the relevant articles on the topic from the 10-volume Encyclopedia of Neuroscience (Academic Press, 2008) and serves as an affordable and immediate resource for scientists, postdocs, graduate students with an interest beyond the basic textbook materials on the subject.\n\n    * Impact - The first and only comprehensive affordable single volume reference for Developmental Neuroscience, one of the core disciplines in both, Neuroscience and Developmental Biology\n\n    * Scope - chapters cover topics ranging from cell fate determination, pathfinding, synapse generation, neural stem cells, to neurodegeneration and regeneration, carefully selected from the Encyclopedia of Neuroscience by one of the great developmental neuroscientists, Greg Lemke, The Salk Institute for Biological Studies, San Diego.\n\n    * Expertise - The best researchers in the field provide their conclusions in the context of the latest experimental results.\n\n\n\n# Hardcover: 800 pages\n# Publisher: Academic Press; 1 edition (November 18, 2009)\n# Language: English\n# ISBN-10: 0123750814\n# ISBN-13: 978-0123750815","torrent":{"xt":"urn:btih:9f5bcdf073b97d71afe544717eac35905d14c1e7","amp;dn":"Developmental+Neurobiology+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f5bcdf073b97d71afe544717eac35905d14c1e7","infoHashBuffer":{"type":"Buffer","data":[159,91,205,240,115,185,125,113,175,229,68,113,126,172,53,144,93,20,193,231]},"announce":[],"urlList":[]}}