{"title":"William Luther Pierce - The ADL of B'nai B'rith","uid":4735262,"size":3063483,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:9f81b24c7fd32da6e86f7fc75b79b203baa1aa0a&amp;dn=William+Luther+Pierce+-+The+ADL+of+B%5C%27nai+B%5C%27rith&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"nIx76","files":-1,"time":1235246719,"description":"American Dissident Voices - William Luther Pierce - The Anti-Defamation League (ADL) of B'nai B'rith\n\nType: Speech\nBroadcast Date: 10-10-1998\n\nIn late September, the ADL released a report stating the National Alliance is the &quot;most dangerous organized hate group in America.&quot; But it is the ADL which is the true hate group. It earns its living: selling hate. It makes its money by persuading Jews and wannabe Jews that they are in great danger -- but if everyone will just send them a nice, fat check today, the ADL will protect them. The ADL deliberately makes the National Alliance sound scary. Their press releases tend to be deceptive and are written in a way calculated to lead to misinterpretation. Then, if the newspapers exaggerate things even more, why so much the better.\n\nOne of the ADL's fondest projects is &quot;combating hate speech.&quot; &quot;Hate speech,&quot; of course, is whatever they find offensive or dangerous to their interests. The ADL is especially concerned about the propagation of what they consider dangerous ideas over the Internet and has been working with software developers to develop censorship programs which can be installed on any computer, so that computer users cannot find any Politically Incorrect material on the Internet. But lobbying to stamp out the Bill of Rights isn't the ADL's only activity. They're also the largest and most effective private espionage organization in America -- in which guise they have committed more criminal acts than the National Alliance has been &quot;linked&quot; to. \n\nThe National Alliance | http://www.natvan.com/","torrent":{"xt":"urn:btih:9f81b24c7fd32da6e86f7fc75b79b203baa1aa0a","amp;dn":"William+Luther+Pierce+-+The+ADL+of+B%5C%27nai+B%5C%27rith","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f81b24c7fd32da6e86f7fc75b79b203baa1aa0a","infoHashBuffer":{"type":"Buffer","data":[159,129,178,76,127,211,45,166,232,111,127,199,91,121,178,3,186,161,170,10]},"announce":[],"urlList":[]}}