{"title":"Noel Coward - Dirk Bogarde - Ruth Gordon - Blithe Spirit (1966)","uid":6518585,"size":3145553920,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a0316ebd80e8934091f51bc91f96142539cb33bd&amp;dn=Noel+Coward+-+Dirk+Bogarde+-+Ruth+Gordon+-+Blithe+Spirit+%281966%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"oddeven","files":-1,"time":1309917793,"description":"An American TV adaptation (For Hallmark Hall of Fame) of Coward's 1941 play, which had already been made 4 times over, one directed by Coward himself, and three of those for the little box.  Perhaps the best known version is David Lean's interpretation for the big screen, from 1945.\n\nThis version is listed twice on IMdB, the other listing is here: http://www.imdb.com/title/tt0292454/\n\nRuth Gordon is decidedly in Maude mode, particularly in her breathing exercises. She's good for the main giggles.\n\nDirk is the befuddled husband of two, a wife and a dead wife (Robyn Hitchcock anyone?). \n\nWhodathought mediums came with any kind of guarantee?  Ah, the good old days.\n\nThis is from a &quot;Kinephoto&quot; transfer (NBC's standard archiving process) and is in black and white. From what I understand color didn't get archived this way all that often, though I remember seeing plenty of Beverly Hillbillies in color, and they started that in 1965. Maybe there are color transfers somewhere out there, but I doubt you'll see it any time soon.\n\nIf it weren't for the included Hallmark promotional ads, I wouldn't have thought it was originally in color.  Not only do they refer to NBC as the all color channel, but the descriptions of their products include color references that would prompt me to fire the adman, if only because the great majority of households did not own color sets back in 1966.  Maybe it was another way of prompting them to keep up with the imaginary Joneses.\n\nNo menus, just the show and its sponsor, Hallmark, shucking their expensive goods. Some of those cards cost more than a good (paperback) book!","torrent":{"xt":"urn:btih:a0316ebd80e8934091f51bc91f96142539cb33bd","amp;dn":"Noel+Coward+-+Dirk+Bogarde+-+Ruth+Gordon+-+Blithe+Spirit+%281966%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0316ebd80e8934091f51bc91f96142539cb33bd","infoHashBuffer":{"type":"Buffer","data":[160,49,110,189,128,232,147,64,145,245,27,201,31,150,20,37,57,203,51,189]},"announce":[],"urlList":[]}}