{"title":"Russian_History_through_Distorted_Mirrors_-_Nicolai_Levashov","uid":5838136,"size":5735992,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a05be8ba0dfce2fff7f86e0e90c49f549197533d&amp;dn=Russian_History_through_Distorted_Mirrors_-_Nicolai_Levashov&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"lutich","files":-1,"time":1284810991,"description":"A unique Knowledge that until now was not available for those who wish, has now reached THE PIRATE BAY! \n\n\nAuthor: Nicolai Levashov \nTitle: \tRussian History Viewed through Distorted Mirrors Volume 1 - From the star Ruses to the desecrated Russians \nYear:\t2007\nFormat:\tPDF\nPages:\t299 with 42 high-quality author's illustrations.\n\nAnnotation:\n\tThe author expounds his views about the past of Russia and brings up the question of the intentional distortion of past events. He is the first to uncover the reasons for this distortion, who is behind it and why; and how it became possible. The author suggests looking at the events of the distant and not so distant past from quite another point of view, more precisely, from several points of\nview simultaneously. The author analyses a number of social phenomena as a single whole and proves that almost any event of the past of any country cannot be interpreted in two ways, or in the way advantageous for those in power, but has an absolutely definite explanation which does not depend on the desire or ambitions of the person who sets his mind to explaining it, but on objective processes which are going on in human society. Using this approach he succeeds in &quot;clearing&quot; the turbid waters of the &quot;river&quot; of time of Midgard-earth's (our planet) civilization and, in particular, the past of Russia; although this Slavonic-Aryan empire had a lot of different names during its very long existence...\n\nPreface:\n&quot;As any Russian I always has been interested in the history of my country. In my childhood I red a lot of historical novels, books on history of both Russia and other countries of the world. As I went on gaining and analyzing historical information available, my heart and mind began to fill with bewilderment and indignation. Every nation on Earth, independently their real role in the destiny of the world, wrote their own Great History using for this purpose both real events, folk legends and some times purely fictitious events. There would be nothing unusual in it but except for just one snag ... everything applied to the history of Russia was filled with uncovered hatred of those who wrote its history. According to their opinion the Slavs lived in earthen pits up to the 9th century and were such primitive that even did not have their own state system and had to invite Varangians to govern. Also they lived in horrified ignorance until in the 10th century two saints, Cyril and Mefodiy, created the Slavonic written language on the basis of the Grek language shedding thus the &quot;light of knowledge&quot; on the obtuse Slavs. Also Mongols had kept Russian people in slavery for three hundred years and only when Peter the Great cut through a &quot;window&quot; to Europe and transformed Russia in accordance with European standards, Russia became the Great Empire, etc. Any well-educated person understands perfectly that history is written according to the orders of those in power and is rewritten following their requirements and desire. Therefore, it would be appropriate to ask who were these &quot;historians&quot; and why were they reluctant to create for Russian rulers something similar to that, what had been created for Jewish, Chinese, Greek, Roman and other nations and empires?..&quot; \n\n(c) Nicolai Levashov, 2007. &lt;a href=&quot;\nhttp://www.levashov.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.levashov.org/&lt;/a&gt;\n\n\nContents:\n\nPreface \nChapter 1. The Origin of Man on Earth \n1.1. The place of man in Midgard-earth's ecological system\n1.2. The alien origin of modern man\n1.3. The origin of modern man in the world's religions and myths \n1.4. The nature of Light and Dark Forces. Dark Forces are social parasites\n1.5. The nature of para-psychological abilities in different races and their distinction in men and\nwomen \n1.6. The war between Light and Dark Forces reflected in the Old Testament and the Slavonic-Aryan Vedas\n1.7. The origin of the grey sub-race\n1.8. The Slavonic-Aryan Vedas: how man appeared on Midgard-earth\n1.9. Perun describes the social parasites' actions during the Wars between Dark and Light Forces \n1.10. The Slavonic-Aryan Vedas about the Star Gates. Their principle of operation\n1.11. Dark Forces change their strategy and tactics. The nature of Days and Nights of Svarog \n1.12. The reasons for the catastrophe on Midgard-earth 13 016 years ago (2007)\n1.13. Vitmanas and Vitmaras: our ancestors space ships \n1.14. The Slavonic-Aryan Vedas: Light hierarchs visit Midgard-earth. Man's evolutional stages \n1.15. The laws of mans development as a reasoning creature \n1.16. The Dark Forces special interest in Midgard-earth. The Source of Life\n1.17. The Slavonic-Aryan Vedas: the reasons for the Second Planetary Catastrophe on Midgardearth\n1.18. The great cold snap and its consequences for Midgard-earth\n1.19. The Slavonic-Aryan Vedas: the origin of the Black, Yellow and Red races. The White Race\nbegan to mix with them\n1.20. The reason for Dark Forces' particular interest in Midgard-earth\n1.21. The reason for the races' compatibility on Midgard-earth\n1.22. The Night of Svarog as the last chance for Dark Forces to take control over Midgard-earth.107\nChapter 2. Geopsychology and the Psychology of Economics\n2.1. Midgard-earth's ecological system and qualitative structure\n2.2. The distribution of human races in climatic zones\n2.3. The Arctic and Sub-Arctic climatic Zones and their conditions for man's development\n2.4. The Equatorial and Subequatorial climatic Zones and their conditions for man's development\n2.5. The passive type of adaptation to the living conditions\n2.6. The level of modern man's self-regulation and his alien origin\n2.7. Man's active type of adaptation to the living conditions \n2.8. The white race's active type of adaptation to the Temperate Zone\n2.9. The active and passive types of adaptation and their influence on the speed of development of different races \n2.10. The passive information growth as the necessary condition for man's development as a\nreasoning creature\n2.11. The forming of a social organism in temperate climatic conditions\n2.12. The nature of Days and Nights of Svarog \n2.13. The Source of Life as a counterbalance for the Nights of Svarog influence\n2.14. The forming of a social organism \n2.15. The forming of economic niches and professional psycho-types in the social organism\n2.16. Economic niches and their place in the economy of a society\n2.17. The economic niches of the social organism\n2.18. The economic system of the primitively-communal society\n2.19. Outcasts of the white race create the first parasitic systems\n2.20. The economic conditions for social parasites to capture Midgard-earth\n2.21. Social parasites and the Moon Cult\n2.22. Dark Forces create false image for their intermediaries\n2.23. The Israelites start creating the world-wide parasitic system\n2.24. The Israelites create a parasitic state: the Khazar Khaganate\n2.25. The Israelites began to create a supranational parasitic system\n2.26. The Israelites had completed the accrual of funds phase by the beginning of capitalism\n2.27. Dark Forces enslave the White Race in the latter half of the Night of Svarog\n2.28. The &quot;Great&quot; Judaic Revolution of 1917 in the Russian Empire\n2.29. The split between the white and black Israelites after the &quot;Great&quot; Judaic Revolution of 1917\n2.30. The real reasons for World War II and the persecution of the Israelite- communists\n2.31. The American Judaic financiers create fascist Germany\nList of illustrations \nEpilogue\nThe author's other books\nBooks in the Process of Writing\n","torrent":{"xt":"urn:btih:a05be8ba0dfce2fff7f86e0e90c49f549197533d","amp;dn":"Russian_History_through_Distorted_Mirrors_-_Nicolai_Levashov","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a05be8ba0dfce2fff7f86e0e90c49f549197533d","infoHashBuffer":{"type":"Buffer","data":[160,91,232,186,13,252,226,255,247,248,110,14,144,196,159,84,145,151,83,61]},"announce":[],"urlList":[]}}