{"title":"Pappo - Buscando un Amor (Argentinian BluesRock) 2003 TQMP","uid":4515615,"size":455541344,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a11d91516d405b9b06a4c02d1a02e50af5bd2c18&amp;dn=Pappo+-+Buscando+un+Amor+%28Argentinian+BluesRock%29+2003+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Breezin","files":23,"time":1226957919,"description":"Quotes from amazon ;))\n\n&quot;La joya final, September 25, 2007 \nBy  Homerock &quot;Homerock&quot; (Bilbao, Basque Country)\nUltima obra de Pappo , que falleciÃƒÂ³ en accidente de motocicleta poco despuÃƒÂ©s de editar este disco. Un mago de la guitarra con una banda de lujo . Temas como &quot;Banquero blues&quot; y &quot;Rock and roll y fiebre&quot; ya son suficientes para comprar el disco . Si ademÃƒÂ¡s, el resto de los temas son todos excelentes , creo que estamos ante una joya discogrÃƒÂ¡fica . LÃƒÂ¡stima que haya sido el broche a una carrera que le ha llevado a la categorÃƒÂ­a de mito del rock . I-M-P-R-E-S-C-I-N-D-I-B-L-E para cualquier amante del rock.&quot;\n \n&quot;Un muy buen disco, April 23, 2004 \nBy  Santiago (Argentina)\nEste es un muy buen disco, mas blusero y alejandose un poco del heavy, pero igual muy bueno. Aguante pappo!&quot;  \n\n\nInfo from wikipedia&quot;\n\n&quot;Pappo is the pseudonym of Argentine blues and metal/rock musician Norberto Napolitano (Buenos Aires, 10 March 1950 - LujÃƒÂ¡n, Buenos Aires province, 24 February 2005). Pappo started playing the guitar at the age of ten, and became active in Argentine rock since its beginnings; Pappo was a force in its transition from English to Spanish as guitarist of Los Gatos, the first rock band to enter the mainstream charts in Argentina. He also played in the first incarnation of cult band Los Abuelos de la Nada and in the quasi-psychedelic La Pesada del Rock and Roll. With his band, Pappo&amp;#039;s Blues, he recorded and toured extensively. He became an underground working-class hero, but received no radio airplay. In the mid-1970s, Pappo spent some time in Brazil and also in England, playing alongside Peter Green (formerly of Fleetwood Mac), Lemmy (who later achieved fame with MotÃƒÂ¶rhead), and other rock and blues greats. In 1978 Pappo, this time with Alejandro Medina playing bass and DarÃƒÂ­o Fernandez with the drums, recorded Pappo&amp;#039;s Blues Volumen 7. On November 14th 1980 the band officially dissolved, but &quot;Pappo&amp;#039;s band&quot; kept playing occasionally. The band recorded Hombre Suburbano in 1994; Caso Cerrado in 1995 and Auto Rojo in 1998.\n\nBack in Argentina, Pappo formed Riff, a heavy metal band. During the 1982 Falklands war (Spanish: Guerra de las Malvinas/Guerra del AtlÃƒÂ¡ntico Sur), Argentine music was given a large share of radio play, and Riff became popular with rockers. With the advent of popular blues bands in the 1980s, such as Memphis La Blusera, Pappo was recognized as the godfather of Argentine blues. As such, he enjoyed the appreciation of B. B. King who admitted cherishing many of Pappo&amp;#039;s records, and with whom he played at the Madison Square Garden in 1993 and 1994. BB King said in one occasÃƒÂ­on that he had travelled by 67 countries and Pappo was the only great blues player he found, and also that he was one of the best guitar players, not onluy in Argentina but in the whole world.\n\nIn the late 1980s Pappo spent time in the United States and formed a new version of Riff, which became Pappo y Widowmakers (Pappo and the Widowmakers) in 1989. This version of the band was based in the Los Angeles / Hollywood California area, and the bandmembers were as follows: Dave Hatlee - Bass, Rick Ness - Second Guitar, Saint Bongosto - Drums&quot;\n\n\nBreezin says:\nHe&amp;#039;s not a singer you will fall in love with, but he sure can play the axe!!!  Sorry, frontcover only in this one.\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project me and my fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:  &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980&amp;#039;s cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nYou can find all TQMP uploads at: www.thepiratebay.se  (Simply use the TQMP searchtag :)\n\nContact: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;7b19091e1e0112153b17120d1e551517&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nGreetings to ya&amp;#039;all from the Breezin Dutchman! d:) ","torrent":{"xt":"urn:btih:a11d91516d405b9b06a4c02d1a02e50af5bd2c18","amp;dn":"Pappo+-+Buscando+un+Amor+%28Argentinian+BluesRock%29+2003+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a11d91516d405b9b06a4c02d1a02e50af5bd2c18","infoHashBuffer":{"type":"Buffer","data":[161,29,145,81,109,64,91,155,6,164,192,45,26,2,229,10,245,189,44,24]},"announce":[],"urlList":[]}}