{"title":"MicroXP v0.8 - eXPerience","uid":4234528,"size":104808448,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a1cc3404ab0e0994819f518e98e3f32cece307d5&amp;dn=MicroXP+v0.8+-+eXPerience&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eXPer1ence","files":1,"time":1213230079,"description":" _____________________________________________________________________\n\n MicroXP v0.8\n\n by eXPerience\n\n _____________________________________________________________________\n\n Thank you for trying this special &quot;MicroXP&quot; edition of Windows XP.\n\n With a total installation size of just 200Mb and a CD size of just\n 99.9Mb, this has to be one of the smallest Windows XP installations\n out there.\n\n Whats more - you can use 99% of the programs you always use and\n up to now there is not one single report of any game not working\n in MicroXP.\n\n This installation takes only 4 Minutes 20 seconds.\n\n This install includes default XP drivers for Ethernet/Sound/SCSI/RAID\n\n It has all languages kept, except Chinese/Japanese/Korean.\n\n It has all keyboard layout choices kept.\n\n It also has Service Pack 3 final slipstreamed into it.\n\n _____________________________________________________________________\n\n [Statistics]\n\n Installation time, in VMware, from\n ISO file, from end of formatting .......... 4 Mins 20 Secs\n\n RAM Usage On First Installation ........... 32.2 Mb\n Handles ................................... 1871\n Threads ................................... 131\n Processes ................................. 13\n\n Entire Install Size ....................... 200Mb\n\n &quot;Documents and settings&quot; folder size ...... 1.59 Mb\n &quot;Program Files&quot; folder size ............... 2.79 Mb\n &quot;WINDOWS&quot; folder size ..................... 194 Mb\n\n Files In System32 ......................... 790\n\n ISO File Size ............................. 99.9 Mb\n\n _____________________________________________________________________\n\n [Services Remaining In Windows]\n\n Cryptographic Services\n DCOM Server Process Launcher\n DHCP Client\n Event Log\n Logical Disk Manager\n Logical Disk Manager Administrative Service\n Network Connections\n Plug and Play\n Print Spooler\n Remote Access Auto Connection Manager\n Remote Access Connection Manager\n Remote Procedure Call\n TCP/IP NetBIOS Helper\n Telephony\n Windows Audio\n Windows Installer\n Wireless Zero Configuration\n\n All these services are enabled except &quot;Print Spooler&quot;\n which you will need to enable in &quot;services.msc&quot;.\n\n To use the functionality you need, for example: a printer,\n just click the green square icon near the start button.\n\n There you can double click the service you need to use and even a\n novice user can now read the service descriptions and decide what\n to enable and what to keep disabled.\n\n For example if you have a Dial-Up connection (for example: ADSL\n Broadband) then it says &quot;Dial-Up Connection&quot; in the services as\n opposed to the long and overly technical descriptions put in by\n Microsoft by default.\n\n The services window can be set so you can see all service names\n and all columns in the services window are fully visible. Just\n click &quot;Standard&quot; at the bottom and double click all the columns\n at the top where the top row joins the columns. When you install\n some programs, they might put a new service in and add their own\n long and overly technical descriptions, nevermind, its nice whilst\n it lasts.\n\n _____________________________________________________________________\n\n [eXPerience Desktop Folder Contents]\n\n Desktop Icon Layout (Lets you save your desktop icon layout)\n Driver Install Tool (Easily install all your drivers, see ReadMe)\n Keyboard Settings (Quick access to Regional and Language options)\n Registry Backup (Make a complete backup of the registry in one click)\n Services Config (Files to enable and disable functionality)\n Web Browser (Browzar, to download a full browser of YOUR choice)\n Windows Media Player 11 (This is just a readme file about WMP11)\n\n _____________________________________________________________________\n\n [WHAT YOU CANNOT DO]\n\n This is a greatly reduced installation of Windows XP Professional SP3\n\n Please read these notes BEFORE using this edition of Windows:\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- STANDALONE SYSTEM ONLY\n\n No local networking is possible. The &quot;Network Connections&quot; service\n has been kept in this edition of Windows to stop errors when\n installing Ethernet card or modem drivers. The &quot;Network Connections&quot;\n service is not there to support LAN networking. You can of course\n just try to plug another computer into your MicroXP computer, but\n networking in this way is not guaranteed to work, because the\n related services for this are removed (Computer Browser and\n Workstation).\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- SINGLE USER ONLY\n\n You cannot add any additional users. Do not try to add more users,\n otherwise your main account that is used by default (Administrator)\n will become the new account and after logging in, you will not have\n any desktop theme (not even Classic) and the whole account will be\n ruined. You&amp;#039;ll probably have to install Windows again because if\n you make a new account it replaces &quot;Administrator&quot; and tries to\n log you in with &quot;Default User&quot; - the problem with this is - there\n is no &quot;Default User&quot; anymore.\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- NO WEBCAMS, SCANNERS OR DIGITAL CAMERAS\n\n You cannot use these devices in this version of Windows, because the\n &quot;Windows Image Acquisition&quot; service is removed.\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- NO NATIVE SUPPORT FOR FTP SITES\n\n There is no &quot;built in&quot; support for downloading from FTP sites,\n try using Filezilla or WS_FTP if you need to do that. Even just\n Opera or Firefox can probably do it. This functionality is gone\n because the &quot;Application Layer Gateway&quot; service is gone, along\n with ALG.EXE that normally runs in Task Manager, taking up about\n 6Mb RAM for what amounts to no reason.\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- NO VISITING WINDOWS UPDATE\n\n You cannot visit Windows Update with this version of Windows\n because Internet Explorer is removed. You can manually download\n updates from Microsoft and you can also use the alternative\n &quot;Windiz&quot; Update website through Opera or Firefox. Because so\n much has been removed from this edition of Windows, you are not\n likely to be any more &quot;safe&quot; installing updates for Windows.\n NOTE: Because this edition of Windows uses a patched\n &quot;winlogon.exe&quot; in order to remove the &quot;oembios.bin&quot; file,\n you really should not update Windows anyway, in case\n &quot;winlogon.exe&quot; gets replaced by an update. There are more\n details about this in the eXPerience folder on the desktop\n once MicroXP is installed.\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- NO FAST USER SWITCHING\n\n Apart from you only being able to have the one account anyway\n (Administrator) the ability to do Fast User Switching is also\n removed.\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- NO PASSWORD STORAGE/AUTOCOMPLETE\n\n Windows will not save stored passwords, however, this only really\n applied to Internet Explorer and Outlook Express, which are removed.\n You will be fine using Firefox or Opera web browsers and Thunderbird\n email client for emails. Those are self contained programs and take\n care of storing your passwords by themselves.\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- NO CD-ROM AUTOPLAY\n\n When you insert a CD that would bring up a screen to install the\n program contained on the CD, this does not happen in this version\n of Windows, you will have to explore the CD manually and run\n whatever file it is that runs the program&amp;#039;s setup, usually\n &quot;setup.exe&quot; on the root of the CD. If the CD has a file called\n &quot;AUTORUN.INF&quot; then open that file and look at which .exe file\n is listed in &quot;AUTORUN.INF&quot;\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- NO SMART CARD DETECTION\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- NO SCHEDULED TASKS\n\n You cannot set programs, like AntiVirus or Hard Disk Defrag programs\n to run in the future IF they need the Scheduled Tasks service in\n Windows. If you are going to run those types of programs you will\n have to manually scan or defrag whenever it is convenient. Despite\n this, one program that will schedule its operations is Perfectdisk\n defrag, you do not need Task Scheduler for this program to run a\n scheduled defrag.\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- NO REMOTE DESKTOP\n\n There is no Remote Desktop in this version of Windows\n because the &quot;Terminal Services&quot; service is removed.\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- NO THEMES\n\n You cannot have the Luna (Blue/Olive/Silver) desktop theme in this\n version of Windows, the only theme you can choose is &quot;Windows\n Classic&quot; which it is already set to by default. You can however\n install &quot;Windowblinds&quot; if you want to and it will work fine,\n Windowblinds does not rely on the Themes service. You could even\n make MicroXP look like Vista with the &quot;Ironjer&quot; AeroGlass The\n Remix V4. Use v4 not v5 of that if you use it.\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- NO &quot;UNINTERRUPTIBLE POWER SUPPLY&quot; SERVICE\n\n I always thought &quot;UPS Service&quot; delivered parcels but apparently not,\n if you have this type of device then it will not work on this version\n of Windows. A UPS is only used for emergencies like if you have\n a power cut - thats if you even have such a device.\n\n#########################################\n\nNFO IS CONTINUED BELOW IN THE FIRST REPLY\n\n#########################################\n","torrent":{"xt":"urn:btih:a1cc3404ab0e0994819f518e98e3f32cece307d5","amp;dn":"MicroXP+v0.8+-+eXPerience","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1cc3404ab0e0994819f518e98e3f32cece307d5","infoHashBuffer":{"type":"Buffer","data":[161,204,52,4,171,14,9,148,129,159,81,142,152,227,243,44,236,227,7,213]},"announce":[],"urlList":[]}}