{"title":"Heros 3 + Xtras","uid":3309101,"size":208149725,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a1dfb140b5027f245b3295d9de90bd0a1e87a2f1&amp;dn=Heros+3+%2B+Xtras&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"orel.bi","files":1,"time":1112205155,"description":"New World Computing\nHeroes of Might and Magic(TM) III\n2/12/99\n\nThank you for purchasing Heroes of Might and Magic III.  We hope you\nhave as much fun playing Heroes(TM) III as we had making it.\n\n------------------------- TABLE OF CONTENTS ----------------------------\n\n1) New Features\n2) Manual errata\n3) Hard drive space required\n4) Mplayer.com\n5) Heat.net\n6) MSN Gaming Zone\n7) Windows(R), Virtual Memory, and Hard Disk Space\n8) Miscellaneous\n9) Troubleshooting\n10) Purchasing 3DO Software\n11) Contacting Customer Support\n\n------------------------------------------------------------------------\n\n1)   New Features:\n\nAfter the manual was printed, the following features were added to the\ngame:\n\nThe &amp;quot;T&amp;quot; hot key cycles through each town button on the adventure map.\nThe &amp;quot;S&amp;quot; hot key brings up the save screen from the adventure map.\nThe &amp;quot;L&amp;quot; hot key brings up the load screen from the adventure map.\nThe &amp;quot;I&amp;quot; hot key displays Scenario Info from the adventure map.\nThe &amp;quot;P&amp;quot; hot key displays the Puzzle Map from the adventure map.\nThe &amp;quot;V&amp;quot; hot key shows the View World display from the adventure map.\nThe &amp;quot;D&amp;quot; hot key tells the current hero to dig for the grail.\n\nYou may delete a save game from the load game screen by selecting the\nfile and pressing the Del key.\n\nYou may delete a save game from the save game screen by selecting the\nfile and pressing the Ctrl-Del keys.\n\n\n------------------------------------------------------------------------\n\n2)   Manual errata:\n\nPage 8\nBack.  &amp;quot;Menu Menu&amp;quot; should be &amp;quot;Main Menu&amp;quot;.\n\nPage 35\nArmorer secondary skill.  Damage reduced by this skill is 5% at Basic, \n10% at Advanced and 15% at Expert skill level.\n\nPage 38\nOffense secondary skill.  Offense increases the amount of damage in\nhand to hand combat only.\n\nPage 42\nTactics Formation Table.  If a hero has one higher degree of the tactics \nskill, troop placement is within the first 3 hex columns.  Two higher \ndegrees of tactics skill allows placement within the first 5 hex \ncolumns and three degrees is 7 hexes.\n\nPage 44\nLuck.  A positive luck score gives creatures the chance of inflicting \ndouble damage instead of maximum damage.\n\nPage 74\nBerserk Spell.  The duration for this spell is one attack, not one \nround.\n\nPage 78\nFrost Ring Spell.  The duration for this spell is instant, not one \nround per Power.\n\nPage 82\nHall Structures, Capitol.  You may only have one capitol.  If you take \nan enemy capitol, it is downgraded to a City Hall.\n\nPage 89\nHarpies &amp;amp; Harpy Hags.  The first sentence should read:  &amp;quot;Harpies have a \nswooping attack that returns them to the hex they started from&amp;quot;.\n\nPage 94\nGorgons &amp;amp; Mighty Gorgons.  The second sentence should read:  &amp;quot;The \nmighty gorgon has a death stare with a 10% chance per attack of killing \n1 creature per 10 mighty gorgons outright.&amp;quot;\n\nPage 98\nEfteet &amp;amp; Efreet Sultans.  Efteet and Efreet Sultans have Fly movement,\nnot Ground movement.  Efteet Sultans have a natural fire shield \ndefense, similar to the fire shield spell.\n\nPage 119\nBarbarians.  Jabarkas is an ogre, not a goblin.\n\nPage 120\nBattle Mages.  Dessa in an ogre, not a goblin.  He also starts with \nBasic Logistics, not Basic Ballistics.\n\nGird starts with Basic Wisdom and Basic Sorcery instead of Advanced\nWisdom.\n\nOris starts with Basic Eagle Eye instead of Basic Learning.\n\nVey is an ogre, not a goblin.\n\nPage 121\nBeastmasters.  Tazar's secondary skill should be Advanced Armorer, not\nAdvanced Defense.\n\nPage 122\nClerics.  Rion starts with Basic First Aid instead of Basic \nLeadership.\n\nSanya starts with Basic Eagle Eye, not Basic Scholar.\n\nPage 124\nAll Demoniacs' starting abilities are:\nAttack 2, Defense 2, Power 1, Knowledge 1.\n\nPage 125\nDruids.  Elleshar starts with Basic Intelligence, not Basic Mysticism.\n\nGem starts with the Basic First Aid secondary skill instead of Basic\nDiplomacy.\n\nMelodia is an Elf not a Human.\n\nPage 126\nHeretics.  Ayden starts with Basic Wisdom and Basic Intelligence \ninstead of Advanced Wisdom.\n\nPage 127\nKnights.  Sylvia starts with Basic Navigation, not Basic Logistics.\n\nChristian starts with Basic Artillery instead of Basic Tactics.\n\nPage 128\nThant's unique ability allows him to cast Animate Dead at a greater\neffect, instead of Resurrection.\n\nPage 129\nGunnar starts with Basic Logistics, not Basic Offense.\n\nPage 130\nKyrre's unique ability gives her a logistics bonus instead of a\npathfinding bonus.\n\nPage 131\nJeddite's unique ability allows him to cast Resurrection at a greater\neffect, instead of Animate Dead.\n\nPage 132\nVerdish starts with Basic First Aid, not Basic Scholar.\n\n\n------------------------------------------------------------------------\n\n3)   Hard Drive Space:\n\nHeroes III requires approximately 200 megabytes of hard drive space for \ninstallation.\n\n\n------------------------------------------------------------------------\n\n4)   Mplayer.com:\n\nTo install mplayer.com software on your computer you must start the \nHeroes III autorun program.  On most computers, inserting your Heroes \nIII CD into your CD ROM drive will start the autorun program.\n\nOnce the autorun program screen has appeared, click the MORE button.  \nThe Multiplayer Online screen should appear.  Select the MPLAYER.COM \nbutton to launch the mplayer.com install program.\n\nIf you have disabled the autorun feature on your computer, you can \nlaunch the autorun program by clicking the Window(R)'s Start button, \nselecting Programs, then Heroes of Might and Magic(R) III, then\nOnline Services.  Select the MPLAYER.COM button to launch the \nmplayer.com install program.\n\nIf you're having trouble installing mplayer.com or have any questions or\ntechnical problems with mplayer.com, please contact mplayer.com \ntechnical support by e-mailing &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;c1b2b4b1b1aeb3b581acb1ada0b8a4b3efa2aeac&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; or by calling (650) \n429-3100 between 2 p.m. and 9 p.m. (PST) Tues. - Sat.\n\n------------------------------------------------------------------------\n\n5)   Heat.net:\n\nTo install heat.net software on your computer you must start the Heroes \nIII autorun program.  On most computers, inserting your Heroes III CD \ninto your CD ROM drive will start the autorun program.\n\nOnce the autorun program screen has appeared, click the MORE button.  \nThe Multiplayer Online screen should appear.  Select the HEAT.NET button\nto launch the heat.net install program.\n\nIf you have disabled the autorun feature on your computer, you can \nlaunch the autorun program by clicking the Window(R)'s Start button, \nselecting Programs, then Heroes of Might and Magic(R) III, then\nOnline Services.  Select the HEAT.NET button to launch the heat.net \ninstall program.\n\nIf you have any comments or questions regarding the Heat software, Heat \nregistration, or any other aspect of the Heat site, please contact Heat \nvia e-mail at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;aedacbc5c6cbc2deeec6cbcfda80c0cbda&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; or via phone between 11:00 a.m. and 11:00 \np.m. PST at (415) 437-1674.  Heat can also be reached online via Heat's \nOnline Consultation between the hours of 8:00 a.m. and 1:00 a.m. PST. To \nget to chat, simply go to www.heat.net, then click the NEED HELP link, \nand choose Online Consultation.\n\n\n------------------------------------------------------------------------\n\n6)   MSN Gaming Zone:\n\nTo install msn gaming zone software on your computer you must start the \nHeroes III autorun program.  On most computers, inserting your Heroes \nIII CD into your CD ROM drive will start the autorun program.\n\nOnce the autorun program screen has appeared, click the MORE button.  \nThe Multiplayer Online screen should appear.  Select the msn Gaming ZONE\nbutton to launch the msn gaming zone install program.\n\nIf you have disabled the autorun feature on your computer, you can \nlaunch the autorun program by clicking the Window(R)'s Start button, \nselecting Programs, then Heroes of Might and Magic(R) III, then\nOnline Services.  Select the msn Gaming ZONE button to launch the msn \ngaming zone install program.\n\n\nFor technical support or more information about the msn gaming zone, go \nto http://www.zone.com on the internet and click Help.\n\n\n------------------------------------------------------------------------\n\n7)   Windows(R), Virtual Memory, and Hard Disk Space:\n\nThe Windows(R) operating system requires a certain amount of virtual \nmemory to function properly. The amount of virtual memory required by \nWindows(R) varies depending on how much of your computer's resources are \nrequired by an application.  Heroes of Might and Magic III, like most \nother games, requires the use of most of your computer's resources to \nrun properly.\n\nTherefore, for a Windows(R) application like Heroes III to run properly \nthere must be sufficient free space on the hard disk with your Windows \nsystem folder.  As a general rule of thumb, you should keep enough free \nhard disk space equal to the larger of: two times the total amount of \nRAM your computer has; or, 10% of the space on the hard drive with \nWindows(R).\n\n\n------------------------------------------------------------------------\n\n8)   Miscellaneous:\n\nThe Official strategy guide for Heroes III is available from Prima \nPublishing.  To order call (800) 531-2343. Also available at bookstores \nand multimedia outlets nationwide.\n\nThe Official Heroes III website is located at: http://www.heroes3.com\nPlease feel free to stop by and check out our site.\n\nIf any patches are released for Heroes III or any other New World\nComputing or 3DO game, Game Update can automatically download the most \nrecent patch and patch your game for you.  You must have the game \ncurrently installed on your computer and have an Internet Service \nProvider (ISP) to use Game Update.  To run Game Update, first connect to \nthe internet.  Next click on your Windows Start button and select \nPrograms, then Heroes of Might and Magic III, then Game Update.  The \nGame Update utility will then download the latest patch available and \nrun the patch for you.  If you already have the latest patch, Game \nUpdate will tell you are up to date.  As a convenience to you, Game \nUpdate checks any other recent New World Computing or 3DO products \ninstalled on your computer also.  You can choose to update them or not, \nas you wish.\n\n\n------------------------------------------------------------------------\n\n9)   Troubleshooting\n\nInstallation \n\nProblem: \t\n\tThe CD is in the CD-ROM drive, but the computer is not \n\trecognizing it. \nAnswers: \t\n\tThe CD may be dirty or scratched.\nSolutions: \t\n\t1. Make sure that the data side of the CD (shiny side) is not \n\tdirty or scratched.  If it is dirty, take a lint free \n\tnon-abrasive cloth and wipe gently to clean it (always wipe from \n\tthe inside of the CD to the outside edges).  If the data side of \n\tthe CD appears to be scratched, return the game to the store that\n\tyou bought it from, and exchange it for a new copy. If you are \n\tunable to exchange the game at the store that you bought it from,\n\tplease call Customer Support for information on our exchange \n\tpolicy.\n\nProblem:\t\n\tThe computer freezes during install, or you receive an error \n\tmessage (such as &amp;quot;*_ins error&amp;quot; or &amp;quot;An error has occurred during \n\tthe move data process&amp;quot;) during install.\nAnswers: \t\n\tYour computer may be using an older 16-bit CD-ROM driver; or \n\tthere may not be enough space on your hard drive for temporary \n\tfiles to expand; or the CD-ROM drive might be having problems \n\twith how it buffers information. Or, the Autorun or DMA settings \n\ton your CD-ROM drive could be interfering with the game \n\tinstallation.\n\nTo check and see if your computer is using an older 16-bit CD-ROM driver:\n\t1. Right-click on the 'My Computer' icon and select 'Properties'.\n\t2. Click on the 'Performance' tab.\n\t3. In the Performance status box, if the File System line says  \n\t&amp;quot;Some drivers are using MS-DOS compatibility&amp;quot;, you are using a \n\t16-bit CD-ROM driver.\nSolutions:\t\n\t1. For 16-bit CD-ROM drivers: Contact the manufacturer of your \n\tCD-ROM drive or the manufacturer of your computer for an updated\n\t32-bit CD-ROM driver.\n\n\t2. For 32-bit CD-ROM drivers:\n\t\t1. Close all unnecessary programs running in the \n\t\tBackground.  Press the CTRL+ALT+DEL keys at the same time\n\t\tto open the Close Program window, select a program, and \n\t\tpress the End Task button.  Repeat this process until all\n\t\tprograms except 'Explorer' and 'Systray' are closed.\n\t\n\t\t2. Delete all files in your C:WindowsTemp folder, then \n\t\tempty the Recycle Bin.\n\n\t3. Turn off read-ahead on the CD-ROM drive:\n\t\t1. Right-click on the 'My Computer' icon and select \n\t\t   'Properties'.\n\t\t2. Click on the 'Performance' tab.\n\t\t3. Click on the 'File System' button.\n\t\t4. Choose the 'CD-ROM' tab at the top\n\t\t5. Change the 'Optimize access pattern for' field to \n\t\t   'No read-ahead'\n\t\t6. Click on Apply, then OK and finally click Close (you \n\t\t   will be prompted to restart your system).\n\n\t4. Turn off the Autorun and DMA settings on your CD-ROM drive:\n\t\t1. Right click on the 'My Computer' icon and choose \n\t\t   'Properties'.\n\t\t2. Click on the 'Device Manager' tab.\n\t\t3. Click on the '+' sign next to the CD-ROM line so that \n\t\t   it becomes a '-' sign.\n\t\t4. Click on the line that appears under the CD-ROM line \n\t\t   so that it is highlighted, then click on the \n\t\t   'Properties' button.\n\t\t5. Click on the 'Settings' tab.\n\t\t6. Look for the Auto-insert Notification and DMA lines.  \n\t\t   If there is a check mark in the boxes next to either \n\t\t   of these lines, click on the box to remove the check \n\t\t   mark.\n\t\t7. Click on the 'Apply' button, and then click on the \n\t\t   'OK' button.\n\t\t8. When you are asked if you want to restart your system,\n\t\t   choose 'Yes'. \n\nYou can restore all of the CD-ROM settings back to normal after the game \nhas been successfully installed.\n\n\n\nLaunching the Game I\n\nProblem: \t\n\tAfter launching the game from the Start menu or Desktop icon, you\n\tget a blank screen, a black box that surrounds the mouse cursor, \n\tblurring or choppy graphics, vertical lines on the screen, choppy\n\tsound, or no sound.\nAnswer: \t\n\tThere is probably a conflict between your video or sound card and\n\tMicrosoft's DirectX.\nSolution: \nFor Windows 95 and 98 users: \n1. Press the 'Start' button on the Windows 95/98-task bar and select \n   'Run'. \n2. Type &amp;quot;c:Program Filesdirectxsetupdxdiag.exe&amp;quot; then click on the \n   'OK' button. This will run the DirectX Diagnostics Tool.\n3. Make sure all your files are DirectX 6 compatible. Select the 'DirectX\n   Files' tab make sure there are no exclamation points next to the file \n   names. If you find exclamation points under this tab you will need to \n   reinstall DirectX 6 by going to the 'START' Button on the Windows95 \n   task bar then select 'RUN' and type your CD-ROM drive letter followed \n   by &amp;quot;: DirectXdxsetup.exe&amp;quot; and click on the 'Reinstall DirectX' \n   button. This will reinstall DirectX 6.\n4. Make sure all of your drivers are DirectX 6 compatible. Select the \n  'DirectX Drivers' tab and make sure there are no exclamation points \n   next to any of the file names.  If you find exclamation points under \n   this tab you will need to update your drivers by contacting the \n   manufacturer of the hardware through their Phone Support or through \n   their web site. 3DO has a listing of manufactures sites available at: \n   http://www.3do.com/support.\n5. Test your hardware with the DirectX 6 Diagnostics tool. Run the tests \n   that are available on the 'Display', 'Sound', and 'Input' tabs. If one\n   or more tests fail, this could be due to driver incompatibility. \n   Installing the newest drivers available for your sound and video card \n   hardware can usually resolve this.\n\nFor Windows 98 users:\n1. Press the Start button on the Windows 98 task bar and select 'Help'\n2. Select the Search tab, type 'DirectX Troubleshooter' in the text box, \n   and then press the List Topics button.  Select 'DirectX Troubleshooter'\n   in the Topics window, click the Display Button, and then follow the \n   instructions to troubleshoot your DirectX issue.\n\nLaunching the Game II\n\nProblem:    \n\tYou try to start the game and the screen flashes briefly, and you\n\tare returned to the desktop without an error message. \nAnswer:       \n\tThere are probably miscellaneous programs running in the \n\tbackground that are interfering with the game and causing it to \n\tcrash. \nSolution:\n\tFor Windows 95 users:     \n1. Press the CTRL+ALT+DEL keys at the same time to open the Close Program\n   window.\n2. Click on a program so that it is highlighted, then click on the 'End \n   Task' button.\n3. Repeat this process until only 'Explorer' and 'Systray' are left in \n   the Close Program list, then try running the game.\n\nFor Windows 98 users:\n1. Click on the Windows Start button, then choose Run.\n2. In the Run line type in: &amp;quot;msconfig&amp;quot;, then push the 'Enter' key. (This \n   will bring up the System Configuration Utility.)\n3. Select the 'Startup' tab, and turn all of the check boxes off, except \n   for the one next to 'Systray'.\n4. Press 'OK'. When you are prompted to restart your system, click 'Yes'.\n5. Once your machine has restarted try running the program again. \n\nVideo and Sound card manufacturers regularly update their software \ndrivers to enhance performance and stability, and to improve \ncompatibility with DirectX.  You can find links to many of these \nmanufacturers' sites by going to the Driver Updates section of our \nsupport web site, which is located at http://www.3do.com/support. \n\nYou may obtain a list of Microsoft-certified video and audio drivers for \nyour hardware by going to http://www.microsoft.com/hwtest/hcl/.  Drivers \nlisted here are confirmed to be compatibility with Windows 95, Windows 98\nand Windows NT4.0. \n\nMicrosoft updates DirectX and its components regularly and posts them for\ndownload off of their web site at http://www.microsoft.com/DirectX. \n\n\n\n\n--The End--\n","torrent":{"xt":"urn:btih:a1dfb140b5027f245b3295d9de90bd0a1e87a2f1","amp;dn":"Heros+3+%2B+Xtras","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1dfb140b5027f245b3295d9de90bd0a1e87a2f1","infoHashBuffer":{"type":"Buffer","data":[161,223,177,64,181,2,127,36,91,50,149,217,222,144,189,10,30,135,162,241]},"announce":[],"urlList":[]}}