{"title":"Original Soundtrack - All This And World War II (1976)","uid":3619895,"size":242482278,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a216344f5e63e00138dc65f383a140762f1a90ca&amp;dn=Original+Soundtrack+-+All+This+And+World+War+II+%281976%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"workjobb","files":31,"time":1171651884,"description":"This is a true curiosity. I&amp;#039;m not really sure if it&amp;#039;s ever been released on CD. Hip-O Select has had it listed on their website for over a year with a delay due to a production problem, and the status hasn&amp;#039;t been updated. The production problem may very well be the bundle of money they had to pay for the rights to these performances.\nIn any case, this is a vinyl rip from a not great copy of the album-I&amp;#039;ve tried to take out as much of the pops and clicks as possible.\nAll This And World War II was a film released by 20th Century Fox in 1976. It was pulled from theaters after about a week when it proved to be a total embarrassment for everyone involved. The concept was to take World War II newsreel footage and clips from old movies and set them to Beatles songs performed by other artists. Why? Only the producers knew for sure, but the result was a disaster. Subsequently, the movie has very rarely been seen since that time, never having been released to video. Thing is that some of the performances were quite good-far superior to the &quot;Sgt. Pepper&quot; fiasco of a few years later, and the Bee Gees did have a few songs in this project also. They did manage to line up some heavy hitters-Frankie Valli and the Four Seasons, Peter Gabriel, Rod Stewart, Ron Wood, Leo Sayer, Keith Moon, Elton John, Jeff &quot;ELO&quot; Lynne, Bryan Ferry, Tina Turner, Status Quo, and The Brothers Johnson. There were also some what-the-hell-are-they-doing-here inclusions as well-Helen Reddy, Henry &quot;Shannon&quot; Gross, and recently deceased cowboy singer from the 40&amp;#039;s Frankie Laine (&quot;High Noon&quot; and &quot;Blazing Saddles&quot;), but even their contributions aren&amp;#039;t as bad as they could be.\nI suspect, though I&amp;#039;m not sure, that this is the only way that some of these songs can be found. The only ones I&amp;#039;ve ever seen outside this project are Elton&amp;#039;s &quot;Lucy In The Sky&quot; and Ambrosia&amp;#039;s &quot;Magical Mystery Tour&quot;, which was released as a single.\nPlease seed this so that everyone who wants it can get a shot at it.","torrent":{"xt":"urn:btih:a216344f5e63e00138dc65f383a140762f1a90ca","amp;dn":"Original+Soundtrack+-+All+This+And+World+War+II+%281976%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a216344f5e63e00138dc65f383a140762f1a90ca","infoHashBuffer":{"type":"Buffer","data":[162,22,52,79,94,99,224,1,56,220,101,243,131,161,64,118,47,26,144,202]},"announce":[],"urlList":[]}}