{"title":"Saint Bernadette... In The Ballroom(2007)[FLAC]","uid":6801193,"size":280713444,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a23a77842f53c9f96839012d15c6b16a80b9ba88&amp;dn=Saint+Bernadette...+In+The+Ballroom%282007%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":16,"time":1320687795,"description":"\n\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n1 I Own the City \n2 Bound to Do \n3 She's a Natural \n4 Money in the Air \n5 Pieces \n6 Sidestep \n7 Such Ease \n8 Lay Me Down \n9 Universe \n10 No Dreams \n\nRecorded in the titular space (the ballroom of the Bijou Theater in Bridgeport, CT) in only three days, with no overdubs, Saint Bernadette's debut is a shimmering set of torchy, if not necessarily romantic jazz blues that reveals additional layers the more it's played. Although horns and guitar add to the atmosphere, it's Meredith DiMenna's supple, velvety voice -- somewhat like a combination of Norah Jones, Toni Price, Peggy Lee, and Billie Holiday -- that drives the project. Led by DiMenna, whose vocals are heard in an entirely different setting as MTV's trashy Chunky Pam, along with fellow songwriter Keith Saunders, these 11 originals hint at retro '60s styled mood with contemporary touches. But it's the subtle dynamics that elevate the material; lap steel guitar brings a somewhat ghostly approach to the songs as DiMenna's husky, sexy singing weaves through the spaces in the sound. A few tracks like &quot;Such Ease&quot; benefit from a harder edge yet the album typically stays in a mid-tempo, not quite ballad mode that lets the songs breathe and allows DiMenna the leeway to smother her smoky voice over the proceedings. The project exudes a sensuous sheen over its 40-minute playing time, and the album works due to a greater-than-the-sum-of-its-parts dynamic. Imagine a set influenced by Santo &amp; Johnny's nocturnal instrumental &quot;Sleepwalk&quot; and you're close to the hazy vibe evoked here. DiMenna occasionally radiates Grace Slick-styled phrasing, especially on the dramatic &quot;Lay Me Down.&quot; Although the material is strong, it isn't particularly hooky. That's not a detriment, though, because it adds to the mystery and sense of ambiguity that the songs simmer in. When the guitars do crank up on &quot;No Dreams,&quot; it's a sonic shock to the system. Turn the lights down low, burn some incense, and lose yourself in Saint Bernadette's intense yet lithe charms.\n\ncd ripped by EAC\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:a23a77842f53c9f96839012d15c6b16a80b9ba88","amp;dn":"Saint+Bernadette...+In+The+Ballroom%282007%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a23a77842f53c9f96839012d15c6b16a80b9ba88","infoHashBuffer":{"type":"Buffer","data":[162,58,119,132,47,83,201,249,104,57,1,45,21,198,177,106,128,185,186,136]},"announce":[],"urlList":[]}}