{"title":"Macmillan Encyclopedia of Energy(3Vols){BBS}","uid":6800420,"size":43093294,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a309a0adfd2282272c03719570d8557b2cba7e05&amp;dn=Macmillan+Encyclopedia+of+Energy%283Vols%29%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1320671995,"description":"this three-volume set is a timely contribution to this subject. This work takes an interdisciplinary approach to the study of energy, offering 253 articles representing the fields of physics, chemistry, biology, economics, and ethics. The articles, which range in length from two to 20 pages, were contributed by international scientists and educators. Traditional fuels such as gasoline and diesel are covered, as are alternative fuels such as methanol and hydrogen, alternative fuels for vehicles such as hybrid and electric cars, and alternative energy sources such as wind, solar, and fuel cells. Topics also include energy concepts such as electricity, thermodynamics, combustion, and catalysts, with basic formulas for essential physical and chemical processes. In addition, there are 60 biographies of scientists and engineers who made major contributions to the understanding of energy and energy technologies, among them Rudolph Diesel, Enrico Fermi, Pierre Laplace, and Alessandro Volta. The text features numerous photographs, illustrations, sidebars, and easy-to-use charts and graphs. All articles include bibliographies, and Volume 3 contains an energy time line and a good index. Bits and pieces of similar information can be found in the Encyclopedia of Environmental Science (LJ 2/15/01), but overall this is a unique resource. Aimed at public, high school, and undergraduate libraries, it should be purchased if funds and interest are sufficient. Eva Lautemann, Georgia Perimeter Coll. Lib., Clarkston\nCopyright 2001 Reed Business Information, Inc.\nProduct Details\n\n    * Hardcover: 1500 pages\n    * Publisher: MacMillan Reference Library (December 2000)\n    * Language: English\n    * ISBN-10: 0028650212\n    * ISBN-13: 978-0028650210","torrent":{"xt":"urn:btih:a309a0adfd2282272c03719570d8557b2cba7e05","amp;dn":"Macmillan+Encyclopedia+of+Energy%283Vols%29%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a309a0adfd2282272c03719570d8557b2cba7e05","infoHashBuffer":{"type":"Buffer","data":[163,9,160,173,253,34,130,39,44,3,113,149,112,216,85,123,44,186,126,5]},"announce":[],"urlList":[]}}