{"title":"Graphene Science Handbook - Size-Dependent Properties","uid":14709534,"size":34739500,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a30f799648f1d667ed73720a945b5095f2c34b59&amp;dn=Graphene+Science+Handbook+-+Size-Dependent+Properties&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1464404398,"description":"Graphene Science Handbook - Size-Dependent Properties - Mahmood Aliofkhazraei et al. (CRC, 2016).pdf\r\n\r\nISBN 978-1-4665-9136-3\r\n\r\nSize Up the Short- and Long-Term Effects of Graphene\r\n\r\nThe Graphene Science Handbook is a six-volume set that describes graphene’s special structural, electrical, and chemical properties. The book considers how these properties can be used in different applications (including the development of batteries, fuel cells, photovoltaic cells, and supercapacitors based on graphene) and produced on a massive and global scale.\r\n\r\nVolume One: Fabrication Methods\r\n\r\nVolume Two: Nanostructure and Atomic Arrangement\r\n\r\nVolume Three: Electrical and Optical Properties\r\n\r\nVolume Four: Mechanical and Chemical Properties\r\n\r\nVolume Five: Size-Dependent Properties\r\n\r\nVolume Six: Applications and Industrialization\r\n\r\nThis handbook describes the fabrication methods of graphene; the nanostructure and atomic arrangement of graphene; graphene’s electrical and optical properties; the mechanical and chemical properties of graphene; the size effects in graphene, characterization, and applications based on size-affected properties; and the application and industrialization of graphene.\r\n\r\nVolume five is dedicated to size effects in graphene, characterization, and applications based on size-affected properties and covers:\r\n\r\nThe use of graphene as a tunnel barrier for both charge and spin transport\r\nThe mechanical behavior of Kevlar–graphene fibers\r\nSize-controlled graphene and cases of graphene nanostructures with size-dependent properties\r\nThe applications of graphene as adsorbents, supporting and hybridization materials, and catalysts for removal of pollutants in contaminated water and air\r\nRecent research efforts to synthesize a variety of graphene-based structures\r\nThe properties of indirect coupling between magnetic moments in monolayer graphene nanostructures\r\nThe recent results of the electronic properties of graphene/metal systems\r\nInterface traps in graphene field-effect devices\r\nSemi-analytical models for the calculation of the quantum capacitance of both monolayer and bilayer graphene and its nanoribbons\r\nThe various properties of mono- and multilayers of silicene compared with the corresponding properties of graphene\r\nThe most relevant data obtained in the field of the vibrational characterization of graphene and graphene-based materials and more","torrent":{"xt":"urn:btih:a30f799648f1d667ed73720a945b5095f2c34b59","amp;dn":"Graphene+Science+Handbook+-+Size-Dependent+Properties","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a30f799648f1d667ed73720a945b5095f2c34b59","infoHashBuffer":{"type":"Buffer","data":[163,15,121,150,72,241,214,103,237,115,114,10,148,91,80,149,242,195,75,89]},"announce":[],"urlList":[]}}