{"title":"Guerrilla The Taking of Patty Hearst (TV) [2005] Robert Stone","uid":6845231,"size":899940472,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a4704b6c53290f97f4f837b54a15399c93c68153&amp;dn=Guerrilla+The+Taking+of+Patty+Hearst+%28TV%29+%5B2005%5D+Robert+Stone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1322323899,"description":" &lt;a href=&quot;http://bayimg.com/jaLfbaADB&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/jaLfbaADB&lt;/a&gt;\n\nThe American Experience  \n\nGuerrilla: The Taking of Patty Hearst \n\nNeverland: The Rise and Fall of the Symbionese Liberation Army\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0390299/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0390299/&lt;/a&gt;\n\nOriginal Air Date:3 June 2005\n\nIn 1974, a militant, fringe political group kidnapped teenage newspaper heiress Patricia Hearst from her Berkeley apartment. In the months that followed, Hearst, the Symbionese Liberation Army (S.L.A.), and their constant, paramilitary audio messages dominated headlines globally.\n\nUsing a treasure trove of archival footage and audio material, this American Experience film follows the bizarre saga from the establishment of the S.L.A., through the kidnapping, Hearst's conversion to her captors' cause, and the bank robberies and shootouts that followed.\n\nFirst-ever interviews with two surviving members of the S.L.A. provide insight into the politically charged times and the reasons why the group embraced revolutionary rhetoric and a terrorist agenda. As the spectacle unfolds, and journalists camped outside the Hearst home become consumed by the story, the film begins to explore questions about the role of the media and the ethics of broadcast journalism.\n\nGuerrilla: The Taking of Patty Hearst is an unprecedented account of the Symbionese Liberation Army, arguably the most notorious and flamboyant domestic terrorist group in American history.\n\nDedicated to the rights of black prisoners and the working class, the S.L.A. set forth in 1973 to incite the violent overthrow of the U.S. government, brilliantly manipulating the mass media to advance their message. Their audacious kidnapping of teenage newspaper heiress Patty Hearst inspired what might be described as the first true media &quot;frenzy,&quot; one that only exploded further when Patty transformed into &quot;Tania&quot; and joined the ranks of the S.L.A. Every detail of their descent into the surreal outer limits of political extremism was played out in public, a spectacle foreshadowing some of the worst excesses of modern TV journalism. Thirty years later, the S.L.A.'s extraordinary two-year crime spree resonates as a parable of political ideology run amok, the role of the media in America, and the romantic fantasies of modern political terrorism.\n\nFor Guerrilla, filmmaker Robert Stone went underground, where he spent four years creating a film that delivers both eye-popping archival footage and an exclusive interview with S.L.A. founder Russ Little, whose incarceration inspired the Hearst kidnapping. Little has never before given an on-camera interview, making Guerrilla an important historical document, as well as gripping entertainment. This American Experience program does not sympathize with or glorify the S.L.A. Instead, it provides a thorough, clear-eyed account of the first terrorist group to hold not just one heiress, but the entire nation hostage, and its subsequent, disastrous self-destruction.\n\n","torrent":{"xt":"urn:btih:a4704b6c53290f97f4f837b54a15399c93c68153","amp;dn":"Guerrilla+The+Taking+of+Patty+Hearst+%28TV%29+%5B2005%5D+Robert+Stone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4704b6c53290f97f4f837b54a15399c93c68153","infoHashBuffer":{"type":"Buffer","data":[164,112,75,108,83,41,15,151,244,248,55,181,74,21,57,156,147,198,129,83]},"announce":[],"urlList":[]}}