{"title":"Dying of Money - Pirate Bay Edition","uid":4989753,"size":1936906,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a4b18f5a11449b74c7acff1180e52526dc833806&amp;dn=Dying+of+Money+-+Pirate+Bay+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tpbsuxx","files":1,"time":1246976687,"description":"The final convulsion when it began was at first bizarre and at last became sheer nightmare. Beginning in July 1922, prices rose tenfold in four months, two hundredfold in eleven months. Near the end in 1923, prices were at least quadrupling each week.\n \nPrices raced so far ahead of the money-printing plants that, in the end, the total real value of all the Reichsmarks in the world was smaller than it had ever been, a phenomenon which enabled the government's economists to argue that there was no true inflation at all, it was just numbers.\n\nThis phenomenon also made money so scarce, even in the face of astronomical prices, that urban Germans could not find the price of their daily bread. The\nworker had to compute his pay in the trillions, carry it in bales, and spent it instantly lest he lose it. The forlorn buyers' strikes of earlier days against the mildly higher prices were no more; in their place the buyers were vying with one another to buy up any kind of goods at any price before their little money could evaporate. The seas of marks which had been stored up by Germans and especially by trusting foreigners flooded forth and fought to buy into other investments, foreign currencies, tangible goods, almost anything but marks. Legally &quot;fair&quot; interest rates reached as much as 22 percent per day. The price of a schnitzel dinner might rise 20 percent between giving the order and paying the check. Germany's money printing industry (another impressively large employer with 30 paper mills, 133 printing plants, workers in thousands) could not turn out enough trillions to keep up. States, towns, and companies got into the act by issuing their own &quot;emergency money&quot; (Notgeld).\n\n---\n\nThink it can't happen here?\n\n\nTake heed and listen to the following podcasts:\n &lt;a href=&quot;\nhttp://www.financialsense.com/fsn/main.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.financialsense.com/fsn/main.html&lt;/a&gt;","torrent":{"xt":"urn:btih:a4b18f5a11449b74c7acff1180e52526dc833806","amp;dn":"Dying+of+Money+-+Pirate+Bay+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4b18f5a11449b74c7acff1180e52526dc833806","infoHashBuffer":{"type":"Buffer","data":[164,177,143,90,17,68,155,116,199,172,255,17,128,229,37,38,220,131,56,6]},"announce":[],"urlList":[]}}