{"title":"Skyrim + All DLCs + Latest HD Res Pack (Non-Zipped Version)","uid":8289833,"size":13747884644,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a50dcc104531ba5dcc2db4b6ba56e927629fb90d&amp;dn=Skyrim+%2B+All+DLCs+%2B+Latest+HD+Res+Pack+%28Non-Zipped+Version%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"thejester39","files":19,"time":1364026473,"description":"Hey guys. Me again. So when I uploaded my last torrent:\n\n (http://thepiratebay.se/torrent/8120078/Skyrim___All_DLCs___HD_Texture_Pack_%282-6-13_Version%29___Update_11\n\nthere were some people who were unhappy that I had zipped everything into one archive. So, I recently had to re-install Skyrim and had unzipped everything, and figured hey, why not cater to the babies? (jk guys!) So here it is. Skyrim, all DLCs, and the most current HD Res pack as of 3/23/13. Unzipped. Just the way you like it. I'll repost the same stuff I wrote one the other file as it still pertains to this one. However I've removed Update 11 because now that Update 12 is available it is no longer needed. Just search Pirate Bay for it! Enjoy, and may Talos watch over you!\n\n\nI love Skyrim, and much like any PC Gamer, I love mods. As we all know, mods, at times, can cause issues with a game if, or more so WHEN, something goes wrong. With that said, there are times where I like to clean install Skyrim if something goes awry. It became a pain searching for and downloading each and every piece of the game. So I decided to make a folder that contained them all. Then I thought, &quot;Hey, why not share it, so that others dont have to deal with the same thing?&quot;. So, as you now know, I did just that! Enjoy!\n\n\nThis torrent contains the following:\n\nSkyrim (Base Game)\n\nDawnguard DLC\n\nHearthfire DLC\n\nDragonborn DLC\n\nHD Texture Pack (This is the one that was released on March 23rd, 2013. It includes texture updates for the base game, and ALL the DLCS)\n\nIt also includes a few other of my personal choices for Skyrim, which are completely optional. They are as follows:\n\n\nIn the Data Folder, you will find a Music, Sound, and Video folder. \n\nThe Music folder contains the file mus_maintheme.xwm. What this file does, is changes the main theme at the title screen, to the &quot;Dragonborn Rap&quot; by Dan Bull. Its a cool song, and kind of amps you up as you get ready to play.\n\nThe Sound folder contains a folder called FX. Inside that folder is yet another folder labeled drs. Which I assume is short for doors. Because inside there are 4 files. drs_thievesguildmausoleum_close_2d.wav, drs_thievesguildmausoleum_close_3d.wav, drs_thievesguildmausoleum_open_2d.wav, and drs_thievesguildmausoleum_open_3d.wav. What these files do, is quiet the absurdly loud Thieves Guild mausoleum door that leads into Riften. I found the door to be just way too loud, amongst the other noises.\n\nAnd lastly, the Video folder. Which contains a file labeled BGS_Logo.bik. What this file does, is skips the opening Bethesda video, and takes you straight to the Main Menu. Saves you a few seconds, if you have a minor case of ADD like myself. lol\n\n\nInstallation:\n\n1. You will need a program that can mount .iso files. I personally like Daemon Tools. But to each their own. Whichever program you use, mount the Skyrim.iso file. Install the game.\n\n2. Next, browse to your Skyrim installation folder. (The one you chose during installation) Once there install the DLCs as follows:\n\n  2a Dawnguard - Place the Dawnguard.bsa and Dawnguard.esm files into the Data\n folder of your Skyrim installation directory.\n\n  2b Hearth Fires - Place the HearthFires.bsa and Hearthfires.esm files into the\n Data folder of your Skyrim installation directory.\n\n  2c Dragonborn - Much like the base game, Dragonborn is an .iso file that needs\n to be mounted with your .iso mounting program. Install just as you did with the\n base game.\n\n You now have all the DLCs installed. BUT DONT START THE GAME YET. YOU'RE NOT DONE!\n\n4. Next, you can install the HD Texture Pack. Place the HighResTexturePacks files (There are 3 &quot;packs&quot; and a total of 6 files. 3 .bsa files, and 3 .esp files) into the Data folder of your Skyrim installation directory.\n\n***NOTE: Please be aware the HD Res pack is COMPLETELY OPTIONAL. It is not needed to play. It is for higher end graphic cards. So dont try to use it. Also, personally I stopped using it. Instead I use some great HD Texture mods on the Nexus. Because I choose community over the fat cats. We're more dedicated to perfection!\n\n You now have all the DLCs + the HD Texture Pack installed. But you're still not\n done, so DO NOT START THE GAME still to this point.\n\n5. Lastly, download and install the Update 12, which can be found here on Pirate Bay by searching. Follow proper installation instructions.\n\n***NOTE: If you dont want to download Update 12 for some unknown and bizarre reason, you will need to take another step. While you have Dragonborn.iso mounted in DAEMON tools, you will need to &quot;Explore&quot; it by going into my computer. Inside you will find a crack folder. Drag those files into your Skyrim directoy. BAM, you're done.\n\n AND THATS IT! YOU NOW HAVE SKYRIM, ALL OF THE DLCS, THE LASTEST HD TEXTURE PACK\n AS OF 02-08-2013, AND THE MOST RECENT UPDATE AS OF 03-23-2013. NOW GO AHEAD AND PLAY!! (or follow the next step to install the optional files)\n\n6. (OPTIONAL) To install the optional files, simply drag the Data folder into your Skyrim installation directory. Select Yes when asked to Merge, and overwrite any files it prompts. That's it!!\n\n\nI DONT EVER REALLY DOWNLOAD TORRENTS, BUT I FIGURED I'D SHARE THIS WITH EVERYONE!\n\nPLEASE FEEL FREE TO POINT OUT ANYTHING THAT MAY BE INCORRECT OR WRONG. I HAVE SPENT\n\nMANY HOURS PLAYING AND NOTHING HAS APPEARED WRONG. OBVIOUSLY I HAVENT FULLY\n\nTESTED IT OUT, MEANING THE DLCS AND ALL THAT, BUT I SEE NO REASON WHY THERE SHOULD\n\nBE PROBLEMS. IF YOU COME ACROSS ANYTHING, LEAVE A COMMENT AND I WILL DO MY BEST TO\n\nHELP TRY TO CORRECT IT, OR AT LEAST MAKE EVERYONE AWARE OF THE ISSUE. THANKS \n\nAGAIN, AND I HOPE YOU ALL ENJOY THIS!!\n\n\n\nONE OF THE WORST OF THE SEVEN DEADLY SINS IS GREED.\nSO DO US A FAVOR, DON'T BE SELFISH, AND SEED, SEED, SEED!!!","torrent":{"xt":"urn:btih:a50dcc104531ba5dcc2db4b6ba56e927629fb90d","amp;dn":"Skyrim+%2B+All+DLCs+%2B+Latest+HD+Res+Pack+%28Non-Zipped+Version%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a50dcc104531ba5dcc2db4b6ba56e927629fb90d","infoHashBuffer":{"type":"Buffer","data":[165,13,204,16,69,49,186,93,204,45,180,182,186,86,233,39,98,159,185,13]},"announce":[],"urlList":[]}}