{"title":"Handmade.on.the.Silk.Road--BBC-2016-3.Eps-w.subs-468p","uid":14653727,"size":969106691,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a5598e31f2c6981374abf7fc957beed9c9496048&amp;dn=Handmade.on.the.Silk.Road--BBC-2016-3.Eps-w.subs-468p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"uggauga","files":6,"time":1463678046,"description":"Handmade on the Silk Road\r\n\r\nSeries about traditional crafts along the ancient trade route of the Silk Road. Each film follows a day in the working life of a weaver, woodcarver and potter in China, Uzbekistan and Iran.\r\n\r\nBBC (2016) - 3 Episodes\r\n \nhttp://www.bbc.co.uk/programmes/b079cmnz\r\n_______________________________________\r\n\r\n832x468 resolution\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nWith subtitles - enjoy !!\r\n_______________________________________\r\n\r\nThe Weaver - Handmade on the Silk Road Episode 1 of 3\r\nThe Uyghur community in north west China have been making atlas silk for thousands of years. Mattursun Islam and his family are continuing the tradition, using a combination of handmade techniques and mechanised looms. From designing the patterns to colouring, dyeing and weaving the thread, this film follows each stage in absorbing detail. We also get an engaging glimpse into how their family and working life are closely connected. With rival companies often copying his designs, Mattursan is proud of his reputation. But he and his wife also enjoy a good-natured rivalry over who really runs things.\r\n\r\nThe Wood Carver - Handmade on the Silk Road Episode 2 of 3\r\nShavkat Jumanijozov has been working with wood for over 30 years. In his workshop in Khiva in Uzbekistan, he makes doors, chests and impressive wooden columns. Trained by the grandson of a famous 19th-century carver, Shavkat is a proud master of his craft and oversees a team of brothers, sons and nephews, passing on his expertise to the next generation.\r\nIn this beautifully filmed portrait of a traditional craftsman at work, we follow the painstaking carving of a wooden pillar, from the first cuts into the wood to its sanding, shaping and varnishing, each stage captured in absorbing detail.\r\n\r\nThe Potter - Handmade on the Silk Road Episode 3 of 3\r\nThe desert city of Meybod in southern Iran is famous for its ceramics and Abdol Reza Aghaei's family have been potters there for generations. This beautifully observed film follows Abdol and his father making a simple decorated water jug. Competing with cheap Chinese imports, they sometimes struggle to make a living, but share a dedication to keeping their traditions alive. And with Abdol's father teasing his son about who makes the best pots, the film also offers a touching, intimate portrait of two master craftsmen at work","torrent":{"xt":"urn:btih:a5598e31f2c6981374abf7fc957beed9c9496048","amp;dn":"Handmade.on.the.Silk.Road--BBC-2016-3.Eps-w.subs-468p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5598e31f2c6981374abf7fc957beed9c9496048","infoHashBuffer":{"type":"Buffer","data":[165,89,142,49,242,198,152,19,116,171,247,252,149,123,238,217,201,73,96,72]},"announce":[],"urlList":[]}}