{"title":"Glued to Games: How Video Games Draw Us In","uid":7658779,"size":3877061,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a5a5cbc77b46fd84fffe6130cfac9c76a51f29d8&amp;dn=Glued+to+Games%3A+How+Video+Games+Draw+Us+In&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"the_zin","files":1,"time":1348247007,"description":"Glued to Games: How Video Games Draw Us In and Hold Us Spellbound (New Directions in Media)\n\nAuthors: Scott Rigby and Richard Ryan\n\n\n\nBook Description (from amazon.com)\n\nPublication Date: February 28, 2011\n\nWith video game sales in the billions and strong opinions about\ntheir potential and their peril growing louder, Glued to Games: How\nVideo Games Draw Us In and Hold Us Spellbound brings something new to the\ndiscussion. It is the first truly balanced review of the psychology of video\ngame motivation and engagement, based on years of research with thousands of\ngamers. The book addresses both the positive and negative aspects of game play\nby drawing on significant recent studies and established motivational theory to\nexplore the fundamental drivers of engagement, how games satisfy basic\npsychological needs, and how an understanding of these factors can be applied\nto controversial topics such as video game violence and game addiction.\n\n\nFilled with examples from popular games and the real experiences\nof gamers themselves, Glued to Games gets to the heart of\ngaming's powerful psychological and emotional allure--the benefits as well as\nthe dangers. It gives everyone from researchers to parents to gamers themselves\na clearer understanding of the psychology of gaming, while offering\nprescriptions for healthier, more enjoyable games and gaming experiences.","torrent":{"xt":"urn:btih:a5a5cbc77b46fd84fffe6130cfac9c76a51f29d8","amp;dn":"Glued+to+Games%3A+How+Video+Games+Draw+Us+In","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5a5cbc77b46fd84fffe6130cfac9c76a51f29d8","infoHashBuffer":{"type":"Buffer","data":[165,165,203,199,123,70,253,132,255,254,97,48,207,172,156,118,165,31,41,216]},"announce":[],"urlList":[]}}