{"title":"Mortal Kombat X - Premium Edition-2015-RePack by R.G. Steamgames","uid":11817515,"size":29031863811,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a5c33e3a571b554553ebb1b1ac5af1f2fef36069&amp;dn=Mortal+Kombat+X+-+Premium+Edition-2015-RePack+by+R.G.+Steamgames&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Montiablo","files":16,"time":1429141409,"description":"Information\nYear: April 14, 2015\nGenre: Action\nDeveloper: NetherRealm Studios, High Voltage Software\nPublisher: Warner Bros. Interactive Entertainment\nPublication Type: RePack\nGame Version: v1.0\nLanguage: Russian, English, MULTI8\nLanguage: English, MULTI6\nTablet: enclosing (RELOADED)\n\nSystem Requirements\nâ‡› Operating System: Windows Vista / 8 / 8.1 / 64-Bit only\nâ‡› Processor: Intel Core i5-750 2.67 GHz or AMD Phenom II X4 965 3.4 GHz\nâ‡› RAM: 3 GB\nâ‡› Video Card: 512 MB with support for DX11 (NVIDIA GeForce GTX 460 and AMD Radeon HD 5850)\nâ‡› Free space on hard disk: 36 GB\n\nDescription\nLike previous games in the series, Mortal Kombat X is a fighting game in which two players fight against each other using a variety of attacks, special moves and fatalities horrific. Energy meter, first introduced in the previous game Mortal Kombat 2011, once again allow to carry out X-Ray, with some modifications made to the system. By analogy with the Injustice: Gods Among Us, men can now interact with the environment, bouncing from certain places to change your position or use components of the environment as a weapon. Each fighter now has three different variations of combat, having a unique set of techniques that can be used during the match. For example, the Scorpio has a style Â«NinjutsuÂ», where he owns two swords; Â«HellfireÂ», which is based on special methods of using fire; and Â«InfernoÂ», as he calls fiend who help him in battle. Also planned is fully functional plug-in to play online. The game is said Ed Boon, offers a new, original and non-linear storyline, &quot;featuring some of the most colorful characters in the game, including Scorpion and Sub-Zero, at the same time will be introduced new candidates who represent the forces of good and evil and tie the story together &quot;. At E3 2014, it was confirmed that the story covers the period between the end of the previous game and the next 25 years after that (and the story can &quot;ride&quot; between specific dates, for example, after 5 or 10 years). Therefore, the game will feature both new fighters and old, but the age-adjusted.\n\nFeatures RePack:\n&quot;It is based on a licensed version of the game.\n&quot;Do not cut / no recoded.\n&quot;There are all DLC: Kombat Pack and Skin Pack - Samurai.\nÂ»RePack by: R.G. Steamgames","torrent":{"xt":"urn:btih:a5c33e3a571b554553ebb1b1ac5af1f2fef36069","amp;dn":"Mortal+Kombat+X+-+Premium+Edition-2015-RePack+by+R.G.+Steamgames","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5c33e3a571b554553ebb1b1ac5af1f2fef36069","infoHashBuffer":{"type":"Buffer","data":[165,195,62,58,87,27,85,69,83,235,177,177,172,90,241,242,254,243,96,105]},"announce":[],"urlList":[]}}