{"title":"Jaki Byard - Sunshine of my Soul [1967]","uid":9487386,"size":118007899,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a5ca4c47dab139cc98fbd57ecc89f931d134c86d&amp;dn=Jaki+Byard+-+Sunshine+of+my+Soul+%5B1967%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":-1,"time":1389925257,"description":"In 1967, Jaki Byard turned 45. At that age, some musicians are very set in their ways -- they have a niche, cater to it, and stick with whatever it is they do best. But Byard wasn't becoming complacent; the restless pianist was continuing to experiment and take chances, which is exactly what he does on Sunshine of My Soul. Recorded on Halloween 1967, this unpredictable post-bop/avant-garde effort finds Byard being influenced by a wide variety of pianists. One minute, his lyricism is acknowledging Erroll Garner and Dave Brubeck -- the next minute, he takes it outside and shows his appreciation of Cecil Taylor's free jazz. McCoy Tyner is an influence on original pieces like &quot;Sunshine&quot; and &quot;Cast Away,&quot; while W.C. Handy's often-recorded &quot;St. Louis Blues&quot; (the only tune on the album that Byard didn't write) becomes an unlikely mixture of free jazz and stride -- sort of Taylor by way of James P. Johnson and Fats Waller. Taylor's influence is especially strong on the very stream-of-consciousness &quot;Trendsition Zildjian,&quot; which is among the most abstract pieces that Byard has recorded. And whoever might be influencing Byard at a particular moment -- Taylor, Brubeck, Tyner, Garner, Bud Powell, or someone else -- the Bostonian always sounds like himself. Of course, a musician who is that broad-minded and eclectic needs musicians who are capable of keeping up with him and, thankfully, Byard has that in drummer Elvin Jones and bassist David Izenzon (known for his work with Ornette Coleman in the 1960s). Neither of them have a problem keeping up with Byard on this superb Prestige date, which Fantasy reissued on CD in 2001 under its Original Jazz Classics imprint. ","torrent":{"xt":"urn:btih:a5ca4c47dab139cc98fbd57ecc89f931d134c86d","amp;dn":"Jaki+Byard+-+Sunshine+of+my+Soul+%5B1967%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5ca4c47dab139cc98fbd57ecc89f931d134c86d","infoHashBuffer":{"type":"Buffer","data":[165,202,76,71,218,177,57,204,152,251,213,126,204,137,249,49,209,52,200,109]},"announce":[],"urlList":[]}}