{"title":"Heroes of Hellas 1- 2- 3","uid":6740282,"size":279988775,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a5f2ca319579a54691398823d21bc67e4e0f061b&amp;dn=Heroes+of+Hellas+1-+2-+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":".BONE.","files":4,"time":1318478067,"description":"In Heroes of Hellas, you`ll travel through Ancient Greece to find the thief who stole the scepter of Zeus. This relaxing matching game challenges you to click and drag across objects on the game board to create chains of three or more identical items. Draw from the powers of 7 heroes and use special bonuses. Explore the history behind nine classic mythologies. Easy to learn and challenging to master, Heroes of Hellas offers an unforgettable adventure through a magical time\n\n* Unique heroes to utilize.\n* Stunning desktop wallpapers.\n* Explore captivating myths.\n\nHeroes of Hellas 2 Olympia \n\n \n\nBuild a city from the ashes of a fallen civilization and rule your people with wisdom and justice in Heroes of Hellas 2: Olympia. A mix of addictive match-three gameplay and city building fun, Heroes of Hellas 2 challenges you to drag your mouse across chains of identical items to remove obstacles, activate bonus items and collect valuable objects.\n\n\n \n\nRebuild Athens from the ashes of its destruction and secure the help of the Heroes of Olympus as you battle an evil god! When calamity strikes the capital city of Hellas, the people turn to you for help. Through addictive match three-gameplay and compelling city building interludes, you will gather gold, meet the needs of a ravaged population, and search for legendary lockets that will allow you to summon the gods and appeal to them for help.\n\n \n\nHeroes of Hellas 3: Athens will challenge you to click-and-drag your mouse cursor across chains of identical items to remove obstacles, activate bonus items and collect valuable objects. As you call upon the gods to unleash their powers, dazzling visual effects will ignite the game screen and help you to achieve your goals quickly. Between levels, you'll be able to interact with the people of Athens and restore the city to its former glory.\n\nKey Game Features\n\nOver 90 campaign levels\n30 bonus levels\nFour match-three modes\n12 trophies\nTen original songs\n","torrent":{"xt":"urn:btih:a5f2ca319579a54691398823d21bc67e4e0f061b","amp;dn":"Heroes+of+Hellas+1-+2-+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5f2ca319579a54691398823d21bc67e4e0f061b","infoHashBuffer":{"type":"Buffer","data":[165,242,202,49,149,121,165,70,145,57,136,35,210,27,198,126,78,15,6,27]},"announce":[],"urlList":[]}}