{"title":"Omar and The Howlers - Swing Land","uid":9104433,"size":60273861,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a65370f148382a0c4698047b8bea1b35bd4ba230&amp;dn=Omar+and+The+Howlers+-+Swing+Land&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Noshock","files":-1,"time":1382832438,"description":"One doesn't recall Omar &amp; the Howlers as a straight-out jump blues combo, but it looks as if they're on the bandwagon with this CD. Omar Dykes has a squirrelly voice that falls between sandpaper gruff and churlish shouting, a cross twixt Dr. John and Howlin' Wolf. Help from the capable Howlers, big-time backup from saxophonists David &quot;Fathead&quot; Newman and Mark &quot;Kaz&quot; Kazanoff and harmonica whiz Gary Primich on three cuts gives Omar, who also plays guitar throughout, all the support and inspiration he needs. As much as the band does predictably jump and swing hard on the majority of these cuts, there's always a surprise. Obvious choices like &quot;Hit the Road Jack,&quot; &quot;Just Like a Woman,&quot; and the hardest swinger &quot;So Mean to Me&quot; come naturally. Taj Mahal's loping &quot;Going up to the Country&quot; is one that fits Omar's range perfectly, and he really cops &quot;the Wolf&quot; on &quot;Yellow Coat.&quot; The most daring move is his singing the Oscar Brown, Jr. lyrics to Nat Adderley's &quot;Work Song&quot; with the saxophonists trading licks nicely, or Charles Brown's lesser-known upbeat flag-waver &quot;That's Your Daddy Yaddy-O.&quot; An instrumental version of the famous Albert Collins number &quot;Don't Lose Your Cool&quot; really cooks, Omar and Derek O'Brien on electric six strings working out. And they do return to their straight blues base on the final two cuts, Primich standing up firmly and wailing on &quot;One Room Country Shack,&quot; the band getting down right dirty and nasty on &quot;Alligator Wine.&quot; &quot;Swing Land&quot; has lots of teeth and the bite to match. It's sincere, authentic, well played, and represents better than a lot of the phony swing bands copying songs and well-worn riffs. ","torrent":{"xt":"urn:btih:a65370f148382a0c4698047b8bea1b35bd4ba230","amp;dn":"Omar+and+The+Howlers+-+Swing+Land","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a65370f148382a0c4698047b8bea1b35bd4ba230","infoHashBuffer":{"type":"Buffer","data":[166,83,112,241,72,56,42,12,70,152,4,123,139,234,27,53,189,75,162,48]},"announce":[],"urlList":[]}}