{"title":"The Wind Riders - Tales of the Lore Valley Book 1","uid":11706683,"size":774242,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a6d7b9afb0e8581cd8e8f021aeb57e265799424a&amp;dn=The+Wind+Riders+-+Tales+of+the+Lore+Valley+Book+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"XDhacker","files":1,"time":1424159957,"description":"About the BOOK\n\nThe epic Tales of the Lore Valley fantasy series begins here!\n\nThe Wind Riders. Fabled pirates, who sail the skies on magic airships, protecting the weak and harassing the tyrannical Clerics who rule the nearby city of Tyr. Their very name conjures up dreams of freedom and whispers of hope amongst the slaves forced to mine Mergoran crystals in the mountains, the only known source of magic in the world. That is, until the Wind Riders are attacked and nearly destroyed by Tyr, who has somehow managed to build an airship of its own.\n\nWith many of their ships destroyed and their people dead, the surviving Wind Riders are forced to send a small group of volunteers into the heart of Tyr, the den of their hated enemies, to find allies who can purify crystals, the only way the Wind Riders can continue to fly their remaining ships. Failure would mean certain death for everyone ever known as a Wind Rider, as Tyr is busy preparing their next attack, one that will eradicate the Wind Riders from existence.\n\nBook 1 of the Tales of the Lore Valley sword and sorcery series. Get started now with one of the largest, most ambitious fantasy series ever told!","torrent":{"xt":"urn:btih:a6d7b9afb0e8581cd8e8f021aeb57e265799424a","amp;dn":"The+Wind+Riders+-+Tales+of+the+Lore+Valley+Book+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6d7b9afb0e8581cd8e8f021aeb57e265799424a","infoHashBuffer":{"type":"Buffer","data":[166,215,185,175,176,232,88,28,216,232,240,33,174,181,126,38,87,153,66,74]},"announce":[],"urlList":[]}}