{"title":"Tieners Naaien DVD 1+2 - Dutch Porn","uid":5586482,"size":7412762624,"categoryP":"porn","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a74d87944dc2a76f46f65cb2b2c2f6a871da5b85&amp;dn=Tieners+Naaien+DVD+1%2B2+-+Dutch+Porn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"anonimious","files":42,"time":1274714711,"description":"Deel 1:\nSjors en zijn maat Sjimmie zijn op vakantie en nemen een lokaal sletje mee naar hun super-de-luxe hotelkamer.\nDaar aangekomen geven ze het sletje een lekkere lollie.\nMaar voor wat hoort wat natuurlijk en Sjimmie neukt het sletje even goed af.\nNadat het zoete chicky suf geneukt is,krijgt ze nog een extraatje van Sjimmie.\nEen lekkere lading zaad midden in haar gezicht, ze vindt het heerlijk!\nVerder vragen Sjors en Sjimmie vragen zich waarom ze nog niet genoeg geneukt hebben deze dag en komen ze een lekker meisje tegen op een bankje die ze eens even flink palen.\nMet een smoes lokken ze haar mee naar het hotel waar Sjimmie haar helemaal uitwoont.\nHij laat het sletje alle hoeken van de kamer.\nZe likt aan zijn pik tot haar beloning eruit komt gespoten\n &lt;a href=&quot;\nhttp://bayimg.com/OAMcAAaCp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/OAMcAAaCp&lt;/a&gt;\n\nDeel 2:\nMidden op straat spot Sjors een lekker sportief sletje met een kapotte fiets.\nZe nemen haar mee naar de garage van hun vakantievilla en neuken haar kutje schraal op de werkbank.\nHet sletje laat zich gewillig afwerken en krijgt een flinke lading zaad in haar gezicht gekledderd.\nZe vindt alles prima zolang haar fiets maar gemaakt wordt...\nEen dag later lopen ze door de stad opzoek naar wat lekkers en de twee maten stuiten op een verdrietig chicky.\nDaar weten we wel raad mee! Iedere vrouw houdt van chocola dus Sjimmie laat haar eens lekker aan zijn zwarte pik zuigen.\nHij neukt een grote glimlach op haar gezicht en ze gaat helemaal los!\nMaar dat is niet alles verkleed als politie agent staat Sjors midden op de weg auto's aan te houden.\nEen domme tiener trapt in hun grapje en laat zich naaien!\nZe trekken haar zo uit de auto, nemen haar mee naar de achtertuin van hun vakantie villa en werken haar af op het gras.\nWie wordt er nu genaaid?\n","torrent":{"xt":"urn:btih:a74d87944dc2a76f46f65cb2b2c2f6a871da5b85","amp;dn":"Tieners+Naaien+DVD+1%2B2+-+Dutch+Porn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a74d87944dc2a76f46f65cb2b2c2f6a871da5b85","infoHashBuffer":{"type":"Buffer","data":[167,77,135,148,77,194,167,111,70,246,92,178,178,194,246,168,113,218,91,133]},"announce":[],"urlList":[]}}