{"title":"AutoB+v3-NoGRP","uid":7404340,"size":1291722430,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a76a69bf196b73bb5382601f46189c5181a026f0&amp;dn=AutoB%2Bv3-NoGRP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"xp.home","files":3,"time":1341192265,"description":"Cea mai usoara si sigura cale pentru obtinerea permisului de conducere auto, o reprezinta invatarea cu ajutorul acestui soft, intrucat materialele prezentate in cadrul sau, acopera absolut tot ceea ce are nevoie un cursant pentru a deveni garantat un viitor conducator auto.\nProdusul este insa recomandat si celor ce poseda permis auto si doresc sa fie la curent cu noile reglementari din sistemul rutier.\n\nAjuns la a 3-a versiune, programul autoB+ reprezinta un lider pe piata softurilor de gen, nelipsindu-i din cuprinsul sau animatiile, cursurile, simularile de conducere practica si de examene teoretice generate, legile si documentele necesare dosarului de scolarizare, peste 2000 de intrebari cu explicatii amanuntite, teste psihologice si examinari medicale, etc.\n\nTocmai pentru ca acest program sa devina un bun sfatuitor si profesor pentru cursant, au fost dezvoltate functii prin care autoB+ evalueaza si ofera informatii inca de la inceput legate de evolutia cursantului in cadrul fiecarui capitol accesat, comunica instant care sunt sansele de promovare, ofera posibilitatea programarii examenului auto real, avertizand constant de timpul ramas pana la sustinerea acestuia, etc.\n\nGarantat nu exista pentru viitorii soferi auto de categoria B, un program mai complex si mai complet decat autoB+ 3.\n\nCerinte de sistem:\n1500 Mhz frecventa procesor\n512 Mb memorie RAM\n1 Gb spatiu pe hard disk\n128 Mb memorie placa video\nRezolutie monitor de 1024 x 768\nSistem de operare: Windows XP Service Pack 2, Windows Vista, Windows 7","torrent":{"xt":"urn:btih:a76a69bf196b73bb5382601f46189c5181a026f0","amp;dn":"AutoB%2Bv3-NoGRP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a76a69bf196b73bb5382601f46189c5181a026f0","infoHashBuffer":{"type":"Buffer","data":[167,106,105,191,25,107,115,187,83,130,96,31,70,24,156,81,129,160,38,240]},"announce":[],"urlList":[]}}