{"title":"Mass Casualties: A Young Medic's True Story of Death, Deception,","uid":9052986,"size":4874807,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a7ee1eeb98ea30e5307154140421588c2eae320a&amp;dn=Mass+Casualties%3A+A+Young+Medic%27s+True+Story+of+Death%2C+Deception%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"K-Slender","files":4,"time":1381892532,"description":"Publisher: Adams Media; 1 edition (October 18, 2009)\nLanguage: English\nISBN-10: 1440501831\nISBN-13: 978-1440501838\n\n&quot;Starred Review. When SPC Anthony joined the Army at 18, he went in with high hopes and sterling ideals; coming from a family with a proud military background, Anthony expected to meet mentors, heroes and lifelong friends while earning money for college and becoming a man. What he discovered was a disenchanting web of mundane corruption and self-serving lies. Unlike accounts exposing the military's most shameful iniquities, Anthony's memoir focuses on an endless parade of petty offenses-the cowardice, drug addiction, thievery, adultery and rampant hypocrisy-he found while working in a base hospital. Relentlessly honest and reflective, Anthony's record communicates perfectly the stranglehold of sadness, fear and disappointment that came with his lost innocence; just as worse is his eventual acceptance of the pointless, dysfunctional bureaucracy maintaining the status quo. Avoiding the intensity of the battlefield and the OR itself, Anthony's frustrations resonate with the feelings of any young man learning about the nature of authority and his helplessness before it. Readers curious about the human side of the ongoing Iraqi conflict will be struck by Anthony's strong voice, direct storytelling and stark honesty. &quot; ","torrent":{"xt":"urn:btih:a7ee1eeb98ea30e5307154140421588c2eae320a","amp;dn":"Mass+Casualties%3A+A+Young+Medic%27s+True+Story+of+Death%2C+Deception%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7ee1eeb98ea30e5307154140421588c2eae320a","infoHashBuffer":{"type":"Buffer","data":[167,238,30,235,152,234,48,229,48,113,84,20,4,33,88,140,46,174,50,10]},"announce":[],"urlList":[]}}