{"title":"Mythologies","uid":7857444,"size":276368929,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a850893fda6f0888dbb866bcce70b95ee1176a7f&amp;dn=Mythologies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"cloak-and-dagger","files":-1,"time":1353808815,"description":"&quot;[Mythologies] illustrates the beautiful generosity of Barthes's progressive interest in the meaning (his word is signification) of practically everything around him, not only the books and paintings of high art, but also the slogans, trivia, toys, food, and popular rituals (cruises, striptease, eating, wrestling matches) of contemporary life . . . For Barthes, words and objects have in common the organized capacity to say something; at the same time, since they are signs, words and objects have the bad faith always to appear natural to their consumer, as if what they say is eternal, true, necessary, instead of arbitrary, made, contingent. Mythologies finds Barthes revealing the fashioned systems of ideas that make it possible, for example, for 'Einstein's brain' to stand for, be the myth of, 'a genius so lacking in magic that one speaks about his thought as a functional labor analogous to the mechanical making of sausages.' Each of the little essays in this book wrenches a definition out of a common but constructed object, making the object speak its hidden, but ever-so-present, reservoir of manufactured sense.&quot;--Edward W. Said","torrent":{"xt":"urn:btih:a850893fda6f0888dbb866bcce70b95ee1176a7f","amp;dn":"Mythologies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a850893fda6f0888dbb866bcce70b95ee1176a7f","infoHashBuffer":{"type":"Buffer","data":[168,80,137,63,218,111,8,136,219,184,102,188,206,112,185,94,225,23,106,127]},"announce":[],"urlList":[]}}