{"title":"Rick Atkinson - An Army at Dawn [48] Unabridged (2007)","uid":9533750,"size":564833141,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a886903b54be2693c51e2cbe9ac52183b984931e&amp;dn=Rick+Atkinson+-+An+Army+at+Dawn+%5B48%5D+Unabridged+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rambam1776","files":-1,"time":1390885431,"description":"An Army at Dawn: The War in North Africa, 1942-1943\n\nLiberation Trilogy Volume 1 of 3\n\n48 kbps, Unabridged, Read by George Guidell\n &lt;a href=&quot;\nhttp://www.barnesandnoble.com/w/army-at-dawn-rick-atkinson/1100350844?ean=9780805087246&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.barnesandnoble.com/w/army-at-dawn-rick-atkinson/1100350844?ean=9780805087246&lt;/a&gt;\n\nOverview\nThe Liberation of Europe and the Destruction of the Third Reich is an epic story of courage and calamity, of miscalculation and enduring triumph. In this first volume of the Liberation Trilogy, Rick Atkinson shows why no modern reader can understand the ultimate victory of the Allied powers without a grasp of the great drama that unfolded in North Africa in 1942 and 1943. Opening with the daring amphibious invasion in November 1942, An Army at Dawn follows the American and British armies as they fight the French in Morocco and Algeria, and then take on the Germans and Italians in Tunisia. Battle by battle, an inexperienced and often poorly led army gradually becomes a superb fighting force. At the center of the tale are the extraordinary but flawed commanders who come to dominate the battlefield: Eisenhower, Patton, Bradley, Montgomery, and Rommel. Brilliantly researched, rich with new material and surprising insights, Atkinson's vivid narrative tells the deeply human story of a monumental battle for the future of civilization.\n\n\nWinner of the 2003 Pulitzer Prize for History.\n\nPublishers Weekly\nAtkinson won a Pulitzer Prize during his time as a journalist and editor at the Washington Post and is the author of The Long Gray Line: The American Journey of West Point's Class of 1966 and of Crusade: The Untold Story of the Persian Gulf War. In contrast to Crusade's illustrations of technomastery, this book depicts the U.S. Army's introduction to modern war. The Tunisian campaign, Atkinson shows, was undertaken by an American army lacking in training and experience alongside a British army whose primary experience had been of defeat. Green units panicked, abandoning wounded and weapons. Clashes between and within the Allies seemed at times to overshadow the battles with the Axis. Atkinson's most telling example is the relationship of II Corps commander George Patton and his subordinate, 1st Armored Division's Orlando Ward. The latter was a decent person and capable enough commander, but he lacked the final spark of ruthlessness that takes a division forward in the face of heavy casualties and high obstacles. With Dwight Eisenhower's approval, Patton fired him. The result was what Josef Goebbels called a &quot;second Stalingrad&quot;; after Tunisia, the tide of war rolled one way: toward Berlin. Atkinson's visceral sympathies lie with Ward; his subtext from earlier books remains unaltered: in war, they send for the hard men. Despite diction that occasionally lapses into the melodramatic, general readers and specialists alike will find worthwhile fare in this intellectually convincing and emotionally compelling narrative.","torrent":{"xt":"urn:btih:a886903b54be2693c51e2cbe9ac52183b984931e","amp;dn":"Rick+Atkinson+-+An+Army+at+Dawn+%5B48%5D+Unabridged+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a886903b54be2693c51e2cbe9ac52183b984931e","infoHashBuffer":{"type":"Buffer","data":[168,134,144,59,84,190,38,147,197,30,44,190,154,197,33,131,185,132,147,30]},"announce":[],"urlList":[]}}