{"title":"Doktor Deen Ned.TV Serie DVD 1 2011 DVD5 Audio Ned. TBS","uid":7043874,"size":4042930561,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a8b4e24e50a0d45b985ae6583091d3c86bc173c4&amp;dn=Doktor+Deen+Ned.TV+Serie+DVD+1+2011+DVD5+Audio+Ned.+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"juutje","files":-1,"time":1329657011,"description":"Doktor Deen Ned.TV Serie DVD 1 2011 DVD5 Audio Ned. TBS\n\n\n\nVerhaal: Dokter Deen\n\n\nVerhaal:\nMet trots kondigt MAX haar eerste dramaserie Dokter Deen aan, met in de hoofdrol Monique van de Ven.\nDe serie speelt zich af op het waddeneiland Vlieland.\nMonique van de Ven speelt de huisarts Maria Deen, die naast haar werkzaamheden als arts nog veel meer\nbetekent voor de inwoners van het eiland.\nZij heeft een praktijk aan huis, met een apotheek en een kleine operatiekamer waar\nzij kleine ingrepen kan uitvoeren.\nHet leven op het eiland is een unieke wereld, totaal anders dan het leven op het vasteland.\nMaria Deen is de rots in de branding waar de eilandbewoners en bezoekers voor raad en daad naar toe gaan.\nMaria komt vaak voor moeilijke keuzes te staan. Voor noodgevallen is er aan de wal:al een helikopter,\nmaar die is niet altijd op tijd of kan helemaal niet komen.\nMaria moet dan ook regelmatig alles doen wat in haar macht ligt om levens te redden.\n\n\n\nAflevering 1 - De Storm:\nTijdens een stormachtige nacht zijn er rond Vlieland veel schepen in nood geraakt.\nDe helikopters van de SAR (Search and rescue) hebben het er druk mee.\nEen schip verliest zijn lading tropisch hardhout, die op het strand van Vlieland aanspoelt.\nDat wakkert de Vlielandse koorts aan: het jutten.\nZelfs de kerkdienst wordt ervoor onderbroken.\nWanneer er dan een noodlottig ongeval plaats vindt in de duinen, is er geen helikopter meer\nbeschikbaar om het slachtoffer naar het vasteland te vervoeren.\nDokter Deen moet met alle beperkte middelen die haar te beschikking staan het slachtoffer,\neen goede bekende van de familie, in leven houden.\n\nAflevering 2 - Afscheid:\nMevrouw Nools, een van de oudste gasten van het eiland en goede vriendin van dokter Deen,\nbrengt een onverwacht bezoek aan Vlieland.\nMevrouw Nools is de vrouw die Maria Deen aan haar adoptieouders heeft geholpen.\nNu keert ze terug met een verzoek, dat Maria in grote verlegenheid brengt.\nAan de ene kant wil zij haar weldoenster helpen, aan de andere kant worstelt ze met\nhaar geweten als arts.\nBovendien staan haar persoonlijke gevoelens van genegenheid voor mevrouw Nools haar in de weg.\nBij gebrek aan een dierenarts wordt Maria weggeroepen om een veulen te halen.\n\nAflevering 3 - Jan Barendtz:\nEen dronken dorpsgenoot zorgt voor problemen met een mogelijk fatale afloop.\nMaria Deen weet wat de oorzaak is van zijn drankzucht.\nIsa kampt met het onbegrijpelijke gedrag van haar nieuwe vriend Paul.\nRobbert leert Wendy kitesurfen, en komt daarbij in een:X-XML: hachelijke situatie terecht.\nOndertussen kan Maria maar geen goede afspraak maken met Oscar.\n\n\n\nInfo:\nSpeelduur: 135 Minuten\nBron: Digitale TV - Nederland 1 HD\nGesproken talen: Nederlands\nGeluid: Nederlands Stereo &amp; Dolby Digital 5.1\nBeeld: 16:9\nProductiejaar: 2011\n\nEnjoy the Serie\n\n************************************\n\nKom ook eens kijken :\n &lt;a href=&quot;\nhttp://www.black-sam.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.black-sam.org&lt;/a&gt;\n\nEnjoy\n\n\n\n*************************************","torrent":{"xt":"urn:btih:a8b4e24e50a0d45b985ae6583091d3c86bc173c4","amp;dn":"Doktor+Deen+Ned.TV+Serie+DVD+1+2011+DVD5+Audio+Ned.+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8b4e24e50a0d45b985ae6583091d3c86bc173c4","infoHashBuffer":{"type":"Buffer","data":[168,180,226,78,80,160,212,91,152,90,230,88,48,145,211,200,107,193,115,196]},"announce":[],"urlList":[]}}