{"title":"Eugene McDaniels - Headless Heroes Of The Apocalypse (1971)","uid":9633832,"size":73756139,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a9747876440124da11fbe474a7887a8050e5c212&amp;dn=Eugene+McDaniels+-+Headless+Heroes+Of+The+Apocalypse+%281971%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AaronVincent","files":13,"time":1392822094,"description":"When Headless Heroes of the Apocalypse was first released in 1971, so the legend goes, Spiro Agnew himself called Atlantic Records to complain about the album's incendiary lyrics. Promotional efforts dried up, and since then, the album has become one of the great rare gems of the funk era. With this first-ever CD release from Label M, it is available again in all its strange, eclectic glory. McDaniels had earned his living as a producer and songwriter for artists like Roberta Flack and Gladys Knight, and was in all honesty not much of a singer, but somehow his clumsy lyrics and dry delivery combined to carry his message across. In an unthreatening manner that hardly warranted a call from the White House, McDaniels warns that man's struggles against each other are pointless, as some dark sinister force controls us all (&quot;Headless Heroes&quot;), and that protest without action is futile (&quot;no amount of dancing is going to make us free,&quot; he sings in &quot;Freedom Death Dance&quot;). With a dry wit he recounts an episode of everyday racist brutality in &quot;Supermarket Blues,&quot; and finds simple carnal pleasures in the acoustic folk-flavored &quot;Susan Jane.&quot; It all gets wrapped up in an appealing stew that draws from rock, funk, folk, soul, and even free jazz. Considering the number of times McDaniels' sinewy beats and chunky guitar riffs have been sampled over the years, it's about time a proper re-release allowed listeners to hear the whole picture.","torrent":{"xt":"urn:btih:a9747876440124da11fbe474a7887a8050e5c212","amp;dn":"Eugene+McDaniels+-+Headless+Heroes+Of+The+Apocalypse+%281971%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9747876440124da11fbe474a7887a8050e5c212","infoHashBuffer":{"type":"Buffer","data":[169,116,120,118,68,1,36,218,17,251,228,116,167,136,122,128,80,229,194,18]},"announce":[],"urlList":[]}}