{"title":"Elvis Presley - Pure diamonds box -4cd- (2007)","uid":11838242,"size":460146066,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a985da2fdf9406c304b902ce114e3990cb5d7f03&amp;dn=Elvis+Presley+-+Pure+diamonds+box+-4cd-+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Hounddog","files":70,"time":1429794256,"description":"Title:  Pure Diamonds - The Uncut &amp; Undubbed RCA Studio Sessions   \n  Label:  WLR   \n  Label Number:  2018   \n  Release Date:  2007   \n  Recording Type:  Studio   \n  Location:  Hollywood / Nashville and Memphis   \n  Date:  Various   \n  Sound:  Excellent   \n          \n  Track Listing:   Disc 1:\n\n Almost In Love - If I Were You - Only Believe - Mary In The Morning - You Don't Have To Say You Love Me - I'll Never Know - Just Pretend - Life - Stranger In The Crowd - This Is Our Dance - Heart Of Rome - It's Your Baby , You Rock It - First Time Ever I Saw Your Face - Help Me Make It Trough The Night - Until It's Time For You To Go - It's Only Love - We Can Make The Morning.\n Bonus Track: Britches.\n\n Disc 2:\n\n When I'm Over You - Make The World Go Away - Funny How Time Slips Away - Snowbird - Where Did They Go Lord ? - Rags To Riches - The Sound Of Your Cry - I Washed My Hands In Muddy Water - Patch It Up - It Ain't No Big Thing - Bridge Over Troubled Water - Cindy Cindy - Got My Mojo Working.\n\n Disc 3:\n\n Put Your Hand In The Hand - Reach Out To Jesus - He Is My Everything - There Is No God But God - I , John - Bosom Of Abraham - Put Your Hand In The Hand - Raised On Rock - Just A Little Bit - If You Don't Come Back - Three Corn Patches - Take Good Care Of Her - Find Out What's Happening - I've Got A Thing About You Baby - Just A Little Bit - For Ol' Times Sake - Raised On Rock.\n\n Disc 4:\n\n Twenty Days And Twenty Nights - I've Lost You - I Was Born About Ten Thousand Years Ago - The Sound Of Your Cry - The Fool - Little Cabin On The Hill - Cindy , Cindy - Bridge Over Troubled Water - Got My Mojo Working - How The Web Was Woven - The First Time Ever I Saw Your Face - Untill It's Time For You To Go - Separate Ways - For The Good Times - Where Do I Go From Here - Burning Love - Fool - Always On My Mind - It's A Matter Of Time - For The Good Times - Untill It's Time For You To Go.\n     \nNote:   All songs are undubbed versions !\n  \n All songs can be found on the Pure Diamonds series from Flashback !\n\nBox has a 24 page booklet inside ! \n\n\nEnjoy!\nThanks to the original uploader!\nJeroep","torrent":{"xt":"urn:btih:a985da2fdf9406c304b902ce114e3990cb5d7f03","amp;dn":"Elvis+Presley+-+Pure+diamonds+box+-4cd-+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a985da2fdf9406c304b902ce114e3990cb5d7f03","infoHashBuffer":{"type":"Buffer","data":[169,133,218,47,223,148,6,195,4,185,2,206,17,78,57,144,203,93,127,3]},"announce":[],"urlList":[]}}