{"title":"Mob Rules What the Mafia Can Teach the Legitimate Businessman by","uid":9235254,"size":751251,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ab0ee31cdc84e2c45beff42bb743e33790c0e460&amp;dn=Mob+Rules+What+the+Mafia+Can+Teach+the+Legitimate+Businessman+by&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"420weedman","files":4,"time":1385159572,"description":"The average Mafia don knows more about effective leadership than any Fortune 500 CEO. The Mob is notorious for its cruel and immoral practices, but its most successful members have always been extremely smart businessmen. Now, former mobster Louis Ferrante reveals its surprisingly effective management techniques and explains how to apply them-legally-to any legitimate business. As an associate of the Gambino family, Ferrante relied on his instincts to pull off some of the biggest heists in U.S. history. By the age of twenty-one, he had netted millions of dollars for his employers. His natural talent for management led Mafia bosses to rely on him. After being arrested and serving an eight-and-a-half-year prison sentence, Ferrante went straight. He realized that the Mob's most valuable business lessons would allow him to survive and thrive in the real world. Now he offers eighty-eight time-tested Mafia strategies, including: * Go get your own coffee!: Respecting the chain of command without being a sucker. * The walls have ears: Never bad-mouth the boss. * Is this phone tapped?: Watch what you say every day. * How to bury the hatchet-but not in someone's head. * Don't split yourself in half: The wrong decision is better than none at all. * Don't build Yankee stadium, just supply the concrete: Spotting new rackets. * Leave the gun, take the cannolis...and beware of hubris. Ferrante brings his real-life experiences to the book, offering fascinating advice that really works and sharing behind-the-scenes episodes almost as outrageous as those occurring on Wall Street every day.\n","torrent":{"xt":"urn:btih:ab0ee31cdc84e2c45beff42bb743e33790c0e460","amp;dn":"Mob+Rules+What+the+Mafia+Can+Teach+the+Legitimate+Businessman+by","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab0ee31cdc84e2c45beff42bb743e33790c0e460","infoHashBuffer":{"type":"Buffer","data":[171,14,227,28,220,132,226,196,91,239,244,43,183,67,227,55,144,192,228,96]},"announce":[],"urlList":[]}}