{"title":"The Brothers Grimm - Fairy Stories (Unabridged)","uid":5076011,"size":186537196,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ab3a89878bff6fc1c10029fb07dca38b77382b6f&amp;dn=The+Brothers+Grimm+-+Fairy+Stories+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":4,"uploader":"sheila6","files":33,"time":1251841191,"description":"Audio Books : Childrens : MP3/64Kbps : English\n\n\n\n\nThe Brothers Grimm - Fairy stories (unabridged) - Read by Anna Massey\n\n\nSource Internet\nDuration approx 6:30 hours\nFhG MPEG 1 Layer III 64 Kbps CBR\n44100Hz, 16-bit, Stereo\n\nI found this during an Internet trawl, they purport to be unabridged readings of fairy stories as written by the brothers Grimm, do not expect them to be same as the currently accepted stories, in fact they can be a little bit gruesome, contents as per file list.\n\n\nThe author\n\nThe Brothers Grimm (German: Die BrÃƒÂ¼der Grimm or Die GebrÃƒÂ¼der Grimm), Jacob (January 4, 1785 - September 20, 1863) and Wilhelm Grimm (February 24, 1786 - December 16, 1859), were German academics who were best known for publishing collections of folk tales and fairy tales and for their work in linguistics, relating to how the sounds in words shift over time (Grimm's law).\n\nThey are among the best known story tellers of novellas from Europe, allowing the widespread knowledge of such tales as Rumpelstiltskin, Snow White, Sleeping Beauty, Rapunzel, Cinderella, Hansel and Gretel, and The Frog Prince.\n\n\nThe reader\n\nAnna Raymond Massey, CBE (born 11 August, 1937) is an English actress born in Thakeham, West Sussex, England, the daughter of British actress Adrianne Allen and Canadian-born Hollywood actor Raymond Massey. Her late brother, Daniel Massey, was also an actor. She is the niece of Vincent Massey, a Governor General of Canada.\n\nMassey was on stage as a teenager and made her film debut in 1958. In 1960, she played a potential murder victim in Michael Powell's cult thriller Peeping Tom. She played the role of the cockney barmaid Babs in Alfred Hitchcock's Frenzy (1972). She appeared with her brother Daniel playing deadly siblings in the 1973 horror film\nThe Vault of Horror.\n\nMassey continued to make occasional film and stage appearances, but has worked more frequently in television, in dramas such as The Pallisers (1974), the 1978 adaptation of Rebecca (in which she starred along with her ex-husband, Jeremy Brett), The Mayor of Casterbridge (1978), The Cherry Orchard (1980), and Anna Karenina (1985). She had roles in the British sitcoms The Darling Buds of May (1991) and The Robinsons (2005). She has also appeared in a number of mysteries and thrillers on British television, including episodes of Inspector Morse, The Inspector Alleyn Mysteries, Midsomer Murders, Strange, and Lewis. She is the narrator of This Sceptred Isle on BBC Radio. She also played the part of Josephine Daunt in Daunt and Dervish on BBC radio.\n\nIn 1986, Massey was awarded the British Academy TV Award for Best Actress for her role in Hotel Du Lac.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:ab3a89878bff6fc1c10029fb07dca38b77382b6f","amp;dn":"The+Brothers+Grimm+-+Fairy+Stories+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab3a89878bff6fc1c10029fb07dca38b77382b6f","infoHashBuffer":{"type":"Buffer","data":[171,58,137,135,139,255,111,193,193,0,41,251,7,220,163,139,119,56,43,111]},"announce":[],"urlList":[]}}