{"title":"Climax Blues Band-A Lot Of Bottle(1970)(1990 Rep. Rem.)[EAC-FLAC","uid":4632372,"size":266834774,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ab5a3a064833015a06a698d715eb1b0ae50f8dd1&amp;dn=Climax+Blues+Band-A+Lot+Of+Bottle%281970%29%281990+Rep.+Rem.%29%5BEAC-FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"thewall68","files":27,"time":1231434079,"description":"Releaser: thewall\n\nExtractor: EAC 0.99 prebeta 4  \nRead Mode: Secure with NO C2, accurate stream, disable cache.\nCodec: Flac 1.2.1;  Level 8  \nSource: Original CD \nArtwork:  Full Scans 300dp.\n\n\n\nGeneral Info:\n\n\nLed by Colin Cooper, the former frontman of the R&amp;B unit the Hipster Image, the Stafford, England-based Climax Chicago Blues Band was one of the leading lights of the late-1960s blues boom. A sextet also comprised of guitarists Derek Holt and Peter Haycock, keyboardist Arthur Wood, bassist Richard Jones and drummer George Newsome, the group debuted in 1969 with a self-titled effort recalling the work of John Mayall.\n\nPrior to the release of 1969's Plays On, Jones left the group, prompting Holt to move to bass. In 1970 the Climax Chicago Blues Band moved to the Harvest label, at the same time shifting towards a more rock-oriented sound on the LP A Lot of Bottle. Around the release of 1971's Tightly Knit, Newsome was replaced by drummer John Holt; upon Wood's exit in the wake of 1972's Rich Man, the unit decided to continue on as a quartet, also dropping the &quot;Chicago&quot; portion of their name to avoid confusion with the American band of the same name.\n\nThis album starts out promisingly (and interestingly, and misleadingly) with a cool acoustic number, &quot;Country Hat,&quot; before the amplification gets cranked up and a lot of subtlety goes out the window. Still, this is generally an exciting album, if not always an interesting one. The band plays hard enough on grinding, crunchy shouters like &quot;Reap What I've Sowed&quot; (which features a wondering, soaring solo by Peter Haycock, and a spellbinding performance by Derek Holt on bass), which also parallels Mountain's contemporary release &quot;Mississippi Queen&quot;; and they bring back in that oft-overlooked instrument, the saxophone (played by Colin Cooper), on &quot;Brief Case.&quot; Much of the rest is on the bland side, &quot; &quot;Alright Blue?&quot; being a tedious workout for the harmonica as lead instrument. A couple of Willie Dixon and Muddy Waters covers are more engaging than most of the originals that follow, until the pleasantly loose-limbed closer, &quot;Cut You Loose.&quot;\n\n\n\n\n01. Country Hat\n02. Everyday\n03. Reap What I've Sowed\n04. Brief Case\n05. Alright Blue\n06. Seventh Son\n07. Country Hat (Reprise)\n08. Please Don't Help Me\n09. Morning Noon and Night\n10. Long Lovin' Man\n11. Louisiana Blues\n12. Cut You Loose\n13. Spoonful [Bonus]\n","torrent":{"xt":"urn:btih:ab5a3a064833015a06a698d715eb1b0ae50f8dd1","amp;dn":"Climax+Blues+Band-A+Lot+Of+Bottle%281970%29%281990+Rep.+Rem.%29%5BEAC-FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab5a3a064833015a06a698d715eb1b0ae50f8dd1","infoHashBuffer":{"type":"Buffer","data":[171,90,58,6,72,51,1,90,6,166,152,215,21,235,27,10,229,15,141,209]},"announce":[],"urlList":[]}}