{"title":"Ali Farka Toure debut album [FLAC] TQMP","uid":5629979,"size":299067993,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ac313fb2cfef91b01466192fa0c6dbb567771ebe&amp;dn=Ali+Farka+Toure+debut+album+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"pastafari","files":-1,"time":1276633504,"description":"Ali Farka Toure\n1988\n\nAli Farka Toure's debut album not out here in the open? How come? Not anymore. If you're a fan you should have it. Enjoy!\n\nBrought to you by TQMP\nThe Quality Music Project\n\nInternationally feted at the age of 50, Ali Farka Toure's life was not always so easy. Up till the release of this, his first album, he was virtually unknown in West Africa and a non-entity in the world music community. Before this album bought him fame, if not fortune, Toure's life resembled Amos Tutuola's in Palm Wine Drunkard, a mixture of hard times and legend. What made Toure stand out from the crowd was his mixture of these two elements, a blues-based singing style close to John Lee Hooker and a particularly African choice of subject matter, often rooted in West African myth and folktale. On this release, Toure performs most often unaccompanied relying entirely on the magnetism of his beautiful voice and the counterpoint of his rhythmic guitar. Occasionally, Toure is accompanied by traditional instruments such as calabash or bongos, which he also plays, but the real strength of this album lies in his magnificent voice. While he sings in several different languages, including English, the power and genius of Toure's compositions easily carry through the language barrier. This album inaugurated a new marriage of American blues and African musical traditions of which Toure is the best practitioner\n-- All Music (*****)\n\nAmazon.com essential recording\n\nThis self-titled debut is an amazing collection, spotlighting the Malian guitarist in his full solo acoustic glory for a beautiful, intimate music that recalls American blues. The beauty of Ali Farka Toure lives in Toure's light, nimble touch on the strings as well as his flexible, reedy voice, which both perfectly complement his gentle, ambling rhythmic style. Tastier highlights include the cantering &quot;Tchigi Fo,&quot; with haunting call-and-response sung in Songhai, and the oddly pastoral &quot;Kadi Kadi,&quot; a sweet folk song about an encounter with a young woman and her gift of a gold chain. The Arabic praise song &quot;Bakoye&quot; is a comely love song that pulses with Ali's low, bubbling fingerpicking over which his voice soars in a lovely bucolic melody. &quot;Amandrai,&quot; in both a studio and live version, is the kind of bluesy tune that's made Toure famous and earned him comparisons to Lightnin' Hopkins and John Lee Hooker. And in later releases, we indeed witness the Malian master collaborating with such Western artists as the Chieftains and Taj Mahal, but this loner of a debut features the guitarist's talents in a quietly understated, purely African light.\n-- amazon.com\n\nTracks\n01- Timbarma\n02- Singya\n03- Nawiye\n04- Bakoytereye\n05- Tchigi Fo\n06- Amandrai\n07- Kadi Kadi\n08- Yulli\n09- Bakoye\n10- Amandrai Live\n\nArtwork, EAC log and CUE sheet included.\n\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt; \n\nEnjoy, seed and inhale!\n\nLegalise it!\n\nPastafari Cubensis &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;\nProud Member of the Church of the Flying Spaghetti Monster &lt;a href=&quot;\nhttp://venganza.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://venganza.org&lt;/a&gt;","torrent":{"xt":"urn:btih:ac313fb2cfef91b01466192fa0c6dbb567771ebe","amp;dn":"Ali+Farka+Toure+debut+album+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac313fb2cfef91b01466192fa0c6dbb567771ebe","infoHashBuffer":{"type":"Buffer","data":[172,49,63,178,207,239,145,176,20,102,25,47,160,198,219,181,103,119,30,190]},"announce":[],"urlList":[]}}