{"title":"Boulez Conducts Webern I (1995)","uid":13380130,"size":320837509,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ad7bfc323af9d0fcc3d9681467aeed78c0b4a0d7&amp;dn=Boulez+Conducts+Webern+I+%281995%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Scheheraz","files":75,"time":1454269311,"description":"ANTON WEBERN (1883-1945)\r\nOrchestral, Vocal &amp; Chamber Works\r\n\r\nGramophone {3/1995}:\r\n&quot;It is almost exactly a quarter of a century since Pierre Boulez recorded his complete Webern survey (now available on CD). This new collection, apart from being useful for anyone who doesn't want to buy three whole CDs of Webern, offers an interesting insight into how Boulez's way with a composer probably more central to him than any other has changed.\r\nFor a start he gives him a little more time: most of the pieces here are slightly but significantly slower than they were in 1970. This allows lines to be more subtly moulded, phrases to acquire a touch more poise. This is not to say that Boulez has softened and now phrases Webern as though he were Chopin, but grace and even wit (the second movement of the Quartet) are now noticeable alongside his customary precision. The Ensemble InterContemporain have been playing these pieces constantly since they were first founded, and it shows in the absolute assurance of their performances. The instrumental and choral works are very beautifully played and sung indeed, and anyone grappling with these pieces for the first time (or returning for another attempt) could hardly choose better.\r\nThe songs are good, too, but here a comparison with the 1970 set makes me grateful that I still have a copy of it. Francoise Pollet sings the three earlier groups with precision and an intelligent realization that they often repay quietness, but the distinct break between the two registers of her voice and her not very characterful way with words make her no real rival to Heather Harper, her voice at its most beautiful and her musicianship at its most subtle in the 1970 recordings. The later songs are a real problem: they demand a soprano with an extended range, especially at the top, fearless negotiation of awkward intervals and absolute accuracy of pitch. A sort of 'Webern soprano' developed in response to this, chalk-white and rather antiseptic, and the great benefit of Halina Lukomska in 1970 was that she added verbal responsiveness and even a degree of vocal allure to these necessary but rather chilly qualities. Christiane Oelze has an agreeably child-like quality at times, which helps with the naive folk-texts of some of these songs, but the voice is otherwise pallid and thin. So in all I would buy this disc for the choruses (the BBC Singers: excellent) and the instrumental works; all three are masterpieces, in performances that leave no doubt of that. For the songs Boulez's earlier recordings are much to be preferred.&quot; --Michael Oliver\r\n\r\n• Piano Quintet (1907) [13'11]\r\n• &quot;Entflieht auf leichten Kähnen&quot; op. 2 [2'43]\r\n• 2 Lieder op. 8 [2'19]\r\n• 5 Pieces for Orchestra op. 10 [4'36]\r\n• 4 Lieder op. 13 [7'03]\r\n• 6 Lieder op. 14 [8'12]\r\n• 5 Sacred Songs op. 15 [5'25]\r\n• 5 Canons op. 16 [3'32]\r\n• 3 Traditional Rhymes op. 17 [2'37]\r\n• 3 Lieder op. 18 [3'28]\r\n• 2 Lieder op. 19 [2'24]\r\n• Quartet op. 22 [6'18]\r\n• Concerto op. 24 [6'37]\r\n\r\nFrançoise Pollet, soprano (op. 8, 13, 14)\r\nCristiane Oelze, soprano (op. 15-18)\r\nBBC Singers (op. 2, 19)\r\nPierre-Laurent Aimard, piano\r\nEnsemble InterContemporain\r\nPierre Boulez\r\n\r\nRecording: Paris, IRCAM-Studio / ESPRO, 10/1992\r\nExecutive Producer: Roger Wright\r\nAssociate Producer: Pal Christian Moe\r\nRecording Producer: Karl-August Naegler\r\nTonmeister: Helmut Burk\r\nRecording Engineers: Hans-Rudolf Muller/ Wolf-Dieter Karwatky\r\nEditing: Ingmar Haas\r\n© 1995 Deutsche Grammophon GmbH, Hamburg • [69'25]\r\n437 786-2","torrent":{"xt":"urn:btih:ad7bfc323af9d0fcc3d9681467aeed78c0b4a0d7","amp;dn":"Boulez+Conducts+Webern+I+%281995%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad7bfc323af9d0fcc3d9681467aeed78c0b4a0d7","infoHashBuffer":{"type":"Buffer","data":[173,123,252,50,58,249,208,252,195,217,104,20,103,174,237,120,192,180,160,215]},"announce":[],"urlList":[]}}