{"title":"TVO-Big Ideas,Sept 26, 2009: A Crisis in Leadership, Naomi Klein","uid":5102364,"size":186352216,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ada13ebfcf85fdd999c4d4d84c06fb8818859e71&amp;dn=TVO-Big+Ideas%2CSept+26%2C+2009%3A+A+Crisis+in+Leadership%2C+Naomi+Klein&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Temptation","files":1,"time":1254084910,"description":"[b]TVO - Big Ideas, September 26, 2009: A Crisis in Leadership (with Naomi Klein)[/b]\n\nIntellectual heavyweights John Ralston Saul, Naomi Klein, Margaret MacMillan and Adam Gopnik discuss 'A Crisis in Leadership' at the Globe and Mail Open House Festival. The panelists reflect on what constitutes a good leader and why some leaders fail while others thrive. Journalist Carol Off is the moderator.\n\nFor more information on this episode, including information on the guests and various other resources and links, visit the [url=http://www.tvo.org/TVOsites/WebObjects/TvoMicrosite.woa?bigideas]episode webpage[/url]\n\n-----\n\nNote:  This is an iPod video podcast that is available for free download from the website.  Quality is good.  Audio podcast (mp3 format) is also available for free download.  \n\nType: m4v file\nSize: 177MB\nRuntime: 00:54:50\nVideo: MPEG4 Video (H264) 320x240 \nAudio: AAC 32000Hz mono 48Kbps \n\nDownload this episode using the attached torrent file or download it directly using this link: &lt;a href=&quot;\nhttp://feeds.tvo.org/~r/tvobigideasVideo/~5/Ui6FzonOCW0/BI_Full_20090926_834128_LeadershipCrisis_320x240_404k.m4v&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://feeds.tvo.org/~r/tvobigideasVideo/~5/Ui6FzonOCW0/BI_Full_20090926_834128_LeadershipCrisis_320x240_404k.m4v&lt;/a&gt;\n\nYou can also watch a flash video of this lecture through your web-browser here: &lt;a href=&quot;\nhttp://www.tvo.org/TVO/WebObjects/TVO.woa?video?BI_Full_20090926_834128_LeadershipCrisis&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tvo.org/TVO/WebObjects/TVO.woa?video?BI_Full_20090926_834128_LeadershipCrisis&lt;/a&gt;\n\n-----\n\nThis program was taped in May of this year, and Naomi Klein is the best thing about it. Viewing this now a couple of months after it was taped, Naomi Klein's comments in this discussion and her wariness about The Hope-and-Change Messiah, Obama turn out to have been incredibly prescient now that it has become quite apparent that &quot;The Obama, who won an election by treating America to a year-long self-help seminar and then made off with the registration fees&quot;, to quoteor to beglib[/url], now that American liberals are &quot;confronted with the titanic failure of the Obama administration to live up to a single one of his progressive supporters' more or less fervent dreams&quot;.\n\nNot only does Naomi Klein correctly identify the main problem as structural rather than a question of &quot;leadership&quot; but she also correctly identifies the need for the existence of a strong left consisting of social movements and organizations to apply pressure on the Democrats and on Obama to force the Democrats to actually enact progressive policies.  Otherwise, as the events of the last few months have demonstrated, the Democrats do what they and other political parties always do by default, i.e., side with capital, wealth and power.  \n\nUnfortunately, because because most intellectuals and media elites are themselves an elite class who are beneficiaries of the system as it exists, none of the the so-called &quot;intellectual heavyweights&quot; on the panel, with the slight exception of perhaps John Ralston Saul, are particularly interested in or even ideologically capable of understanding Naomi Klein's substantial critiques about structural problems of that said system, such as the ability of elites with wealth and power to corrupt and rig the political and economic system to benefit themselves at the expense of everyone else. Intellectuals move around the same circles of power with other political, corporate and media elites, and so they view the world through the very elitest, ideological blinders that Klein is trying to critique and shatter.  She deserves credit for putting up a good fight though. And this bears repeating: she was right. \n\n[b]Resources and links to related material[/b]\n\n1) [url=https://onebigtorrent.org/torrents/5411/TVO--Big-Ideas-May-16-2009-John-Ralston-Saul-on-what-defines-Canada-as-a-nation]TVO - Big Ideas, May 16, 2009: John Ralston Saul on what defines Canada as a nation[/url]\n\n2) Building on Naomi Klein's points in this discussion, read [url=http://stopmebeforeivoteagain.org/stopme/]this excellent piece[/url] to understand how the American political system really works, to understand American political history and the long, sordid history of the Democratic party and its long track-record of betrayals of the left, and to understand how crucial bottom-up grass-roots activism, existence of third parties and pressure from a strong left were in bringing about civilizing, social progress like civil rights and in forcing the Democratic party to push through progressive policies like the New Deal and the Civil Rights Act\n\n3)Perrin - That Thing With Feathers[/url] \n\n4) [url=http://prorev.com/2008/11/can-we-talk-about-real-obama-now.html]Sam Smith - Can We Talk About The Real Obama Now?[/url]\n\n5) [url=http://www.chris-floyd.com/component/content/article/3-articles/1732-beyond-here-lies-nothing-surging-further-into-the-abyss.html]Chris Floyd - Beyond Here Lies Nothing: Surging Further Into the Abyss[/url]\n\n6) [url=http://www.truthdig.com/report/item/20081020_the_idiots_who_rule_america/]Chris Hedges - The Idiots Who Rule America[/url]\n\n[url=http://www.truthdig.com/report/item/20090810_nader_was_right_liberals_are_going_nowhere_with_obama/]Chris Hedges -  Nader Was Right: Liberals Are Going Nowhere With Obama[/url]\n\n7)- Making Him Do It[/url]\n\n-----\n\n[b]TVO - Big Ideas[/b]\n\nTELEVISION FOR PASSIONATE THINKERS\n\n[quote]I had never seen your program before, in fact I had never even heard of it. I was fortunate enough to tune in today ... Nothing is quite as nourishing as food for thought.\n-Brian, Big Ideas viewer[/quote]\n\n[quote]I have been off and on social assistance for several years. When I watch your show, I really am in university (a place I badly miss) and I don't feel so poor.\n-Gillian, Big Ideas viewer[/quote]\n\n[quote]... Were it not for Big Ideas to bring this to our attention we would be clueless. You are doing important work and those of us that are fortunate enough to catch your program, greatly appreciate your efforts.\n-Gary, Big Ideas viewer[/quote]\n\nBIG IDEAS, now in its eighth season, has an increasingly loyal following, exemplified by viewers such as Brian, Gillian and Gary. The program started in a late, late-night time slot with - among other offerings - the literary lectures by Robert Adams. It is now an established part of our weekend schedule, airing at 4pm on Saturday, with a repeat broadcast on Sunday, also at 4:00 pm. As TVO's educational mandate grew, so did the concept for BIG IDEAS, explains producer Wodek Szemberg: &quot;We have recognized from the passionate viewer response that there was a real niche for this kind of unapologetically intellectual programming.&quot; BIG IDEAS podcasts are among the most popular TVO web offerings.\n\n&quot;BIG IDEAS is a showcase of ideas that shape our public debates. At their best the lectures featured on the program expose us to the differing ways of defining what matters and how that affects our understanding of the world as it is and as it is likely to be,&quot; adds Szemberg. &quot;Each age has a set of questions by which it defines itself. If, 50 years from now, someone came across a list of BIG IDEAS shows, they would have a pretty good idea of what people thought about and debated in the early 2000s.&quot;\n\nBy nature of its lecture format, pacing and inquisitive approach, it is the antithesis of the prevailing sound-bite television norm. Engaging, articulate speakers stand behind lecterns across the province addressing audiences - a stark, on-air aesthetic running counter to fast edits and whizzy sound effects. The simple, bold concept, a victory of substance over style, has found an appreciative following. The success of this public television offering is testimony to our viewers need for nothing but intelligent discussion with perhaps a dash of personality and humour. At a time when much television programming induces in many viewers feelings of guilt, BIG IDEAS is as guilt-free television experience as it is possible to imagine.\n\nBIG IDEAS offers a variety of thought-provoking topics which range across politics, culture, economics, art history, science.... The program has introduced Ontario viewers to the impressive brainpower of people like Niall Ferguson on American empire, Daniel Libeskind on architecture, Robert Fisk on the Middle East, George Steiner on the demise of literacy, Camille Paglia on aesthetic education, Tariq Ramadan on being a Western Muslim, Noam Chomsky on U.S. politics, Leon Kass on dying, Janice Stein on accountability and governance.\n\nThe public face of the program is Andrew Moodie, who assumed the hosting duties for BIG IDEAS on January 7, 2006. You may recognize him as one of the three jurors who helped us to come up with the 10 finalists in 2005's Best Lecturer Competition, or you may know him as a gifted actor and playwright.\n\nTVO's [b]Big Ideas[/b] website:  [url]http://www.tvo.org/TVOsites/WebObjects/TvoMicrosite.woa?bigideas[/url]\n","torrent":{"xt":"urn:btih:ada13ebfcf85fdd999c4d4d84c06fb8818859e71","amp;dn":"TVO-Big+Ideas%2CSept+26%2C+2009%3A+A+Crisis+in+Leadership%2C+Naomi+Klein","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ada13ebfcf85fdd999c4d4d84c06fb8818859e71","infoHashBuffer":{"type":"Buffer","data":[173,161,62,191,207,133,253,217,153,196,212,216,76,6,251,136,24,133,158,113]},"announce":[],"urlList":[]}}