{"title":"[Greg Olson]David Lynch Beautiful Dark (Scarecrow Filmmakers Ser","uid":11461436,"size":5443035,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ae692cf1cdbef4280051a0e4372c76c3055fc1c0&amp;dn=%5BGreg+Olson%5DDavid+Lynch+Beautiful+Dark+%28Scarecrow+Filmmakers+Ser&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":1,"time":1415992691,"description":"For nearly 40 years, David Lynch's works have enthralled, mystified, and provoked viewers. Lynch's films delve into the subjective consciousness of his characters to reveal both the depraved darkness and luminous spirituality of human nature. From his experimental shorts of the 1960s to feature films like Eraserhead, The Elephant Man, Blue Velvet, Mulholland Drive, and INLAND EMPIRE, Lynch has pushed the boundaries of cinematic storytelling. In David Lynch: Beautiful Dark, author Greg Olson explores the surreal intricacies of the director's unique visual and visceral style not only in his full-length films but also his early forays into painting and short films, as well as his television landmark, Twin Peaks. This in-depth exploration is the first full-length work to analyze the intimate symbiosis between Lynch's life experience and artistic expressions: from the small-town child to the teenage painter to the 60-year-old Internet and digital media experimenter. To fully delineate the director's life and art, Olson received unprecedented participation from Lynch, his parents, siblings, old school friends, romantic partners, children, and decades of professional colleagues, as well as on-set access to the director during the production of Twin Peaks: Fire Walk with Me. Throughout this study, Olson provides thorough analyses of the filmmaker's works as Lynch conceived, crafted, and completed them. Consequently, David Lynch: Beautiful Dark is the definitive study of one of the most influential and idiosyncratic directors of the last four decades.\n\nReview\nA thorough-going critical study of Lynch's works in all media that is firmly embedded in a clear biographical narrative and backed by lengthy interviews with almost everyone in his life...The result is exactly the kind of complex, keen-eyed but sympathetic critical biography one wishes every great filmmaker could receive. Dga Quarterly With unprecedented access to Lynch, his parents, family, and colleagues, Olson has captured and defined the raw, mysterious energy that flows through the works of this iconoclastic auteur. College &amp; Research Libraries News, February 2009 Olson's comprehensive biography of this highly original filmmaker contains a wealth of information, much of it previously unpublished. CHOICE, June 2009 Simply put, the book, &quot;Beautiful Dark&quot; by Greg Olsen is a work of art...The one thing that hits you about this book is the amount of passion that Olsen has put into his work...Olsen covers nearly every imaginable work that Lynch has ever done to date and does so with great enthusiasm and passion. He insightfully moves between Lynch's works with a precision that is both refreshing and exhaustive at the same time. The result is a chance between two worlds...into a place where no one has gone before...So if you were hesitating picking this one up, as Coop would say, &quot;Every day, once a day, give yourself a present...&quot; And grab this book today! -- Brian Kursar Dugpa.Com, 10/4/08\n\nAbout the Author\nGreg Olson is the Film Curator of the Seattle Art Museum. He has written on film for several publications including The Seattle Times, Moviemaker, Premiere and Film Comment. He has contributed to the books Vietnam War Films and Contemporary Literary Criticism. He is a board member of the Film Noir Foundation and a juror for the American Film Institute's annual 100 Years...100 Movies television programs.\n\nPublisher: Scarecrow Press (28 September 2008)\nLanguage: English\nISBN-10: 0810859173\nISBN-13: 978-0810859173","torrent":{"xt":"urn:btih:ae692cf1cdbef4280051a0e4372c76c3055fc1c0","amp;dn":"%5BGreg+Olson%5DDavid+Lynch+Beautiful+Dark+%28Scarecrow+Filmmakers+Ser","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae692cf1cdbef4280051a0e4372c76c3055fc1c0","infoHashBuffer":{"type":"Buffer","data":[174,105,44,241,205,190,244,40,0,81,160,228,55,44,118,195,5,95,193,192]},"announce":[],"urlList":[]}}