{"title":"A Spoonful of Sugar - Brenda Ashford.epub","uid":9481265,"size":921253,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:af399ea49e2b5706484489a53a012d84ea9ee657&amp;dn=A+Spoonful+of+Sugar+-+Brenda+Ashford.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1389801750,"description":"From Britain's beloved oldest living nanny comes a charming and uplifting memoir of a real-life Mary Poppins.\n\nIn her extraordinary memoir, Brenda Ashford shares her endearing and amusing experiences as a British nanny caring for generations of children over the past sixty-two years.\n\nBrenda's lifelong love for children began the minute she laid eyes on her baby brother, David. As a teenager, she applied to London's Norland College, famous for producing top-class nannies, and, after a grueling interview, she was accepted on scholarship. It was a radical change from her idyllic country life in the village of Surrey. The training was rigorous and discipline strictly enforced, as Brenda and her classmates scrambled to pass inspections on everything from morality and neatness to needlework and pram pushing. Meanwhile, World War II began, and Brenda's heart was broken twice. She vowed never to fall for a man again and devoted her life to caring for other people's children, never having any of her own.\n\nBrenda's memoir offers readers an enticing glimpse into the joys, frustrations, adventures, and mishaps of children of all ages and situations. She peppers her story with delightful bits of cultural history and timeless life lessons. A Spoonful of Sugar is an irresistible Mary Poppins story that will touch your heart and remind you of what is truly important in life.","torrent":{"xt":"urn:btih:af399ea49e2b5706484489a53a012d84ea9ee657","amp;dn":"A+Spoonful+of+Sugar+-+Brenda+Ashford.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af399ea49e2b5706484489a53a012d84ea9ee657","infoHashBuffer":{"type":"Buffer","data":[175,57,158,164,158,43,87,6,72,68,137,165,58,1,45,132,234,158,230,87]},"announce":[],"urlList":[]}}