{"title":"James Plunkett - Strumpet City (epub, mobi)","uid":8274214,"size":1561286,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:af4331084d074492a132d4d0830177add87a4f24&amp;dn=James+Plunkett+-+Strumpet+City+%28epub%2C+mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1363675608,"description":"The Dublin: One City, One Book initiative for 2013 has chosen Strumpet City as its book this year, in commemoration of the centenary of the 1913 Lockout. Events connected with the novel will take place throughout Dublin, 1 April - 30 April 2013.\n\n---\n\nJames Plunkett - Strumpet City (Gill &amp; McMillan, 2012; first published 1969).\n\nHigh quality epub and mobi formats.\n\nSet in Dublin during the Lockout of 1913, Strumpet City is a panoramic novel of city life. It embraces a wide range of social milieux, from the miseries of the tenements to the cultivated, bourgeois Bradshaws. It introduces a memorable cast of characters: the main protagonist, Fitz, a model of the hard-working, loyal and abused trade unionist; the isolated, well-meaning and ineffectual Fr O'Connor; the wretched and destitute Rashers Tierney. In the background hovers the enormous shadow of Jim Larkin, Plunkett's real-life hero.\n\nStrumpet City's popularity derives from its realism and its naturalistic presentation of traumatic historical events. There are clear heroes and villains. The book is informed by a sense of moral outrage at the treatment of the locked-out trade unionists, the indifference and evasion of the city's clergy and middle class and the squalor and degradation of the tenement slums.\n\nAbout the Author\n\nThe late James Plunkett drew on his city-centre working-class background, and his commitment to the labour movement, as the background for his fiction. Strumpet City is acknowledged as his masterpiece. His other novels include Farewell Companions and The Circus Animals. He was an accomplished short-story writer and also wrote for radio and theatre.\n\n---\n\nNote: Strumpet City was adapted by RTE into a popular television series in 1980; it's available here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5202865&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5202865&lt;/a&gt;","torrent":{"xt":"urn:btih:af4331084d074492a132d4d0830177add87a4f24","amp;dn":"James+Plunkett+-+Strumpet+City+%28epub%2C+mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af4331084d074492a132d4d0830177add87a4f24","infoHashBuffer":{"type":"Buffer","data":[175,67,49,8,77,7,68,146,161,50,212,208,131,1,119,173,216,122,79,36]},"announce":[],"urlList":[]}}