{"title":"Litres.ru - 4316 fiction ebooks on russian","uid":4260916,"size":934510294,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:af6041ea4a15eb8c11852099d6db778283a8b92f&amp;dn=Litres.ru+-+4316+fiction+ebooks+on+russian&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bill_g","files":27,"time":1214472460,"description":"The company &quot;LitRes&quot; formed by the creators of digital libraries FictionBook.lib, Aldebaran, Litportal, Bookz.ru and Fenzin. \n\nWhen digital libraries born only when the first texts appeared on the network - it was a hobby for us. Pleasant and useful thing that can be practised at leisure. Neobremenitelnym, but a useful hobby. Someone has to crawl, someone deducted and formatting, someone created a library. Time was, the number and variety of texts on the Net grew, the demands of users, and their number is growing. Despite the growing number of enthusiasts-scanners meet the needs of the inhabitants of the network is becoming increasingly difficult. Yes and the growing number of people involved in electronic books, not the best way impact on their quality. \n\nIn 2006 - year finally became clear that further development of digital libraries on &quot;spontaneous&quot; road does not lead anywhere. Volumes of interest to our readers of literature is enormous and continues to grow. Users who use libraries to polistat book before buying the paper copies, even more numerous and their queries even in the first approximation no enthusiasts are unable to meet. \n\nIn addition to these, purely technical difficulties and limitations, electronic libraries have another weakness - uncertain relationship with the law. Suffice it was conducting an aggressive policy of one company, and a unique electronic text Russian public repository has been threatened with destruction and conversion to underground situation (that from the perspective of an ordinary user the same). \n\nCorrect legal clearance, transparent financial activities and coordination of work - all this required the establishment of libraries and the legal form of our merger, which was Ltd. &quot;LitRes&quot;. \n\n\n\nThe mission &quot;LitRes&quot; \nAs their time in cars, enthusiasts gathered in personal shops, factories shifted to a conveyor, and electronic texts should become of amateurishness in the industry, if we want to receive them in sufficient quantity and quality. \nWe want users of the Network could always read any book, issued on paper. Not in a year when there enthusiast who otskaniruet her, and immediately. \nWe want electronic texts were of good quality. Without omissions, errors and other recognition ogrehov common to today&amp;#039;s electronic books. \nWe want to see any book was available network without any user dangerous excursions to sites of hackers, spammers and other swindler. \nAnyone using a standard browser should be able to read any of our books free of charge, and we calculate it with the author contributions to advertising. \nWe want authors receive fair remuneration for their work. We will allocate money to the authors, not only for direct sales, but also for displaying advertisements on the pages of their books. Users will be able to CPC for a fair price to buy paper for comfortable reading offline-and not having the willingness / ability to pay will be able to thank the author of his attention to the banners. \n\n\n\nThe philosophy of the &quot;LitRes&quot; \n&quot;LitRes&quot; - Internet company legal business. Since the state, writers, publishers and readers we are in a relationship, the relevant moral and ethical standards, the requirements of legislation and regulations mezhkorporativnyh relations. &quot;LitRes&quot; sells electronic copies of books only upon the rights of their rights holders (authors or publishers). We have formalized relations with the sponsors, paying royalties as well as all the necessary taxes and royalties. We do not give reasons for discontent authors LitResom, they willingly signed contracts with us. Detailed information is available to authors on the site AA PI through which we get the right of individuals. \n&quot;LitRes&quot; supports the free circulation of texts. In agreement with the author, we have to spread his works in the Internet libraries, with the possibility of free reading. Also spread for free reading and books from the Public Domain (literary classics). \n&quot;LitRes&quot; legally provides free access even to those books, which the author provided on a fee basis. In this case, the author fee is paid from profits from advertising on sites &quot;LitResa&quot;. \n&quot;LitRes&quot; doing everything possible to improve the quality of texts. In most cases LitRes sells electronic document in author or publishing the editorial. \nThe strategy &quot;LitRes&quot; - the constant growth of quality of service. Low prices, ease of payment, a wide choice of formats, convenience and ease of navigation - we are doing everything so that users can quickly and easily read any book from the vast array of Internet libraries LitResa. \n&quot;LitRes&quot; ready to cooperate with all who value intellectual labour writer and considers it necessary to reward the sponsors for their creativity. We agree to cooperate with any resources that will transmit reward authors collected on loan, sponsorship or any other basis. \n&quot;LitRes&quot; will take steps to curb the activities of Internet publishers, parasitic on theft texts of books and non-payment of royalties.\n\n\n\n\nlisting:\n\n","torrent":{"xt":"urn:btih:af6041ea4a15eb8c11852099d6db778283a8b92f","amp;dn":"Litres.ru+-+4316+fiction+ebooks+on+russian","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af6041ea4a15eb8c11852099d6db778283a8b92f","infoHashBuffer":{"type":"Buffer","data":[175,96,65,234,74,21,235,140,17,133,32,153,214,219,119,130,131,168,185,47]},"announce":[],"urlList":[]}}