{"title":"Sin City - That Yellow Bastard (Book4)","uid":4836411,"size":47964076,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:afbe516791f624658216631e365138152fec9e78&amp;dn=Sin+City+-+That+Yellow+Bastard+%28Book4%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"DrinkyCrow","files":7,"time":1239332348,"description":"Issues #1-6 of 6.\n\nThat Yellow Bastard\nFirst published in February 1996-July 1996, That Yellow Bastard is a six-issue comic book miniseries, and the sixth in the Sin City series. It follows the usual black and white noir style artistry of previous Sin City novels. That Yellow Bastard is currently under publication by Dark Horse Comics; the first edition became available in July 1997 (ISBN 1-56971-225-5).\n\nThe story begins more than eight years before any other Sin City book takes place, with possibly the most noble, and heroic protagonist in the Sin City universe, a policeman known as John Hartigan (suffering from severe angina problems) on his final mission before his forced retirement. Roark Junior, son of one of the most powerful and corrupt officials in Basin City, is indulging his penchant for raping and murdering pre-pubescent girls. It is Hartigan's mission to rescue Junior's latest quarry, a thin eleven-year-old named Nancy Callahan.\n\nAmazon.com\nIn a Sin City short story, &quot;The Babe Wore Red,&quot; Frank Miller deviated from his stark black-and-white artwork by adding tiny bits of color throughout the story. The girl's dress was red, her lips were red--you get the picture. In That Yellow Bastard, the fourth Sin City graphic novel, Miller's experiment with yellow ink is also a tremendous success. The setup is simple. On the last day before he retires, Hartigan, an old cop, gets a call about an 11-year-old girl who has been kidnapped by a lunatic. Hartigan has got just one more thing to do before he retires: save the girl. Saving her is the easy part, because Hartigan has uncovered something really bad that is not going to stop until it catches up with him. That Yellow Bastard is nerve-racking to the very end.\n\nBook Description\nJust one hour to go. Hartigan's polishing his badge and working himself up to kissing it good-bye, it and the thirty-odd years of protecting and serving and tears and blood and triumph that it represents. He's thinking about his wife's slow smile, about the thick, fat steaks she's picked up at the butcher's, about the bottle of champagne she's got packed in ice, about sleeping in till ten in the morning and spending sunny afternoons flat on his back. Just one hour to go and he gets word from a stoolie about that one loose end he hasn't tied up, a young girl who's out there, helpless in the hands of a drooling lunatic. Just one hour to go . . . and he's gonna go out with a bang.","torrent":{"xt":"urn:btih:afbe516791f624658216631e365138152fec9e78","amp;dn":"Sin+City+-+That+Yellow+Bastard+%28Book4%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afbe516791f624658216631e365138152fec9e78","infoHashBuffer":{"type":"Buffer","data":[175,190,81,103,145,246,36,101,130,22,99,30,54,81,56,21,47,236,158,120]},"announce":[],"urlList":[]}}