{"title":"Donald Harington - The Nearly Complete Works (epub, mobi)","uid":8796459,"size":21489787,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:affb3ebfaa651d0cd8e53146d8c077333bad51a6&amp;dn=Donald+Harington+-+The+Nearly+Complete+Works+%28epub%2C+mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1376090021,"description":"Donald Harington - The Nearly Complete Works (3 volumes) (AmazonEncore, 2012).\n\nEpub and mobi files from a retail source.\n\n\n\nDonald Harington is one of the finest, and yet least known, American novelists. This definitive collection of Harington's novels includes a new foreword by Ron Rash, the author of The Cove, and an Introduction by Peter Straub, the bestselling author of many books, including Ghost Story and Shadowland.\n\nAs Ron Rash writes in his Foreword, &quot;No oeuvre in American literature, past or present, can equal the combination of joy, humor, and wonder contained in Donald Harington's fifteen novels. He is America's Chaucer.&quot; This collection offers readers the opportunity to discover the fictional town of Stay More in the Arkansas Ozarks, the setting of most of Harington's books, and enjoy an underappreciated treasure of American literature.\n\nVolume 1 includes five complete novels: (1) Lightning Bug; (2) Some Other Place. The Right Place; (3) The Architecture of the Ozarks; (4) The Cockroaches of Stay More; (5) The Choiring of the Trees.\n\nVolume 2 includes five complete novels: (1) Ekaterina; (2) Butterfly Weed; (3) When Angels Rest; (4) Thirteen Albatrosses (or, Falling off the Mountain); (5) With.\n\nVolume 3 includes five complete novels: (1) The Pitcher Shower; (2) Farther Along; (3) Enduring; (4) Let Us Build Us a City; (5) The Cherry Pit.\n\nAbout the Author\n\nAlthough he was born and raised in Little Rock, Donald Harington spent nearly all of his early summers in the Ozark mountain hamlet of Drakes Creek, his mother's hometown, where his grandparents operated the general store and post office. There, before he lost his hearing to meningitis at the age of twelve, he listened carefully to the vanishing Ozark folk language and the old tales told by story-tellers. His academic career is in art and art history and he has taught art history at a variety of colleges, including his alma mater, the University of Arkansas. His first novel was published by Random House in 1965, and since then he has published twelve other novels, most of them set in the Ozark hamlet of his own creation, Stay More, based loosely upon Drakes Creek. He has also written books about artists. He won the Robert Penn Warren Award in 2003, the Porter Prize in 1987, the Heasley Prize at Lyon College in 1998, was inducted into the Arkansas Writers' Hall of Fame in 1999 and that same year won the Arkansas Fiction Award of the Arkansas Library Association. He has been called &quot;an undiscovered continent&quot; (Fred Chappell) and &quot;America's Greatest Unknown Novelist&quot; (Entertainment Weekly).","torrent":{"xt":"urn:btih:affb3ebfaa651d0cd8e53146d8c077333bad51a6","amp;dn":"Donald+Harington+-+The+Nearly+Complete+Works+%28epub%2C+mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"affb3ebfaa651d0cd8e53146d8c077333bad51a6","infoHashBuffer":{"type":"Buffer","data":[175,251,62,191,170,101,29,12,216,229,49,70,216,192,119,51,59,173,81,166]},"announce":[],"urlList":[]}}