{"title":"Paranormality: Why We See What Isn't There -epub","uid":8185116,"size":1063189,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b061818096df41c80d8f7cfac3e5b1904c684942&amp;dn=Paranormality%3A+Why+We+See+What+Isn%27t+There+-epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bookzilla","files":1,"time":1361666411,"description":"People are emotionally drawn to the supernatural. They actively want weird, spooky things to be true ...Wiseman shows us a higher joy as he deftly skewers the paranormal charlatans, blows away the psychic fog and lets in the clear light of reason&quot;. (Richard Dawkins, Professor). Richard Wiseman is clear about one thing: paranormal phenomena don't exist. But in the same way that the science of space travel transforms our everyday lives, so research into telepathy, fortune-telling and out-of-body experiences produces remarkable insights into our brains, behaviour and beliefs. &quot;Paranormality&quot; embarks on a wild ghost chase into this new science of the supernatural and is packed with activities that allow you to experience the impossible. So throw away your crystals, ditch your lucky charms and cancel your subscription to &quot;Reincarnation Weekly&quot;. It is time to discover the real secrets of the paranormal. Learn how to control your dreams - and leave your body behind. Convince complete strangers that you know all about them. Unleash the power of your unconscious mind.\n \n","torrent":{"xt":"urn:btih:b061818096df41c80d8f7cfac3e5b1904c684942","amp;dn":"Paranormality%3A+Why+We+See+What+Isn%27t+There+-epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b061818096df41c80d8f7cfac3e5b1904c684942","infoHashBuffer":{"type":"Buffer","data":[176,97,129,128,150,223,65,200,13,143,124,250,195,229,177,144,76,104,73,66]},"announce":[],"urlList":[]}}