{"title":"Criticism of the Western Civilization-Col. 68 (American Issues7)","uid":14569764,"size":96435558,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b0c47e4d2beb7fb5227effbd698422d76bbaaf5b&amp;dn=Criticism+of+the+Western+Civilization-Col.+68+%28American+Issues7%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"moman73","files":35,"time":1462790880,"description":"Criticism of the Western Civilization - Collection 68 (American Issues 7):\r\n\r\nWe have 35 titles here:\r\n\r\n-  Brueggemann - Rich, Free, and Miserable; the Failure of Success in America (2010)\r\n\r\n-  Burt - American Hysteria; the Untold Story of Mass Political Extremism in the United States (2015)\r\n\r\n-  Clear &amp; Frost - The Punishment Imperative; the Rise and Failure of Mass Incarceration in America (2014)\r\n\r\n-  Cohn - The President's First Year; None Were Prepared, Some Never Learned ... (2016)\r\n\r\n-  Cost -  A Republic No More; Big Government and the Rise of American Political Corruption (2015)\r\n\r\n-  Davis - Arbitrary Justice; the Power of the American Prosecutor (2007)\r\n\r\n-  De Leon - The Land of Open Graves; Living and Dying on the Migrant Trail (2015)\r\n\r\n-  Duncan - Gambling with the Myth of the American Dream (2015)\r\n\r\n-  Ferguson - Inferno; an Anatomy of American Punishment (2014)\r\n\r\n-  Francis - The Great American Health Hoax; the Surprising Truth About How Modern Medicine Keeps You Sick (2014)\r\n\r\n-  Gutierrez - To Sin Against Hope; How America Has Failed its Immigrants (2013)\r\n\r\n-  Hartman - A War for the Soul of America; a History of the Culture Wars (2015)\r\n\r\n-  Howard - The Death of Common Sense; How Law Is Suffocating America (2011)\r\n\r\n-  Howell - The History of Street Gangs in the United States; Their Origins and Transformations (2015)\r\n\r\n-  Jones - A Dreadful Deceit; the Myth of Race from the Colonial Era to Obama's America (2013)\r\n\r\n-  Katakis - A Thousand Shards of Glass; There is Another America (2014)\r\n\r\n-  Kellerman - Hard Times; Leadership in America (2015)\r\n\r\n-  Krugman - The Great Unraveling; Losing our Way in the New Century (2003)\r\n\r\n-  Kupelian - The Snapping of the American Mind; Healing a Nation Broken by a Lawless Government and Godless Culture (2015)\r\n\r\n-  Lessig - Republic Lost; the Corruption of Equality and the Steps to End It, rev. ed. (2015)\r\n\r\n-  Levine - American Insecurity; Why Our Economic Fears Lead to Political Inaction (2015)\r\n\r\n-  Lunbeck - The Americanization of Narcissism (2014)\r\n\r\n-  Moliterno - The American Legal Profession in Crisis; Resistance and Responses to Change (2013)\r\n\r\n-  Nader - Return to Sender; Unanswered Letters to the President, 2001-2015 (2015)\r\n\r\n-  Nye - Is the American Century Over (2015)\r\n\r\n-  Paul - Government Bullies; How Everyday Americans Are Being Harassed, Abused, and Imprisoned by the Feds (2012)\r\n\r\n-  Piereson - Shattered Consensus; the Rise and Decline of America's Postwar Political Order (2015)\r\n\r\n-  Rank - American History &amp; Donald Trump; a History Professor Explores the 200-Year-Old Roots of the Trump Campaign (2016)\r\n\r\n-  Root - Over-Rules; the Long War for Control of the U.S. Supreme Court (2014)\r\n\r\n-  Rothkopf - National Insecurity; American Leadership in an Age of Fear (2014)\r\n\r\n-  Schwartz-Nobel - Poisoned Nation; Pollution, Greed, and the Rise of Deadly Epidemics (2007)\r\n\r\n-  Sherrow - Homegrown Terror; the Oklahoma City Bombing (2013)\r\n\r\n-  Vine - Base Nation; How U.S. Military Bases Abroad Harm America and the World (2015)\r\n\r\n-  Wedel - Unaccountable; How Anti-Corruption Watchdogs and Lobbyists Sabotaged America's Finance, Freedom, and Security (2014)\r\n\r\n-  Zimmer - Immigrants Against the State; Yiddish and Italian Anarchism in America (2015)","torrent":{"xt":"urn:btih:b0c47e4d2beb7fb5227effbd698422d76bbaaf5b","amp;dn":"Criticism+of+the+Western+Civilization-Col.+68+%28American+Issues7%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0c47e4d2beb7fb5227effbd698422d76bbaaf5b","infoHashBuffer":{"type":"Buffer","data":[176,196,126,77,43,235,127,181,34,126,255,189,105,132,34,215,107,186,175,91]},"announce":[],"urlList":[]}}