{"title":"Men Without Hats - The Safety Dance [Extended Version promo].VOB","uid":7654712,"size":187299840,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b14ab5d4dedfc43914f6fb786be59cd31790a283&amp;dn=Men+Without+Hats+-+The+Safety+Dance+%5BExtended+Version+promo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1348120883,"description":"Men Without Hats - The Safety Dance [Extended Version promo].VOB\n\n\nHQ very rare promo music video from a promo DVD. &quot;The Safety Dance&quot; is a song written and recorded by Canadian New Wave band Men Without Hats; and to date, it remains their biggest hit. It was initially released in Canada in January 1983 as the second single from the band's first full-length album, Rhythm of Youth. The song was written by Ivan Doroschuk after he had been kicked out of a club for pogoing. \n\nThe writer/performer, Ivan Doroschuk, has explained that &quot;The Safety Dance&quot; is a protest against bouncers stopping dancers pogoing to 1980s New Wave music in clubs when disco was dying and New Wave was up and coming. New Wave dancing, especially pogoing, was different from disco dancing, because it was done individually instead of with partners and involved holding the torso rigid and thrashing about. To uninformed bystanders this could look dangerous, especially if pogoers accidentally bounced into one another (the more deliberately violent evolution of pogoing is slam dancing). The bouncers did not like pogoing so they would tell pogoers to stop or be kicked out of the club. Thus, the song is a protest and a call for freedom of expression. Other lyrics in the song include references to the way pogoing looked to bouncers, especially &quot;And you can act real rude and totally removed/And I can act like an imbecile&quot;.\n\nDoroschuk disagrees with two common interpretations of the song. Firstly, he notes it is not a call for safe sex. Doroschuk says that is reading too much into the lyrics. Secondly, he explained that it is not an anti-nuclear protest despite the nuclear imagery at the end of the video. Doroschuk says that he considers Men Without Hats &quot;a punk band with one hit song&quot; and that as such they were &quot;anti-everything&quot;.\n\nThe music video for the song, directed by Tim Pope, is notable for its English folk revival imagery, notably Morris men, Mummers, Punch and Judy and a Maypole. It was filmed in the village of West Kington, near Chippenham, in southwest England. Ivan Doroschuk is the only member of the band to actually perform in the video. Doroschuk, and others in the video, can be seen repeatedly forming an &quot;S&quot; sign by jerking both arms into a stiff pose, one arm in an upward curve and the other in a downward curve, apparently referencing the first letter in 'safety'. The Morris Dance side in the video was Chippenham Town Morris from Wiltshire, performing Three Musketeers. The dwarf actor is Mike Edmonds; his T-shirt in the video says &quot;RHYTHMYOUTH&quot;.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Safety_Dance&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Safety_Dance&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/CACFjaAek&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/CACFjaAek&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 9800kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 192kbps\n   Duration: 00:04:32\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.6.3\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:b14ab5d4dedfc43914f6fb786be59cd31790a283","amp;dn":"Men+Without+Hats+-+The+Safety+Dance+%5BExtended+Version+promo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b14ab5d4dedfc43914f6fb786be59cd31790a283","infoHashBuffer":{"type":"Buffer","data":[177,74,181,212,222,223,196,57,20,246,251,120,107,229,156,211,23,144,162,131]},"announce":[],"urlList":[]}}