{"title":"Amateur Telescope Making in the Internet Age Finding Parts, Gett","uid":6394158,"size":12824740,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b1715cd1801f3fd56eab4b39e8de3942f0b70dc4&amp;dn=Amateur+Telescope+Making+in+the+Internet+Age+Finding+Parts%2C+Gett&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"daemonx0x","files":-1,"time":1305419413,"description":"Amateur Telescope Making in the Internet Age Finding Parts, Getting Help, and More-viny\n\nBuilding an astronomical telescope offers the amateur astronomer an exciting challenge, with the possibility of ending up with a far bigger and better telescope than could have been afforded otherwise. In the past, the starting point has always been the grinding and polishing of at least the primary mirror, a difficult and immensely time-consuming process. But now that the Internet has brought us together in a global village, purchasing off-the-shelf goods such as parabolic mirrors, eyepieces, lenses, and telescope tubes, is possible.\n\nThere are also a vast number of used mirrors and lenses out there, and it is now possible to track them down almost anywhere in the world. Online stores and auction houses have facilitated commerce regarding all sorts of useful optical components at a reasonable price. This is a book about making telescopes from available parts. It provides guidance on where to look and what to look for in selecting items useful for telescope making and explains how to assemble these components to produce an excellent instrument on a tight budget. At one time, many amateurs made their own telescopes from home-made parts. In today's rushed world, that has almost become a lost art. The Internet offers a wonderful alternative to either buying a pricey scope fully assembled or making your own from scratch.\n","torrent":{"xt":"urn:btih:b1715cd1801f3fd56eab4b39e8de3942f0b70dc4","amp;dn":"Amateur+Telescope+Making+in+the+Internet+Age+Finding+Parts%2C+Gett","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1715cd1801f3fd56eab4b39e8de3942f0b70dc4","infoHashBuffer":{"type":"Buffer","data":[177,113,92,209,128,31,63,213,110,171,75,57,232,222,57,66,240,183,13,196]},"announce":[],"urlList":[]}}