{"title":"Maxed Out: Hard Times, Easy Credit and the Era of Predatory Lend","uid":4656166,"size":871872638,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b2c0ba33d9340199411baee08d3fd6cd670ea744&amp;dn=Maxed+Out%3A+Hard+Times%2C+Easy+Credit+and+the+Era+of+Predatory+Lend&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"vikingsfreak","files":-1,"time":1232210765,"description":"AVI files.\n\n\nMaxed Out: Hard Times, Easy Credit and the Era of Predatory Lenders (2006) is an independent feature-length documentary film and (2007) book that chronicles abusive practices in the credit card industry. Written and directed by James Scurlock, the film and book use interviews with creditors, debtors, academics, and others to illustrate its story.[1] The film premiered at the South by Southwest Film Festival in Austin, Texas, USA, in 2006 where it claimed the Special Jury Prize. It went on to several film fests including Seattle, Full Frame Documentary, Maui, New Zealand, Milwaukee International, Woodstock, Bergen, Leeds International, Oxford and IDFA (Amsterdam) film festivals. It was released in movie theaters in select cities in the United States in March 2007 through Magnolia Pictures. The DVD was released nationally in June 7, 2007, in the joint effort Magnolia Pictures and Red Envelope Entertainment (a division of Netflix). The book Maxed Out is published by Scribner, a division of Simon and Schuster. It was published in March 2007 in hardcover and in December 2007 in paperback.\n\nScurlock's purpose for the film and book was to raise awareness of how credit and lending issues are affecting society.[1] The main premises of the documentary and book are that banks and other creditors deliberately market to people who are more likely to have problems paying predatory lending and that the creditors benefit from connections to government, the debt collection industry, and from lawmaker apathy.[2]\n\nThe non-profit organization Americans for Fairness in Lending (AFFIL) has organized screenings of Maxed Out around the country as part of its work. AFFIL sustains a formal collaboration with the film.","torrent":{"xt":"urn:btih:b2c0ba33d9340199411baee08d3fd6cd670ea744","amp;dn":"Maxed+Out%3A+Hard+Times%2C+Easy+Credit+and+the+Era+of+Predatory+Lend","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2c0ba33d9340199411baee08d3fd6cd670ea744","infoHashBuffer":{"type":"Buffer","data":[178,192,186,51,217,52,1,153,65,27,174,224,141,63,214,205,103,14,167,68]},"announce":[],"urlList":[]}}