{"title":"Zeitgeist 2009 Pack","uid":4756019,"size":10558814221,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b2d6d19300b2a9c12dbacd723c300341371634f3&amp;dn=Zeitgeist+2009+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"OilersFan05","files":33,"time":1236457501,"description":"Here is the complete package of Zeitgeist. Included in this pack is the Zeitgeist Movie in AVI format, Zeitgeist Addendum in both AVI and DVD/ISO format, Zeitgeist Addendum subtitles in 26 languages, The Zeitgeist Movement's Activist Orientation Guide in PDF format, The Zeitgeist Movement's DVD Guide in DVD/ISO format. I have also included Jacque Fresco and Roxanne Meadows' Designing the Future in PDF format (I don't think this is the full book, if anyone has the full book, please let me know and I can put it in here)and The Venus Project in AVI format. \n\nI didn't put the first Zeitgeist film nor The Venus Project film in DVD/ISO format and the Activist DVD Guide in AVI format because of the size of those files. If you want these in DVD/ISO and AVI, tell me in the comments and if a lot of you request it, I will update this pack with those. I will also update this pack with subtitles for the first Zeitgeist film and The Venus Project when I find them.\n\nI have put all files in this pack separately rather than in one large ZIP file so you can pick whatever you like instead of being forced to download the whole thing. \n\nThe programs you will need to view these files:\n\nAdobe Acrobat Reader \nPowerISO, MagicISO, ISO Burner or whatever you prefer to mount/burn the ISO files\nWindows Media Player, MPC, VLC or whatever you prefer to watch video on your computer\n\nHere's a bit of info on the files in the pack ,(name, file type, size, length):\n\nAddendum Subtitle Text Files (NTSC)-----STL-----6.32MB-----26 Files\nDesigning the Future - Jacque Fresco-----PDF-----863KB-----73 Pages\nJacque Fresco and The Venus Project-----AVI-----699MB-----1:28:53\nThe Zeitgeist Movement - Activist Guide-----PDF-----511KB-----83 Pages\nThe Zeitgeist Movement DVD Guide-----ISO-----3.92GB-----1:37:05\nZeitgeist (2007)-----AVI-----700MB-----2:02:09\nZeigeist Addendum (2008)-----AVI-----700MB-----2:03:06\nZeitgeist Addendum DVD-----ISO-----3.85GB-----2:02:59\n\nSince this is a large torrent, please continue seeding even after your download completes so that more people can download this in a decent amount of time.\n\nFinally, please spread these files to as many people as you can, the more that join the movement, or at least are aware of it, the easier it'll be to take action.","torrent":{"xt":"urn:btih:b2d6d19300b2a9c12dbacd723c300341371634f3","amp;dn":"Zeitgeist+2009+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2d6d19300b2a9c12dbacd723c300341371634f3","infoHashBuffer":{"type":"Buffer","data":[178,214,209,147,0,178,169,193,45,186,205,114,60,48,3,65,55,22,52,243]},"announce":[],"urlList":[]}}