{"title":"Knit Kimono/Knit Kimono 2","uid":9291314,"size":19132523,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b2e45883c9789be5ebeb7c7a374cf4f0c84c6b24&amp;dn=Knit+Kimono%2FKnit+Kimono+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KnitLady","files":-1,"time":1386097693,"description":"From the bestselling author of Knit Kimono comes a brand new collection of kimono and Asian-inspired tops with simple shapes and unique details. In more than 20 new designs, Vicki Square has created a pattern collection of kimonos and other Asian-inspired tops, tunics, and vests, blending traditional inspiration with projects that contemporary knitters can't resist. You'll love the stunning look of each kimono design and relish in the easy-to-follow instructions for shaping and construction.\n\nKnit Kimono Too focuses on lighter weight knits for layering, plus unique stitch patterns, colorwork, and openwork designs. Vicki also offers innovative shaping, interesting closures and edgings, and clever knitting techniques. Each project--from vests, coats, lightweight shells, and short-sleeve tops to a wide assortment of kimono jackets featuring various weights of yarn--is shown off in clear photography and step-by-step instructions. On the included instructional DVD, Vicki also demonstrates the special techniques and stitches that make these garments so elegantly wearable, including two-color slip stitch, surface embroidery, two-hand stranded colorwork, garter-stitch shortrows, attaching knitted cord, making origami folds, double knitting, and more.","torrent":{"xt":"urn:btih:b2e45883c9789be5ebeb7c7a374cf4f0c84c6b24","amp;dn":"Knit+Kimono%2FKnit+Kimono+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2e45883c9789be5ebeb7c7a374cf4f0c84c6b24","infoHashBuffer":{"type":"Buffer","data":[178,228,88,131,201,120,155,229,235,235,124,122,55,76,244,240,200,76,107,36]},"announce":[],"urlList":[]}}