{"title":"Power Rangers: Lost Galaxy (Legacy Collection and Beyond)","uid":11737633,"size":17296477514,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b314a6aba81ca147e1d95ed4a5b9733a2ce8d5e7&amp;dn=Power+Rangers%3A+Lost+Galaxy+%28Legacy+Collection+and+Beyond%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":9,"uploader":"CeraKesh","files":46,"time":1425620415,"description":"Rangers Forever! Earth's defenders never surrender!\n\nThese are HQ x264 rips from the Power Rangers Legacy Collection DVDs.\n\n[img]http://vignette2.wikia.nocookie.net/powerrangers/images/d/d3/Poster-prlg.jpg/revision/latest?cb=20120122154903[/img]\nPower Rangers: Lost Galaxy (often abbreviated as PRLG or simply Lost Galaxy) is the seventh season of the Power Rangers series. It is based on the Japanese Super Sentai television series Seijuu Sentai Gingaman (translated as Star Beasts Squadron Galaxy Man). Lost Galaxy is the first series to not be a continuation of the previous series, with its own new cast and story. With the annual suit change that began with Power Rangers Zeo and the annual cast and story change starting with this series, this is the first series to follow the practice set by the Super Sentai series.\n\nIn late 1998, after Power Rangers in Space ended with the two-part finale Countdown to Destruction (which ended the six year storyline that began in Mighty Morphin Power Rangers), the general belief was that the Power Rangers franchise would end with In Space. However, Destruction's ratings were enough that Saban chose to continue and produce future Power Rangers seasons as standalone stories. According to some trademark documents, the original title for Lost Galaxy was Power Rangers: Space Jungle.\n\nSaban observed and bought footage, costumes, props, and story elements from 1998 Super Sentai series Seijuu Sentai Gingaman, a nature themed Sentai. (The title Lost Galaxy was thought significant because the word &quot;Ginga&quot; is a Japanese for &quot;Galaxy&quot;.) The success of in Space meant that Lost Galaxy was reworked into a space-set show, an in-spirit sequel. This was often difficult for the writers as the stock footage was of a nature-based show with no space elements.\n\nWhereas all of the previous series featured interconnections in their casts and characters, Lost Galaxy used an entirely new cast of characters to become the Power Rangers. It also began the trend of &quot;Team up&quot; episodes between the current team and past teams to fight a common enemy. In Lost Galaxy's case, the Space Power Rangers and Psycho Rangers returned in the series for the first full blown teamup episodes in series history. This traditon came from the Sentai and would become a part of Power Rangers in many future seasons.\n\nDespite its stand-alone story, there were several ties to previous seasons (or Zordon Era). There were allusions to Zordon being the source of the Galaxy Power Rangers' powers; Paul Schrier and Jack Banning reprised their roles as Bulk and Professor Phenomenus, respectively. Alpha 6 and the Astro Megaship were used again and Melody Perkins reprised her role as Karone midway through the series. This is also the first season to have sentient Zords and feature the demise of a Power Ranger in battle, though Kendrix would be revived in the finale.\n\nFurio's costume came from In Space's' Sentai counterpart, Denji Sentai Megaranger, not Gingaman. This is one of only two times suits from one Sentai season were used in another's Power Rangers adaption. It would be repeated, perhaps more famously, in Power Rangers Wild Force.\n\nThe Lost Galaxy season serves as a transitional series and a unique one in Power Rangers history. It is neither completely self-contained nor a direct continuation, but a bit of both. Future seasons would not begin to have completely independent stories until the following series, Lightspeed Rescue","torrent":{"xt":"urn:btih:b314a6aba81ca147e1d95ed4a5b9733a2ce8d5e7","amp;dn":"Power+Rangers%3A+Lost+Galaxy+%28Legacy+Collection+and+Beyond%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b314a6aba81ca147e1d95ed4a5b9733a2ce8d5e7","infoHashBuffer":{"type":"Buffer","data":[179,20,166,171,168,28,161,71,225,217,94,212,165,185,115,58,44,232,213,231]},"announce":[],"urlList":[]}}