{"title":"Ryron and Rener Gracie - Gracie Combatives","uid":11292452,"size":8254781950,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:b36c89130996d59ee4df91692ce9c7d4fe9eae36&amp;dn=Ryron+and+Rener+Gracie+-+Gracie+Combatives&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":null,"files":39,"time":1414351954,"description":"The Course\nAlthough Gracie Jiu-Jitsu consists of more than 600 techniques, studies of the fights conducted by members of the Gracie Family show that 36 techniques have been used more often, and with greater success, than all the other techniques combined. Originally developed for the U.S. Army, Gracie Combatives is the only course that is entirely dedicated to the mastery of these 36 essential techniques. Up until now, this course was taught exclusively at a small network of Gracie Academy accredited schools, but now, for the first time ever, the complete Gracie Combatives course is available in a 13-disc instructional DVD series!\n\nThe Objective\nThe demand for quality Gracie Jiu-Jitsu instruction far exceeds its availability, and this realization is what inspired Ryron and Rener Gracie to put the complete Gracie Combatives course on DVD. In producing this series, their sole objective was to present the techniques so effectively that a student could actually learn all the most important techniques of Gracie Jiu-Jitsu, and develop reflexes in their execution, without ever stepping foot into a school of martial arts. To accomplish this, they formatted the lessons using the same Dynamic Reflex Development system that is used in private lessons at the Gracie Academy. In each lesson, the new technique is first presented in the form of simplified drills, or &quot;Slices,&quot; and then it is combined with other techniques to form progressively more complex training exercises called Fight Simulation Drills. The lessons are so carefully engineered and the technique presentations are so detailed, that any student who dedicates him/herself to the DVDs will go from no knowledge to &quot;street ready&quot; in the absolute least amount of time possible!\n\nThe Blue Belt Qualification Test\nComprised of 13 DVDs and over 18 hours of instruction, the Gracie Combatives DVD collection features every detail of every technique that must be mastered before one is considered for blue belt. On the 13th DVD of the collection, you will find a complete demonstration of the Blue Belt Qualification Test that one must pass to qualify for promotion. If, after several months of dedicated practice, you become extremely proficient in the execution of the five Blue Belt Qualification Drills (BBQDs), you are invited to test for promotion using the revolutionary video evaluation process.\n\nThe Truth\nTraining for the streets and training for tournaments are two entirely different things. If your sole training objective is to prepare for point-based BJJ tournaments, this DVD series is not for you. If, on the other hand, you train at a sport BJJ school and would like to gain some awareness as to the technical and philosophical difference between sport and street jiu-jitsu,and you would like to learn the techniques that you will almost certainly need in a real fight against a more athletic opponent, this collection will be extremely enlightening.\n\nThe Bonuses\nAlong with the 13 DVDs, you will receive a 65-page handbook and the Gracie Combatives Fight Chart. The handbook contains insightful information on the principles of Gracie Jiu-Jitsu which, once understood, will enable you to solve any problems that may arise during training sessions. It also includes a recommended training schedule and a one-page outline for each lesson as well as note space for each segment of that lesson","torrent":{"xt":"urn:btih:b36c89130996d59ee4df91692ce9c7d4fe9eae36","amp;dn":"Ryron+and+Rener+Gracie+-+Gracie+Combatives","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b36c89130996d59ee4df91692ce9c7d4fe9eae36","infoHashBuffer":{"type":"Buffer","data":[179,108,137,19,9,150,213,158,228,223,145,105,44,233,199,212,254,158,174,54]},"announce":[],"urlList":[]}}