{"title":"HeliconSoft Helicon Focus Pro 5.3.12.1 Incl Loader (MPT) - KurdT","uid":8676156,"size":86585497,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b39cbccfc2fad71ecbdb6bf81897387df11a4e00&amp;dn=HeliconSoft+Helicon+Focus+Pro+5.3.12.1+Incl+Loader+%28MPT%29+-+KurdT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KurdTM","files":-1,"time":1373597560,"description":"HeliconSoft Helicon Focus Pro 5.3.12.1 Multilingual  Incl Loader (MPT) - KurdTM\n\n\nHelicon Focus is a program that creates one completely focused image from several partially focused images by combining the focused areas. The program is designed for macrophotography, microphotography and hyperfocal landscape photography to cope with the shallow depth-of-field problem. Helicon Focus also aligns images as objects often change their size and position from shot to shot. This function is especially important for macrophotography. Helicon Focus is able to create 3D model of the object which can be manipulated in free Helicon 3D Viewer (included into Helicon Focus installation) and exported as video file, stereo pair or anaglyph.\n\nHelicon Focus Lite (basic version):\n- Automatically adjusts and resizes images (important for stereomicroscopes and macrophotography)\n- Uses all available processors (1.7 times faster with 2 processors, 2.3 times faster with 4 processors)\n- Preserves details by using advanced interpolators for image manipulation (Lanczos, Sinc256)\n- Internal workflow always uses 16 bit color depth to preserve colors\n- Processes an unlimited number of images in the stack\n- Supports dust map to automatically remove black points from the resulting images\n- Automatically adjusts brightness of the adjacent images\n- Reads RAW, 8bit and 16bit TIFFs, JPEG, JPEG 2000, BMP, etc\n- Writes 8bit and 16bit TIFFs, JPEG, JPEG 2000, BMP\n- Adds text and scale bar\n- Provides command line interface to call it from other applications\n\nHelicon Focusa Pro (advanced version):\n- Includes all the features of the Lite version\n- Helicon Remote utility to automate focus bracketing\n- Retouching brush to clone from aligned source images to the resulting image (cannot be performed with external photo editor)\n- Export of 3D model to Helicon 3D Viewer (included into Helicon Focus installation) \n- Batch mode to process multiple image stacks or the same stack with different parameters\n- 2D micropanorama \n- Export of animated stacks\n\nHelicon Focus Pro X64 (premium version):\n- Helicon Focus Pro X64 uses Helicon Processing Server to overcome 3Gb address space limitation for 32 bit applications. Using this technique Helicon Focus is able to get additional 3Gb of the address space on 32 bit OS and all available RAM on 64 bit OS.\n- Includes all the features of the Lite and Pro versions\n- 32 bit OS: additional 3Gb to process big images \n- 64 bit OS: higher performance + access to all available RAM\n\nHome Page - http://www.heliconsoft.com/","torrent":{"xt":"urn:btih:b39cbccfc2fad71ecbdb6bf81897387df11a4e00","amp;dn":"HeliconSoft+Helicon+Focus+Pro+5.3.12.1+Incl+Loader+%28MPT%29+-+KurdT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b39cbccfc2fad71ecbdb6bf81897387df11a4e00","infoHashBuffer":{"type":"Buffer","data":[179,156,188,207,194,250,215,30,203,219,107,248,24,151,56,125,241,26,78,0]},"announce":[],"urlList":[]}}