{"title":"Cubanismo! - Jesus Alemany's Cubanismo! (Feat.. Alfrendo Rodrig","uid":6466870,"size":402102856,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b4090fe05e62f8f3f8772420f99265717aa19154&amp;dn=Cubanismo%21+-+Jesus+Alemany%5C%27s+Cubanismo%21+%28Feat..+Alfrendo+Rodrig&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"alekow1","files":27,"time":1307989913,"description":"\nCubanismo! is a rollicking, entertaining collection of Cuban-inspired jazz recorded with pianist Alfredo Rodriguez and a host of Havana musicians. Jesus Alemany sounds vigorous throughout the album, spurring his team of supporting musicians to great performances.\nIt's an album that emphasizes the Latin rhythms of Latin jazz, not the jazz and it is all the stronger for it. (AMG)\n\n\n\nCubanismo is one of the finest Cuban dance bands working today.\nThey are absolutely incredible live and, although this isn't a live recording, it does capture some of the pure fire and swing of catching Jesus Alemany and his crew in a live setting.\nUnlike the dynamic Cuban salsa and timba bands of today, Cubanismo plays more traditional Cuban dance rhythms, such as son montuno, changui, pilon, and mambo, but with a modern descarga (jam session) feel and jazz elements mixed in.\nThe first three Cubanismo albums are all FANTASTIC, but, in my opinion, this is the best of the three because of the pure swing and incredible musicianship.\nAlemany is one of the finest trumpet players anywhere, and he surrounds himself here with the likes of Tata Guines, Miguel &quot;Anga&quot; Diaz, Alfredo Rodriguez, Orlando &quot;Maraca&quot; Valle, Yosvanny Terry, Carlitos Del Puerto, and many other great musicians. It is a band that is hard to top. The arrangements are loose and the playing is intense, allowing the musicians to stretch out. Like the New York Times review so aptly states, it was a session in which the music really does equal &quot;the intensity of music performed in a club.&quot;\nThis is Cuban dance music at it's intense and dynamic best!!!\nI recommend this, as well as Malembe and Reencarnacion to anyone who wants to experience just how explosive Cuban music can be. (Customer from Amazon)\n\n &lt;a href=&quot;\nhttp://img522.imageshack.us/img522/6724/frontro.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img522.imageshack.us/img522/6724/frontro.jpg&lt;/a&gt;\n\n\n01 - Descarga De Hoy   (6:19)\n02 - Meta Y Guaguanco   (4:26)\n03 - Tumbao De Coqueta   (4:46)\n04 - Aprovecha   (4:49)\n05 - Pa'que Gozen   (5:34)\n06 - Ni Pa'ca Ni Pa'lla   (5:15)\n07 - Homanaje A Arcano   (5:29)\n08 - La Rumba Y El Tumbador   (4:27)\n09 - Cicuta Tibia   (4:15)\n10 - Ahora Me Voy   (4:43)\n\n\n\n\nPersonnel: \nJesus Alemany (trumpet); Jorge Luis Rojas &quot;Rojitas&quot; (vocals); Efraim Rios (tres, background vocals); Orlando Valle &quot;Maracas&quot; (flute); Yosvany Terry Cabrera (alto saxophone); Leonardo Castellini &quot;Nardy&quot; (tenor saxophone); Javier Salvas (baritone saxophone); Luis Alemany, Luis Alemany, Jr. (trumpet); Carlos Alvarez (trombone); Alfredo Rodriguez (piano); Carlos Puerto, Jr. (bass); Tata Guines (quinto, conga, bongo, guiro); Emilio Del Monte (timbale); Julian Oviedo (bongo); Carlos Godines (bongo, guiro, claves); Miguel Aurelio Diaz &quot;Anga&quot; (timbale, conga, bongo); Luis Varzaga (background vocals).\n\n\nArranger: Jesus Alemany.\nRecording information: EGREM Studios, Havana, Cuba (05/1995).\n\n\nLabel: Hannibal / Rykodisc\nReleased: Feb 27, 1996\nCatalogue: HNCD 1390\n\n\n\n\nCodec: Flac\nCompression Level: 5\nQuality: High\n\n\nCD-rip by alekow (EAC and Flac)\nCovers Included (400dpi)\n\n\n\n\n\n\n\nEnjoy, Seed and Share\n","torrent":{"xt":"urn:btih:b4090fe05e62f8f3f8772420f99265717aa19154","amp;dn":"Cubanismo%21+-+Jesus+Alemany%5C%27s+Cubanismo%21+%28Feat..+Alfrendo+Rodrig","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4090fe05e62f8f3f8772420f99265717aa19154","infoHashBuffer":{"type":"Buffer","data":[180,9,15,224,94,98,248,243,248,119,36,32,249,146,101,113,122,161,145,84]},"announce":[],"urlList":[]}}