{"title":"The Velvet Underground - Boston 12 Dec 1968 audience recording [","uid":4654396,"size":472349894,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b43d1067368df0f9099dcf1f623068223f7465db&amp;dn=The+Velvet+Underground+-+Boston+12+Dec+1968+audience+recording+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"no_fun","files":16,"time":1232154119,"description":"From info file:\n\nQuote:\nThe Velvet Underground 12 Dec 1968 Boston audience recording\n\nBoston Tea Party, 12 December 1968\n\ndisc 1\ntrack 01: intro (00.35)\ntrack 02: Heroin (08.28)\ntrack 03: Move Right In (05.13)\ntrack 04: Waiting For The Man (06.27)\ntrack 05: I'm Set Free (04.26)\ntrack 06: Foggy Notion (07.47)\ntrack 07: Beginning To See The Light (06.31)\ntrack 08: Candy Says (04.01)\n\ndisc 2\ntrack 01: White Light White Heat (06.01)\ntrack 02: Jesus (03.50)\ntrack 03: Sister Ray (26.11)\ntrack 04: Pale Blue Eyes (5.58)\n\nLou Reed: guitar, vocals\nSterling Morrison: guitar\nDoug Yule: bass, organ, vocals\nMoe Tucker: drums\n\nlineage: cassette - CDr - EAC - WAV - FLAC (level 8 ) - you\n\noriginal audience recording by the &quot;professor&quot;\nuploaded October 2007 by lurid_uk\n\nThis was the first show of a 3 night stay at the Velvets &quot;second home&quot;, the Boston Tea Party. This recording, reputedly made by the &quot;professor&quot;, was not included on the recent Scorpio 4CD box set (for reasons known only to the boys at Scorpio - maybe they're saving it for a future release along with the Hilltop Rock Festival tape).\n\nThis show has long been my personal favourite of all the extant Tea Party recordings. Lou and Sterling's guitar playing is outstanding, and Moe never misses a beat. &quot;Move Right In&quot; is just great - Sterling sounds just like a tape loop and Lou's &quot;improvised on the spot&quot; lyrics are tantalisingly almost intelligible. &quot;Foggy Notion&quot; is a joyful breeze, with buzzsaw guitars and fine vocals. Going by Lou's introduction, this would appear to be the first public performance of &quot;Candy Says&quot;. It's certainly the only Velvets recording of it which I am aware of where Lou actually sings it himself - he cant quite reach the high notes but there's a certain weary tenderness to his vocal which I dont think Doug ever managed to achieve, live or in the studio. This is undoubtedly my favourite version of one of my favourite songs.\n\nNo words I can write can adequately describe this performance of &quot;Sister Ray&quot; - over 26 mins of musical mayhem and lyrical debauchery. It is simply outstanding.\n\nOverall, the sound quality is not great, but very listenable. It could no doubt benefit from a little equalisation but I've not tried to improve it in any way. My cassette &quot;claims&quot; to be a 4th generation copy of the professor's original reel. With a bit of luck Scorpio have access to the &quot;remastered&quot; version which Polygram made from the professor's master tape, and will release it to us all soon.","torrent":{"xt":"urn:btih:b43d1067368df0f9099dcf1f623068223f7465db","amp;dn":"The+Velvet+Underground+-+Boston+12+Dec+1968+audience+recording+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b43d1067368df0f9099dcf1f623068223f7465db","infoHashBuffer":{"type":"Buffer","data":[180,61,16,103,54,141,240,249,9,157,207,31,98,48,104,34,63,116,101,219]},"announce":[],"urlList":[]}}