{"title":"RARE Disney Movie - Ollie Hopnoodle's Haven of Bliss (1988)","uid":4512316,"size":925685133,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b4ae51652c3d373c1df8dcf5a58c7bf72e1c089a&amp;dn=RARE+Disney+Movie+-+Ollie+Hopnoodle%5C%27s+Haven+of+Bliss+%281988%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"cowboy23","files":2,"time":1226834908,"description":"Bought this movie online and upon receiving it found that the sound was badly out of sync for most of the movie. After much editing was able to get everything as it should be, and I figured it&amp;#039;s time to upload it. Plenty of movies you liked as a kid don&amp;#039;t hold up when you watch them as an adult. This isn&amp;#039;t one of them, and I still think it&amp;#039;s pretty darn funny. Enjoy!!\n\nOllie Hopnoodle&amp;#039;s Haven of Bliss was a 1988 TV movie following the family from A Christmas Story on their annual vacation to Ollie Hopnoodle&amp;#039;s Haven of Bliss, a set of cabins by a lake in Michigan. Ralph, now fourteen, secures a summer job moving furniture along with his friends Flick and Schwartz, thereby risking missing the family vacation. Some creative use of footage from Fritz Lang&amp;#039;s Metropolis and an eerie nightmare scene involving a robotic refrigerator provide some additional entertainment. After a small subplot involving the disappearance of the family&amp;#039;s dog, Fuzzhead (played by the director&amp;#039;s pet dog), the family sets off on an epic journey involving bees, windmills, seedy gas stations, and the inevitable life lessons.\n\nIt is based on one of Jean Shepherd&amp;#039;s semi-autobiographical short stories. PBS made a series of TV movies based on the Parker family, including The Great American Fourth of July and Other Disasters, and The Phantom of the Open Hearth. Ollie Hopnoodle&amp;#039;s Haven of Bliss originally aired numerous times on the Disney Channel in 1988, and was released by Disney on VHS in 1993.","torrent":{"xt":"urn:btih:b4ae51652c3d373c1df8dcf5a58c7bf72e1c089a","amp;dn":"RARE+Disney+Movie+-+Ollie+Hopnoodle%5C%27s+Haven+of+Bliss+%281988%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4ae51652c3d373c1df8dcf5a58c7bf72e1c089a","infoHashBuffer":{"type":"Buffer","data":[180,174,81,101,44,61,55,60,29,248,220,245,165,140,123,247,46,28,8,154]},"announce":[],"urlList":[]}}