{"title":"Sarah McLachlan - Wintersong","uid":5990947,"size":259623919,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b5a1a33def404b555c87e4e6d4055a42966551b3&amp;dn=Sarah+McLachlan+-+Wintersong&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ddawg","files":-1,"time":1290889069,"description":" &lt;a href=&quot;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/d2/21/a64f619009a0b92d88d75110.L.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/d2/21/a64f619009a0b92d88d75110.L.jpg&lt;/a&gt;\n\n\nTitle: Wintersong\nArtist: Sarah McLachlan\nAudio CD (October 17, 2006)\nOriginal Release Date: 2006\nNumber of Discs: 1\nGenre: Christmas\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. Happy Xmas (War Is Over) [Featuring the Sarah McLachlan Music Outreach Children\\'s Choir and Youth Choir]\n02. What Child Is This? (Greensleeves)\n03. River\n04. Wintersong\n05. I\\'ll Be Home For Christmas\n06. O Little Town Of Bethlehem\n07. The First Noel/Mary Mary\n08. Silent Night\n09. Song For A Winter\\'s Night\n10. Have Yourself A Merry Little Christmas\n11. In A Bleak Mid Winter\n12. Christmas Time Is Here [Featuring Diana Krall]\n\n\nAmazon Review:\nAn album like this could cement Sarah McLachlan as a middle-of-the-road crooner ready for the Andy Williams Christmas Show, but there\\'s more beneath the surface of Wintersong than just Christmas chestnuts, over-roasting on an open fire. Longtime McLachlan producer Pierre Marchand blurs the borders with ambient sound effects, distorted guitars, and subtle echoes. He adds a Mark Isham-esque muted trumpet solo emerging out of reverse echoes on \\&quot;I\\'ll Be Home for Christmas\\&quot; as if viewing the song through a distorted mirror. Violins that sound like they\\'re being blown through a Leslie speaker combine unpredictably with a banjo on \\&quot;O Little Town of Bethlehem.\\&quot; And on the seventh song, McLachlan finally kicks the album into another gear, turning \\&quot;The First NoÃƒÂ«l\\&quot; into a storming entreaty backed by tribal drums and surging low strings. Her voice is like the serene angel amidst the raging storm. I wish McLachlan had taken more chances like this, instead of the subtle framing she employs around melodies that remain true to form. Surprisingly, the more contemporary songs by John Lennon, Joni Mitchell, and Gordon Lightfoot are the least inventive. Her reading of Mitchell\\'s incandescently wistful \\&quot;River\\&quot; is overly faithful to the original, and Lennon\\'s \\&quot;Happy Xmas (War Is Over)\\&quot; sounds like karaoke, right down to the Spector-esque production and children\\'s choir. But given that Lennon\\'s prayer for peace still remains unanswered, that fidelity could be intentional. Regardless, this is familiar Christmas fare delivered in an intimate and ethereal fashion that will satisfy those who believe in the nostalgic spirit of the season.\n\nAllmusic Review:\nBecause no artist\\'s career is truly complete without a holiday album, Sarah McLachlan took yet another step toward establishing her place in sentimental adult contemporary radio history with Wintersong. For the most part, the singer chooses the darker, more melancholic, and \\&quot;wintry\\&quot; pieces to cover (there\\'s no \\&quot;Joy to the World\\&quot; or \\&quot;Angels We Have Heard on High,\\&quot; for example), focusing as much on the Christmas season and the general feel of the holiday as on its religious connotations. She brings together the folk spiritual \\&quot;Mary Mary\\&quot; -- also called \\&quot;Virgin Mary\\&quot; when covered by Joan Baez on her 1966 NoÃƒÂ«l or \\&quot;Mary What You Gonna Call That Pretty Little Baby\\&quot; when a black gospel song -- and the traditional \\&quot;The First Noel,\\&quot; showing off not only her own impressive range but her ability to adapt to different vocal styles while still remaining wholly herself. Her version of Gordon Lightfoot\\'s \\&quot;Song for a Winter\\'s Night,\\&quot; which was originally released on the 1994 Miracle on 34th Street soundtrack (and then on McLachlan\\'s Rarities, B-Sides &amp; Other Stuff), is pretty and sweet, using as acoustic guitar as well as layers and layers of vocal harmonies to create a sense of space and warmth, and her cover of Joni Mitchell\\'s \\&quot;River\\&quot; is lovely, too, using a guitar and arpeggiated synths to push the song sadly along. The synths, in fact, are used frequently on Wintersong, sometimes in their string form on \\&quot;O Little Town of Bethlehem\\&quot; or \\&quot;Have Yourself a Merry Little Christmas,\\&quot; which works nicely, but more often as slightly new agey background effects that get a little tedious, especially considering the fact McLachlan has always been able to carry herself on more organic instrumentation, and sound good doing it, too. She does manage to just stick to only the sad, reflective piano chords on which she has earned her living -- nice in their simplicity -- on the title track, the one original song on the album, which sounds a lot, both thematically and musically, like \\&quot;River,\\&quot; using Christmas as a way to contemplate a lover (\\&quot;And this is how I see you/In the snow on Christmas morning..../Oh I miss you now, my love, merry Christmas,\\&quot; she sings). McLachlan\\'s voice sounds great, and her interpretations stick pretty close to the originals while still expressing her own artistic individuality (with the exception of \\&quot;What Child Is This [Greensleeves],\\&quot; in which she goes too far, taking liberties with the melody and changing the song too much); but in making everything so soft and ethereal, instead of increasing their poignancy (which is certainly a goal of hers), she kills some of the songs\\' immediacy and power, unfortunately rendering Wintersong a little lifeless, albeit soothing, at the end. \n \n","torrent":{"xt":"urn:btih:b5a1a33def404b555c87e4e6d4055a42966551b3","amp;dn":"Sarah+McLachlan+-+Wintersong","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5a1a33def404b555c87e4e6d4055a42966551b3","infoHashBuffer":{"type":"Buffer","data":[181,161,163,61,239,64,75,85,92,135,228,230,212,5,90,66,150,101,81,179]},"announce":[],"urlList":[]}}