{"title":"The Crises of Multiculturalism: Racism in a Neoliberal Age","uid":11779381,"size":1192804,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b65a47d0793c9b236be7c8ce304e8daee06cc1dc&amp;dn=The+Crises+of+Multiculturalism%3A+Racism+in+a+Neoliberal+Age&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1427497232,"description":"Across the West, something called multiculturalism is in crisis. Regarded as the failed experiment of liberal elites, commentators and politicians compete to denounce its corrosive legacies; parallel communities threatening social cohesion, enemies within cultivated by irresponsible cultural relativism, mediaeval practices subverting national &quot;ways of life&quot; and universal values. This important new book challenges this familiar narrative of the rise and fall of multiculturalism by challenging the existence of a coherent era of &quot;multiculturalism&quot; in the first place. The authors argue that what we are witnessing is not so much a rejection of multiculturalism as a rejection of lived multiculture. In documenting mainstream racism and the anxieties that inform it, Lentin and Titley argue that the crisis is a projection of neoliberal societies' disjunctures. Combining theory with a reading of contemporary events, it examines the transnational, mediated nature of crisis itself, and argues challenging this notion provides activists with a chance to transcend resurgent racism","torrent":{"xt":"urn:btih:b65a47d0793c9b236be7c8ce304e8daee06cc1dc","amp;dn":"The+Crises+of+Multiculturalism%3A+Racism+in+a+Neoliberal+Age","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b65a47d0793c9b236be7c8ce304e8daee06cc1dc","infoHashBuffer":{"type":"Buffer","data":[182,90,71,208,121,60,155,35,107,231,200,206,48,78,141,174,224,108,193,220]},"announce":[],"urlList":[]}}