{"title":"Unreal Tournament 3 (Mac) (CXS)","uid":5362220,"size":7523668512,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:b6a14cce7d24de9ee2723ce1fbbb18c9c177638a&amp;dn=Unreal+Tournament+3+%28Mac%29+%28CXS%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"thenoobish","files":2,"time":1266105604,"description":"Description:\nUnreal Tournament 3 (UT3) is a first-person shooter and online multiplayer video game by Epic Games and is the latest installment of the Unreal series after Unreal Tournament 2004. It is published by Midway Games and was released for Microsoft Windows on November 19, 2007, PlayStation 3 on December 11, 2007, and on Xbox 360 on July 3, 2008. Unreal Tournament 3 is the fourth game in the Unreal Tournament series and the eighth Unreal game, but it has been numbered in terms of the engine it runs on. The original Unreal Tournament uses the original Unreal Engine, while UT2003 and UT2004 use the Unreal Engine 2, and 2004 incorporates all of the content from 2003; therefore they are considered as the same generation. UT3 is subsequently part of the third generation, because it runs on the Unreal Engine 3, and does not reuse any content. In March 2008, Midway announced that UT3 had sold over a million copies worldwide.\n\nStatus:\nGREEN, everything works except online multiplayer\n\nSystem Requirements:\nMac OS X 10.5 or 10.6\n2.0 GHz single core CPU (2.4 GHz dual core CPU or faster recommended)\n512 MB RAM (1.0 GB RAM or greater recommended)\n8.0 GB hard disk drive space\nNVIDIA 6200 or ATI 9600 video card (NVIDIA 7800GTX or ATI X1300 or faster recommended)\n\nNotes/Known Issues:\n1. VERY IMPORTANT: You will get a message when you first launch the game. Select NO TO ALL, or the game will not run properly!!\n2. To play the game properly, set the resolution to match your screen's resolution, or set it as close as possible!!\n3. The mouse will not work in the menus therefore to use these buttons, you will need to keep pressing TAB until they are selected. Once your button is selected, use the ENTER key to press it. To scroll the menus use the ARROW KEYS.\n4. There is a saved game profile that is set as the default, to avoid the game trying to log the player in at startup. To start up a new campaign, simply select &quot;New Campaign&quot; from the game screen. Or feel free to delete the already existing profile all together!\n\nAll credit for this port goes to rynotheking14 from The Porting Team\nOriginal thread here: http://forum.portingteam.com/viewtopic.php?f=46&amp;t=2098&amp;p=23964#p23964\n\nEnjoy!","torrent":{"xt":"urn:btih:b6a14cce7d24de9ee2723ce1fbbb18c9c177638a","amp;dn":"Unreal+Tournament+3+%28Mac%29+%28CXS%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6a14cce7d24de9ee2723ce1fbbb18c9c177638a","infoHashBuffer":{"type":"Buffer","data":[182,161,76,206,125,36,222,158,226,114,60,225,251,187,24,201,193,119,99,138]},"announce":[],"urlList":[]}}