{"title":"'I Hope I Don't Intrude' - 1st Edition (2015).pdf Gooner","uid":13743144,"size":18058989,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b732086ed2a2d927d930167585fffc373aacc4f7&amp;dn=%27I+Hope+I+Don%27t+Intrude%27+-+1st+Edition+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1457096564,"description":"'I Hope I Don't Intrude' - Privacy and its Dilemmas in Nineteenth-Century Britain - 1st Edition (2015).pdf Gooner\r\n\r\nPublisher: Oxford University Press; 1 edition (July 14, 2015)\r\nLanguage: English\r\nISBN-10: 0198725035\r\nISBN-13: 978-0198725039\r\n\r\n'I Hope I Don't Intrude' takes its title from the catch-phrase of the eponymous hero of the 1825 play Paul Pry, which was an immense success on the London stage and then rapidly in New York and around the English-speaking world. It tackles the complex, multi-faceted subject of privacy in nineteenth-century Britain by examining the way in which the tropes, language, and imagery of the play entered public discourse about privacy in the rest of the century. The volume is not just an account of a play, or of late Georgian and Victorian theatre. Rather it is a history of privacy, showing how the play resonated through Victorian society and revealed its concerns over personal and state secrecy, celebrity, gossip and scandal, postal espionage, virtual privacy, the idea of intimacy, and the evolution of public and private spheres.\r\n\r\nAfter 1825 the overly inquisitive figure of Paul Pry appeared everywhere - in songs, stories, and newspapers, and on everything from buttons and Staffordshire pottery to pubs, ships, and stagecoaches - and 'Paul-Prying' rapidly entered the language. 'I Hope I Don't Intrude' is an innovative kind of social history, using rich archival research to trace this cultural artefact through every aspect of its consumer context, and using its meanings to interrogate the largely hidden history of privacy in a period of major transformations in the role of the home, mass communication (particularly the new letter post, which delivered private messages through a public service), and the state. In vivid and entertaining detail, including many illustrations, David Vincent presents the most thorough account yet attempted of a recreational event in an era which saw a decisive shift in consumer markets. His study casts fresh light on the perennial tensions between curiosity and intrusion that were captured in Paul Pry and his catchphrase. Giving a new account of the communications revolution of the period, it re-evaluates the role of the state and the market in creating a new regime of privacy. And its critique of the concept and practice of surveillance looks forward to twenty-first-century concerns about the invasion of privacy through new technologies","torrent":{"xt":"urn:btih:b732086ed2a2d927d930167585fffc373aacc4f7","amp;dn":"%27I+Hope+I+Don%27t+Intrude%27+-+1st+Edition+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b732086ed2a2d927d930167585fffc373aacc4f7","infoHashBuffer":{"type":"Buffer","data":[183,50,8,110,210,162,217,39,217,48,22,117,133,255,252,55,58,172,196,247]},"announce":[],"urlList":[]}}