{"title":"[SoM]A proposito di Henry[DvdRip-Xvid-Ita Ac3- Eng Mp3]","uid":5019707,"size":1567645696,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b854c45e4f1689b280a104dbf30003fbfd5d7408&amp;dn=%5BSoM%5DA+proposito+di+Henry%5BDvdRip-Xvid-Ita+Ac3-+Eng+Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mitimex","files":1,"time":1248393521,"description":"\n\nLanguage: Ita/Eng\n\nHenry Turner, un ricco e cinico avvocato di New York, colleziona l'ultimo successo in tribunale a spese di Matthews, un povero malato, che perde cosÃƒÂ¬ la causa contro un ospedale per essere risarcito dei danni provocatigli da un grave errore terapeutico. Ma una sera dal tabaccaio un rapinatore lo ferisce gravemente: uscito dal coma, Henry ha perso la memoria. Lo aiutano nel faticoso recupero psico fisico un fisioterapista di colore, Bradley, che gli insegna i primi passi e lo sostiene con calorosa e contagiosa vitalitÃƒÂ  ed allegria; la moglie Sarah, che gli si ÃƒÂ¨ riavvicinata; la figlia dodicenne Rachel, che lui ha sempre trattato con crescente distacco. A poco a poco Henry riscopre quei valori umani e sociali che la sua attivitÃƒÂ  aveva inaridito: il rapporto di amicizia e di tenerezza con la moglie; il piacere di essere padre; la correttezza nello svolgere il suo lavoro. Rientrato in ufficio va a rivedere le sue cause scoprendo quante ingiustizie sono state perpetrate grazie alla sua diabolica abilitÃƒÂ . Ritrovata la piena armonia coniugale con Sarah, tutto sembra svanire a causa della scoperta di lettere compromettenti scritte a sua moglie da un amico e collega d'ufficio, Bruce. Disperato, decide di prendere alloggio al Ritz, nome che gli suona familiare senza sapere perchÃƒÂ¨; la soluzione gli viene da una collega, Linda, che gli rivela essere l'albergo luogo dei loro incontri sentimentali. Sotto shock per la nuova rivelazione, ma convinto che il suo passato sia decisamente da dimenticare, Henry chiede a Sarah di iniziare una nuova vita con lui, dÃƒÂ  ai Matthews la prova che consentirÃƒÂ  loro di essere rimborsati dall'ospedale annullando cosÃƒÂ¬ l'ingiustizia da lui procurata, e poi si licenzia dall'ufficio. ","torrent":{"xt":"urn:btih:b854c45e4f1689b280a104dbf30003fbfd5d7408","amp;dn":"%5BSoM%5DA+proposito+di+Henry%5BDvdRip-Xvid-Ita+Ac3-+Eng+Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b854c45e4f1689b280a104dbf30003fbfd5d7408","infoHashBuffer":{"type":"Buffer","data":[184,84,196,94,79,22,137,178,128,161,4,219,243,0,3,251,253,93,116,8]},"announce":[],"urlList":[]}}