{"title":"Green Lantern Corps v2 01-63 (2006-2011|Dgtl+S|TLK+Mona|MM-DTs)","uid":9520433,"size":1632095430,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:b862bacb422bb1909eeb7c3d85d995d9eb7b4205&amp;dn=Green+Lantern+Corps+v2+01-63+%282006-2011%7CDgtl%2BS%7CTLK%2BMona%7CMM-DTs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1390619985,"description":"For more information about this specific era of the Green Lantern Corps, please check the wikilink here:\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Green_Lantern_Corps#Rebirth_of_the_Corps&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Green_Lantern_Corps#Rebirth_of_the_Corps&lt;/a&gt;\n\nAfter the Recharge and Rebirth miniseries, both Hal Jordan and the rest of the Corps have returned in full force to the DC Universe. However, this version of the Corps is depleted due to prior events and needs new blood, new ideas - and of course, they must face new conflicts! This series runs parallel to Green Lantern v4, and while that tends to focus on Hal Jordan, this run is more sprawling and examines the Corps as a whole along with Oa and the relationship the Lanterns have to the galaxy and the Guardians. Along the way, the reader is shown glimpses of specific character studies - Guy Gardner, Kyle Rayner, Kilowog, and Soranik Natu among others all get the chance to shine. Also, this run crosscuts with some major conflicts that heavily involve the Lantern Corps and their legacy; these include the Sinestro Corps War, Blackest Night, Brightest Day, War of the Lanterns, and a few more here and there. Larfleeze and Atrocitus are featured as key players as well - both would go on not only to have their own Corps (Orange and Red Lanters, respectively) but also their own series as well. This is a must read if you are a fan of Green Lantern and want to read about the greater mythology and history of the Corps. \n\nThis collection is AFAIK the best possible scans of all issues as of January 2014. Issues 01-30 are digital thanks to TLK-Empire; issues 31-38 are Minutemen-DTs or MMen-Sha-Hic! scans; issues 39-47 are digital-HD care of Monafekk-Empire, and the remaining issues (48-63) are various scanners including some Archangel-DCP. Also, most are no-ads but the last few and maybe some in the middle are c2c. Massive thanks to ALL the scanners and original uploaders AND all the various sources housing these bits and pieces in their own online lockers! Please seed this file if you like it, as there is NO other complete assemblage of this or Green Lantern v4 on torrent sites so far; believe me, I checked. Thanks for reading this wall of text, hope you enjoy! :-)","torrent":{"xt":"urn:btih:b862bacb422bb1909eeb7c3d85d995d9eb7b4205","amp;dn":"Green+Lantern+Corps+v2+01-63+%282006-2011%7CDgtl%2BS%7CTLK%2BMona%7CMM-DTs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b862bacb422bb1909eeb7c3d85d995d9eb7b4205","infoHashBuffer":{"type":"Buffer","data":[184,98,186,203,66,43,177,144,158,235,124,61,133,217,149,217,235,123,66,5]},"announce":[],"urlList":[]}}