{"title":"The Middlesteins by Jami Attenberg (ePUB/Mobi)","uid":7826718,"size":700431,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b8a4726d5237683205dcb1959e5fb8080b77ac04&amp;dn=The+Middlesteins+by+Jami+Attenberg+%28ePUB%2FMobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"azizex666","files":-1,"time":1352945243,"description":"For more than thirty years, Edie and Richard Middlestein shared a solid family life together in the suburbs of Chicago. But now things are splintering apart, for one reason, it seems: Edie's enormous girth. She's obsessed with food--thinking about it, eating it--and if she doesn't stop, she won't have much longer to live.\n\nWhen Richard abandons his wife, it is up to the next generation to take control. Robin, their schoolteacher daughter, is determined that her father pay for leaving Edie. Benny, an easy-going, pot-smoking family man, just wants to smooth things over. And Rachelle-- a whippet thin perfectionist-- is intent on saving her mother-in-law's life, but this task proves even bigger than planning her twin children's spectacular b'nai mitzvah party. Through it all, they wonder: do Edie's devastating choices rest on her shoulders alone, or are others at fault, too?\n\nWith pitch-perfect prose, huge compassion, and sly humor, Jami Attenberg has given us an epic story of marriage, family, and obsession. The Middlesteins explores the hopes and heartbreaks of new and old love, the yearnings of Midwestern America, and our devastating, fascinating preoccupation with food.\n\n                              Format 1 - .ePUB\n\n                              Format 2 - .Mobi\n\n                          Published - October 23rd 2012\n\n                All my Ebook uploads are separated by Genre Tags \n\n \n            **Support Your Favorite Authors By Buying Their Books**\n\n\n                Check out all my Magazine and ebook uploads here.\n\n                    &lt;a href=&quot; https://thepiratebay.se/user/azizex666/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/azizex666/&lt;/a&gt;","torrent":{"xt":"urn:btih:b8a4726d5237683205dcb1959e5fb8080b77ac04","amp;dn":"The+Middlesteins+by+Jami+Attenberg+%28ePUB%2FMobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8a4726d5237683205dcb1959e5fb8080b77ac04","infoHashBuffer":{"type":"Buffer","data":[184,164,114,109,82,55,104,50,5,220,177,149,158,95,184,8,11,119,172,4]},"announce":[],"urlList":[]}}