{"title":"John W. Dower - Embracing Defeat Japan in the Wake of World War ","uid":9410864,"size":625033320,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b92a3e619cf1fca554bd78078db0e52ee5273ef3&amp;dn=John+W.+Dower+-+Embracing+Defeat+Japan+in+the+Wake+of+World+War+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"rambam1776","files":-1,"time":1388288771,"description":"Embracing Defeat: Japan in the Wake of World War II\nby John W. Dower\n\nWinner of the Pulitzer Prize, the 1999 National Book Award for Nonfiction, finalist for the Lionel Gelber Prize and the Kiriyama Pacific Rim Book Prize, Embracing Defeat is John W. Dower's brilliant examination of Japan in the immediate, shattering aftermath of World War II.\n\nDrawing on a vast range of Japanese sources and illustrated with dozens of astonishing documentary photographs, Embracing Defeat is the fullest and most important history of the more than six years of American occupation, which affected every level of Japanese society, often in ways neither side could anticipate. Dower, whom Stephen E. Ambrose has called &quot;America's foremost historian of the Second World War in the Pacific,&quot; gives us the rich and turbulent interplay between West and East, the victor and the vanquished, in a way never before attempted, from top-level manipulations concerning the fate of Emperor Hirohito to the hopes and fears of men and women in every walk of life. Already regarded as the benchmark in its field, Embracing Defeat is a work of colossal scholarship and history of the very first order. John W. Dower is the Elting E. Morison Professor of History at the Massachusetts Institute of Technology. He is a winner of the National Book Critics Circle Award for War Without Mercy.\n\nWinner of the L. L. Winship/ PEN New England Award\n\nPublishers Weekly - Publisher's Weekly\nThe writing of history doesn't get much better than this. MIT professor Dower (author of the NBCC Award-winning War Without Mercy) offers a dazzling political and social history of how postwar Japan evolved with stunning speed into a unique hybrid of Western innovation and Japanese tradition. The American occupation of Japan (1945-1952) saw the once fiercely militarist island nation transformed into a democracy constitutionally prohibited from deploying military forces abroad. The occupation was fraught with irony as Americans, motivated by what they saw as their Christian duty to uplift a barbarian race, attempted to impose democracy through autocratic military rule. Dower manages to convey the full extent of both American self-righteousness and visionary idealism. The first years of occupation saw the extension of rights to women, organized labor and other previously excluded groups. Later, the exigencies of the emergent Cold War led to American-backed &quot;anti-Red&quot; purges, pro-business policies and the partial reconstruction of the Japanese military. Dower demonstrates an impressive mastery of voluminous sources, both American and Japanese, and he deftly situates the political story within a rich cultural context. His digressions into Japanese culture--high and low, elite and popular--are revealing and extremely well written. The book is most remarkable, however, for the way Dower judiciously explores the complex moral and political issues raised by America's effort to rebuild and refashion a defeated adversary--and Japan's ambivalent response to that embrace.\n\nKirkus Reviews\nAn NBCC award winner and expert in the modern history of Japan, Dower (Massachusetts Inst. of Technology; Japan in War and Peace, 1994; War Without Mercy, 1986) absorbingly explains how American forces imposed a revolution from above in six years of occupation that transformed imperial Japan into a democracy. As WWII ended, Japan had lost three million dead, with many more wounded, starving, homeless, and demoralized. Dower has drawn effectively on Japanese academic, archival, and popular sources to capture the atmosphere of flux and uncertainty that followed surrender, including suicidal despair, gratitude toward generous GIs, black-market entrepreneurship, prostitution, and the unleashing of creative energy. The most important change, of course, occurred in politics. In a root-and-branch attempt to destroy Japan's militaristic culture, the Americans created a constitution that limited the emperor to a symbolic head of state, renounced war as an instrument of settling international disputes, and established such reforms as sexual equality, greater freedom of speech and press, an end to the Shinto state religion, and a free labor movement. Written in six days, the constitution set the stage for unprecedented Japanese freedom, equality, and prosperity. For all their idealism, however, the American forces also acted with little knowledge of Japanese history, censored criticism of the occupation, and treated the losers with condescension. In the Far East counterpart to the Nuremberg trials, American prosecutors excluded testimony about Emperor Hirohito's responsibility for war crimes and fed the nation's sense of its victimization without forcing a realization of itsculpability for atrocities committed against other Asians. In the greatest irony, by promoting such bureaucratic structures as the Ministry of Trade and Industry, MacArthur merely replaced his own mandarinate with a Japanese version. A turning point in Japanese history, illuminated through diligent research and piercing insight.","torrent":{"xt":"urn:btih:b92a3e619cf1fca554bd78078db0e52ee5273ef3","amp;dn":"John+W.+Dower+-+Embracing+Defeat+Japan+in+the+Wake+of+World+War+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b92a3e619cf1fca554bd78078db0e52ee5273ef3","infoHashBuffer":{"type":"Buffer","data":[185,42,62,97,156,241,252,165,84,189,120,7,141,176,229,46,229,39,62,243]},"announce":[],"urlList":[]}}