{"title":"Britten: Double Concerto, Sinfonietta etc. - Kent Nagano (1999)","uid":13941283,"size":289079252,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b93d5f3d926ad6b51f02a2b7dd0bc90e17a3b1b8&amp;dn=Britten%3A+Double+Concerto%2C+Sinfonietta+etc.+-+Kent+Nagano+%281999%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Scheheraz","files":28,"time":1458467444,"description":"BENJAMIN BRITTEN (1913-1976)\r\nDouble Concerto\r\nTwo Portraits • Young Apollo • Sinfonietta\r\n\r\nGramophone [8/1999]:\r\n&quot;An unusually absorbing Britten release, containing no less than three world-premiere recordings. The most striking discovery here has to be the Double Concerto, the short score of which the gifted 18-year-old RCM student had completed by the early autumn of 1932. That same summer, however, he also produced his ‘official’ Op. 1, the dazzlingly inventive Sinfonietta for ten instruments. Fascinatingly, the two works have plenty in common both formally and stylistically: at the outset of the central Andante lento of the Sinfonietta, for example, note the unashamedly soloistic nature of the two violins’ expressive dialogue.\r\nThe ‘orchestral’ version of the Sinfonietta heard here dates from 1936 and incorporates markings for a full complement of strings as well as a second horn part. In the case of the Double Concerto, it was left to Colin Matthews to fashion a performing edition from Britten’s helpfully detailed sketches, and the piece received its belated premiere at the 1987 Aldeburgh Festival. Though it may not quite display the effortless fluency and innovative thematic guile of the Sinfonietta, it remains a pretty astonishing work for one so young. Certainly, there are numerous examples of characteristically sparky, head-turning inspiration – those penetrating string harmonies at the start of the slow movement, for instance, or the breathless momentum of the Allegro scherzando finale (whose striking closing section recalls material from the opening Allegro ma non troppo).\r\nLikewise, the Two Portraits make intriguing listening. Composed in August 1930 (just a couple of months prior to his first term at the RCM), the first is a ‘sketch for strings describing David’ (David Layton, a close friend of the 16-year-old Britten at Gresham’s School), whose emotional vehemence and harmonic restlessness nod towards Janacek and even Berg (symptomatic, perhaps, of his private teacher Frank Bridge’s refreshingly cosmopolitan outlook). Listen out, too, for some tantalizing pre-echoes of the ‘Wiener Walzer’ movement from the Frank Bridge Variations when the music switches into 3/4 time at 5'38''. By contrast, its partner is a restrained self-portrait (subtitled ‘E.B.B.’) for solo viola and strings, whose dignified main theme possesses an almost Holstian sobriety. Oddly enough, only the seven-minute ‘fanfare’ for piano and orchestra, Young Apollo, fails to improve much with repetition. Britten himself was the soloist for the 1939 broadcast premiere in Toronto, but he evidently had his doubts (daringly, the music never strays from its glinting opening A major tonality) and withdrew the piece before the end of the year.\r\nKent Nagano directs a set of performances which are beyond praise in their luminous refinement and blistering commitment to the cause; all three of his distinguished soloists are on unimpeachable form throughout. Moreover, Erato’s Bridgewater Hall sound quality is sumptuously realistic to match, and the whole enterprise forms an exemplary companion disc to this conductor’s admirable 1997 realization of the original four-act version of Billy Budd (also on Erato, 3/98).&quot; --Andrew Achenbach\r\n\r\nGidon Kremer, violin\r\nYuri Bashmet, viola\r\nNikolai Lugansky, piano\r\nString quartet:\r\n• Lyn Fletcher, violin\r\n• Dara de Cogan, violin\r\n• Tim Pooley, viola\r\n• Peter Worrall, cello\r\nHallé Orchestra\r\nKent Nagano\r\n\r\nRecording: Bridgewater Hall, Manchester; Double Concerto, Two Portraits: 6 and 8 February, 1998; Young Apollo, Sinfonietta: 10 and 11 November, 1998\r\nProducers: Martin Sauer (Double Concerto, Two Portraits), Wilhelm Hellweg (Young Apollo, Sinfonietta)\r\nEditing: Alexia Benoit (Double Concerto, Two Portraits), Tim Oldham (Young Apollo, Sinfonietta)\r\nSound engineer: Jean Chatauret; assistant: Didier Jean\r\nRecording made in association with the Britten Estate Limited\r\nMusic consultants: Donald Mitchell and Colin Matthews\r\n© Erato Disques S.A. Paris France 1999\r\n3984-25502-2","torrent":{"xt":"urn:btih:b93d5f3d926ad6b51f02a2b7dd0bc90e17a3b1b8","amp;dn":"Britten%3A+Double+Concerto%2C+Sinfonietta+etc.+-+Kent+Nagano+%281999%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b93d5f3d926ad6b51f02a2b7dd0bc90e17a3b1b8","infoHashBuffer":{"type":"Buffer","data":[185,61,95,61,146,106,214,181,31,2,162,183,221,11,201,14,23,163,177,184]},"announce":[],"urlList":[]}}