{"title":"The Red Queen - Philippa Gregory  (Unabridged)","uid":8668443,"size":356918344,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b9f5588ffd333b38835e3f573940caff2359fe0e&amp;dn=The+Red+Queen+-+Philippa+Gregory++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Robin1966","files":68,"time":1373452052,"description":"Written by Philippa Gregory\n\nThe second book in the Cousins' War series and the sequel to The White Queen.\n\nHeiress to the red rose of Lancaster, Margaret Beaufort never surrenders her belief that her house is the true ruler of England and that she has a great destiny before her. Her ambitions are disappointed when her sainted cousin Henry VI fails to recognize her as a kindred spirit, and she is even more dismayed when he sinks into madness. Her mother mocks her plans, revealing that Margaret will always be burdened with the reputation of her father, one of the most famously incompetent English commanders in France. But worst of all for Margaret is when she discovers that her mother is sending her to a loveless marriage in remote Wales.\n\nMarried to a man twice her age, quickly widowed, and a mother at only fourteen, Margaret is determined to turn her lonely life into a triumph. She sets her heart on putting her son on the throne of England regardless of the cost to herself, to England, and even to the little boy. Disregarding rival heirs and the overwhelming power of the York dynasty, she names him Henry, like the king; sends him into exile; and pledges him in marriage to her enemy Elizabeth of York's daughter. As the political tides constantly move and shift, Margaret charts her own way through another loveless marriage, treacherous alliances, and secret plots. She feigns loyalty to the usurper Richard III and even carries his wife's train at her coronation.\n\nWidowed a second time, Margaret marries the ruthless, deceitful Thomas, Lord Stanley, and her fate stands on the knife edge of his will. Gambling her life that he will support her, she then masterminds one of the greatest rebellions of the time - all the while knowing that her son has grown to manhood, recruited an army, and now waits for his opportunity to win the greatest prize.\n\nIn a novel of conspiracy, passion, and coldhearted ambition, number one bestselling author Philippa Gregory has brought to life the story of a proud and determined woman who believes that she alone is destined, by her piety and lineage, to shape the course of history.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:b9f5588ffd333b38835e3f573940caff2359fe0e","amp;dn":"The+Red+Queen+-+Philippa+Gregory++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9f5588ffd333b38835e3f573940caff2359fe0e","infoHashBuffer":{"type":"Buffer","data":[185,245,88,143,253,51,59,56,131,94,63,87,57,64,202,255,35,89,254,14]},"announce":[],"urlList":[]}}