{"title":"Brad Paisley - A Brad Paisley Christmas","uid":6048568,"size":376105278,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ba3ff4dd02625e7adf0ef7e0495a010d29529bd1&amp;dn=Brad+Paisley+-+A+Brad+Paisley+Christmas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ddawg","files":-1,"time":1292644070,"description":" &lt;a href=&quot;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/65/09/722b808a8da0fb3c114d6110.L.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/65/09/722b808a8da0fb3c114d6110.L.jpg&lt;/a&gt;\n\n\nTitle: A Brad Paisley Christmas\nArtist: Brad Paisley\nAudio CD (October 10, 2006)\nOriginal Release Date: 2006\nNumber of Discs: 1\nGenre: Christmas\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. Winter Wonderland  Listen \n02. Santa Looked a Lot Like Daddy  Listen \n03. I'll Be Home for Christmas  Listen \n04. Away in a Manger  Listen \n05. Penguin, James Penguin  Listen \n06. 364 Days to Go  Listen \n07. Jingle Bells [Instrumental]  Listen \n08. Silent Night  Listen \n09. Born on Christmas Day  Listen \n10. Silver Bells  Listen \n11. Kung Pao Buckaroo Holiday  \n12. Hidden Track\n\n\nAmazon Review:\nA worthy addition to the country Christmas collection, this succinctly titled album combines respect for tradition with contemporary inspiration. &quot;Winter Wonderland&quot; features a Western swing arrangement and country references in the lyrics, &quot;Away in a Manger&quot; has a Cajun feel, and the &quot;Jingle Bells&quot; instrumental benefits from an injection of rockabilly twang (as does Paisley's revival of Buck Owens's &quot;Santa Looked a Lot Like Daddy&quot;). Among the original material that distinguishes the collection, &quot;Penguin, James Penguin&quot; is like &quot;Rudolph the Red-Nosed Reindeer&quot; for the higher-tech generation, as Santa enlists a &quot;secret-agent bird&quot; to keep computerized tabs on who deserves what. &quot;Born on Christmas Day&quot; features a tape of a song Paisley wrote and initially recorded when he was 13, then segues into the artist today on the same tune. The album closes with a slam at political correctness on &quot;Kung Pao Buckaroo Holiday,&quot; with the Kung Pao Buckaroos (a.k.a. George Jones, Bill Anderson, and &quot;Little&quot; Jimmy Dickens) discovering that they get bleeped every time they mention &quot;Chxxxxmas.&quot;\n\nAllmusic Review:\nBrad Paisley has made it no secret that he wants to be seen as part of a tradition of country singers, one that hails back through not just through his obvious musical forefathers Buck and Merle, but stretches back to such Grand Ole Opry mainstays as Jimmy Dickens and runs through George Strait, the gold standard for contemporary country singers. So, it should come as no surprise that when he decided to record a Christmas album -- humbly titled A Brad Paisley Christmas -- he followed the examples of his heroes and kept things simple, cutting an 11-track record that captures the spirit of the season while staying true to the sound of his band. Unlike Buck, Paisley didn't write a bunch of new material for his holiday album: he covers a bunch of standards, including Buck's &quot;Santa Looked a Lot Like Daddy,&quot; adding a handful of originals to the mix, plus a seasonal variation on his cornpone comedy sketches that traditionally close his albums. It's simple and unassuming, but it's also tremendously entertaining, more so than most contemporary Christmas records. That's because Paisley not only has a sharp ear for picking songs that work for his band, he also lets his band work, giving them the room to turn such standards as &quot;Away in a Manger,&quot; &quot;Winter Wonderland,&quot; and &quot;Silver Bells&quot; into songs that sound like Paisley and his band -- and on top of that, he's thrown in some new songs that meet these high standards, like the whimsical &quot;Penguin, James Penguin&quot; and the lazy, jazzy &quot;364 Days to Go,&quot; which provides the perfect soundtrack to a snowy night wrapping presents. In fact, that sentiment applies to A Brad Paisley Christmas as a whole: it's a sweet, warm, big-hearted Christmas record with more musical weight than the average modern country record -- or, in other words, it has more in common with classic Christmas records, and it feels every bit a classic holiday record itself. \n\n","torrent":{"xt":"urn:btih:ba3ff4dd02625e7adf0ef7e0495a010d29529bd1","amp;dn":"Brad+Paisley+-+A+Brad+Paisley+Christmas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba3ff4dd02625e7adf0ef7e0495a010d29529bd1","infoHashBuffer":{"type":"Buffer","data":[186,63,244,221,2,98,94,122,223,14,247,224,73,90,1,13,41,82,155,209]},"announce":[],"urlList":[]}}