{"title":"Iris &amp; Roy Johansen - [Kendra Michael 02] - Close Your Eyes.","uid":9132314,"size":1002484,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bacc840de0042d17d30a9282d84e448fcd4b6c61&amp;dn=Iris+%26amp%3B+Roy+Johansen+-+%5BKendra+Michael+02%5D+-+Close+Your+Eyes.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"420weedman","files":1,"time":1383347666,"description":"Version: Retail\nOverview: In Close Your Eyes, The New York Times bestselling duo Iris Johansen and Roy Johansen are back with a suspenseful novel about a once-blind woman with a talent for tracking serial killers. The FBI doesn't usually consult with music therapists to solve their cases. But Kendra Michael's astonishing powers of observation and analysis have made her a favorite of law enforcement agencies all across the country. Blind for the first twenty years of her life, she cares little for investigative work but can't deny her unique skill, or the results she's been able to facilitate. Kendra learned at an early age to become hyper-aware of her surroundings, perfecting the art of picking up the most subtle audio, olfactory, and tactile cues in the world around her. Like a secret weapon, she is in high demand. Former FBI agent Adam Lynch, known as The Puppetmaster, has weapons of his own. He's a notorious master manipulator, skillfully handling criminals and colleagues alike to get the results he wants. Now he needs Kendra's special brand of help, but she's not interested until Lynch reveals that Agent Jeff Stedler - Kendra's ex - is missing and may have run directly into the path of a serial killer. What began as a heinous murder investigation escalates into something even larger and more frightening: a multi-million dollar conspiracy to hide a secret that's worth killing for, again and again and again.\nGenre: Fiction | Mystery/Thriller ","torrent":{"xt":"urn:btih:bacc840de0042d17d30a9282d84e448fcd4b6c61","amp;dn":"Iris+%26amp%3B+Roy+Johansen+-+%5BKendra+Michael+02%5D+-+Close+Your+Eyes.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bacc840de0042d17d30a9282d84e448fcd4b6c61","infoHashBuffer":{"type":"Buffer","data":[186,204,132,13,224,4,45,23,211,10,146,130,216,78,68,143,205,75,108,97]},"announce":[],"urlList":[]}}