{"title":"Metallica - ...And Justice for All [24 bit FLAC] vinyl","uid":9554995,"size":1535221326,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bb839811e8f7ebeb6ba6d3a78b6563a7e3ca224d&amp;dn=Metallica+-+...And+Justice+for+All+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"politux","files":-1,"time":1391350417,"description":"\n  Metallica - ...And Justice for All [24 bit FLAC] vinyl\n\n  Genre: Pop/Rock\n  Styles: Thrash Metal, Hard Rock\n  Source: Elektra 60812-1 (1st US pressing)\n  Codec: FLAC\n  Bitrate: ~ 2,900 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  A1 Blackened \n  A2 ...And Justice for All \n\n  B1 Eye of the Beholder \n  B2 One \n\n  C1 The Shortest Straw \n  C2 Harvester of Sorrow \n  C3 The Frayed Ends of Sanity\n\n  D1 To Live Is to Die\n  D2 Dyers Eve\n\n  Rip Info (not my rip)\n\n  Turntable: VPI Scoutmaster\n  Tonearm: Trans-Fi Termninator\n  Cartridge: Audio-Technica AT33PTG/II\n  Phone Stage: Cinemag SUT feeding a Marantz 2220B\n  Digital Interface: E-MU 1212\n  Recording Software: Adobe Audition 3.01\n  Recording Bitrate/Sample Rate: 192/24\n\n  Review\n\n  The most immediately noticeable aspect of ...And Justice for All isn't Metallica's still-growing compositional sophistication or the apocalyptic lyrical portrait of a society in decay. It's the weird, bone-dry production. The guitars buzz thinly, the drums click more than pound, and Jason Newsted's bass is nearly inaudible. It's a shame that the cold, flat sound obscures some of the sonic details, because ...And Justice for All is Metallica's most complex, ambitious work; every song is an expanded suite, with only two of the nine tracks clocking in at under six minutes. It takes a while to sink in, but given time, ...And Justice for All reveals some of Metallica's best material. It also reveals the band's determination to pull out all the compositional stops, throwing in extra sections, odd-numbered time signatures, and dense webs of guitar arpeggios and harmonized leads. \n\n  At times, it seems like they're doing it simply because they can; parts of the album lack direction and probably should have been trimmed for momentum's sake. Pacing-wise, the album again loosely follows the blueprint of Ride the Lightning, though not as closely as Master of Puppets. This time around, the fourth song -- once again a ballad with a thrashy chorus and outro -- gave the band one of the unlikeliest Top 40 singles in history; &quot;One&quot; was an instant metal classic, based on Dalton Trumbo's antiwar novel Johnny Got His Gun and climaxing with a pulverizing machine-gun imitation. As a whole, opinions on ...And Justice for All remain somewhat divided: some think it's a slightly flawed masterpiece and the pinnacle of Metallica's progressive years; others see it as bloated and overambitious. Either interpretation can be readily supported, but the band had clearly taken this direction as far as it could. The difficulty of reproducing these songs in concert eventually convinced Metallica that it was time for an overhaul.","torrent":{"xt":"urn:btih:bb839811e8f7ebeb6ba6d3a78b6563a7e3ca224d","amp;dn":"Metallica+-+...And+Justice+for+All+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb839811e8f7ebeb6ba6d3a78b6563a7e3ca224d","infoHashBuffer":{"type":"Buffer","data":[187,131,152,17,232,247,235,235,107,166,211,167,139,101,99,167,227,202,34,77]},"announce":[],"urlList":[]}}