{"title":"HISTORY OF POP AND ROCK MUSIC - part 565","uid":10598966,"size":276302045,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:bba790b13e32925c7205a1b3d6e4245ffe0f7253&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+565&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pupovaczlatko","files":-1,"time":1405892118,"description":"\n                       PART  565\n\n\n\n\n                ULTRA LOUNGE   -  Mega Mix (2005) \n                FRANK SINATRA  -  Strangers in The Night   \n\n\n\n\n                 Lounge music is a type of easy listening music popular in the 1950s and 1960s. It may be meant to evoke in the listeners the feeling of being in a place, usually with a tranquil theme, such as a jungle, an island paradise or outer space. The range of lounge music encompasses beautiful music-influenced instrumentals, modern electronica (with chillout, and downtempo influences), while remaining thematically focused on its retro-space-age cultural elements. The earliest type lounge music appeared during the 1920s and 1930s, and was known as light music. Contemporaneously, the term lounge music may also be used to describe the types of music played in hotels (the lounge, the bar), casinos, and piano bars.\n               Swinging music of the era is also considered lounge and consisted of a schmaltzy continuation of the swing jazz era of the 1930s and 1940s, but with more of an emphasis on the vocalist. The legendary Rat Pack of Frank Sinatra, Dean Martin, and Sammy Davis Jr., along with similar artists such as Bobby Darin, Jackie Gleason, Wayne Newton, Louis Prima, Sonny King, and Sam Butera are notable examples. The music of Burt Bacharach was soon featured as part of many lounge singers' repertoires. Such artists performed mainly at featured lounges in Las Vegas casinos.\n\n\n\n             &quot;Strangers in the Night&quot; is a popular song credited to Bert Kaempfert with English lyrics by Charles Singleton and Eddie Snyder.The song was made famous in 1966 by Frank Sinatra.  Reaching number one on both the Billboard Hot 100 chart and the Easy Listening chart, it was the title song for Sinatra's 1966 album Strangers in the Night, which became his most commercially successful album. The song also reached number one on the UK Singles Chart. Sinatra's recording won him the Grammy Award for Best Male Pop Vocal Performance and the Grammy Award for Record of the Year, as well as a Grammy Award for Best Arrangement Accompanying a Vocalist or Instrumentalist for Ernie Freeman at the Grammy Awards of 1967.","torrent":{"xt":"urn:btih:bba790b13e32925c7205a1b3d6e4245ffe0f7253","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+565","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bba790b13e32925c7205a1b3d6e4245ffe0f7253","infoHashBuffer":{"type":"Buffer","data":[187,167,144,177,62,50,146,92,114,5,161,179,214,228,36,95,254,15,114,83]},"announce":[],"urlList":[]}}