{"title":"[1996] Total Coelo - I Eat Cannibals &amp; Other Tasty Trax","uid":5328926,"size":341606971,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bcaf914f46baa7feca8b09829a6feeae12a6ded4&amp;dn=%5B1996%5D+Total+Coelo+-+I+Eat+Cannibals+%26+Other+Tasty+Trax&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ddawg","files":-1,"time":1265069598,"description":"\n\nTitle: I Eat Cannibals &amp; Other Tasty Trax\nArtist: Total Coelo \nAudio CD (April 23, 1996) \nOriginal Release Date: April 1996 \nNumber of Discs: 1 \nLabel: Razor &amp; Tie \nGenre: New Wave\nFormat: flac\n\n\nTrack Listings \n\n01. I Eat Cannibals, Pt. 1  \n02. Milk From the Coconut, Pt. 1  \n03. Man O' War  \n04. Dracula's Tango  \n05. Hey Rajah  \n06. (I May Commit) The Perfect Crime  \n07. Milk from the Coconut, Pt. 2  \n08. Mucho Macho  \n09. Spy Vs. Spy  \n10. I Eat Cannibals, Pt. 2  \n11. Weird  \n12. Milk From the Coconut, Pt. 1 &amp; 2 [12&quot; Mega Mix]  \n13. I Eat Cannibals, Pt. 1 &amp; 2 [12&quot; Mega Mix]  \n\n\nAllMusic Review:\nThis compilation gathers much of the output of new wave one-hit wonders Total Coelo, including multiple mixes of two songs, and, for all but the most rabid '80s enthusiast, could easily be defined as overkill. Possibly the quintessential example of new wave silliness, the female quintet, in keeping with the spirit of the times, seems to have given as much (if not more) thought to their image as the music. The draw here is their &quot;classic&quot; &quot;I Eat Cannibals,&quot; which, despite making the Top Ten in their native U.K., was only a minor chart hit in the States. Part Bananarama, part Bow Wow Wow, there's no denying the insidiously infectious charm of the song, no matter how slight or silly (and it is slight and silly). However, unless you feel an overwhelming urge to possess the nearly 12-minute long mega-mix, most listeners would be better served picking up the single version, available on numerous new wave compilations. \n \n\nAllMusic Biography:\nOne of the silliest one-hit wonders of the new wave era (by design), the all-female vocal quintet originally known in their native U.K. as Toto Coelo took their name from a Latin expression meaning entirely or utterly. Featuring lead vocalist Anita Mahadervan (later Anita Chellamah), as well as the daughter of British game show host Bob Holness, the group dressed in wildly colorful costumes and spiced their music with some of the pseudo-exotic ethnic touches of Bow Wow Wow. It all made for a cheerfully disposable novelty which briefly caught on in the U.K, as the group's 1982 single, &quot;I Eat Cannibals,&quot; climbed into the Top Ten. Mutterings from the rock group Toto led to a name alteration on the single's American release, although the newly christened Total Coelo didn't fare nearly as well on the opposite side of the Atlantic, as the single topped out well below the Top 50. Subsequent follow-ups failed to make much of an impact anywhere, and the group disbanded before even recording a full-length album. Mahadervan/Chellamah joined the hard rock band the Cherry Bombz, which also featured members of Lords of the New Church and Hanoi Rocks, and later became a TV host.","torrent":{"xt":"urn:btih:bcaf914f46baa7feca8b09829a6feeae12a6ded4","amp;dn":"%5B1996%5D+Total+Coelo+-+I+Eat+Cannibals+%26+Other+Tasty+Trax","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcaf914f46baa7feca8b09829a6feeae12a6ded4","infoHashBuffer":{"type":"Buffer","data":[188,175,145,79,70,186,167,254,202,139,9,130,154,111,238,174,18,166,222,212]},"announce":[],"urlList":[]}}