{"title":"John Vince - Quaternions for Computer Graphics","uid":6495291,"size":1147032,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bcb54d0db30fd5bbcbd6aafc16c9e6df3ebe1464&amp;dn=John+Vince+-+Quaternions+for+Computer+Graphics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TheBookie","files":-1,"time":1309042045,"description":"Quaternions for Computer Graphics by John Vince. \n\n\nSir William Rowan Hamilton was a genius, and will be remembered for his significant contributions to physics and mathematics.\n\nThe Hamiltonian, which is used in quantum physics to describe the total energy of a system, would have been a major achievement for anyone, but Hamilton also invented quaternions, which paved the way for modern vector analysis.\n\nQuaternions are one of the most documented inventions in the history of mathematics, and this book is about their invention, and how they are used to rotate vectors about an arbitrary axis. Apart from introducing the reader to the features of quaternions and their associated algebra, the book provides valuable historical facts that bring the subject alive.\n\nQuaternions for Computer Graphics introduces the reader to quaternion algebra by describing concepts of sets, groups, fields and rings. It also includes chapters on imaginary quantities, complex numbers and the complex plane, which are essential to understanding quaternions. The book contains many illustrations and worked examples, which make it essential reading for students, academics, researchers and professional practitioners.","torrent":{"xt":"urn:btih:bcb54d0db30fd5bbcbd6aafc16c9e6df3ebe1464","amp;dn":"John+Vince+-+Quaternions+for+Computer+Graphics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcb54d0db30fd5bbcbd6aafc16c9e6df3ebe1464","infoHashBuffer":{"type":"Buffer","data":[188,181,77,13,179,15,213,187,203,214,170,252,22,201,230,223,62,190,20,100]},"announce":[],"urlList":[]}}