{"title":"Exploring Mars - Chronicles from a Decade of Discovery [PDF]","uid":9946145,"size":2277325,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bdf5a4c49787699d77b9cb3293b0410267f8737e&amp;dn=Exploring+Mars+-+Chronicles+from+a+Decade+of+Discovery+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"AtomTPB","files":1,"time":1397318054,"description":"Paperback: 224 pages\nPublisher: University of Arizona Press (15 January 2012)\nLanguage: English\nISBN-10: 0816528969\nISBN-13: 978-0816528967\n\n\n\nThe Red Planet has been a subject of fascination for humanity for thousands of years, becoming part of our folklore and popular culture. The most Earthlike of the planets in our solar system, Mars may have harbored some form of life in the past and may still possess an ecosystem in some underground refuge. The mysteries of this fourth planet from our Sun make it of central importance to NASA and its science goals for the twenty-first century. ??? In the wake of the very public failures of the Mars Polar Lander and the Mars Climate Orbiter in 1999, NASA embarked on a complete reassessment of the Mars Program. Scott Hubbard was asked to lead this restructuring in 2000, becoming known as the &quot;Mars Czar.&quot; His team's efforts resulted in a very successful decade-long series of missions--each building on the accomplishments of those before it--that adhered to the science adage &quot;follow the water&quot; when debating how to proceed. Hubbard's work created the Mars Odyssey mission, the twin rovers Spirit and Opportunity, the Mars Reconnaissance Orbiter, the Phoenix mission, and most recently the planned launch of the Mars Science Laboratory. ??? Now for the first time Scott Hubbard tells the complete story of how he fashioned this program, describing both the technical and political forces involved and bringing to life the national and international cast of characters engaged in this monumental endeavor.? Blending the exciting stories of the missions with the thrills of scientific discovery, Exploring Mars will intrigue anyone interested in the science, the engineering, or the policy of investigating other worlds. ?","torrent":{"xt":"urn:btih:bdf5a4c49787699d77b9cb3293b0410267f8737e","amp;dn":"Exploring+Mars+-+Chronicles+from+a+Decade+of+Discovery+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdf5a4c49787699d77b9cb3293b0410267f8737e","infoHashBuffer":{"type":"Buffer","data":[189,245,164,196,151,135,105,157,119,185,203,50,147,176,65,2,103,248,115,126]},"announce":[],"urlList":[]}}