{"title":"Microwave Heating as a Tool for Sustainable Chemistry","uid":8263459,"size":7629017,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:be22ae3187291adbcd6885743e299460f14830cf&amp;dn=Microwave+Heating+as+a+Tool+for+Sustainable+Chemistry&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1363440630,"description":"Nicholas E. Leadbeater, &quot;Microwave Heating as a Tool for Sustainable Chemistry&quot;\n2010 | ISBN: 1439812691 | 290 pages | PDF | 7,3 MB\n\nShorter reaction times, higher product yields, and enhanced selectivity are some of the advantages microwave heating has over conventional methods, causing its use to transition from a curiosity to mainstream, both in industrial and academic settings. Microwave Heating as a Tool for Sustainable Chemistry showcases the application of microwave heating in a number of areas of preparative chemistry as well as in the biosciences.\n\nFrom organic chemistry to materials and biological applications\n\nThe book begins with an introduction to microwave heating, the physical concepts behind it, its application in synthetic chemistry, and commercially available microwave equipment. It shows how microwave heating can be used to facilitate the clean and sustainable synthesis of organic compounds. The authors examine microwave heating as a tool for sustainable polymer chemistry, with discussions of the use of alternative solvents and feedstocks, the design of degradable polymeric materials, and recycling polymers. They then discuss the significant contribution made by microwave-promoted synthesis in the drug discovery process, with a focus on how the technology has been used to generate discovery chemistry libraries and as a tool for medicinal chemists. Other topics examined in this application-driven text include the use of microwave heating in the preparation of inorganic and organometallic compounds, in the production of inorganic materials, and in the area of biosciences.","torrent":{"xt":"urn:btih:be22ae3187291adbcd6885743e299460f14830cf","amp;dn":"Microwave+Heating+as+a+Tool+for+Sustainable+Chemistry","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be22ae3187291adbcd6885743e299460f14830cf","infoHashBuffer":{"type":"Buffer","data":[190,34,174,49,135,41,26,219,205,104,133,116,62,41,148,96,241,72,48,207]},"announce":[],"urlList":[]}}