{"title":"American Possessions - 1st Edition (2015).Pdf Gooner","uid":13958696,"size":1579890,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:be783983577f4981bfac92ab72bfc4ecc85e6a1b&amp;dn=American+Possessions+-+1st+Edition+%282015%29.Pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1458562994,"description":"American Possessions - Fighting Demons in the Contemporary United States - 1st Edition (2015).pdf Gooner\r\n\r\nPublisher: Oxford University Press; 1 edition (May 20, 2015)\r\nLanguage: English\r\nISBN-10: 0190205350\r\nISBN-13: 978-0190205355\r\n\r\nStories of contemporary exorcisms are largely met with ridicule, or even hostility. Sean McCloud argues, however, that there are important themes to consider within these narratives of seemingly well-adjusted people who attend school, go shopping, watch movies, and also happen to fight demons.\r\n\r\nAmerican Possessions examines Third Wave spiritual warfare, a late twentieth-, early twenty-first century movement of evangelicals focused on banishing demons from human bodies, material objects, land, regions, political parties, and nation states. While Third Wave beliefs may seem far removed from what many scholars view as mainstream religious practice, McCloud argues that the movement provides an ideal case study for identifying some of the most prominent tropes within the contemporary American religious landscape. Drawing on interviews, television shows, documentaries, websites, and dozens of spiritual warfare handbooks, McCloud examines Third Wave practices such deliverance rituals (a uniquely Protestant form of exorcism), spiritual housekeeping (the removal of demons from everyday objects), and spiritual mapping (searching for the demonic in the physical landscape). Demons, he shows, are the central fact of life in the Third Wave imagination. \r\n\r\nMcCloud provides the first book-length study of this influential movement, highlighting the important ways that it reflects and diverts from the larger, neo-liberal culture from which it originates","torrent":{"xt":"urn:btih:be783983577f4981bfac92ab72bfc4ecc85e6a1b","amp;dn":"American+Possessions+-+1st+Edition+%282015%29.Pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be783983577f4981bfac92ab72bfc4ecc85e6a1b","infoHashBuffer":{"type":"Buffer","data":[190,120,57,131,87,127,73,129,191,172,146,171,114,191,196,236,200,94,106,27]},"announce":[],"urlList":[]}}