{"title":"Photodex ProShow Gold 5.0.3276","uid":7494192,"size":35424872,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:be96a81aee3aae30ecc621ead9368bf1c59cc884&amp;dn=Photodex+ProShow+Gold+5.0.3276&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"nikita200","files":-1,"time":1343831526,"description":"ProShow Gold is a software designed to help you easily create slideshows. You don't need to be a rocket scientist to work with this application, as it's very user friendly. In the next step you add music (that you can also edit), and then a theme (choose from 14 slide styles and 10 transitions).In the last step you give a name to your newly created slideshow, tune the energy level (whether it's slow and steady, or fast and intense), and choose an aspect ratio (standard or widescreen).\n\nThen you can preview your slideshow, and decide whether you want to save it, publish it, or learn how to further customize it. Publishing options are quite extensive. You can create an output for the television platform (DVD, Blu-ray), social media (YouTube, Facebook, Vimeo), online environment (flash, web show), devices, or the offline platform (PC executable, video file, autorun CD, screen saver). These steps are all you need to quickly create a professional-looking slideshow. And the result is indeed excellent! Just think about how much money you would save on a birthday party, where you can use ProShow Gold to create a professional slideshow instead of paying someone else to do it.\n\nOS: Windows XP/Vista/7\nHome Page: www.photodex.com\nInterface: english","torrent":{"xt":"urn:btih:be96a81aee3aae30ecc621ead9368bf1c59cc884","amp;dn":"Photodex+ProShow+Gold+5.0.3276","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be96a81aee3aae30ecc621ead9368bf1c59cc884","infoHashBuffer":{"type":"Buffer","data":[190,150,168,26,238,58,174,48,236,198,33,234,217,54,139,241,197,156,200,132]},"announce":[],"urlList":[]}}