{"title":"Agarest Generations of War Zero-RELOADED","uid":9983800,"size":5522335744,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bf1fed2883510a53ba14b14871b3225740ff6737&amp;dn=Agarest+Generations+of+War+Zero-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"HeroMaster","files":-1,"time":1397765964,"description":"Agarest: Generations of War Zero (c) Ghostlight LTD\n04/2014: RELEASE.DATE .. PROTECTION: Steam\n1: DISC(S) .. GAME.TYPE: Adventure, RPG\nStrategy\n\nUNCOVER THE EPIC STORY PRECEDING #1 SELLER, AGAREST: GENERATIONS OF WAR\nFollowing hot on the heels of the number 1 top selling epic SRPG Agarest:\nGenerations Of War, Ghostlight are proud to announce its prequel Agarest:\nGenerations Of War ZERO bringing an enticing blend of in-depth strategy and\nepic multi-generational storytelling to Steam!\n\nFrom the void, the gods of darkness and light created Agarest, a most\nperfect and divine world. As the generations passed, paradise sadly fell to\nthe ravages of time. War darkened the skies and Agarest soon became a\ntorturous hell as the gods divided and immense armies clashed, desecrating\nthe once beautiful land\nAfter many years with the war in deadlock, Sieghart, a young officer loyal to\nthe armies of light, passes through the scarred mountains on a perilous\nmission. There, he meets a strange girl and unknowingly changes the fate of\nthe world forever\n\n* Watch the story unfold as you battle the enemy hordes in over 80hrs in a\ncompelling and innovative turn based-based combat system\n* Choose the path of Darkness or Light through a truly epic story, spanning\nmultiple generations\n* Build your ultimate army of warriors and master Extra Skills, Special Arts\nand Over Kills to defeat colossal enemies!\n* Use the all new Card Skill System to create your hero's unique persona\n* Featuring stunning new and beautifully animated character portraits\n* The Soul Breed System returns! Unite with your chosen bride to shape the\nfate of the next generation of heroes\n\nAgarest: Generations of War ZERO exclusive game features!Agarest: Generations\nof War ZERO contains many of the unique features found in the first release\nof the series such as Extended Areas allowing you to chain attacks together\nin huge combos, the Blacksmith's Guild for experimentation in crafting of\nitems and weapons and of course, the Soul Breed System where you must\ncarefully choose your bride as this decision will directly affect following\ngenerations\n\nIn addition to these existing game features, the following new features have\nbeen added:\nThe new Vacation Days allow you to get to know your party members better and\nunlock bonus items and locations by visiting various places in the towns\nAlso, as you build your relationship with the rest of your party you will\nunlock new costumes for them to wear\n\nCharacter portraits displayed during conversations have been vastly improved\nwith the implementation of Motion Portrait. This brings characters to life\nwith subtle animations really helping to enhance the stunning artwork\n\nWith various other changes such as improved graphics and a brand new Card\nSkill System to allow you to customise your starting character, this is a\nprequel you won't want to miss\n\nExclusive to the PC version, this new and improved version of Agarest:\nGenerations Of War ZERO now features Cloud Saving (which has also been added\nto Agarest: Generations Of War very recently). We've also added the ability\nto decide which direction you wish the controls to be offset along with a\nrevamp of the DLC menu giving you control to pick and choose how DLC is added\nto your existing saves. As expected there is full mouse and keyboard support\nfull gamepad support, Steam achievements, higher resolution art and a number\nof other user interface changes to ensure that PC gamers receive the best\ngaming experience possible. We are pleased to announce that a selection of\ncollectible Steam Trading Cards are featured, whilst DLC is included in the\ngame completely free of charge with other bundle packs of DLC available to\npurchase separately after release\n\nIncluded free DLC\n* A Deputy's Gift Pack: Contains 4 Flame elements, 4 Ice elements, 4 Thunder\nelements, 4 Wind elements, 4 Earth elements, 4 Darkness elements and 4 Light\nelements\n* Upgrade Pack 1: Contains 2 STR UP, 2 VIT Up, 2 Agi Up, 2 Int Up. 2 LUK Up\nand 2 Max HP Up\n* Healing Hand Pack: Contains Healing Hand Pack\n* Upgrade Pack 2: Contains 2 STR UP+, 2 VIT Up+, 2 Agi Up+, 2 Int Up+. 2\nLUK Up+ and 2 Max HP Up\n* Health and Guard Pack: Contains 2 Marfile Seed, 2 Vessels of life, 1\nRevive, 1 Dryad's Soul and 1 Requiem Bracelet\n* Legendary Items Pack: Contains 2 Divine Branch, 2 Unicorn Horn, 2 Moon\nFragment, Magic Crystal Chip, 1 seed of Happiness and 1 Bracelet of Feicui\n* Dream Prophecy Pack: Contains 2 Damascus, 2 meteoric iron, 2 generation\ncrystal, 2 lapis noster, 1 shiny fang and 1 whispered dream\n* Logistic Support 1: Contains railgun, divine guard, crystal bracelet, dark\nbracelet and bracelet of light\n* Fall from Grace Pack: Contains Big Black, Black bustier, Angel Halo and\nAngel Wing\n* Stout Defense Pack 1: Contains extra frame, chaos frame, Heaven's End and\nE.O.M\n* Squalid Chicken Pack: Contains rusty sword, rusty bracelet. rusty ring\nfunky chicken and chicken ring\n* Nobility Pack: Contains Princess Bustier, Princess's Tiara, Imperial Guar\nand levitation stone\n* Loral Beast Pack: Contains Seiryu's sword, Genbu's gauntlet, Byakko's\nBracelet and Suzaku's Ring\n* Stout Defense Pack 2: Contains Dragon frame, Demon frame, Mighty ring\nDismal Sylph and Prometheus Bound\n* Extra Points Pack 1: Contains 5000 gold, 50PP 150TP and 250EP\n* Extra Points Pack 2: Contains 50000 gold, 150PP, 350TP and 5000EP\n* Add-on Dungeon 1: An Add-on Dungeon for Generation 1 - A new adventure\nawaits in the Fohites Ruins\n* Add-on Dungeon 2: An Add-on Dungeon for Generation 2 - Explore the Neige\nSnow Field\n\n1. Burn or mount the image\n2. Install the game\n3. Copy over the cracked content from the /Crack directory on the image to\nyour game install directory\n4. Play the game\n5. Support the software developers. If you like this game, BUY IT!\n\n\nSystem Requirements:\n\n\nOS: Windows XP \nProcessor: 2.13GHz Intel Core2 Duo or equivalent \nMemory: 1 GB RAM \nGraphics: DirectX 9.0c compatible graphics card with 64Mb RAM \nand support for v3 shaders \nDirectX: Version 9.0c \nHard Drive: 5 GB available space \nSound Card: DirectX 9.0c compatible sound card\n\n\nPoster:\n\n &lt;a href=&quot;\nhttp://i.imgur.com/egjDKI4.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/egjDKI4.png&lt;/a&gt;\n\n\nScreenshots:\n\n &lt;a href=&quot;\nhttp://i.imgur.com/hWM0ten.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/hWM0ten.jpg&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://i.imgur.com/ZatEdNx.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/ZatEdNx.jpg&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://i.imgur.com/Fxk811k.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/Fxk811k.jpg&lt;/a&gt;\n\n\nSEED AND ENJOY!","torrent":{"xt":"urn:btih:bf1fed2883510a53ba14b14871b3225740ff6737","amp;dn":"Agarest+Generations+of+War+Zero-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf1fed2883510a53ba14b14871b3225740ff6737","infoHashBuffer":{"type":"Buffer","data":[191,31,237,40,131,81,10,83,186,20,177,72,113,179,34,87,64,255,103,55]},"announce":[],"urlList":[]}}