{"title":"The Immune System [3rd Ed] Peter Parham","uid":8028221,"size":67267190,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bf91a0ef15692164007ff6d60bb986b62d0d1c47&amp;dn=The+Immune+System+%5B3rd+Ed%5D+Peter+Parham&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"4noraisin","files":-1,"time":1358352947,"description":"The Immune System [3rd Ed] Peter Parham\n\nISBN-10: 0815341466\nISBN-13: 978-0815341468\n\n\nThe Immune System, Third Edition emphasizes the human immune system and synthesizes immunological concepts into a comprehensible, up-to-date, and reader-friendly account of how the immune system works. \n\nWritten for undergraduate, medical, veterinary, dental, and pharmacy students in immunology courses, it makes generous use of medical examples to illustrate points. \n\nThe Third Edition has been extensively revised and updated and includes two new chapters on innate and adaptive immunity, which explore the physical, cellular, and molecular principles underlying these responses to infection.  It also features enhanced coverage of aspects of innate immunity such as the complement system, Toll-like receptors, defensins, and C-reactive protein; the role of dendritic cells in initiating the primary adaptive immune response and the functions of other cells that bridge innate and adaptive immunity; immunotherapies using humanized monoclonal antibodies to treat certain diseases; and the nature of the immune response in the mucosal tissues and immunological memory.  The book offers over 500 full-color illustrations that complement and clarify the concepts.  The end-of-chapter questions have been expanded and include essay, multiple-choice, and case study questions, with answers provided at the end of the book.","torrent":{"xt":"urn:btih:bf91a0ef15692164007ff6d60bb986b62d0d1c47","amp;dn":"The+Immune+System+%5B3rd+Ed%5D+Peter+Parham","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf91a0ef15692164007ff6d60bb986b62d0d1c47","infoHashBuffer":{"type":"Buffer","data":[191,145,160,239,21,105,33,100,0,127,246,214,11,185,134,182,45,13,28,71]},"announce":[],"urlList":[]}}