{"title":"Louise Foxcroft - Opium In 19th Century Britain","uid":5481768,"size":5979424,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c073ab2c59a0d9547d2ab521c841d9516942fd8b&amp;dn=Louise+Foxcroft+-+Opium+In+19th+Century+Britain&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"artpepper","files":-1,"time":1270475758,"description":"Louise Foxcroft - The Making of Addiction: The 'Use and Abuse' of Opium in Nineteenth-Century Britain\n\nPublisher: Ashgate Publishing | 2007-01-30 | ISBN: 0754656330 | PDF | 199 pages | 5.70 MB\n\n\nWhat does drug addiction mean to us? What did it mean to others in the past? And how are these meanings connected? In modern society, the idea of drug addiction is a fixed and commonly understood concept, yet this was not always the case in the past. This book uncovers the original influences that shaped the creation and the various interpretations of addiction as a disease, and of addiction to opiates in particular. It delves into the treatments, regimes, and prejudices that surrounded the condition, a newly emerging pathological entity and a form of 'moral insanity' during the nineteenth century.\n\n The source material for this book is rich and surprising. Letters and diaries provide the most moving material, detailing personal struggles with addiction and the trials of those who cared and despaired. Confessions of shame, deceit, misery and terror sit alongside those of deep sensual pleasure, visionary manifestations and blissful freedom from care. \n\nThe reader can follow the lifelong opium careers of literary figures, artists and politicians, glimpse a raw underworld of hidden drug use, or see the bleakness of urban and rural poverty alleviated by daily doses of opium. Delving into diaries, letters and confessions, this book exposes the medical case histories and the physician's mad, lazy, commercial, contemptuous, desperate, altruistic and frustrated attempts to deal with drug addiction. \n\nIt demonstrates that many of the stigmatising prejudices arose from false 'facts' and semi-mythical beliefs and thus has significant implications, not only for the history of addiction, but also for how view the condition today.","torrent":{"xt":"urn:btih:c073ab2c59a0d9547d2ab521c841d9516942fd8b","amp;dn":"Louise+Foxcroft+-+Opium+In+19th+Century+Britain","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c073ab2c59a0d9547d2ab521c841d9516942fd8b","infoHashBuffer":{"type":"Buffer","data":[192,115,171,44,89,160,217,84,125,42,181,33,200,65,217,81,105,66,253,139]},"announce":[],"urlList":[]}}