{"title":"Internet Download Manager 6.12 Build 26 Activated Edition[A4]","uid":7885851,"size":4371937,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c0c71074054a7085d7cbb7c5a49a425dd420cbed&amp;dn=Internet+Download+Manager+6.12+Build+26+Activated+Edition%5BA4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AUDI-A4","files":1,"time":1354615424,"description":"Internet Download Manager 6.12 Build 26 Activated Edition\n\n\nNOTE: After the installation process, in order to get the latest version (build) of IDM you can use the automatic update function of the software.\n\nInternet Download Manager is a powerful download manager that promises to accelerate downloads by up to 500 percent. \n\nIn addition, the application can also restart interrupted downloads and integrate into a large number of browsers, including Internet Explorer, Firefox, Google Chrome and Opera.\n\nInternet Download Manager's interface is clean and well-organized, with large, stylish buttons that facilitate the management of the files in process. It is a great organizer too, as every single download can be moved into a different folder, depending on its type. Plus, it has a rich settings menu where you can change the way the program handles certain file formats or the default download locations.\n\nWe tried the quick update function too, which worked like a breeze and basically updated the application with just a single click. It all came down to choosing whether to update or not, and the whole job was done by the integrated updater that automatically downloaded the new files and installed them on the computer.\n\nThe application encases all the features specific to a decent download manager, including drag and drop support, a task scheduler, virus protection, queue processor, HTTPS support, progressive downloading with quotas, command line parameters, sounds, ZIP preview and proxy servers.\n\nThe tests revealed that the CPU and memory footprint is minimal, but this also depends on the download speed and the overall size of the file.\n\nInternet Download Manager is a must have application for many users out there. It will prove itself essential for users who download large files on a regular basis.\n\nÂ· Added support for Firefox 19\nÂ· Improved IE 10 integration\nÂ· Improved Google Chrome integration","torrent":{"xt":"urn:btih:c0c71074054a7085d7cbb7c5a49a425dd420cbed","amp;dn":"Internet+Download+Manager+6.12+Build+26+Activated+Edition%5BA4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0c71074054a7085d7cbb7c5a49a425dd420cbed","infoHashBuffer":{"type":"Buffer","data":[192,199,16,116,5,74,112,133,215,203,183,197,164,154,66,93,212,32,203,237]},"announce":[],"urlList":[]}}