{"title":"Stan Tracey Quartet - Under Milk Wood (FLAC)","uid":6528052,"size":227142571,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c0e00bc92d180ebdf959fc5c404d948e1ce00d8e&amp;dn=Stan+Tracey+Quartet+-+Under+Milk+Wood+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tiddler22","files":12,"time":1310219635,"description":"\n\nFull title: Jazz Suite Inspired By Dylan Thomas' 'Under Milk Wood'.\n\nReview -Tony Augarde (Jazz CD Reviews)\nStan Tracey's 1965 recording of his &quot;Jazz Suite inspired by Dylan Thomas&quot; has attained the status of a classic disc - and rightly so. Stan's son, drummer Clark Tracey, has now reissued it on his new ReSteamed label, which will be making available other Stan Tracey recordings from the defunct Steam label and other sources. \nAfter more than 40 years, the album stands up as one of Stan's finest. Dylan Thomas's &quot;play for voices&quot; is transformed into appropriately varied music, with the hint of a tongue-in-cheek approach which matches Dylan's attitude towards his eccentric villagers. Bobby Wellins's dark-toned tenor sax captures the sombre atmosphere of the Welsh village - notably in Starless and Bible Black, which evokes the gloom of the night. Other tracks are more cheerful - like Llareggub (the palindromic name of the village), which portrays the livelier side of the community. \nThe opening track contains echoes of another tune - I'm Getting Sentimental Over You. It starts with a drum intro by Jackie Dougan, whose playing is excellent throughout. Wellins's sax solo is forthright and bluesy, while Tracey's solo betrays (not for the first time!) the influence of Thelonious Monk. No Good Boyo might have been written by Thelonious, although it wasn't (all the compositions are by Stan Tracey). Again, it lets Stan fashion some jagged shapes at the piano. \nI Lost My Step in Nantucket (the words of a drowned sailor in Dylan Thomas's play) is a trio track and one of the catchiest tunes on the CD. It gives full reign to Tracey's unexpected twists and turns. Penpals is another attractive theme, on which Wellins lays back almost nonchalantly. The title track is a slow, rather mournful piece but A. M. Mayhem is a bright swinger which closes the album on a positive note. \nA British jazz masterpiece? How often can you suggest such a thing? But in this case the answer is undoubtedly &quot;Yes&quot;. \n\n\nStan Tracey - Piano \nBobby Wellins - Tenor \nJeff Clyne - Bass \nJackie Dougan - Drums\n\n1. Cockle Row \n2. Starless and Bible Black \n3. I Lost My Step in Nantucket \n4. No Good Boyo \n5. Penpals \n6. Llareggub \n7. Under Milk Wood \n8. A. M. Mayhem\n\n \n","torrent":{"xt":"urn:btih:c0e00bc92d180ebdf959fc5c404d948e1ce00d8e","amp;dn":"Stan+Tracey+Quartet+-+Under+Milk+Wood+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0e00bc92d180ebdf959fc5c404d948e1ce00d8e","infoHashBuffer":{"type":"Buffer","data":[192,224,11,201,45,24,14,189,249,89,252,92,64,77,148,142,28,224,13,142]},"announce":[],"urlList":[]}}