{"title":"Honeymoon Suite - 5 Albums 1984 - 1991 [FLAC] - Kitlope","uid":6927164,"size":1610622739,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c0eb1c12f5ceee0cc4da3323747b1001f3d31cf2&amp;dn=Honeymoon+Suite+-+5+Albums+1984+-+1991+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Kitlope","files":70,"time":1325548823,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nOptical Drive Hardware: Plextor PX-716SA / Samsung SH-S223L\nOptical Drive Firmware: 1.11 / SB04\nCd Software: Exact Audio Copy V1.0 Beta 3 (Secure Mode)\nEAC Log: Yes\nEAC Cue Sheet: Yes\nM3U Playlist: Yes\nTracker(s):http://tracker.openbittorrent.com/announce; \nTorrent Hash: C0EB1C12F5CEEE0CC4DA3323747B1001F3D31CF2\nFile Size: 1.50 GB\nLabel: WEA Canada, Warner Bros.\n\n\n\n\n\nAlbums, Years &amp; Catalog # in This Torrent:\n\n\nHoneymoon Suite 1984 CD 50730 *\nThe Big Prize 1986 W2 25293 (545293T) *\nRacing After Midnight 1988 25652-2 *\nMonsters Under The Bed 1991 CD 75532 *\nThe Singles 1989 CD 56979 *\n\n\n* Denotes My Rip\n\n\n\n\n\n\n\n\nIf anybody has anymore Honeymoon Suite please do make available in lossless! \n\n\n\nPlease help seed these FLACs! \n\n\n\n\nFrom Wiki:\n\n\nHoneymoon Suite is a Canadian rock band formed in 1981 in Niagara Falls, Ontario. The band's name was a nod to the fact that Niagara Falls is the unofficial honeymoon capital.\n\nThe band was originally formed in 1981 by lead vocalist and guitarist Johnnie Dee (of Niagara Falls, Ontario), Keyboardist Brad Bent (of Toronto, Ontario), and original drummer Mike Lengyell, formerly with The Diodes. Even after exhausting tours to sold out shows, great audience praise of the vocal pairings of Dee and Bent, praise of Lengyell's wood splintering drum fury, and praise of the overall unique originality of the band, the band could not sustain any financial stability. This prompted a hiatus and a few member changes; after they released their song &quot;New Girl Now&quot;, which won them an unsigned band contest put on by Toronto radio station Q107.[1], they soon signed with WEA Canada.\n\nDee, now on rhythm guitar and lead vocals, then recruited Derry Grehan on lead guitar, Ray Coburn on keyboards (replacing Bent), Dave Betts on drums (replacing Lengyell), and Gary Lalonde (formerly with Rose and Toronto) on bass.\n\nIn 1984, they released their self-titled debut album, produced by Tom Treumuth, which led to four big hits in Canada: &quot;New Girl Now&quot;, &quot;Burning In Love&quot;, &quot;Wave Babies&quot;, and &quot;Stay In the Light&quot;. &quot;New Girl Now&quot; was also Honeymoon Suite's first single to reach the top-50 in the United States.\n\nTheir follow up album, The Big Prize, produced by Bruce Fairbairn, was equally successful in Canada, with four more hits: &quot;Feel It Again&quot;, &quot;What Does It Take&quot;, &quot;Bad Attitude&quot;, and &quot;All Along You Knew&quot;. &quot;Feel It Again&quot; reached the Top 40 in the US, while &quot;What Does It Take&quot; reached no. 52, buoyed by its inclusion on the soundtrack for the John Cusack film One Crazy Summer. In 1989, &quot;Bad Attitude&quot; was featured in the series finale of Miami Vice, played during a Ferrari driving segment that mirrored one from the series' pilot episode.\n\nIn 1986, keyboardist Ray Coburn temporarily left the band, replaced by Rob Preuss of Burlington, Ontario-based Spoons. Also during 1986 the band produced the track &quot;Those Were the Days&quot; for the Charlie Sheen film The Wraith.\n\nIn the spring of 1987, the band produced the title track for the Mel Gibson film Lethal Weapon. In the winter of 1987, the band started work on their third album in L.A. Unfortunately, Johnnie Dee was hit by a car at L.A.X. airport, breaking his leg in several places, and required surgery to insert a ten inch pin to help the leg heal properly.[1] While Dee was recovering in the hospital, one-time Doobie Brothers member Michael McDonald was brought in to help out with the recording sessions; he wrote lyrics and sang back up on &quot;Long Way Back&quot;, a forthcoming track for their next album.\n\nIn 1988, their third album was finally released: Racing After Midnight, produced by Ted Templeman (of Van Halen fame) and Jeff Hendrickson. That album made the top 10 in Canada, but was not as successful in the U.S. Singles included &quot;Love Changes Everything&quot;, &quot;Looking Out for Number One&quot;, &quot;Cold Look&quot; (Europea only), and &quot;It's Over Now&quot;.\n\nIn 1989, the band released their first greatest hits compilation, The Singles, which included the new single &quot;Still Loving You&quot;. Coburn rejoined the band in time to embark on &quot;The Singles&quot; tour, which would turn out to be the last tour featuring the band's classic line-up until 2007.\n\nBy 1991, Lalonde and Betts left the band, and were replaced by Steve Webster (from Billy Idol's band) on bass, and Jorn Anderson (from Fludd and Alannah Myles) on drums. The band returned to the studio to craft 'Monsters Under The Bed' with Paul Northfield producing. Singles like &quot;Say You Don't Know Me&quot; and &quot;The Road&quot; did well in Canada but once again failed to make a dent in the US. They'd had songs played on TV's 'Miami Vice' and songs on two movie soundtracks ('Lethal Weapon II' and 'One Crazy Summer') and had won awards. Things were in perspective for them, but the band would once again lose Ray Coburn. He was replaced on keyboards by Peter Nunn.\n\nThe band continued to tour in the '90s, although many line-up changes continued to occur, with only Dee and Grehan remaining as the continuing members. Sass Jordan bassist Stan Miczek joined in 1998 for the first of his 3 two year stints with the band. Stan also played bass on the 2008 CD Clifton Hill [see 3 paragraphs below].\n\nIn 2002 they released their first new studio album in 11 years, Lemon Tongue. The album was released under an independent label, and leaned towards a more artistic and adventurous direction than their previous rock releases.[2] The European release of this album was titled Dreamland, and featured many track changes, adding the new songs &quot;Dreamland&quot;, &quot;Radiant&quot;, &quot;Even Now&quot;, and &quot;Just Love Somebody&quot;.\n\nIn 2006 the band released another greatest hits collection entitled Feel It Again: An Anthology, a 2-CD set featuring most of the band's singles, selected album tracks, and rare and unreleased material.\n\nIn June 2007, the band officially announced the return of a reunited classic line-up of Johnnie Dee, Derry Grehan, Ray Coburn, Gary Lalonde, and Dave Betts. The band toured extensively throughout Canada in 2007 and 2008 and then entered the studio to record a new album. The high point of the reunion was the new CD Clifton Hill, produced by Tom Treumuth (who produced the self-titled Honeymoon Suite debut album in 1984), and named after the famous landmark in the centre of the tourist activity in Niagara Falls. The album was released in Canada in late September 2008 on Koch Records and subsequently by Italian melodic rock label Frontiers Records on October 10, 2008. The new album is described by guitarist Derry Grehan as &quot;somewhat of a return musically to the sound that we had in the 80's&quot;.\n\nIn 2009 the band continued to tour Canada and select Northeastern United States cities. However, on September 1, 2009, it was announced that the band had again parted ways with original keyboardist Ray Coburn. Peter Nunn returned to the band lineup to replace him for the second time.[3] The band made a successful appearance at Firefest 6 Nottingham, England to a very enthusiastic audience in October, 2009\n\n\n\n\n\n\nHoneymoon Suite 1984\n\n\n\nHoneymoon Suite was the debut album by the band Honeymoon Suite, released in 1984 on Warner Bros. Records. It went certified Platinum in Canada and all four singles - &quot;New Girl Now&quot;, &quot;Burning In Love&quot;, &quot;Wave Babies&quot; and &quot;Stay In The Light&quot; - were certified Gold as well in Canada.\n\n\nTracks: \n\n\n1.\t&quot;New Girl Now&quot; (Dermot Grehan) 3:37\n2.\t&quot;Burning In Love&quot; (Dermot Grehan) 4:43\n3.\t&quot;Wave Babies&quot; (Dermot Grehan) 4:21\n4.\t&quot;Stay In The Light&quot; (Dermot Grehan) 3:52\n5.\t&quot;Now That You Got Me&quot; (Dermot Grehan) 3:30\n6.\t&quot;Funny Business&quot; (Dermot Grehan) 4:01\n7.\t&quot;Heart On Fire&quot; (Eddie Schwartz/Dave Tyson)^ 3:32\n8.\t&quot;Turn My Head&quot; (Dermot Grehan) 3:29\n9.\t&quot;It's Your Heart&quot; (Dermot Grehan/Ray Coburn) 3:25\n10.\t&quot;Face To Face&quot; (Dermot Grehan) 5:05\n\n\n\n\n\n\n\n\nThe Big Prize 1986\n\n\nThe Big Prize is the second album by Honeymoon Suite, released in early 1986. It featured four hit singles, including the band's biggest hit in the U.S., &quot;Feel It Again,&quot; and &quot;Bad Attitude,&quot; which was notably featured in a sequence in the final episode of Miami Vice three years later. The album also certified Platinum in Canada by the CRIA (Canadian Recording Industry Association).\n\nThe album cover features a newly married couple having their picture taken by some tourists at Niagara Falls, Honeymoon Suite's hometown. The photo was taken on the Canadian-side of the Falls.\n\nFollowing the release of this album, the band won the Juno Award for &quot;Group of the Year&quot; and was also nominated for &quot;Album of the Year&quot; in 1986.\n\nIn a 2008 interview, Honeymoon Suite's guitarist Derry Grehan said &quot;I think our best record was The Big Prize.&quot;\n\nFollowing the success of their debut album and a subsequent two-year tour, Honeymoon Suite wrote much of their next album on the road. The Big Prize was produced by Bruce Fairbairn with assistance from fellow Canadian Bob Rock and featured the trademark 80s sound of rock guitars interlaced with keyboards.\n\nThe first single &quot;Bad Attitude&quot; was written by guitarist Derry Grehan, and according to singer Johnnie Dee &quot;Derry was playing this lick for a long time and eventually wrote this song around it. The chorus wouldn't come together for us until Bruce Fairbairn helped us out. The lyrics kinda summed up our feelings at the time.&quot;\n\nThe second single released was &quot;Feel It Again,&quot; written by keyboardist Ray Coburn. This tune became the band's first, and only single to date to crack the Billboard Top 40 Chart in the States. It was also extremely successful at home in Canada.\n\nThe third single was the power ballad &quot;What Does It Take&quot; and was originally written on a Fostex recorder at a gig in Sarnia, Ontario. The song was added to the soundtrack for the movie One Crazy Summer.\n\nIt was Bob Rock's production work on this record (specifically as an engineer) that is largely credited with helping him get noticed by Jon Bon Jovi. Rock engineered Bon Jovi's massive break-out album Slippery When Wet, which was a major launching point in Rock's engineering and producing career\n\nTracks: \n\n\n1.\tBad Attitude&quot; (Derry Grehan) - 5:28\n2.\t&quot;Feel It Again&quot; (Ray Coburn) - 4:37\n3.\t&quot;Lost and Found&quot; (Coburn) - 4:22\n4.\t&quot;What Does It Take&quot; (Grehan) - 4:13\n5.\t&quot;One By One&quot; (Grehan) - 3:42\n6.\t&quot;Wounded&quot; (Johnnie Dee) - 4:36\n7.\t&quot;Words in the Wind&quot; (Grehan) - 4:35\n8.\t&quot;All Along You Knew&quot; (Grehan) - 4:19\n9.\t&quot;Once the Feeling&quot; (Grehan) - 4:32\n10.\t&quot;Take My Hand&quot; (Grehan) - 3:41\n\n\n\n\n\n\n\n\n\nRacing After Midnight 1988\n\n\n\nRacing After Midnight is the third album by Honeymoon Suite. It was released in 1988.\n\n\nTracks: \n\n\n1.\t&quot;Lookin' Out for Number One&quot; \n2.\t&quot;Long Way Back&quot; \n3.\t&quot;Cold Look&quot; \n4.\t&quot;Love Fever&quot; \n5.\t&quot;Other Side of Midnight&quot; \n6.\t&quot;Love Changes Everything&quot; \n7.\t&quot;It's Over Now&quot; \n8.\t&quot;Fast Company&quot; \n9.\t&quot;Tears on the Page&quot; \n10.\t&quot;Lethal Weapon&quot; (Remix from the Motion Picture)\n\n\n\n\n\n\n\n\n\nMonsters Under The Bed 1991\n\n\n\nTracks: \n\n\n1. Say You Don't Know Me\n2. Bring On The Light\n3. If Ya Love Me\n4. The Road\n5. Little Sister\n6. How Long\n7. Come (Let Me Take You There)\n8. Miracle\n9. It's Only Love\n10. Next to You\n11. Stand Alone\n12. All I Wanted\n\n\n\n\n\n\n\n\nThe Singles 1989\n\n\n\n\nTracks:\n\n\n1. New Girl Now\n2. Burning In Love\n3. Stay In The Light\n4. Wave Babies\n5. Feel It Again\n6. What Does it Take\n7. Bad Attitude\n8. Lethal Weapon\n9. Love changes Everything\n10. Lookin' Out For Number One\n11. Still Lovin' You\n12. Long Way\n\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:c0eb1c12f5ceee0cc4da3323747b1001f3d31cf2","amp;dn":"Honeymoon+Suite+-+5+Albums+1984+-+1991+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0eb1c12f5ceee0cc4da3323747b1001f3d31cf2","infoHashBuffer":{"type":"Buffer","data":[192,235,28,18,245,206,238,12,196,218,51,35,116,123,16,1,243,211,28,242]},"announce":[],"urlList":[]}}