{"title":"Mud and Water: The Teachings of Zen Master Bassui","uid":11801900,"size":537430,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c143a16ec0e5033e0e1ab95b12c62e9e5c4caa1d&amp;dn=Mud+and+Water%3A+The+Teachings+of+Zen+Master+Bassui+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"alongway","files":1,"time":1428419813,"description":"Mud and Water: The Teachings of Zen Master Bassui \n\n\nThe fourteenth-century Zen master Bassui was recognized as one of the most important Zen teachers of his time. Accessible and eloquent, these teachings cut to the heart of the great matter of Zen, pointing directly to the importance of seeing our own original nature and recognizing it as Buddhahood itself. Bassui is taking familiar concepts in Buddhism and recasting them in an essential Zen light.\n\nThough he lived centuries ago in a culture vastly different from our own, Zen Master Bassui speaks with a voice that spans time and space to address our own modern challenges - in our lives and spiritual practice.\n\nLike the revered Master Dogen several generations before him, Bassui was dissatisfied with what passed for Zen training, and taught a radically reenergized form of Zen, emphasizing deep and direct penetration into one's own true nature. And also like Dogen, Bassui uses powerful and often poetic language to take familiar Buddhist concepts recast them in a radically non-dual Zen light, making ancient doctrines vividly relevant","torrent":{"xt":"urn:btih:c143a16ec0e5033e0e1ab95b12c62e9e5c4caa1d","amp;dn":"Mud+and+Water%3A+The+Teachings+of+Zen+Master+Bassui+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c143a16ec0e5033e0e1ab95b12c62e9e5c4caa1d","infoHashBuffer":{"type":"Buffer","data":[193,67,161,110,192,229,3,62,14,26,185,91,18,198,46,158,92,76,170,29]},"announce":[],"urlList":[]}}