{"title":"Atlantis Word Processor v2.02 Portable","uid":15940393,"size":142588955,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c14b6c23d00dc70c32c39f707fbd8b4228822f6f&amp;dn=Atlantis+Word+Processor+v2.02+Portable&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"Vortex72","files":4,"time":1475449670,"description":"Download, unzip and use.  It is portable.\r\n\r\n\r\n\r\nAtlantis Word Processor has all the features you need to create simple documents or great works of literature: novels, essays, reports, letters, diaries, newspaper articles, etc.\r\n\r\nCompose rich-formatted documents from scratch, or edit existing MS Word documents, and send them to colleagues, customers, partners, friends.\r\n\r\nMake eBooks for a living, or just create eBooks to read on your iPad or another eBook reader. Turn any document into an eBook with just a few mouse clicks!\r\n\r\nIntuitive, safe and reliable, superfast, portable and entirely customizable, Atlantis will be the perfect companion for your word processing tasks.\r\n\r\n\r\n\r\n\r\nAtlantis on a memory flash drive\r\n\r\nYou might have to work on computers that do not have Atlantis. Installing Atlantis on a memory flash drive allows you to use Atlantis on such computers. All you have to do is to plug the USB stick into the host PC and launch Atlantis from the USB drive. In this way, Atlantis travels with you. Note that the host computer must match the Atlantis system requirements.\r\n\r\nAtlantis installs on a memory flash drive in the following way:\r\n\r\nIf you have already installed Atlantis on your PC,\r\nLaunch Atlantis on your computer as usual (if it is not running yet).\r\nRun the &quot;Tools | Install to Removable Drive...&quot; command, and follow the onscreen instructions.\r\nIf you do not have Atlantis installed on your PC, or if you have Atlantis on your PC but do not want to transfer its current settings to the flash drive,\r\nDownload the latest setup of Atlantis, and run it on your system.\r\nSpecify a folder on your flash drive as the destination folder for the installation, and complete the setup.\r\nAfter this, Atlantis is ready to be used from the flash drive. Simply connect the flash drive to a computer, locate the corresponding USB drive in Windows Explorer, and run the Atlantis executable from the USB drive (&quot;awp.exe&quot;).\r\n\r\nAtlantis will automatically use the settings stored on the USB stick. Any change to these settings will automatically be saved back to the USB drive. No changes will be made to the registry of the host PC.\r\n\r\nSee also...\r\n\r\nReality Ascent by Dragan Glavasic\r\nWake up!\r\n\r\n\r\n\r\n2016","torrent":{"xt":"urn:btih:c14b6c23d00dc70c32c39f707fbd8b4228822f6f","amp;dn":"Atlantis+Word+Processor+v2.02+Portable","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c14b6c23d00dc70c32c39f707fbd8b4228822f6f","infoHashBuffer":{"type":"Buffer","data":[193,75,108,35,208,13,199,12,50,195,159,112,127,189,139,66,40,130,47,111]},"announce":[],"urlList":[]}}