{"title":"Slime [1990] Die Letzten","uid":4132660,"size":37045815,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c1afefe86d4b95480b02f4fe47c7a9d17fd1683e&amp;dn=Slime+%5B1990%5D+Die+Letzten&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"fourbanger","files":18,"time":1208112475,"description":"Founded in Hamburg in 1979, Slime&amp;#039;s original members (Elf, Eddie, and Ball) played together for several months before a singer (Dirk) came along. Their first concert as Slime was at a Juvenile Hall in Neuengamme, but it was their first release that would officially put them on the map. This first release took the form of a 7&quot; EP called Wir Wollen Keine Bulllenschweine (&quot;We Don&amp;#039;t Want the Pigs!&quot;) and enabled them gig more often - in these days, punk in Germany was inherently combined with the left-wing political activism scene and thus were their concerts at demonstrations, squats, and rallies. In 1981, Slime released their debut full-length, the Slime LP, and were censored by the German government as &quot;reactionaries&quot; when three of the songs on the album caught the negative attention of the beaurocracy. These songs were &quot;A.C.A.B.&quot; (&quot;All Coppers Are Bastards&quot;), &quot;Bullenschweine&quot; (&quot;Bullpigs&quot;, literally, but a grievous insult to the police force), and &quot;Deutschland Muss Sterben&quot; (&quot;Death To Germany&quot;). Later released on AGR (Aggressive Rock Productions), the LP was confiscated and banned throughout Germany, and they were forced to refrain from playing these three songs as a result of this censorship.\n\nAs they became ever more popular, die-hard fans denied rumors that they had sold out with their second LP, Yankees Raus (&quot;Americans Out&quot;). These rumors led to fighting within the audience, and also to the alienation of the dissident portions of their fanbase. Slime played a gig in Hamburg in 1983 with US bands MDC and Dead Kennedys, which led to increased popularity outside of Germany&amp;#039;s borders. 100 police officers waited in the audience, in an attempt to quell the performance of &quot;Polizei SA/SS&quot; and &quot;Bullenschweine&quot;... the performance didn&amp;#039;t come, and 26 police officers quit the force as a result of the stress involved with their mission that night.","torrent":{"xt":"urn:btih:c1afefe86d4b95480b02f4fe47c7a9d17fd1683e","amp;dn":"Slime+%5B1990%5D+Die+Letzten","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1afefe86d4b95480b02f4fe47c7a9d17fd1683e","infoHashBuffer":{"type":"Buffer","data":[193,175,239,232,109,75,149,72,11,2,244,254,71,199,169,209,127,209,104,62]},"announce":[],"urlList":[]}}