{"title":"Being the Other by Saeed Naqvi","uid":15785768,"size":818154,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c1e11ccf2a26cccbb8b8b4fbbb293a5864796ae1&amp;dn=Being+the+Other+by+Saeed+Naqvi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"steve-kon","files":4,"time":1473321383,"description":"Title: Being the Other: The Muslim in India by Saeed Naqvi\r\n\r\nFormat: ePUB, AZW3\r\n\r\nIn this remarkable book, which is partly a memoir and partly an exploration of the various deliberate and inadvertent acts that have contributed to the othering of the 180 million Muslims in India, Saeed Naqvi looks at how the divisions between Muslims and Hindus began in the modern era. The British were the first to exploit these divisions between the communities in the nineteenth and twentieth centuries. In the run-up to Independence, and its immediate aftermath, some of India’s greatest leaders including Mahatma Gandhi, Jawaharlal Nehru, Vallabhbhai Patel, and others only served to drive the communities further apart. Successive governments, whether formed by the Congress or BJP, compounded the problem by failing to prevent (if not actively supporting) tragic events like communal riots in Gujarat (1969 and 2002), Bombay (1992, 1993), Muzaffarnagar (2013), the breaking of the Babri Masjid (1992) and so on. As a reporter, and editor, Naqvi covered all these events (with the exception of Partition), and in the book he shows us, with acuity and insight, how each of these resulted in the shaping of the discontent of the Muslim in India. Thought-provoking and troubling, Being the Other is essential reading for all those interested in understanding the forces that have shaped contemporary Indian society","torrent":{"xt":"urn:btih:c1e11ccf2a26cccbb8b8b4fbbb293a5864796ae1","amp;dn":"Being+the+Other+by+Saeed+Naqvi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1e11ccf2a26cccbb8b8b4fbbb293a5864796ae1","infoHashBuffer":{"type":"Buffer","data":[193,225,28,207,42,38,204,203,184,184,180,251,187,41,58,88,100,121,106,225]},"announce":[],"urlList":[]}}