{"title":"RealtimeBondage--Sybian blasted out of her mind, Rain DeGrey cum","uid":10150200,"size":1330333128,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:c21136b9938a21403f87f032d65a09977e39d163&amp;dn=RealtimeBondage--Sybian+blasted+out+of+her+mind%2C+Rain+DeGrey+cum&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"merzedes","files":-1,"time":1400094251,"description":"\nSybian blasted out of her mind, Rain DeGrey cums repeatedly while facefucked, brutal deepthroat! | Rain DeGrey\n\nMay 13, 2014\n\n\niPod, Low and High bitrate MP4 + Pics.\n\n\nIn round two of her live show, the utter destruction of Rain DeGrey continues. Her reactions on a sybian are nothing short of legendary, she will keep cumming as long as she is bound onto one. Rain is both blessed and cursed. Her sensitive pussy is a hair trigger. She cums easy, she cums hard, and she just can not stop. Long after she is exhausted and delirious, she keeps cumming. Naturally, we have to bind this bitch onto a sybain just to see what happens. Can she suck dick and cum at the same time?\n\nOnly one scene in and Rain is already loopy. That cocky smirk has been wiped right off her face, replaced with a dazed and confused look. Lets see just how much more dazed this sensation slut can get. Crucified on a large wooden beam and shackled down on top of our trusty sybain, Rain is at the perfect height for facefucking. Which is exactly what we do. She cums immediately, hard and shrieking, the second we flip the switch on the sybian. Now is the time to make full use of that wide open mouth hole. Which is exactly what we do.\n\nOne after another the rock hard cocks run a train on Rain's wailing mouth. Screams and drools come out as the dicks slide in. It would be a shame to let those big bound breasts not get properly decorated, and we add some nipple clamps into the mix. The drool flows out and down her restrained breasts, which look tight enough to burst. Rain chokes and gasps on the dick as they reshape her throat meat. All the while she is still cumming. This bitch is broken and we are only just getting started.\n\nRain has cum so hard and been so well fucked that she can no longer form coherent sentences. All it took to put this cocky whore in her place was some bondage, dick and orgasms. She is so cumdrunk she can not see straight. We stick her in our handy cage to give her a chance to compose herself while we set up the next scene. She swoons and mutters to herself as her fingers grasp the wire mesh of the cage, unable to even answer our questions. Welcome to Sexuallybroken slut... \n \nScreens &lt;a href=&quot;\nhttp://www.realtimebondage.com/live/bondage/2014/05_13rdegrey8/RealTimeBondage-Rain-DeGrey-Sybian-blasted-out-of-her-mind-Rain-DeGrey-cums-repeatedly-while-facefucked-brutal-deepthroat.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.realtimebondage.com/live/bondage/2014/05_13rdegrey8/RealTimeBondage-Rain-DeGrey-Sybian-blasted-out-of-her-mind-Rain-DeGrey-cums-repeatedly-while-facefucked-brutal-deepthroat.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:c21136b9938a21403f87f032d65a09977e39d163","amp;dn":"RealtimeBondage--Sybian+blasted+out+of+her+mind%2C+Rain+DeGrey+cum","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c21136b9938a21403f87f032d65a09977e39d163","infoHashBuffer":{"type":"Buffer","data":[194,17,54,185,147,138,33,64,63,135,240,50,214,90,9,151,126,57,209,99]},"announce":[],"urlList":[]}}