{"title":"Gayle McCormick - Best of","uid":7488801,"size":471456583,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c2428ee11d6350fc7c7ff3e904c0c99eea9beab4&amp;dn=Gayle+McCormick+-+Best+of&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"superflash54","files":30,"time":1343671890,"description":"BURN WITH NO GAPS! They are accounted for already\n\nA compilation from this female vocalist best known for her work with the band SMITH. The first four tracks are all SMITH tracks. All but  Track 3 were also 45 A-sides featuring Gayle's lead vocals. \n\nBasically a mainstream pop/rock band with hard rock and soul-influenced arrangements, SMITH hit the Top Ten in 1969 with their drastically revised cover of the Shirelles' &quot;Baby It's You.&quot; Featuring three lead singers and a B-3 Hammond organ, their strongest asset was their most frequent vocalist, Gayle McCormick, an accomplished female blue-eyed soul belter. Most of their material consisted of covers of popular rock and R&amp;B tunes, and they broke up after a couple of albums, though the singles &quot;What Am I Gonna Do&quot; (co-written by Carole King) and &quot;Take a Look Around&quot; made the middle of the charts. (allmusic)\n\nAfter the group disbanded, McCormick went on to record three solo albums, &quot;Gayle McCormick&quot;, &quot;Flesh and Blood&quot; and &quot;One More Hour.&quot;  In the fall of 1971, her performance of &quot;It's A Cryin' Shame&quot; charted at #44. This &quot;Best Of&quot; compilation features  the first two solo albums in their entirety. &quot;One More Hour&quot; paled in comparison and the last track is the only one I included from it.\nHer first solo album is excellent! In the midst of producing The Four Tops, Evie Sands and Dusty Springfield, Lambert and Potter were on a roll, providing a glossy Hollywood take on Northern Soul which makes even the songs you might think are too well trodden absolutely vital. Possibly the best ever version of 'Superstar' too and you know how good that means!\n\nFLESH AND BLOOD has more of a harder edge and has never seen release on CD. Again, an excellent album that met an undeserved fate.  Great vocals and production and a sexy cover! How did this album not make more of a splash back in 1972? \n\nDe-Clicking by Superflash.  Front cover art included\n.\nFLESH AND BLOOD: THE BEST OF GAYLE McCORMICK\n\n1. Baby It's You\n2. Comin' Back to Me\n3. I'll Hold Out My Hand\n4. What Am I Gonna Do\n5. It's a Cryin' Shame \t\n6. Superstar \n7. C'est La Vie \n8. A Natural Woman (You Make Me Feel Like) \n9. You Really Got a Hold on Me \n10. Rescue Me \t\n11. If Only You Believe\n12. Save Me \n13. Everything Has Got to Be Free \n14. Gonna Be Alright Now \n15. Take Me Back\n16. Near You\n17. Sweet Feeling (That Old TimeFeeling) \t\t\n18. Knight in Shining Armor \t\t\n19. Stay With Me \t\t\n20. Flesh and Blood \t\t\n21. Whoever's Thrilling You Is Killing Me \t\t\n22. Make Myself Over \t\t\n23. Grey Line Tour \t\t\n24. Alabam\n25. Original Midnight Mama","torrent":{"xt":"urn:btih:c2428ee11d6350fc7c7ff3e904c0c99eea9beab4","amp;dn":"Gayle+McCormick+-+Best+of","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2428ee11d6350fc7c7ff3e904c0c99eea9beab4","infoHashBuffer":{"type":"Buffer","data":[194,66,142,225,29,99,80,252,124,127,243,233,4,192,201,158,234,155,234,180]},"announce":[],"urlList":[]}}