{"title":"Cymbals - The Age of Fracture (2014) [FLAC]","uid":9655343,"size":368798329,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c276f7e92607b579ee0800c4ed6c7803ce24114a&amp;dn=Cymbals+-+The+Age+of+Fracture+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1393173414,"description":"\n  Cymbals - The Age of Fracture (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: New Wave, Post-Punk\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44.1 KHz\n\n  01 Winter '98\n  02 The Natural World\n  03 You Are\n  04 Empty Space\n  05 The 5%\n  06 The Fracture of Age\n  07 Like An Animal\n  08 Erosion\n  09 This City\n  10 The End\n  11 Call Me\n\n  Cymbals' third full-length album, 2014's The Age of Fracture, finds the '80s post-punk-influenced ensemble further refining their guitar- and keyboard-heavy sound. Beginning with their 2011 debut, Unlearn, and 2013 sophomore effort Sideways, Sometimes, Cymbals displayed a knack for the kind of angular dork-funk, synthesizer-centric dance music, and skittery, intellectual punk first championed by such iconic '80s acts as Talking Heads and Orange Juice. The Age of Fracture is no exception with the London-based quartet delving into a frenetic and even more high-concept and sonically layered collection of songs. Taking its title and inspiration from Princeton academic Daniel T. Rodgers' book of the same name, The Age of Fracture is a thinking man's dance-rock album, chock-full of analog-sounding keyboards, jangly electric guitars, and propulsive beats, in which lead singer Jack Cleverly ruminates on notions of alienation in a modern world. For all intents and purposes, the album sounds like it could have been recorded sometime in the mid-'80s, a fact that should appeal to the band's fans as well as aficionados of classic post-punk era bands like Wire, Kraftwerk, and Human League. The Age of Fracture also fits nicely alongside the work of similarly inclined brethren as Franz Ferdinand and Hot Chip (whose producer, Dreamtrak, assisted Cymbals here). Cuts like &quot;The Natural World,&quot; with its percolating keyboards juxtaposed by Cleverly's pleading vocals, and &quot;Empty Space&quot; are pleasing dance-oriented numbers that bring to mind a mix of '90s Blur and the more synth pop end of the Cure in the '80s. Elsewhere, tracks like &quot;Erosion&quot; and &quot;The City,&quot; with their driving Peter Hook-influenced basslines, evince a more urgent, post-punk aesthetic. Ultimately, with The Age of Fracture, Cymbals turn disconnection and dystopia into danceable fun.","torrent":{"xt":"urn:btih:c276f7e92607b579ee0800c4ed6c7803ce24114a","amp;dn":"Cymbals+-+The+Age+of+Fracture+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c276f7e92607b579ee0800c4ed6c7803ce24114a","infoHashBuffer":{"type":"Buffer","data":[194,118,247,233,38,7,181,121,238,8,0,196,237,108,120,3,206,36,17,74]},"announce":[],"urlList":[]}}