{"title":"PAIN [PS3 Multi5][Nautilus-bt]","uid":6433573,"size":1237779862,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:c2ce60f0d0ede7e4a28a386ee761d1881e3630c8&amp;dn=PAIN+%5BPS3+Multi5%5D%5BNautilus-bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"someuser11","files":1,"time":1306749869,"description":"PAIN is much more than a game, it is a creative, user-driven comedic experience that presents players with the unique opportunity to control and capture the irreverent style of humor found in slapstick movies and online video clips. The game boldly tackles a rarely explored area of video-gaming: comedy. Many games and products have allowed players to experience scripted, comedic scenes, but none have successfully allowed the end-user to actually be the architect of these situations- until now.\n\nClick here to read the complete review\n\nPAIN e' molto piu' di un gioco, e' un'esperienza comico-creativa dove il giocatore ha l'oppurtinata unica di controllare e catturare l'irreverente stile di comicita' presente nei video clip che si trovano online. Il gioco affronta con coraggio un argomento raramento esplorato nei video giochi: la comicita'. Molti giochi e prodotti hanno permesso ai giocatori di assistere a scene comiche, ma nessuno era riuscito a dare al giocatore la possibilita' di essere l'architetto di tali situzazioni - fino ad ora.\n\nClicca qui per leggere la recensione completa\n\n\n\nRelease Date : 25/06/09\nGenre : Action\nLanguage : Multi5\nTested: on PS3 Phat 60GB with CFW Kmeaw 3.55\n\n\n\n\n\n\n\n\nExtract the files\nInstall CFW and MultiMAN on your PS3\nTransfer extracted files to your PS3 internal HD by FTP with multiman\nInsert an original game disc in your PS3, use MultiMAN for load the game, then start the game from the PS3 XMB\n\nEstrarre i files\ninstallare CFW e multiman sulla PS3\nTrasferire via FTP i files con multiman\nInserire un disco originale nella PS3, usare MultiMAN per caricare il gioco, quindi far partire il gioco dalla XMB della PS3","torrent":{"xt":"urn:btih:c2ce60f0d0ede7e4a28a386ee761d1881e3630c8","amp;dn":"PAIN+%5BPS3+Multi5%5D%5BNautilus-bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2ce60f0d0ede7e4a28a386ee761d1881e3630c8","infoHashBuffer":{"type":"Buffer","data":[194,206,96,240,208,237,231,228,162,138,56,110,231,97,209,136,30,54,48,200]},"announce":[],"urlList":[]}}