{"title":"Francesco's Italy (BBC 2006 - Complete)","uid":11022906,"size":1926301396,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c33b064df59f922dba9577ba474feb9e8844b546&amp;dn=Francesco%27s+Italy+%28BBC+2006+-+Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"davieboy1966","files":6,"time":1410624820,"description":"TV : Documentary : DVD quality : English\n\n1) The Romantic North\nFrancesco da Mosto sets off to travel the length and breadth of Italy in a classic Alfa Romeo Duetto Spider. In the opening episode, he gets romantic in Juliet's home town of Verona; witnesses the birth of Western art; has a fashion makeover from Giorgio Armani; is invited into a closed convent to see the tomb of the most notorious woman in European history; and goes deep-sea diving in pursuit of a childhood dream.\n\n2) A British Love Affair\nFrancesco da Mosto travels the length and breadth of Italy. Da Mosto enters Tuscany and Umbria to look at the long love affair that Britain has had with the area. He learns how to be the perfect courtier in Urbino; goes grape harvesting in Chianti; discovers the romantic inspiration at the heart of Puccini's operas; travels to Assisi to find out why he was named after St Francis; and takes Dame Maggie Smith on a sightseeing tour of Florence.\n\n3) The Heart of Italy\nFrancesco da Mosto travels the length and breadth of Italy. He discovers why Rome is the Eternal City and goes head to head with Mussolini. Travelling via the fantastic water gardens of Villa d'Este and the royal seat of the Bourbon dynasty, he arrives in Naples. After an encounter with Italy's most astonishing sculpture and a lesson in Neapolitan pizza making, Francesco descends deep into the caverns of underground Naples and discovers an eerie cult of the dead.\n\n4) The Land of my Mother\nFrancesco da Mosto travels the length and breadth of Italy. He visits the south and Sicily, home of his mother's family for more than 500 years. Easter celebrations in the south involve the streets running red with celebrants' blood and the locals indulge in frantic dances to ward off the threat of the tarantula. On Sicily, the brooding majesty of Etna terrifies Francesco as he stares into the volcano, but there's beauty and art at the Villa Bagheria and at Noto an explosion of baroque decadence.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:c33b064df59f922dba9577ba474feb9e8844b546","amp;dn":"Francesco%27s+Italy+%28BBC+2006+-+Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c33b064df59f922dba9577ba474feb9e8844b546","infoHashBuffer":{"type":"Buffer","data":[195,59,6,77,245,159,146,45,186,149,119,186,71,79,235,158,136,68,181,70]},"announce":[],"urlList":[]}}