{"title":"[SoM]Il nemico alle porte[DvdRip-Xvid-Ita-Mp3]","uid":4875821,"size":1468026880,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c464014d52a3764ebbaf723bc77021384a6a777a&amp;dn=%5BSoM%5DIl+nemico+alle+porte%5BDvdRip-Xvid-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mitimex","files":2,"time":1241121928,"description":"Autunno 1942, sul fronte bellico sovietico in vista di Stalingrado. Per contrastare l'offensiva tedesca, ai soldati russi viene comandato di gettarsi a capofitto verso il nemico, avendo a disposizione un fucile in due. Quando un soldato muore, l'altro deve raccogliere l'arma e proseguire. Non c'ÃƒÂ¨ scampo per eventuali disertori che vengono eliminati dalla stessa retrovia sovietica.\nIn questo panorama di massacro, il giovane Vassili si mette in evidenza per doti di particolare precisione nel tiro. Il funzionario Danilov se ne accorge, lo segnala a Krusciov, e in poco tempo Vassili diventa famoso come eroe e simbolo della battaglia sovietica contro l'invasore.\nDalla Germania arriva al fronte il maggiore Konig, a sua volta esperto tiratore, con il compito di stanare questo inatteso cecchino. Mentre Vassili si innamora, ricambiato, di Tania, soldatessa trasferita nelle retrovie, il piccolo fratello di lei, Sasha, mette in atto una specie di doppio gioco tra le linee nemiche, dando a Konig false informazioni sulla posizione di Vassili. I due si inseguono a lungo, mentre la battaglia vive un momento tragico: i tedeschi sfondano le linee, i sovietici si ritirano, Tania ÃƒÂ¨ ferita nello scoppio di una bomba e Sasha viene eliminato da Konig che aveva scoperto l'inganno.\nArriva infine la resa dei conti. Grazie all'intervento di Danilov, che vuole riscattare la propria mediocre esistenza, Konig esce allo scoperto e in quell'attimo Vassili lo colpisce a morte. PiÃƒÂ¹ tardi, dopo il ritiro dei tedeschi, Vassili ritrova Tania e resta con lei in una situazione di pace. ","torrent":{"xt":"urn:btih:c464014d52a3764ebbaf723bc77021384a6a777a","amp;dn":"%5BSoM%5DIl+nemico+alle+porte%5BDvdRip-Xvid-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c464014d52a3764ebbaf723bc77021384a6a777a","infoHashBuffer":{"type":"Buffer","data":[196,100,1,77,82,163,118,78,187,175,114,59,199,112,33,56,74,106,119,122]},"announce":[],"urlList":[]}}