{"title":"FSX - Aerosoft Luxembourg Airport V3.00","uid":6140462,"size":487363347,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c46f4e1e2b1588e0f3e742996a39f266320c47ff&amp;dn=FSX+-+Aerosoft+Luxembourg+Airport+V3.00&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"UberScary","files":1,"time":1296482392,"description":"\nProduct overview\n\nProduct description:\n\nThis package includes the three airports of Luxembourg in great detail and the complete country with all relevant landmarks and sightseeing objects. It has detailed mesh and aerial imagery covering the terrain. All buildings on and around the airport of ELLX are photorealistic. \n\nLuxembourg is, with an area of 2586 kmÃ‚Â², the second smallest country in European Union. But it houses a large amount of international institutions that create a steady stream of civil servants to and from the Duchy. For example the European Court of Justice, European Court of Auditors, European Investment Bank and the secretariat of the European Parliament.\n\nAlthough not know as an aviation superpower it does have three airports and it handles an amazing amount of passengers from the surrounding countries. Sixteen airlines, including German Charter airlines fly on Findel. There are two airlines using Findel as their home base: passenger airline Luxair and cargo airline Cargolux. Cargolux has a direct connection to the highway and is a major company from a small country.\n\nThis package includes the detailed airports of Luxembourg and the complete country with all relevant landmarks and sightseeing objects. It has detailed mesh and aerial imagery covering the terrain. All buildings on and around the airport of ELLX are photorealistic.\n\nThrough the support of the Cargolux simulation department, all ground marks and relevant signs were adopted to reflect reality. The status resembles the date of the inauguration of Terminal A, as of August 2008.\n\nFeatures:\n\nDetailed transformation of Luxemburg-Findel Airport(ELLX), including its neighbourhood\nPhoto realistic ground textures on the basis of arial photographs\nVFR-Airfields Noutrange(ELNT) and Useldange (ELUS) have been incorporated in the package\nObstacles and numerous places of interests in Luxembourg and Cattenom (France) were added\nDetailed Mesh for all of Luxembourg\nLandclasses were revised\nDetailed handbook with numerous information is included\nConfiguration Tool for control of all seasons, as required; Activation/Deactivation tool of static aircraft\nFully supported by AES (from version 2.04)\nThe following details were incorporated in ELLX:\n\nAll buildings were created on the basis of aerial photos acc. to original construction plans until the middle of 2008\nGates were added in glass (transparent textures)\nAnimated gates at Terminal A\nHigh resolution day-/nighttextures in two steps to optimize performance\nSound simulation at numerous places of the airport\nGround textures according to the season\nReal runway- and taxiway-illumination in 3-D\nApron signs and markings as in live operations\nNumerous static objects like ground service vehicles, buses, trucks add to animated dynamic reality\nAdditional buildings in the vicinity of the airport\nAI-traffic compatible; The AFCAD-file contains all live parking positions\nGA-traffic included with aircraft and expanded for add-ons of VFR-airfields","torrent":{"xt":"urn:btih:c46f4e1e2b1588e0f3e742996a39f266320c47ff","amp;dn":"FSX+-+Aerosoft+Luxembourg+Airport+V3.00","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c46f4e1e2b1588e0f3e742996a39f266320c47ff","infoHashBuffer":{"type":"Buffer","data":[196,111,78,30,43,21,136,224,243,231,66,153,106,57,242,102,50,12,71,255]},"announce":[],"urlList":[]}}