{"title":"Gavin Friday - Each Man Kills The Thing He Loves[FLAC - LOSSLESS","uid":3830332,"size":336397989,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c48f61f13e8658e2724f3ea640254a52d3c9cf15&amp;dn=Gavin+Friday+-+Each+Man+Kills+The+Thing+He+Loves%5BFLAC+-+LOSSLESS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"99AM","files":19,"time":1191560707,"description":"FLAC files + CUE sheet + Covers\n\n\n\nTrack Listing:\n1. Each Man Kills the Thing He Loves\n2. Tell Tale Hart\n3. Apologia\n4. Dazzle and Delight\n5. Next\n6. You Take Away the Sun\n7. Death Is Not the End\n8. He Got What He Wanted\n9. Man of Misfortune\n10. Rags to Riches\n11. Next Thing to Murder\n12. Love Is Just the Wind\n13. Another Blow on the Bruise\n14.\n\nReview from AMG:\nMaking his solo debut with a nod to an earlier Irish aesthete, Friday&amp;#039;s album isn&amp;#039;t merely titled after a legendary line from Oscar Wilde&amp;#039;s Ballad of Reading Gaol, but kicks off with the title track, where all lyrics in fact come from said poem. Each Man Kills shows a slightly calmer Friday at play, making the same transition to Scott Walker-inspired dark, spiked cabaret that kindred spirits Nick Cave and Marc Almond also did in their own solo careers to one extent or another. Friday&amp;#039;s own take on that spirit actually fits exactly between Cave and Almond&amp;#039;s work -- the slow pace and country twang of &quot;Tell-Tale Heart&quot; could come right from Your Funeral My Trial. The fact that Friday covers two songs here that Cave and Almond would each separately do later (Bob Dylan&amp;#039;s &quot;Death Is Not the End&quot; and Jacques Brel&amp;#039;s &quot;Next&quot;) further shows the similar inspirations shared. In keeping with the overall transformation, Friday eschews the over the top wails and shrieks of his younger days -- his register is still high, but the delivery is much more controlled, showing a greater range while losing none of his desperate passion. Seezer contributes fine lead keyboard work throughout, but Friday&amp;#039;s other key partner is producer Hal Willner, who had clearly demonstrated his own credentials for this kind of music with his Kurt Weill tribute album a few years previously. With a range of talented New York types to work with, including Bill Frisell and Fernando Saunders, Willner gets sympathetic performances from all to back Friday and Seezer&amp;#039;s explorations into wrecked romance, tortured souls and 2 a.m. moods. It isn&amp;#039;t mere recreation of 1930&amp;#039;s Berlin, but a palette of styles, from the dank, slow crawl of &quot;Dazzle and Delight&quot; to the soaring &quot;You Take Away the Sun&quot; and the kicking glam rock-inspired &quot;Man of Misfortune.&quot;\n\nEnjoy!","torrent":{"xt":"urn:btih:c48f61f13e8658e2724f3ea640254a52d3c9cf15","amp;dn":"Gavin+Friday+-+Each+Man+Kills+The+Thing+He+Loves%5BFLAC+-+LOSSLESS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c48f61f13e8658e2724f3ea640254a52d3c9cf15","infoHashBuffer":{"type":"Buffer","data":[196,143,97,241,62,134,88,226,114,79,62,166,64,37,74,82,211,201,207,21]},"announce":[],"urlList":[]}}