{"title":"Bioinspired Intelligent Nanostructured Interfacial Materials","uid":15598368,"size":48301541,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c4ed138da65aed4db7578bc702911c4579fccb82&amp;dn=Bioinspired+Intelligent+Nanostructured+Interfacial+Materials&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1471598413,"description":"Bioinspired Intelligent Nanostructured Interfacial Materials - Lei Jiang, Lin Feng (WSP, 2010).pdf\r\n\r\nIntelligent materials are emerging composite functional materials that have boomed since the 1990s. The intelligent material system, involving a multitude of structures and functions, combines studies that explore nature, mimic nature and surpass nature. It also provides novel ideas, new theories, and cutting-edge methodologies for the innovation of science and technology. Thus, mimicking the micro/nanostructures and functions found in nature will build a bridge between biology and technology, which may provide inspirations for solving today's technological problems. This book gives a complementary introduction about natural and artificial micro/nanoscale interfacial materials, devoting largely to the intelligent materials with special wettabilities. Inspired by nature, the authors proposed a concept of &quot;binary cooperative complementary micro/nanoscale interfacial materials&quot;. Based on this design concept, the contact and coupling of heterogeneous materials will result in novel properties on the surface or interface of materials, which may create new functional materials and devices. This book combines popular science and professional knowledge, which will be suitable for not only researchers but also science lovers","torrent":{"xt":"urn:btih:c4ed138da65aed4db7578bc702911c4579fccb82","amp;dn":"Bioinspired+Intelligent+Nanostructured+Interfacial+Materials","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4ed138da65aed4db7578bc702911c4579fccb82","infoHashBuffer":{"type":"Buffer","data":[196,237,19,141,166,90,237,77,183,87,139,199,2,145,28,69,121,252,203,130]},"announce":[],"urlList":[]}}