{"title":"Roma di Luna...Casting The Bones(2008)[FLAC]","uid":6276649,"size":267264526,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c598c2977af4bfa249e1e7d4468f63a9c2aa517d&amp;dn=Roma+di+Luna...Casting+The+Bones%282008%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":15,"time":1301286803,"description":"[img]http://ecx.images-amazon.com/images/I/51tGCZ%2BsxTL._SS000_.jpg[/img]\n[color=Green]2008 Casting the Bones   CD  [/color] \n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n1 The Romance of Wolves   4:30 \n2 Tamae   4:13 \n3 Trouble Down the Road   3:33 \n4 Red Walls   3:27 \n5 Wildfire   6:10 \n6 Fortune Teller   3:04 \n7 I Can't Afford to be Broke   2:58 \n8 Silver Dagger   3:40 \n9 These Tears Ain't Mine (Reprise)   3:38 \n10 I'm Gone   4:42 \n11 Pearls for Pigs   3:27 \n\n\n\nRoma di Luna's third studio recording &quot;Casting the Bones&quot; is as much an exploration into the group's sound as it is a total reinvention of the aesthetics and boundaries their previous records have established. &quot;Casting the Bones&quot; refers to fortune telling methods of old, gambling games, and can also be interpreted as a common technique for healing a broken bone - All of these definitions fit comfortably with this collection of songs that are at once familiar, intriguing, ambitious, and possess a healing quality for both listener and songwriter alike.\n\nSinger/songwriter husband/wife team Alexei and Channy Moon Casselle keep their feet rooted in the traditional folk song idiom with Bones while their hands seem to reach freely for whatever nuance or shape they wish to apply to their creations.\n\nWhere last year's release of &quot;Find Your Way Home&quot; felt more like the duo's project with some assistance from hired hands, Casting the Bones is a full band collaboration at its finest with each player adding just the right ingredient and nothing more.\n\nAnother evolutionary step for Roma di Luna was the recording process itself, which supplied much more cohesive and organic results with this newest release that was recorded almost entirely in one intensive session and tracked live, as opposed to former methods of patchwork recording in which every track was recorded individually and sometimes weeks apart from each other.\n\nCo-produced and engineered by Ben Durrant at Crazy Beast Studio (Andrew Bird, Dosh), Durrant also played electric guitar along with myriad instruments and manipulated sounds on the record giving it a layer of unworldly and ethereal undertones, yet the album remains anchored with Alexei and Channy's comforting vocal narrative and passionate deliveries respectively.\n\nComing just nine months after their last album, this body of work is urgent rather than rushed, brimming with inspiration from both tragic and triumphant peaks within the group's personal lives.\n\ncd ripped by dBpoweramp\n\nplease seed\n\n[url]http://dickthespic.org/2010/12/31/roma-di-luna/[/url]","torrent":{"xt":"urn:btih:c598c2977af4bfa249e1e7d4468f63a9c2aa517d","amp;dn":"Roma+di+Luna...Casting+The+Bones%282008%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c598c2977af4bfa249e1e7d4468f63a9c2aa517d","infoHashBuffer":{"type":"Buffer","data":[197,152,194,151,122,244,191,162,73,225,231,212,70,143,99,169,194,170,81,125]},"announce":[],"urlList":[]}}