{"title":"X-Men - The Complete Messiah Trilogy + Extras","uid":9464363,"size":2277361152,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c6788789622c515a7b33fcbfb563bcf3bb348c15&amp;dn=X-Men+-+The+Complete+Messiah+Trilogy+%2B+Extras&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"VikTSlick","files":-1,"time":1389424561,"description":"This torrent is the &quot;definitive&quot; collection of the Messiah Trilogy, a major series of three X-Family stories that form one long, cohesive 3-act story arc. Spinning out of the major crossover events Avengers Disassembled and House of M, the primary plotline revolves around Hope - the first new mutant born since the Scarlet Witch used her abilities to depower all but 198 mutants throughout the entire world. Cyclops believes that this child could be the &quot;Mutant Messiah&quot;, but when the X-Men go to retrieve her they find out that they were not the first to arrive on the scene. Thus begins &quot;Messiah Complex&quot;, the first of the three tales. The second, &quot;Messiah War&quot;, is a cataclysmic battle and a race against time involving X-Force and Cable; the third, &quot;Second Coming&quot;, deals with the return of Hope - from where I will not say, for fear of spoilers - but rest assured it causes massive amounts of havoc as multiples friends and enemies race to find her! ;-)\n\nI have carefully assembled this torrent to add as much relevant supplemental material as possible, without it being too overbearing. The final set of files covers about 5 years worth of material from the X-Men Universe and is divided into 6 sections, all numbered and organized as follows:\n\n00. Supplemental - A prologue of sorts, this deals with the fallout from the House of M event and specifically &quot;M-Day&quot;, as the fateful day becomes known to mutants. Includes X-Men v2 #177-179, House of M/Decimation - The Day After (One-Shot), X-Men - The 198 (Limited Series) and X-Men: Endangered Species (One-Shot). I've also included a reading list for the entire 17-part Endangered Species story but since it is told in small backups only in the regular comics,  I have not included every issue, as they are not really relevant here.\n\n01. Messiah Complex TPB - A high-res TPB of the entire Messiah Complex storyline, in lieu of individual issues due to the trade being better quality. Relevant issues are X-Men: Messiah CompleX (One-Shot), Uncanny X-Men #492-494, X-Men #205-207, New X-Men #44-46, X-Factor #25-27, and X-Men: Messiah CompleX - Mutant Files (One-Shot).\n\n01A. Supplemental - relevant material bridging the gap between Messiah Complex and Messiah War. Most included issues cover either the plans of Bastion, the major villain of the arc, or what occurs for the X-Men and Cable directly after the conclusion of MC. Includes X-Men: Divided We Stand (Two-Shot), X-Force v3 #01-06, 12-13; Cable v2 #01-12, and X-Men: Manifest Destiny #01-05 (Limited Series + Nightcrawler One-Shot).\n\n02. Messiah War - The complete story along with the 3-part prelude that serves as a lead-in, and is included in the TPB (which I couldn't find, so the individual issues are provided instead). Relevant materials are The Times and Life of Lucas Bishop #01-03 (Limited Series), X-Force/Cable - Messiah War Prologue (One-Shot), Cable v2 #13-15 and X-Force v3 #14-16.\n\n02A. Supplemental - Covers the events of Utopia and the follow-up, Nation X, as well the remaining pages of Cable and X-Force leading into the conclusion of the trilogy in Second Coming. Note - I have only included the &quot;core&quot; stories for both Utopia and Nation X for the sake of brevity and clarity/cohesiveness; both sagas can be found in full on TPB if you so desire but it is not necessary to add all the extraneous bits here. Includes 3 Dark Avengers/Uncanny X-Men One-Shots (Utopia, Exodus, and Dark X-Men: The Confession), Uncanny X-Men #513-514, Dark Avengers #07-08, Nation X #01-04 (Limited Series + X-Factor One-Shot), X-Force v3 #17-25, and Cable v2 #16-25.\n\n03. Second Coming - The final part of this torrent and the exciting conclusion to this saga, in the form of a high-res TPB instead of the numbered issues. Covers these issues - Second Coming: Prepare (One-Shot), X-Men: Second Coming #01-02, Uncanny X-Men #523-525, New Mutants #12-14, X-Men: Legacy #235-237 and X-Force v3 #26-28. I have added a &quot;Tie-Ins&quot; folder which includes all remaining Second Coming: Revelations additional content; this contains X-Men: Hope, X-Men: Blind Science, X-Men: Hellbound #1-3 and X-Factor #204-206. These tie-ins are meant to be read concurrently with the main chapters but can be read as an epilogue of sorts as well; check out [url]http://en.wikipedia.org/wiki/X-Men:_Second_Coming#Reading_order[/url] for more details.\n\nSorry for this wall of text but I hope it makes clear exactly what you get in this package. Feel free to ignore my supplementals and just read the main story arc, or take whatever you want, etc., and go from there. Taken as a whole, though, I think you will get a complete understanding of what the X-Men family was up to from most of 2006 through the end of 2010 and it is really good stuff, IMHO - otherwise I wouldn't have spent so much time on this torrent, lol. As always, MASSIVE credit and thanks to the original scanners (especially Minutemen) and uploaders as well - I cobbled this together from a TON of different torrents floating out there. As always, please seed - I know it's large but I will be seeding indefinitely - and enjoy the good reads! :-)","torrent":{"xt":"urn:btih:c6788789622c515a7b33fcbfb563bcf3bb348c15","amp;dn":"X-Men+-+The+Complete+Messiah+Trilogy+%2B+Extras","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6788789622c515a7b33fcbfb563bcf3bb348c15","infoHashBuffer":{"type":"Buffer","data":[198,120,135,137,98,44,81,90,123,51,252,191,181,99,188,243,187,52,140,21]},"announce":[],"urlList":[]}}