{"title":"HISTORY OF POP AND ROCK MUSIC - part 493","uid":8330028,"size":384042500,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c6962234ff2803250d8c90475a3ac3ecff82ed78&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+493&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1364866853,"description":"\n\n                      PART  493\n\n\n\n                 NEIL YOUNG  -  Dead Man  (1995)\n                 NEIL YOUNG  -  Love And War  (2010) \n\n\n\n     &quot;Dead Man&quot; is the soundtrack to the 1995 Jim Jarmusch western-themed film of the same name starring Gary Farmer, and Johnny Depp as William Blake. Neil Young recorded the soundtrack by improvising (mostly on his electric guitar, with some acoustic guitar, piano and organ) as he watched the newly edited film alone in a recording studio. The soundtrack album consists of seven instrumental tracks by Young, with dialog excerpts from the film and Johnny Depp reading the poetry of William Blake interspersed between the music. The version of the main theme used over the film's beginning and end credits is not included, but was released as a promo single.\n\n     &quot;Le Noise&quot; is the thirty-third studio album by Canadian musician Neil Young, released in 2010. The album was recorded in Los Angeles and produced by Daniel Lanois. Lanois stated in an interview with Rolling Stone that &quot;We cut a couple of solo acoustic songs, but the rest is very electric&quot;. A music video for the track &quot;Angry World&quot; was premiered on September 14, 2010. A music video for &quot;Hitchhiker&quot; was also premiered on September 17, 2010. The video for &quot;Love And War&quot; was released on September 20, 2010 and the video for &quot;Walk With Me&quot; on September 22, 2010.The track &quot;Angry World&quot; won a Grammy Award for Best Solo Rock Vocal Performance.\n\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:c6962234ff2803250d8c90475a3ac3ecff82ed78","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+493","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6962234ff2803250d8c90475a3ac3ecff82ed78","infoHashBuffer":{"type":"Buffer","data":[198,150,34,52,255,40,3,37,13,140,144,71,90,58,195,236,255,130,237,120]},"announce":[],"urlList":[]}}