{"title":"(1991) David Bowie - Tin Machine II [APE+.cue] {100.XY}","uid":8358683,"size":340141151,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c6ef909f832e91dd215c72d92e4baf2a7811182d&amp;dn=%281991%29+David+Bowie+-+Tin+Machine+II+%5BAPE%2B.cue%5D+%7B100.XY%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"100.XY","files":-1,"time":1365557690,"description":"Wikipedia:\nTin Machine II is an album by Tin Machine, originally released by Victory Music in 1991.\nThe band reconvened following their 1989 tour, recording most of the album before taking a rest while David Bowie conducted his solo Sound+Vision Tour and filmed The Linguini Incident.\nIn describing this album, Reeves Gabrels said &quot;this album is as aggressive as the first one, but the songs are more melodic. Last time, we were screaming at the world. This time, I think, they're all love songs in a strange kind of way.&quot; Reeves joked that his playing style was something his friends called &quot;tonal chromaticism, which is 'any note you want as long as you end on a right note.'&quot;\nGabrels later stated that at the time he was deeply into Nine Inch Nails' album Pretty Hate Machine and was looking for an industrial edge to his own guitar work for the album. Ultimately (after recording track after track of guitar noise), he found a &quot;shard of guitar noise&quot; that he liked and used it on the album track &quot;Shopping for Girls,&quot; a song about child prostitution in Thailand.\n&quot;If There Is Something&quot; (a Roxy Music cover) was originally recorded during the sessions for the first Tin Machine album but didn't come out satisfactorily, so it was shelved until this album.\nThe track &quot;Goodbye Mr. Ed&quot; was started as a jam the band used to tune up one day. Tony Hunt recalled &quot;We all came back from lunch and David had written a whole sheet of lyrics for it, and then he put the vocal on later with the melody.&quot; Bowie described the meaning of the song this way:\n[The song] is very much juxtaposing lines which really shouldn't fit, free-association around the idea of 'bye-bye, '50s America.' New York once belonged to the Manahattos - a tribe that used to have that bit of land before it became Manhattan. That was the first real, solid image I had ... I thought, 'That's what this song's about.'\nThe group signed to Victory Music[6] and added three further tracks in Los Angeles, with Hugh Padgham (producer of Bowie's 1984 album Tonight) overseeing the song &quot;One Shot&quot;. The album was issued in September 1991. Hunt Sales took lead vocals on two tracks: &quot;Stateside&quot; and &quot;Sorry.&quot;\nThe song &quot;Betty Wrong&quot; featured in the film &quot;The Crossing&quot; (1990).\n\n\nCountry: UK\nGenre: Rock\nQuality: APE+.cue (lossless)\n\nTracklist:\n1. Baby Universal\n2. One Shot\n3. You Belong in Rock &amp; Roll\n4. If There Is Something\n5. Amlapura\n6. Betty Wrong\n7. You Can't Talk\n8. Stateside\n9. Shopping for Girls\n10. Big Hurt\n11. Sorry\n12. Goodbye Mr. Ed\n","torrent":{"xt":"urn:btih:c6ef909f832e91dd215c72d92e4baf2a7811182d","amp;dn":"%281991%29+David+Bowie+-+Tin+Machine+II+%5BAPE%2B.cue%5D+%7B100.XY%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6ef909f832e91dd215c72d92e4baf2a7811182d","infoHashBuffer":{"type":"Buffer","data":[198,239,144,159,131,46,145,221,33,92,114,217,46,75,175,42,120,17,24,45]},"announce":[],"urlList":[]}}