{"title":"Magic Camera 8.8.0 Incl Key - Cyclonoid","uid":8868124,"size":17214724,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c6f2a6baa06d773b975387f341deaf0246bc4fc3&amp;dn=Magic+Camera+8.8.0+Incl+Key+-+Cyclonoid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"cyclonoid","files":-1,"time":1377980226,"description":"Magic Camera adds a powerful virtual camera to your system for video chat. You can use it as a real webcam and set pre-recorded video, photo albums, animations and desktop screens as its output. It support most webcam chat software or online chat website - MSN Messenger, Yahoo! Messenger, PalTalk, Skype, AIM, ICQ, Camfrog, ANYwebcam and many others. Also, Magic Camera can add lots of funny photo frames, do text, image, animation, video overlays, support picture in picture functions and add amazing video effect to your real webcam and enable it to be used by several applications at the same time.\n\nHere are some key features of &quot;MagicCamera&quot;:\n\n. Add a virtual camera to your instant messenger or video chat software.\n. Split real webcam into virtual camera for using with multiple programs simultaneously.\n. Share your desktop screen or windows with your friends in the messenger by selecting this virtual camera.\n. Add lots of funny photo frames and do image overlays to your webcam.\n. Record webcams or activity on screen and encode them to video files for later playback in virtual camera. With this, you can save your video conversation.\n. Play pre-recorded videos to your friends without even having a physical webcam.\n. Add various fantastic video effects to your web camera/video files/photos/screen and show it to your friends.\n. Do a live desktop screen streaming by capturing screen as well as sending it out at the same time. With this option, you can send back your friend's live video like a mirror. Also, using this virtual camera, you can keep your privacy by pretending to be some one else. Even more, freely add magic video effects to the video!\n. Slide Show your photo albums in your favorite IM.\n. Easily switch video input between your real camera and other virtual sources.\n. Check update automatically.\n. Easy to use; Simple installation that will have you up and running this powerful virtual camera in minutes.\n. Text overlay enabled.\n. Easily add widget, face to webcam.\n. Picture in Picture.\n. Video and Animation overlay;\n. Change background of webcam;\n. On screen edit by mouse drag;\n. Users can add or customize their own effects.\n. Optimized performance if multi-core is available.\n. Continually added lots of funny effects.\n. Support FLV files.\n. Three transparent modes.\n\nOS : Windows 2000 / XP / Vista / Win7 / Windows Server 2008 / Windows 8 (For both 32bit and 64bit)\nLanguage : Multilingual \n\nHome Page - http://www.shiningmorning.com/\n\nScreenshot: http://bayimg.com/FAPLIAAeE\n\nInstall Notes\n1.Install the app\n2.Use the given key to activate\n3.Enjoy our release by seeding it :) ","torrent":{"xt":"urn:btih:c6f2a6baa06d773b975387f341deaf0246bc4fc3","amp;dn":"Magic+Camera+8.8.0+Incl+Key+-+Cyclonoid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6f2a6baa06d773b975387f341deaf0246bc4fc3","infoHashBuffer":{"type":"Buffer","data":[198,242,166,186,160,109,119,59,151,83,135,243,65,222,175,2,70,188,79,195]},"announce":[],"urlList":[]}}