{"title":"Hitler's Preemptive War: The Battle for Norway, 1940","uid":8672563,"size":2485448,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c71ea7bf6bd79ecaf6391b5ffadd42f953090896&amp;dn=Hitler%27s+Preemptive+War%3A+The+Battle+for+Norway%2C+1940&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Djofullinn","files":1,"time":1373523281,"description":"A thorough examination of one of history's revolutionary campaigns . . .After Hitler conquered Poland, and while still fine-tuning his plans against France, the British began to exert control of the coastline of neutral Norway, an action that threatened to cut off Germany's iron-ore conduit to Sweden and outflank from the start its hegemony on the Continent.The Germans quickly responded with a dizzying series of assaults, using every tool of modern warfare developed in the previous generation. Airlifted infantry, mountain troops and paratroopers were dispatched to the Scandinavian nation, seizing Norwegian strong points while forestalling larger but more cumbersome Allied units.The German navy also set sail, taking a brutal beating at the hands of Britannia, while ensuring with its sacrifice that key harbors could be held open for resupply. As dive bombers soared overhead, small but elite German units traversed forbidding terrain to ambush Allied units trying to forge inland. At Narvik, some 6,000 German troops battled 20,000 French and British, until the Allies were finally forced to withdraw by the great disaster in France, which had then get underway.As a veritable coda to the campaign, the aircraft carrier Glorious, while trying to sail back to Britain, was hammered under the waves by the German battle cruiser Scharnhorst.The air, airborne, sea, amphibious, infantry, armor and commando aspects of this brief but violent campaign are here covered in meticulous detail. Henrik Lunde, a native Norwegian and former U.S. Special Operations colonel, has written perhaps the most objective account to date of a campaign in which 20th century military innovation found its first fertile playing field.\n &lt;a href=&quot;\nhttp://www.amazon.com/Hitlers-Preemptive-War-Historys-Operations/dp/1932033920/ref=sr_1_2?s=books&amp;ie=UTF8&amp;qid=1373515850&amp;sr=1-2&amp;keywords=Hitler%27s+Preemptive+War&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Hitlers-Preemptive-War-Historys-Operations/dp/1932033920/ref=sr_1_2?s=books&amp;ie=UTF8&amp;qid=1373515850&amp;sr=1-2&amp;keywords=Hitler%27s+Preemptive+War&lt;/a&gt;","torrent":{"xt":"urn:btih:c71ea7bf6bd79ecaf6391b5ffadd42f953090896","amp;dn":"Hitler%27s+Preemptive+War%3A+The+Battle+for+Norway%2C+1940","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c71ea7bf6bd79ecaf6391b5ffadd42f953090896","infoHashBuffer":{"type":"Buffer","data":[199,30,167,191,107,215,158,202,246,57,27,95,250,221,66,249,83,9,8,150]},"announce":[],"urlList":[]}}