{"title":"[DJVU] [1988] Pandolfini's Endgame Course Basic Endgame Concept","uid":6455072,"size":1777599,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c78877fa4e9162a6a63e9a1c205942d004f07ec6&amp;dn=%5BDJVU%5D+%5B1988%5D+Pandolfini%5C%27s+Endgame+Course+Basic+Endgame+Concept&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"lyndavilla","files":2,"time":1307554655,"description":"DOWNLOAD MORE EBOOKS, MAGAZINES, &amp; PDFS:\n  &lt;a href=&quot;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&lt;/a&gt;\n\nBOOK INFO:\n\nPandolfini's Endgame Course: Basic Endgame Concepts Explained by America's Leading Chess Teacher (Fireside Chess Library)\nBy Bruce Pandolfini\n\n\nPublisher: Fireside\nNumber Of Pages: 320\nPublication Date: 1988-10-15\nISBN-10 / ASIN: 0671656880\nISBN-13 / EAN: 9780671656881\nBinding: Paperback\n\n\nSummary: Great Endgame book for those trying to move from beginner to Club level\nRating: 5\nPandolfini has won me over. He is a great chess teacher, and it shows in the way he has set this book up. Each page covers one endgame problem, beginning with a discussion written in an easy and interesting style explaining what the problem is intended to illustrate. \n\nStudying the endgame is not necessarily fun... but the endgame is where the money is in Chess, similar to putting in golf. It is very important to study it if you want to improve. What Pandolfini does is makes it palatable by presenting a series of one page self-contained problems. I have found this an excellent addition to some of the Convekta software I am using to study chess, because he explains the ideas behind the endgame positions in more detail and with clarity.\n\n\n\nSummary: An Excellent 2nd Book on Endgames\nRating: 4\nFirst, download the errata as mentioned in other reviews and get that much over with. There *are* more errors than there should have been (1/2 star taken right off the top). \n\nThat said, this should be your *second* endgame book. Why? Because the writing style is terse and laconic. The book is made up of a long series of endgame positions, one per page, with a paragraph of descriptive text and a nearly, if not completely, un-annotated list of moves below the paragraph. It's up to you to digest the text, and relate it to the moves as you play them out. I believe that to do this effectively, you need some basic endgame background, hence my statement that this should be your *second* endgame book. \n\nThe book is quite complete, providing at least one example of all important endgame situations. It is not an exhaustive text, such as Dvoretsky's Endgame Manual or some others, but it leaves out very little, even if what is covered is at times brief (a single example) or at a high level.... but that is not a bad thing. At this stage of learning, you want clear examples, not problem-like esoterica. \n\nFour stars overall. (Another half off for the at times difficult presentation style of text/move list.) \n\n(What would be the first endgame book? Briefly, I'd use Robertie's &quot;Easy Endgame Strategies&quot; or even better if you don't mind an older book in descriptive notation, Horowitz's &quot;How to Win in the Chess Endings.&quot;)\n\n\n\nSummary: An Excellent Instructional Manual to Improve your Endgame\nRating: 5\n\nProbably anyone no matter their skill level can benefit from this book, but I think is best suited for beginners to intermediate players. The author describes the techniques employed in the most important and typical endgame situations, presenting more than 239 positions that clearly describe how a good player will solve the problems encountered in each one of them. If you have read and liked the style of any other Pandolfini's chess instructional books chances are you will enjoy this one. \n\nThe book is divided in three parts. A complete part of the book is devoted to king and pawn endings, but also enough coverage is given to endgame positions where the knight, the bishop, the root, and the queen, and a combination of minor and heavy pieces play the important role of helping promote a pawn or act to accomplish a mating solution. \n\nAs the author states &quot;the book is designed to improve the skills of the practical player who is interested in wining the ending clearly, simply and efficiently.&quot; \n\nI bought this book as part of a used chess book collection on an auction, and I was not disappointed at all with this title. The book systematically showed me how to think and analyze typical positions that as a matter of fact I have encountered during accrual play. One the things I like the most is the Instructional format of this book, clear and easy to follow. For me is absolutely a must have, especially if you are a beginner. \n\nThe book uses algebraic notation, but I guess this is just a matter of preference and it actually doesn't affect the quality and usefulness of the information presented. Nevertheless you should take this into account in case you prefer descriptive notation.\n\n\n\nSummary: A note on the typos....\nRating: 4\nI agree with the many reviewers who think this is an excellent book but are troubled by the typos. For those of you considering using the book, there's a very helpful Houston Chessclub website with a collection of corrections to the book. If you do a Google search for &quot;Pandolfini's Endgame Errata&quot; you can locate it easily. Once you have that, there's no reason not to get this very worthwhile book.\n\n\n\nSummary: A Great Endgame Strategy Book\nRating: 5\nPandolfini writes in a way that is clear, logical, and just plain easy to understand. Any of his books are &quot;must haves&quot; for a solid chess library. His Endgame book covers an area that I belive is often overlooked in favor of the latest opening. This book is just what it says, a &quot;course on endgame concepts&quot; that would benefit any chess player.","torrent":{"xt":"urn:btih:c78877fa4e9162a6a63e9a1c205942d004f07ec6","amp;dn":"%5BDJVU%5D+%5B1988%5D+Pandolfini%5C%27s+Endgame+Course+Basic+Endgame+Concept","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c78877fa4e9162a6a63e9a1c205942d004f07ec6","infoHashBuffer":{"type":"Buffer","data":[199,136,119,250,78,145,98,166,166,62,154,28,32,89,66,208,4,240,126,198]},"announce":[],"urlList":[]}}