{"title":"The Muppets Celebrate Jim Henson RESTORED","uid":9284402,"size":4678890311,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c8db7c931edb2a26817420ffa937490880398a5a&amp;dn=The+Muppets+Celebrate+Jim+Henson+RESTORED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":75,"time":1385989819,"description":"The Muppets Celebrate Jim Henson\n\nThe Muppets Celebrate Jim Henson aired on CBS on November 21, 1990.\n\nThis one-hour special, &quot;a tribute to a man and his imagination,&quot; celebrates the \nlife and career of Jim Henson. The retrospective includes appearances by celebrity \nguests, a variety of clips from Henson's television and film work, and candid, \nbehind-the-scenes footage of Henson working with his creative team.\n\nAs the program begins, Fozzie Bear receives a postcard from Kermit the Frog, who \nasks him to prepare a lavish production number in tribute to Henson. But Fozzie and \nthe other Muppets don't know who Henson is, and feel ill-equipped to give him a \nfitting tribute. Carol Burnett, John Denver, Ray Charles, Steven Spielberg, Harry \nBelafonte, and Henson's friend and close collaborator, Frank Oz, offer via film \ntheir impressions of Henson and reminisce about working with him and the characters \nthat he invented, which helps the Muppets to learn more about him.\n\nThe version was carefully restored from two copies of the special, plus a third for \nthe &quot;Read More About It&quot; tag with Gonzo (and some audio). The main version of the \nspecial given to me was in pretty good shape apart from major color fluctuations at \nthe top of the screen. The other copy lacked horizontal clarity. I ran noise \nremoval and color correction on both sources and used the color from the alternate \nsource at the top of the screen, before overlaying the second source on top of the \nfirst to gain a little more highlight detail (while softening the image slightly).\n\nAny video errors were painted out by hand in Photoshop during the first 10 minutes \nof the special. Restoration was by the editor of The Thief and the Cobbler: \nRecobbled Cut.\n\nThe version I was working from is a slightly different &quot;international edit.&quot; A \nWilkins Coffee clip was replaced with a shot of the prototype Cookie Monster \nexploding after eating a computer. Also, Kermit has been redubbed at the end. I've \nput Wilkins Coffee back in, and both Kermit versions are included on the disc.\n\nAll special features (apart from the Disney Legends Tribute Reel) were carefully \nrestored as well, by running noise reduction via Neat Video, color correction via \nFinal Cut Pro and audio noise reduction via Audacity as per usual.\n\nThe disc includes:\n\nAlternate Ending - Kermit was later redubbed with a pitch-shifted performance \nintended to make Steve Whitmire's voice sound deeper. Here is that version, as an \nalternate audio track for the special.\n\nTelevision Academy Hall of Fame, November 30, 1987 - Kermit the Frog and all his \nfriends honor Jim Henson (who is in the audience) with a musical tribute as he is \ninducted into the Hall of Fame. The Muppets from The Muppet Show, Sesame Street and \nFraggle Rock appear, along with Harry Belafonte, Frank Oz, Bernie Brillstein, Joan \nGanz Cooney, Lord Lew Grade and the crew of the Muppet workshop (including Michael \nFrith), in this 18-minute tribute.\n\nThe Arsenio Hall Show - On May 22, 1989, Jim Henson, Kermit the Frog and a slightly \ninjured Rowlf the Dog joined Arsenio Hall (and LeVar Burton) for a quite funny \nappearance where Rowlf compliments Hall by calling him a &quot;Son of a bitch.&quot; On May \n4, 1990, in his last television appearance, Jim Henson and Kermit the Frog appear \nto promote &quot;The Muppets at Walt Disney World.&quot; Kevin Clash and Clifford join Jim \nand Arsenio for the second segment, with Clifford dominating the proceedings to \nJim's delight. In terms of video, the second appearance is lower quality than the \nfirst.\n\nDisney Legends Tribute Reel - A very recent montage of clips put together by \nDisney, looking over the career of Jim Henson, plus the 2011 film &quot;The Muppets.&quot;\n\nFraggle Rock Countdown Clock - The complete countdown clock used on episodes of \nFraggle Rock, and in this special.\n\nMuppets at Walt Disney World Clip - The Muppets sing &quot;More More More,&quot; in this \nterrific closing number from Jim Henson's last television special. My NTSC copy of \nthis special isn't particularly good quality. I used an alternate PAL source for \nthe audio, which helps, but if I ever restore &quot;The Muppets at Walt Disney World&quot; \nfor DVD release it would be from a different source than this, I think. Possibly a \nPAL one.\n\nThe Muppets Celebrate Jim Henson\n\nProducer/Director: Don Mischer\nCo-Producers: Martin G. Baker and David J. Goldberg\nWriters: Jerry Juhl, Bill Prady and Sara Lukinson\nAssociate Producer: Ritamarie Peruggi\nMuppet Performers: Frank Oz, Dave Goelz, Richard Hunt, Kevin Clash, Jerry Nelson, \nSteve Whitmire, Kathryn Mullen, Caroll Spinney, Pam Arciero, Fran Brill, Camille \nBonora, Joey Mazzarino, Jim Martin, Peter MacKennan, Carmen Osbahr, Martin P. \nRobinson, David Rudman\nClip Segments: David Gumpel and Sara Lukinson\nMusic: Larry Grossman\nScenic Designer: Lyndon Mosse\nLighting Designer: John Rook\nTechnical Director: Tom Guadarrama\nAudio: Jim Anderson, Blake Norton\nSpecial Thanks to The Muppet Workshop\n","torrent":{"xt":"urn:btih:c8db7c931edb2a26817420ffa937490880398a5a","amp;dn":"The+Muppets+Celebrate+Jim+Henson+RESTORED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8db7c931edb2a26817420ffa937490880398a5a","infoHashBuffer":{"type":"Buffer","data":[200,219,124,147,30,219,42,38,129,116,32,255,169,55,73,8,128,57,138,90]},"announce":[],"urlList":[]}}