{"title":"Lykke Li - Peace &amp; Love, BorlÃƒÂ¤nge 090625","uid":5175341,"size":28626496,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ca8a24e1487b4505499fac5d7b71b0a7a4d685f4&amp;dn=Lykke+Li+-+Peace+%26+Love%2C+Borl%C3%83%C2%A4nge+090625&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"RosaMannen","files":20,"time":1258935333,"description":"Li was born in Huddinge, Stockholm in 1986 and was raised by artistic parents; her mother was a painter, her father is a musician. The family moved to Stockholm when Li was a toddler and later moved to a mountaintop in Portugal when Li was six, where they lived for five years; the family also spent time in Lisbon and Morocco and spent winters in Nepal and India.[ She moved to the neighborhood of Bushwick, Brooklyn in New York for three months when she was 19.[3][4][5] She returned when she was 21 to record her album. When not touring, she resides in the SÃƒÂ¶dermalm district of Stockholm.\n\nShe released her first album, Youth Novels on LL Recordings in the Nordic region on 4 February 2008 and it received a wider European release in June, 2008. The album was produced by BjÃƒÂ¶rn Yttling of Peter Bjorn and John and Lasse MÃƒÂ¥rtÃƒÂ©n and reportedly inspired by a previous relationship of three years. It was released in the United States on 6 May 2008. The album was released in the Republic of Ireland on 6 June 2008 and 9 June in the UK, promoted by a performances of &quot;Little Bit&quot; on Later With Jools Holland on 25 May 2008.\n\nShe had some success with the EP &quot;Little Bit&quot; in 2007. Stereogum named her an artist to watch in October 2007 and described her music as a mix of soul, electro and &quot;powdered-sugar pop&quot;.\n\nShe has appeared on Swedish musician Kleerup's self titled album, contributing vocals to the track &quot;Until We Bleed&quot;. She also worked with RÃƒÂ¶yksopp on their album Junior, contributing vocals to &quot;Miss It So Much&quot;.\n\nAccording to her Myspace Blog, she has started writing material for her second album but insists it will be a long wait until it is finished for fans to hear.[8]\n\nLykke has become increasingly popular with indie music fans and took her particular flavor of music more mainstream with an appearance on Last Call with Carson Daly on February 18, 2009. She has received a great deal of notoriety for her cover of &quot;Knocked Up&quot;, originally recorded by Kings of Leon who had approached Lykke to cover a song of her choice, and &quot;Gifted&quot; in which she performs with Kanye West. Going further mainstream, Lykke performed at the 2009 Coachella Valley Music and Arts Festival on April 19. Lykke has recently wrapped up her her Youth Novels tour.\n\nThe song &quot;I'm good, I'm gone&quot; was featured in the film Sorority Row.\n\nThe song &quot;Possibility&quot; was written for the forthcoming New Moon (2009 film) after Lykke had been asked to contribute, she wasn't sure she wanted to write a song. It was after she had seen an early screening of the movie, she decided she wanted to contribute to the soundtrack. The soundtrack was released on 16th October 2009.\n\n\nLive from Peace &amp; Live in BorlÃƒÂ¤nge, Sweden 2009.\nPhotos were taken by PETTER BRANDT http://www.rockfoto.nu/about/Petter%20Brandt\n\n\n\n.ooOO ROSA MANNEN 2009 OOoo.\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               &lt;a href=&quot;\nhttp://thepiratebay.se/user/RosaMannen&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/RosaMannen&lt;/a&gt;\t","torrent":{"xt":"urn:btih:ca8a24e1487b4505499fac5d7b71b0a7a4d685f4","amp;dn":"Lykke+Li+-+Peace+%26+Love%2C+Borl%C3%83%C2%A4nge+090625","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca8a24e1487b4505499fac5d7b71b0a7a4d685f4","infoHashBuffer":{"type":"Buffer","data":[202,138,36,225,72,123,69,5,73,159,172,93,123,113,176,167,164,214,133,244]},"announce":[],"urlList":[]}}