{"title":"Everyman Mini-Comics (Underground - Restored)","uid":7666999,"size":125988283,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:caa067943f327f641bf4f52c1ed4993eed750dc8&amp;dn=Everyman+Mini-Comics+%28Underground+-+Restored%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1348472305,"description":"Everyman Studios Mini-Comics.\n\nThus far, these were the most difficult and time consuming books I've 'Restored'. Do to the fact that they are of a smaller size to begin with, and the paper they were originally printed on was SOOO thin, I literally had to go through them ONE PAGE at a time. No batch applications of the 'Restoration' changes on these. In fact, by the time I was done I had actually discovered several new settings, or combinations of settings, to use on these 'Restoration' projects.\n\nSince they were a smaller book to begin with, I haven't enlarged the images quite as much as my usual 'Restorations', either. You will STILL need to click down the size 2 or 3 notches to get the most out of the work done to these books.\n\nSome of these are quite interesting, or strange, or beautifully drawn, or just nice pieces of art that very few people would ever have seen if not for the efforts of the original collectors and scanners. I did skip one, called 'Samyang Ramyon', because I just couldn't find any 'Restoration' settings that worked and it wasn't very interesting or fun to look at to begin with.\n\nHorrible Misunderstandings 01 - 1981 (this edition), 600 copies, drawn copied, cut, folded and stapled in one day at the San Diego Comic Con. Contributors: J Michael Leonard, Roger May, Artie Edward Romero, Roldo, Mary K Brown, Howard Cruse, Rick Geary\n\nHorribly Misunderstandings 02 - 1980 (this edition). Contributors: Rogerlo, Artie Edward Romero, Bruce Simon, Peter Von Sholly, Revilo, Melinda Gebbie\n\nMore Potatoes - 1980, 300 copies. Written and Illustrated by Artie Edward Romero.\n\nOfficial Maze Master Book Of Mazes - 1979, 200 copies. Written and Illustrated by Artie Edward Romero.\n\nPlatinum Toad 6, 9 &amp; 10 - 1977, 1978 &amp; 1979, 200, 300 &amp; 250 copies. 'Written' and Illustrated by Artie Edward Romero.\n\nContinued in comments section below...","torrent":{"xt":"urn:btih:caa067943f327f641bf4f52c1ed4993eed750dc8","amp;dn":"Everyman+Mini-Comics+%28Underground+-+Restored%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"caa067943f327f641bf4f52c1ed4993eed750dc8","infoHashBuffer":{"type":"Buffer","data":[202,160,103,148,63,50,127,100,27,244,245,44,30,212,153,62,237,117,13,200]},"announce":[],"urlList":[]}}