{"title":"Terror Television - John Kenneth Muir.epub","uid":9396798,"size":1167065,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cae2511790f4ac8c0d05ab3fa802dee4c8db6a4e&amp;dn=Terror+Television+-+John+Kenneth+Muir.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Mohammad_AT","files":1,"time":1387996098,"description":"Although horror shows on television are popular in the 1990s thanks to the success of Chris Carter's The X-Files, such has not always been the case. Creators Rod Serling, Dan Curtis, William Castle, Quinn Martin, John Newland, George Romero, Stephen King, David Lynch, Wes Craven, Sam Raimi, Aaron Spelling and others have toiled to bring the horror genre to American living rooms for years. This large-scale reference book documents an entire genre, from the dawn of modern horror television with the watershed Serling anthology, Night Gallery (1970), a show lensed in color and featuring more graphic makeup and violence than ever before seen on the tube, through more than 30 programs, including those of the 1998-1999 season. Complete histories, critical reception, episode guides, cast, crew and guest star information, as well as series reviews are included, along with footnotes, a lengthy bibliography and an in-depth index. From Kolchak: The Night Stalker to Millennium, from The Evil Touch to Buffy the Vampire Slayer and Twin Peaks, Terror Television is a detailed reference guide to three decades of frightening television programs, both memorable and obscure.","torrent":{"xt":"urn:btih:cae2511790f4ac8c0d05ab3fa802dee4c8db6a4e","amp;dn":"Terror+Television+-+John+Kenneth+Muir.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cae2511790f4ac8c0d05ab3fa802dee4c8db6a4e","infoHashBuffer":{"type":"Buffer","data":[202,226,81,23,144,244,172,140,13,5,171,63,168,2,222,228,200,219,106,78]},"announce":[],"urlList":[]}}