{"title":"Ranald C. Michie - The London Stock Exchange. A History [2000][A","uid":9951287,"size":4190886,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cbe0a54698df0d289e4303c14e0f5d4b2b475f00&amp;dn=Ranald+C.+Michie+-+The+London+Stock+Exchange.+A+History+%5B2000%5D%5BA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Anette14","files":-1,"time":1397405294,"description":"Description\nProduct Details\nBook Title: The London Stock Exchange: A History\nBook Author: Ranald C. Michie (Author)\nPaperback: 696 pages\nPublisher: Oxford University Press, USA (June 28, 1999)\nLanguage: English\nISBN-10: 0198295081\nISBN-13: 978-0199242559\n\nThis pdf document is not in a perfect condition. The text is small and in the upper part of the page. I'm sorry, but it's the only version I found. It was probably converted by someone else from an epub format.\n\nBook Description\nPublication Date: March 2, 2000 | ISBN-10: 0198295081 | ISBN-13: 978-0198295082\nIn 2001, the London Stock Exchange will be 200 years old, though its origins go back a century before that. This book traces the history of the London Stock Exchange from its beginnings around 1700 to the present day, chronicling the challenges and opportunities it has faced, avoided, or exploited over the years.\n\nReview\n&quot;No one familiar with Professor Ranald Michie's earlier work...will be surprised that he has produced a superb volume that will amost certainly be the last institutional history of the first two hundred years of the London Stock Exchange....His book is a 'must-read' for any student of British and world finance, of formal security markets, and of British economic history, and an 'almost-must-read' for anyone with a general interest in economic history....carefully drawn and thorough...a superb study...truly fascinating.&quot;--Journal of Economic History\n\n`a useful account of the formal structures of the London Stock Exchange' Christopher Armstrong, Business History Review\n\n`No one familiar with Professor Ranald Michie's earlier work ... will be surprised that he has produced a superb volume that will almost certainly be the last institutional history of the first two hundred years of the London Stock Echange ... carefully drawn and thorough ... His book is a must-read for any student of British and world finance, of formal security markets, and of British economic history, and an almost-must-read for anyone with a general interest in economic history.' Lance Davis, Journal of Economic History\n\n`This is a fascinating and well-told story that should have wide appeal. It will be the standard reference for a long time. And it is something of an achievement to produce a book on this subject that can carry the reader along so effortlessly.' Forrest Capie, Business History\n\n`It is very far from a narrow treatment of finance, touching as it does on so many aspects in the economy.' Forrest Capie, Business History\n\n`Is a fascinating and well-told story that should have wide appeal.' Forrest Capie, THES\n\n`This is a solid work of original historical research that gives the reader many interesting insights and raises important questions for practitioners and policy makers as well.' Larry Neal, EH.NET, Aug 2000.\n\n`Written on the basis of an intensive examination of the records of the London Stock Exchange, his work will now be the standard reference on the London Stock Exchange.' Larry Neal, EH.NET, Aug 2000.\n\n`this masterly official history of the London Stock Exchange' E. Moggridge, Choice, Sept. 00.\n\n`With a sure command of the secondary literature plus the records of the Exchange, Michie ... traces the Exchange's 19th-century rise to world dominance ... Very stongly recommended.' E. Moggridge, Choice, Sept. 00.\n\n`Michie has written extensively about stock changes, particularly in England, but also in other countries and different periods. He is an authority ... this is a fascinating and well-told story that should have wide appeal.' Forrest Capie, The Times Higher Education Supplement, 29th Sept. 2000.\n\nAbout the Author\nRanald Michie is Professor of History at the University of Durham, where he has been since 1974. He has also held visiting research fellowships in both the United States and Canada and has delivered papers in numerous international institutions. His international speciality is the history of stock exchanges having conducted research in both the British Isles and North America.\n","torrent":{"xt":"urn:btih:cbe0a54698df0d289e4303c14e0f5d4b2b475f00","amp;dn":"Ranald+C.+Michie+-+The+London+Stock+Exchange.+A+History+%5B2000%5D%5BA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbe0a54698df0d289e4303c14e0f5d4b2b475f00","infoHashBuffer":{"type":"Buffer","data":[203,224,165,70,152,223,13,40,158,67,3,193,78,15,93,75,43,71,95,0]},"announce":[],"urlList":[]}}