{"title":"Ancient Chinese Art - The Ernest Erickson Collection (Art Ebook)","uid":8713014,"size":10967895,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cc00d33395695b9635436f6a89fbf9c81260d636&amp;dn=Ancient+Chinese+Art+-+The+Ernest+Erickson+Collection+%28Art+Ebook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"STBGD","files":-1,"time":1374277079,"description":"Hearn, Maxwell K., &quot;Ancient Chinese Art: The Ernest Erickson Collection in The Metropolitan Museum of Art&quot;\nPublisher: Metropolitan Museum of Art | 1987 | ISBN: 0870994832 | English | PDF | 95 pages | 10.46 Mb\n\nChina is a vast and populous country, moving rapidly on all fronts to prepare itself for life in the twenty-first century. Heir to a resplendent ancient culture, modern China is following a unique developmental path that evolves from this long and rich cultural tradition. Our understanding of the transformations in China today must be predicated upon an appreciation of this precious cultural legacy.\n\nThe challenge for The Metropolitan Museum of Art is to represent this colossal culture by the coherent display of aesthetic masterpieces that recapture the great moments of China's past. Collections such as that at the Metropolitan have grown under generations of collectors, curators, and changing fashions.\n\nThe Erickson Collection contains works of outstanding quality that range through different media and across the whole span of ancient China, from the Neolithic to the T'ang period. Ernest Erickson, through his collection, has created a vital memorial that fills in gaps in the Museum's existing holdings. We are honored and privileged to help present this wonderful gift, commemorated by this catalogue","torrent":{"xt":"urn:btih:cc00d33395695b9635436f6a89fbf9c81260d636","amp;dn":"Ancient+Chinese+Art+-+The+Ernest+Erickson+Collection+%28Art+Ebook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc00d33395695b9635436f6a89fbf9c81260d636","infoHashBuffer":{"type":"Buffer","data":[204,0,211,51,149,105,91,150,53,67,111,106,137,251,249,200,18,96,214,54]},"announce":[],"urlList":[]}}