{"title":"Stossel.2014.06.19.[New World].Fox Business.CF.avi","uid":10399769,"size":343665868,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cdf2a10df872a3641e025ee7ab088cd7a8ed8586&amp;dn=Stossel.2014.06.19.%5BNew+World%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1403335809,"description":"----------\n\nSTOSSEL - [New World] - Fox Business Network\n2014, June 19, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nTHE TECH REVOLUTION: Today, a child's PlayStation has more computing power than a military supercomputer from the 1990s. Moore's Law says computing power will continue to double every 18-24 months. MIT professor Eric Brynjolfsson explains why this is all good for human progress.\n\nROBOT REVOLUTION: Will robots become a threat to us? The Futurist editor-at-large Patrick Tucker says they are definitely capable of &quot;anti-social behavior.&quot; They become &quot;more dangerous as we ask them to do more and more things, and we're not exactly sure what those things are.&quot;\n\nSTEALING OUR JOBS: Computers now teach themselves. Watson, a robot made by IBM, taught itself how to play Jeopardy. He beat the world champion. Since robots now can learn, will they soon be a threat to our jobs? Economics professor Noah Smith says they will, and that's why we need more social programs for the poor. But libertarian economist James Miller says people who want government to fix inequality should chill out, because less drudgery for humans is good news.\n\nIMMORTALITY: &quot;Transhumanists&quot; want to use technology to try to live forever. Baseball star Ted Williams tried &quot;cryonics.&quot; He had his body frozen soon after he died in the hopes that when science is more advanced, he will be brought back to life. So far, no luck. But journalist Zoltan Istvan says it will happen.\n\nDESIGNER BABIES: Wouldn't you like your baby to be healthy? Smart? A good athlete? A talented musician? Five years ago, clinics started helping parents choose gender, hair color and eye color. Dr. Jeffrey Steinberg of the Fertility Institute says he could do more if the USA would legalize genetic engineering.\n\nROAD WARRIORS: Is this intersection in Ethiopia a better way to improve traffic flow? I doubt it- Ethiopia is one of the deadliest places to drive. Nevertheless, people are eager to find better ways to speed traffic. And soon, traffic lights may be less necessary because we won't drive our own cars. Computers will. The technology for driverless cars is already here. Evelyn Rusli of the Wall Street Journal says more is coming.\n\nMY TAKE: The tech revolution is very cool. We are much better off because of it. This is why it's important that America not let the pompous old geezers in Congress and at regulatory agencies decide which innovation is permissible. Most established authorities are clueless about advantages of innovation until the gains are so obvious, they slap us in the face. Let's embrace the future. If government doesn't strangle change, life will keep getting better.","torrent":{"xt":"urn:btih:cdf2a10df872a3641e025ee7ab088cd7a8ed8586","amp;dn":"Stossel.2014.06.19.%5BNew+World%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdf2a10df872a3641e025ee7ab088cd7a8ed8586","infoHashBuffer":{"type":"Buffer","data":[205,242,161,13,248,114,163,100,30,2,94,231,171,8,140,215,168,237,133,134]},"announce":[],"urlList":[]}}