{"title":"[MP3 - 320 Kbps - Pop]Rihanna - Good Girl Gone Bad Reloaded","uid":4402490,"size":91116053,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ce1a63ff58df1e82ec19dbdb56732c2009a0b350&amp;dn=%5BMP3+-+320+Kbps+-+Pop%5DRihanna+-+Good+Girl+Gone+Bad+Reloaded&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"taritilion","files":19,"time":1221774364,"description":"Artista \tRihanna\nTipo album \tStudio\nPubblicazione \t[22 giugno]], 2008\nDurata \t61:05\nGenere \tPop, R&amp;B, pop rock, dance-pop, elettronica, hip hop\nEtichetta \tDef Jam\nProduttore \tAnthony Asher\nRegistrazione \t2008\nFormati \tCD, Download digitale\n\nRihanna del suo vero nome Robyn Rihanna Fenty, ÃƒÂ¨ sorto il 18 febbraio 1988 a St. Michael (Barbados, Caraibi). Cresce conducendo una vita semplice data ritmo dal bordo che pratica ascoltando i suoi idoli Alicia Keys, BeyoncÃƒÂ© Knowles o bene Mariah Carey. Il scatto a luogo all&amp;#039;occasione di una riunione con il produttore Evan Rogers che passa le vacanze sull&amp;#039;isola nel 2004. Cade letteralmente sotto l&amp;#039;incanto della bella Rihanna e decide di farle registrare una dÃƒÂ©mo di dodici titoli fra i quali &quot;Pon de Replay&quot;. Jay-Z firma la giovane donna fin dal primo ascolto e primo single &quot;Pon de Replay&quot; esce la scia. ÃƒË† un vero cartone e Rihanna fa uscire il suo primo album fine un 2005 &quot;Music Of The Sun&quot;, grazioso miscuglio di ragga e di R&amp;#039;B prima di ritornare nel 2006 con &quot;A Girl Like me&quot;, nella stirpe del precedente e sempre anche envoÃƒÂ»tant.\n\nGood Girl Gone Bad Reloaded ÃƒÂ¨ il nuovo album della cantante barbadiana Rihanna. Non sarebbe altro che la versione &quot;Deluxe&quot; dell&amp;#039;album Good Girl Gone Bad, contente tre tracce in piÃƒÂ¹ ed un secondo disco contenente quattro esecuzioni live e un &quot;Dietro le scene&quot;.Rihanna per questo album ha collaborato con un nuovo produttore, Anthony Asher, e ha rilasciato l&amp;#039;edizione Reloaded nel giugno 2008. Le 3 canzoni aggiunte sono Take a Bow, un remix di If I Never See Your Face Again, con i Maroon 5, e il Disturbia. Tutte le tre nuove canzoni sono diventate dei singoli. La copertina dell&amp;#039;album ÃƒÂ¨ sempre la stessa dell&amp;#039;edizione standard, solamente che viene aggiunta la scritta &quot;Reloaded&quot; e lo sfondo nel Regno Unito ÃƒÂ¨ grigio, mentre nel resto del Mondo ÃƒÂ¨ di una sfumatura verde che raggiunge quasi il verde acqua. Il CD semplice senza DVD ÃƒÂ¨ stato rilasciato in UK il 2 giugno e con il DVD il 16 e il 12 in Australia. Nell&amp;#039;intera Europa il Cd ÃƒÂ¨ stato rilasciato il 13 giugno, mentre nella maggior parte delle regioni restanti del mondo, compresi Stati Uniti, ÃƒÂ¨ stato rilasciato il 17. La canzone &quot;Cry&quot; ÃƒÂ¨ una bonus track nel Regno Unito e in Australia, ed ÃƒÂ¨ diventato un singolo solo digitale, mentre le differenti versioni di Hate That I Love You, la prima con Hins Cheung e la seconda con David Bisbal, sono rispettivamente bonus track dell&amp;#039;Asia e dell&amp;#039;America Latina e Spagna. L&amp;#039;ultima versione, con David Bisbal, ÃƒÂ¨ diventato il primo singolo estratto dalla re-release in Spagna.","torrent":{"xt":"urn:btih:ce1a63ff58df1e82ec19dbdb56732c2009a0b350","amp;dn":"%5BMP3+-+320+Kbps+-+Pop%5DRihanna+-+Good+Girl+Gone+Bad+Reloaded","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce1a63ff58df1e82ec19dbdb56732c2009a0b350","infoHashBuffer":{"type":"Buffer","data":[206,26,99,255,88,223,30,130,236,25,219,219,86,115,44,32,9,160,179,80]},"announce":[],"urlList":[]}}