{"title":"Pathfinder #1-3 (2012) [Dynamite]","uid":7815733,"size":121329151,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ce44f128ae242eafcd91dd8ad49124faebf14806&amp;dn=Pathfinder+%231-3+%282012%29+%5BDynamite%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"blackcanary","files":-1,"time":1352656031,"description":"English | CBR | 3 Issues\n\nPathfinder #1-3 (2012)\nPublisher:  Dynamite Entertainment\nPublication Date:  August - November 2012\n\nWritten by Jim Zub\nArt by Andrew Huerta\n\nPathfinder #1 - Dark Waters Rising Chapter 1\nPaizo's incredible award-winning, best-selling fantasy world, fiction line and tabletop RPG is now the ultimate fantasy comic from Dynamite Entertainment!\n\nValeros can rely on only his sword arm and his friends, the mysterious and beautiful sorcerer Seoni and silver tongued quick-witted elven rogue Merisiel, but nothing can prepare him for the dangers that lurk ahead. The scattered and chaotic goblin tribes of Varisia are changing, growing in power and unifying in ways no one has ever seen before. At the heart of this strange evolution is an ancient evil looking to establish itself anew.\n\nThe iconic heroes at the core of the Pathfinder's world are brought to life for the first time in a brand new story full of charm and high adventure that will please fans and entertain new readers alike.\n\nPathfinder #2 - Dark Waters Rising Chapter 2\nGoblins chew, goblins fight! Goblins cut, goblins bite! The goblins of Varisia sing twisted songs as their blood boils with ferocious rage and mystic power. Valeros and his companions may discover the forces behind the goblin tribes' newfound strength, but stopping it is another matter entirely. Paizo's incredible award-winning fantasy world, fiction line and tabletop RPG is now the ultimate fantasy comic from Dynamite Entertainment.\n\nPathfinder #3 - Dark Waters Rising Chapter 3\nValeros and his companions have captured one of the cultists behind the strange magic that grips the goblin tribes of Varisia, but their prisoner may not be as helpless as they seem. Making matters worse, the group must cross through the haunted cemetery known as Pauper's Grave, luring them into the paralyzing touch of flesh-eating ghouls. Paizo's incredible award-winning fantasy world, fiction line and tabletop RPG is now the ultimate fantasy comic from Dynamite Entertainment. Includes over 5 pages of character profiles and Pathfinder RPG game statistics.","torrent":{"xt":"urn:btih:ce44f128ae242eafcd91dd8ad49124faebf14806","amp;dn":"Pathfinder+%231-3+%282012%29+%5BDynamite%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce44f128ae242eafcd91dd8ad49124faebf14806","infoHashBuffer":{"type":"Buffer","data":[206,68,241,40,174,36,46,175,205,145,221,138,212,145,36,250,235,241,72,6]},"announce":[],"urlList":[]}}