{"title":"Surfer Blood - Pythons (2013) [FLAC]","uid":8553525,"size":248317750,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cef8e9b4c61ed9f5bc272225e73bdc62ebc2f4e7&amp;dn=Surfer+Blood+-+Pythons+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"politux","files":-1,"time":1370707453,"description":"\n  Surfer Blood - Pythons (2013) [FLAC]\n\n  Released: 2013\n  Duration: 34:33\n  Genre: Pop/Rock\n  Style: Alternative, Indie Rock\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bits Per Sample:  16\n  Sample Rate: 44,100 Hz\n\n  01 Demon Dance\n  02 Gravity \n  03 Weird Shapes \n  04 I Was Wrong \n  05 Squeezing Blood \n  06 Say Yes To Me\n  07 Blair Witch \n  08 Needles And Pins \n  09 Slow Six \n  10 Prom Song \n\n  Though South Florida doesn't have the tides to shoot the curl, West Palm Beach's Surfer Blood fuse sunny surf rock charm with indie rock cool. Guitarist/vocalist John Paul Pitts and drummer Tyler Schwarz had known each other since high school; they started playing together and connected with guitarist Thomas Fekete, bassist Brian Black, and percussionist Marcos Marchesani at an Ultra Music Festival after-party, officially becoming Surfer Blood in spring 2009. They began recording and touring almost immediately, laying down tracks in Pitts' apartment and embarking on four tours in their first five months together. The buzz around the band began in late August after Surfer Blood played a show at the Brooklyn venue Bruar Falls; when they returned to New York that fall for the CMJ Music Marathon, they played ten shows. Tours with Art Brut and Japandroids kept Surfer Blood busy for the rest of 2009, and their debut album, Astro Coast, was released in early 2010. Later that year, the band signed to Warner Bros., but released the Tarot Classics EP on Kanine in 2011. In March of 2012, Pitts was arrested for domestic battery; ultimately, charges were not filed and the case was dropped. The following June, the band's polished major-label debut Pythons was released.\n\n  The two years between the Tarot Classics EP and Pythons weren't easy for Surfer Blood. In 2012, singer/guitarist John Paul Pitts was arrested for domestic battery; ultimately, charges were not filed and the case was dropped. When listening to the band's second album, however, it's hard to imagine that there were ever any clouds on their horizon: these are some of Surfer Blood's most lighthearted songs yet, and some of their slickest, too. For their major-label debut, they worked with producer Gil Norton, who has always excelled at bringing out the pop part of punk-pop bands ranging from the Pixies and Foo Fighters to Jimmy Eat World. There are definitely ties to those groups' work on Pythons, and as on Tarot Classics, Pitts and crew complement their bouncy melodies with driving rhythms and tasteful bursts of distortion. All of these are on display on the single &quot;Weird Shapes,&quot; which tempers jaunty pianos with distant screaming reminiscent of the Pixies and especially Weezer, whose vulnerable to explosive dynamic shifts provide the template for songs like &quot;I Was Wrong.&quot; \n\n  At times, Surfer Blood are even more hooky and melodic than their influences on Pythons, with the heft of their earlier work replaced by catchy conciseness. Unlike Astro Coast, where the distortion and reverb that cloaked its songs added drama, here the standout tracks are often the lightest. There's an almost Morrissey (or Smoking Popes)-like croon to Pitts' vocals on the bittersweet &quot;Say Yes to Me,&quot; and &quot;Blair Witch&quot; has one of the album's best balances of crashing guitars and toothsome melody. Surfer Blood also use their newfound polish to expand their sound, as on the Afro-pop-tinged &quot;Squeezing Blood&quot; and &quot;Slow Six,&quot; a fittingly named waltz that manages to be somewhat heavy and hypnotic at the same time. The more the band embraces Pythons' slickness, the better it sounds; it's a pleasant, ingratiating set of songs that don't aim to be anything more than that.","torrent":{"xt":"urn:btih:cef8e9b4c61ed9f5bc272225e73bdc62ebc2f4e7","amp;dn":"Surfer+Blood+-+Pythons+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cef8e9b4c61ed9f5bc272225e73bdc62ebc2f4e7","infoHashBuffer":{"type":"Buffer","data":[206,248,233,180,198,30,217,245,188,39,34,37,231,59,220,98,235,194,244,231]},"announce":[],"urlList":[]}}