{"title":"Vampirella (Warren)","uid":4705053,"size":6693841053,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:cf2a02e73a9cef5c38c9dacb4095f3fce15b9684&amp;dn=Vampirella+%28Warren%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"brodahisou","files":-1,"time":1233792014,"description":"All scanned issues of Warren's Vampirella magazine.\n\nVampirella is a vampire heroine created by Forrest J Ackerman and developed by Archie Goodwin with artists Frank Frazetta and Tom Sutton. Vampirella first appeared as a horror-story hostess in Vampirella #1 (Sept. 1969), continuing in that capacity through issue #8 (Nov. 1970) when she was &quot;revamped&quot; as a leading character. Backup features appearing in Vampirella included &quot;Tomb of the Gods&quot;, &quot;Pantha&quot; and &quot;Fleur&quot;. Vampirella herself also appeared in a story with fellow Warren characters Pantha and the Rook in Eerie #94-95, and with most of the Warren characters in a company crossover special in Eerie #130.\n\nVampirella was originally presented as an inhabitant of the planet Draculon, a world where people lived on blood and where blood flowed in rivers. Draculon orbits two twin suns that were causing droughts across the planet, marking certain doom for Vampirella and her race. The race of which Vampirella was born, the Vampiri, were able to transform themselves into bats at will, sprout wings when required, and drink blood.\nThe story begins with the inhabitants of Draculon dying slowly due to the drying up of it's blood. The last few lie dying when a spaceship from Earth crashes on the planet. Vampirella, sent to investigate, is attacked; retaliating, she discovers that the astronauts have blood in their veins. In order for her race to survive, she manages to pilot the ship back to Earth where her adventures begin. Vampirella becomes a &quot;good&quot; vampire, and devotes her energy to ridding our world of the homegrown &quot;evil&quot; kind.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:cf2a02e73a9cef5c38c9dacb4095f3fce15b9684","amp;dn":"Vampirella+%28Warren%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf2a02e73a9cef5c38c9dacb4095f3fce15b9684","infoHashBuffer":{"type":"Buffer","data":[207,42,2,231,58,156,239,92,56,201,218,203,64,149,243,252,225,91,150,132]},"announce":[],"urlList":[]}}