{"title":"Dirty Little Lies by Clara James.epub","uid":9560875,"size":382479,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cf75512e1d8bdf63f39a79e7e806ff29bca815f2&amp;dn=Dirty+Little+Lies+by+Clara+James.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bluanjel","files":1,"time":1391422116,"description":"Twenty-nine-year-old Stevie Sinclair has just lost everything: her boyfriend, her apartment, even her ugly bird named Free. (Yeah, she knows itÂ’s stupid name, so donÂ’t start.) But most importantly, StevieÂ’s lost herself. \n\nAs she shuffles through her days in worn-out Hello Kitty PJsÂ—eating ice cream, sipping wine, and contemplating her next moveÂ—a magazine article catches her attention. Blaring black letters read: &quot;How to Get Your Sexy Back in Six Easy Steps.&quot;\n\nStevie studies the article in the trashy magazine like the good student she is and immediately knows what she has to do. With the magazine article in hand, and a bottle of red in her bag, Stevie embarks on a journey to reclaim her life and win back her ex. \n\nUntil she meets Gabe Shannon. Gorgeous, single, and on a quest of his own, Gabe introduces Stevie to a lifestyle that is sure to help get her sexy back and then some. If she doesnÂ’t chicken out Â… (Oh, you know where this is going.)\n\nWhat follows is a story of self-discovery, romantic gestures, erotic encounters, and following one's heart--even if it leads in unexpected directions.\n","torrent":{"xt":"urn:btih:cf75512e1d8bdf63f39a79e7e806ff29bca815f2","amp;dn":"Dirty+Little+Lies+by+Clara+James.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf75512e1d8bdf63f39a79e7e806ff29bca815f2","infoHashBuffer":{"type":"Buffer","data":[207,117,81,46,29,139,223,99,243,154,121,231,232,6,255,41,188,168,21,242]},"announce":[],"urlList":[]}}