{"title":"Streetheart - Drugstore Dancer [1980][2012][320 KBPS][RMSTD]","uid":10310955,"size":102700111,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d01921801defc082686485086a5400f27a0dae15&amp;dn=Streetheart+-+Drugstore+Dancer+%5B1980%5D%5B2012%5D%5B320+KBPS%5D%5BRMSTD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LameDuck69","files":12,"time":1402180113,"description":"Streetheart - Drugstore Dancer [1980][2012][Remastered]\n\n\n\n\n\n01. Drugstore Dancer  \n02. Teenage Rage  \n03. Nobody Like You  \n04. Go To Hell  \n05. You're Gonna Crash  \n06. Tin Soldier  \n07. Trouble  \n08. Sold Out  \n09. Let Me Go  \n\n\n\n\n\n320 KBPS [CBR]\n\nCover Art\n\n\n\n\n\n\nFrom Wikipedia:\n\n\n\nStreetheart is a Canadian rock band, from Winnipeg, Manitoba that got its start in Regina, Saskatchewan. Their best known songs include &quot;Action&quot;, &quot;Hollywood&quot;, &quot;Teenage Rage&quot;, &quot;One More Time&quot;, &quot;Tin Soldier&quot;, &quot;What Kind of Love is This&quot;, and their cover of the Rolling Stones' &quot;Under My Thumb&quot;.\n\n-----------------------------------------------------------------------------------\n\nKeyboard player Daryl Gutheil and bassist Spider (Ken Sinnaeve) formed a band called Witness Incorporated in Regina, and then relocated to Winnipeg, where singer Kenny Shields joined the band.[After renaming the band Witness, the group finally became Streetheart when guitarist Paul Dean and drummer Matt Frenette joined in 1977. The band released Meanwhile Back in Paris the following year and Under Heaven over Hell in 1979, after which Frenette dropped out to join Dean in Loverboy. John Hannah played guitars on Under Heaven Over Hell (1979), Quicksand Shoes (1980), and Drugstore Dancer (1980). In 1980, Streetheart won the Juno Award for &quot;Most Promising Group of the Year&quot;.\n\nArguably, Streetheart's most popular single was a 1979 disco-hybrid cover version of &quot;Under My Thumb&quot; by the Rolling Stones (an early Streetheart influence). Streetheart's version achieved gold single status in Canada. The extended live version is notable for its blazing bass solo, performed by Spider Sinnaeve.\n\nFor the next four years they released a string of albums: Quicksand Shoes (1980), Drugstore Dancer (1980), Action: Best of Streetheart (1981), the self-titled Streetheart (1982), Dancing with Danger (1983), and the double live album Live After Dark (1983). Record sales earned them six gold albums and four platinum albums in Canada. The band broke up in 1983, after which a collection of unreleased songs called Buried Treasures was issued in 1984.\n\nFrehley's Comet recorded their own version of &quot;Dancing with Danger&quot; for their 1988 album, Second Sighting. In 1991, Hardline recorded their own version of the Streetheart song &quot;Hot Cherie&quot; for their 1992 album, Double Eclipse.\n\nAt the peak of their career, Streetheart toured with several rock bands. Canadian bands included Chilliwack, Rush, Toronto, Harlequin, Max Webster, Aldo Nova, April Wine, Headpins; American bands included Sammy Hagar, Styx, Kansas, Blue Ã–yster Cult. They also toured with AC/DC.\n\nStreetheart received a Juno Award, two Ampex Golden Reel awards, a Chimo Award from Music Express Magazine, and were voted the most popular Canadian act at the Peoples' Choice Awards. In 2003, Streetheart was inducted into the Western Canadian Music Hall of Fame.\n\nIn 2008, the band released a 2 CD retrospective collection titled ...Read All About It - The Hits/Anthology. The band continues to tour and often plays shows in its native Winnipeg.","torrent":{"xt":"urn:btih:d01921801defc082686485086a5400f27a0dae15","amp;dn":"Streetheart+-+Drugstore+Dancer+%5B1980%5D%5B2012%5D%5B320+KBPS%5D%5BRMSTD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d01921801defc082686485086a5400f27a0dae15","infoHashBuffer":{"type":"Buffer","data":[208,25,33,128,29,239,192,130,104,100,133,8,106,84,0,242,122,13,174,21]},"announce":[],"urlList":[]}}