{"title":"Buckethead - The Ballad of Buckethead [promo].VOB","uid":10394912,"size":229169152,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d08268ba74fe580f7d86cc43039530b10d456f8d&amp;dn=Buckethead+-+The+Ballad+of+Buckethead+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1403256089,"description":"Buckethead - The Ballad of Buckethead [promo].VOB\n\n\nHQ rare promo music video from a promo DVD. &quot;The Ballad of Buckethead&quot; was chosen to promote Monsters and Robots. It is one of the few Buckethead songs to prominently feature vocals, which are performed by Primus' Les Claypool. Drums were performed by long-time Buckethead friend (and then Primus drummer) Bryan &quot;Brain&quot; Mantia.\n\nMonsters and Robots is Buckethead's fifth studio album, released April 20, 1999, by Higher Octave records. A large part of the album was co-written with Les Claypool, who also plays bass on several tracks and lends his vocals to the track &quot;The Ballad of Buckethead&quot;.\n\nBuckethead promoted the album by opening for Primus in October and November 1999. Monsters and Robots is listed in the German National Library's catalog and is Buckethead's best selling solo album to date.\n\nA video clip using 3D models and reassembling themes from the lyrics was made by English artist Dave McKean, and gained airplay on several music related television stations.\n\nThe song was included to Primus' live set in October and November 1999, when Buckethead made stage cameos.\n\n&quot;The Ballad of Buckethead&quot; features samples from the 1996 movie Sling Blade.\n\nAlso, the music video has been nominated for the &quot;Best New Artist - Modern Rock&quot; on Billboard's Music Video Awards.\n\n\nBrian Patrick Carroll (born May 13, 1969), better known by his stage name Buckethead, is a guitarist and multi-instrumentalist who has worked within many genres of music. He has released 94 studio albums, four special releases and one EP. He has performed on over 50 more albums by other artists. His music spans such diverse areas as progressive metal, funk, blues, jazz, bluegrass, ambient, and avant-garde music.\n\nBuckethead is famous for wearing a KFC bucket on his head, emblazoned with an orange bumper sticker reading FUNERAL in capital black block letters, and an expressionless plain white mask which, according to Buckethead, was inspired by his seeing Halloween 4: The Return of Michael Myers. At one point, he changed to a plain white bucket that no longer bore the KFC logo, but subsequently reverted to his trademark KFC bucket. He also incorporates nunchaku and robot dancing into his stage performances.\n\nAs an instrumentalist, Buckethead has received critical acclaim for his electric guitar playing, and is considered one of today's more innovative guitarists. He has been voted number 8 on a list in GuitarOne magazine of the &quot;Top 10 Fastest Guitar Shredders of All Time&quot; as well as being included in Guitar World's lists of the &quot;25 all-time weirdest guitarists&quot; and the &quot;50 fastest guitarists of all time&quot;.\n\nBuckethead cites a wide variety of musical influences, including Michael Jackson, Parliament-Funkadelic, Shawn Lane, Michael Schenker, Uli Jon Roth, Paul Gilbert, Yngwie Malmsteen, Eddie Hazel, Randy Rhoads, Larry LaLonde, Mike Patton, James Cutri, Louis Johnson, Jimi Hendrix, Jennifer Batten, The Residents, Eddie Van Halen and Angus Young, as well as the many artists he has collaborated with over the years.\n\nIn addition to his musical influences, Buckethead cites a diverse range of non-musical influences manifested on several ways out of which dedicated songs to said inspirations have been a staple of Buckethead's discography with particular attention to basketball players like Michael Jordan (song &quot;Jordan&quot;), George Gervin (on &quot;Iceman&quot;), Blake Griffin (on &quot;Crack the Sky&quot;), &quot;Pistol&quot; Pete Maravich (on &quot;The Mark of Davis&quot;), and LeBron James (with four songs dedicated to him). Other influences include martial artist and actor Bruce Lee (on &quot;The Game of Death&quot; song and inspiration behind the use of nunchakus on stage), author H. P. Lovecraft (on the &quot;Lurker at the Threshold&quot; suite), numerous science fiction and horror TV shows and movies including Little House on the Prairie, and Giant Robot (mentioned on several songs, albums, and episodes shown on stage).\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Ballad_of_Buckethead#The_Ballad_of_Buckethead&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Ballad_of_Buckethead#The_Ballad_of_Buckethead&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/PaoeLaAfN&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/PaoeLaAfN&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video : MPEG2 Video 720x576 (4:3) 25fps 7300kbps\n   Audio1: Dolby Digital AC3 48000Hz stereo 448kbps    \n   Audio2: LPCM 48000Hz stereo 1536kbps [DVD, 16 bit]\n   Duration: 00:03:42\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.5\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t\n","torrent":{"xt":"urn:btih:d08268ba74fe580f7d86cc43039530b10d456f8d","amp;dn":"Buckethead+-+The+Ballad+of+Buckethead+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d08268ba74fe580f7d86cc43039530b10d456f8d","infoHashBuffer":{"type":"Buffer","data":[208,130,104,186,116,254,88,15,125,134,204,67,3,149,48,177,13,69,111,141]},"announce":[],"urlList":[]}}