{"title":"Depeche Mode - Construction Time Again (2007 Remastered) [EAC-FL","uid":5035048,"size":647823232,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d12fc0e7aee0d7c8e5af09db167adcfd49c24874&amp;dn=Depeche+Mode+-+Construction+Time+Again+%282007+Remastered%29+%5BEAC-FL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"repopo","files":-1,"time":1249077446,"description":"*******************************************************************************\n                    Depeche Mode - Construction Time Again\n*******************************************************************************\n\nThis torrent contains both the Audio CD in its remastered stereo form, as \nreleased in 2007, plus a short video, which tells the story of DM during the era.  \n\nThe video is presented in XviD with .mp3 sound.  There are spanish and english \nsubtitles already ripped and a subpack which also includes subs in Deutsch, \nFranÃƒÂ§ais and Italiano.  You have to rip it yourself (I currently use SubRip on \nWindows), in order to use them.\n\nNote: There's no 5.1 audio here.  I repeat: there's no 5.1 audio here.  Only the \n2.0 stereo album remastered.  And sounds great!\n\n\nCD: Depeche Mode - Construction Time Again (2007 Remastered)\n\n01. Love, In Itself    [0:04:29.63]\n02. More Than A Party    [0:04:45.34]\n03. Pipeline    [0:05:54.70]\n04. Everything Counts    [0:04:20.66]\n05. Two Minute Warning    [0:04:13.38]\n06. Shame    [0:03:51.74]\n07. The Landscape Is Changing    [0:04:49.09]\n08. Told You So    [0:04:27.04]\n09. And Then....    [0:04:39.23]\n10. Everything Counts (Reprise)    [0:00:59.63]\n\nDocumentary: \n\n1983 - Teenagers growing up, bad governments, and all that stuff  [0:38:56]\n\n-------------------------------------------------------------------------------\n                              THE ALLMUSIC REVIEW\n-------------------------------------------------------------------------------\n\nThe full addition of Alan Wilder to Depeche Mode's lineup created a perfect \ntroika that would last another 11 years, as the combination of Martin Gore's \nsongwriting, Wilder's arranging, and David Gahan's singing and live star power \nresulted in an ever more compelling series of albums and singles. Construction \nTime Again, the new lineup's first full effort, is a bit hit and miss \nnonetheless, but when it does hit, it does so perfectly. Right from the album's \nfirst song, &quot;Love in Itself,&quot; something is clearly up; Depeche never sounded \nquite so thick with its sound before, with synths arranged into a mini-\norchestra/horn section and real piano and acoustic guitar spliced in at \nstrategic points. Two tracks later, &quot;Pipeline&quot; offers the first clear hint of an \nincreasing industrial influence (the bandmembers were early fans of EinstÃƒÂ¼rzende \nNeubauten), with clattering metal samples and oddly chain gang-like lyrics and \nvocals. The album's clear highlight has to be &quot;Everything Counts,&quot; a live staple \nfor years, combining a deceptively simple, ironic lyric about the music business \nwith a perfectly catchy but unusually arranged blending of more metallic \nscraping samples and melodica amid even more forceful funk/hip-hop beats. \nElsewhere, on &quot;Shame&quot; and &quot;Told You So,&quot; Gore's lyrics start taking on more of \nthe obsessive personal relationship studies that would soon dominate his \nwriting. Wilder's own songwriting contributions are fine musically, but \nlyrically, &quot;preachy&quot; puts it mildly, especially the environment-friendly &quot;The \nLandscape Is Changing.&quot;\n\n-------------------------------------------------------------------------------\n                          SOME WIKIPEDIA INFORMATION\n-------------------------------------------------------------------------------\n\nConstruction Time Again is the third studio album by the British synthpop band \nDepeche Mode, released in 1983. This was the first Depeche Mode album with Alan \nWilder, who composed the songs &quot;Two Minute Warning&quot; and &quot;The Landscape Is \nChanging&quot; (as well as the B-side &quot;Fools&quot;).\n\nThe album was recorded at John Foxx's Garden studios in London, engineered by \nGareth Jones (who had also engineered Foxx's seminal electronic album, \nMetamatic). It was mixed in the famous Hansa Tonstudio in Berlin (where much of \nDavid Bowie's trilogy of seminal electronic albums featuring Brian Eno had been \nproduced).\n\nThe album's cover artwork features the Matterhorn mountain.\n\nThe song Everything Counts was covered by Swedish melodic death metal band In \nFlames on their album Whoracle.\n\nIn 2007, Construction Time Again was re-released with a bonus DVD. The first CD \nwas remastered and (except in the USA) was released on a CD/SACD hybrid. The \nbonus DVD includes B-sides in addition to the single and B-side for &quot;Get the \nBalance Right&quot;, a one-off single recorded prior to the album. The album is \nreleased as originally intended and does not include the bonus extended mix of \n&quot;Everything Counts&quot;, but does keep the reprise.\n\nThe DVD includes a documentary on the album. The double-documentary discusses \nboth &quot;Get the Balance Right&quot; and Construction Time Again, its two singles, the \nmaking of the cover, the lyrics, and the sampling technology used during the \nalbum's production. It also discusses Alan Wilder and Gareth Jones, a new member \nand a new engineer (respectively) and their impact on the band's sound. It also \nincludes footage of the Construction Time Again tour from 1983, as well as \nexcerpts from the music video for &quot;Get the Balance Right&quot;.\n\n-------------------------------------------------------------------------------\n                       SOME TRACKS REVIEWED AT ALLMUSIC\n-------------------------------------------------------------------------------\n\nLOVE IN ITSELF     by Stewart Mason\n\nThe opening track and first single from Depeche Mode's third album, 1983's \nConstruction Time Again, &quot;Love in Itself&quot; fully introduces the group's second \nstage after the spotty and transitional A Broken Frame, which had been unevenly \npitched between frothy pop songs in the &quot;Just Can't Get Enough&quot; vein and Martin \nGore's more ponderous, mopey experiments. &quot;Love in Itself&quot; integrates those two \naspects quite neatly: although the overall tone of the song is solemn and \ndignified in the manner of early Orchestral Manoeuvres in the Dark or some of \nthe other, artsier synth pop bands, &quot;Love in Itself&quot; also has a pair of \nmaddeningly catchy synth hooks counterpointing each other, as well as a sweetly \npretty and memorable chorus. New member Alan Wilder, introduced on the stand-\nalone 1982 single &quot;Get the Balance Right,&quot; fleshes out the reconstituted \nquartet's sound perfectly, adding a depth that had been missing from A Broken \nFrame as well as a richer tonal palette that the comparatively brittle debut, \nSpeak &amp; Spell, had lacked. \n\n\nEVERYTHING COUNTS     \tby Ned Raggett\n\nWhile Martin Gore had created his share of fine hit singles for Depeche Mode \nfollowing Vince Clarke's departure, most were pleasant rather than deathless. \nThat all completely changed with &quot;Everything Counts,&quot; which saw both his own \nsongwriting abilities matched with an increasing ambition of the band as a \nwhole. With a big, full-bodied rhythm, as much indebted to hip-hop's worship of \nthe breakbeat and industrial music's own love of huge beats as to disco's \nsimilar enthrallment, &quot;Everything Counts&quot; remains one of the band's best \nnumbers. Gore's lyrical sentiments, ripping into corruption and compromised \nideals via a perverse singsong ( Gore's own sweet delivery of the chorus is \nparticularly ironic in this light), match the brutal work at play. David Gahan's \nlead vocal is a bit sour at points, but he handles himself well most of the \ntime, letting the combination of drum machine, sampled metallic scrapes, deep \nsynth bass, and, playing the lead melody, a sampled shawm, or Chinese oboe, come \nto the fore. Aggressive and beautiful at once, it can arguably be called the \nfirst English-language industrial pop hit. \n\n\n-------------------------------------------------------------------------------\n                               EAC LOG EXTRACT\n-------------------------------------------------------------------------------\n\nExact Audio Copy V0.99 prebeta 4 from 23. January 2008\n\nEAC extraction logfile from 31. July 2009, 9:58\n\nDepeche Mode / Construction Time Again (2007 Remastered)\n\nUsed drive  : HL-DT-STDVD-RAM GSA-H55N   Adapter: 0  ID: 0\n\nRead mode               : Secure\nUtilize accurate stream : Yes\nDefeat audio cache      : Yes\nMake use of C2 pointers : No\n\nRead offset correction                      : 102\nOverread into Lead-In and Lead-Out          : No\nFill up missing offset samples with silence : Yes\nDelete leading and trailing silent blocks   : No\nNull samples used in CRC calculations       : Yes\nUsed interface                              : Installed external ASPI interface\nGap handling                                : Appended to previous track\n\nUsed output format              : User Defined Encoder\nSelected bitrate                : 1024 kBit/s\nQuality                         : High\nAdd ID3 tag                     : No\nCommand line compressor         : F:Archivos de programaExact Audio \nCopyFLACFLAC.EXE\nAdditional command line options : -8 -V -T &quot;ARTIST=%a&quot; -T &quot;TITLE=%t&quot; -T \n&quot;ALBUM=%g&quot; -T &quot;DATE=%y&quot; -T &quot;TRACKNUMBER=%n&quot; -T &quot;GENRE=%m&quot; -T &quot;COMMENT=%e&quot; %s -o \n%d\n\n\n-------------------------------------------------------------------------------\n                                ACCURIP REPORT\n-------------------------------------------------------------------------------\n\n[Verification date: 31/07/2009 10:02:23]\n[Disc ID: 0011623f-0089b192-8709f70a]\nTrack\t[ CRC    ] Status\n 01\t[62d13fc5] (43/65) Accurately ripped as in pressing(s) #1\n 02\t[562ee674] (43/65) Accurately ripped as in pressing(s) #1\n 03\t[bfaae50f] (43/65) Accurately ripped as in pressing(s) #1\n 04\t[e0424598] (42/64) Accurately ripped as in pressing(s) #1\n 05\t[dceed375] (42/64) Accurately ripped as in pressing(s) #1\n 06\t[dfe068e1] (42/64) Accurately ripped as in pressing(s) #1\n 07\t[e7bfdaac] (42/64) Accurately ripped as in pressing(s) #1\n 08\t[ca616b11] (41/63) Accurately ripped as in pressing(s) #1\n 09\t[9b1f7cd1] (41/65) Accurately ripped as in pressing(s) #1\n 10\t[9e4c83e5] (39/60) Accurately ripped as in pressing(s) #1\n\n-------------------------------------------------------------------------------\n                      IMPORTANT: PLEASE READ (A REQUEST)\n-------------------------------------------------------------------------------\n\nIt's usual to post comments only to complain about a torrent which doesn't work \nin your configuration.  It's normal, after a few hours/days downloading and \nexpecting a release, to feel deceived if it doesn't work properly, and \nexpressing this is legitimate.\n\nI've often found one comment (negative) on a movie/CD downloaded by 2000+ \npeople, and since that single negative feedback, people simply stop downloading \nand therefore, sharing.  But a few times it was due not to the torrent itself, \nbut to some issues on the downloader side (not updated codecs, misused \ntools...), and that's unfair for the person who took the time to share it for\nfree.\n\nIF YOU FIND THIS RELEASE DESERVES TO BE RECOMMENDED TO OTHERS, HELP BY DROPPING \nA LINE AFTER YOU'VE CHECKED IT.  This way, You'll help in keeping the torrent \nalive, almost as much as keeping it in your HDD until a 1:1 ratio is\nreached.\n\nThanks\n\n-------------------------------------------------------------------------------\n-------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:d12fc0e7aee0d7c8e5af09db167adcfd49c24874","amp;dn":"Depeche+Mode+-+Construction+Time+Again+%282007+Remastered%29+%5BEAC-FL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d12fc0e7aee0d7c8e5af09db167adcfd49c24874","infoHashBuffer":{"type":"Buffer","data":[209,47,192,231,174,224,215,200,229,175,9,219,22,122,220,253,73,194,72,116]},"announce":[],"urlList":[]}}