{"title":"Free Moral Agents - Control This (2010)","uid":6799651,"size":106636305,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d14313b1d91f581abb86ea26bf4d2dc53ddfc08a&amp;dn=Free+Moral+Agents+-+Control+This+%282010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eatmecaptain765","files":-1,"time":1320657011,"description":"Free Moral Agents is the brainchild of Isaiah Ikey Owens, Grammy Award-winning keyboardist for The Mars Volta &amp; De Facto.\n\nThe Long Beach, CA-based Owens initially started Free Moral Agents as a solo project. It has since expanded into a group effort, a result of Isaiah's decade-long career of collaborations with artists as diverse as El-P, Mastodon, Sublime, Saul Williams, and Z-Trip.\n\nFree Moral Agents released their debut Everybody's Favorite Weapon on GSL Records in late 2004. With freestyle moments layered over vibrant melodies, heavy beats, and jazzy interludes, Everybody's Favorite Weapon was just the beginning of something that was no longer considered just a side-project.\n\nWhile out on the road with the Mars Volta, Isaiah kept thinking of ways to expand Free Moral Agents. In 2006, FMA went from a solo effort to full six-member group and started improvising new material. With the lineup of Mendee Ichikawa (vocals), Reid Kinnet (Rhodes), Jesse Carzello (guitar), Dennis Owens (bass), Ryan Reiff (drums) and Isaiah jumping from keyboard to keyboard, FMA quickly came up with much new music and was in and out of the studio several times in 2007 and 2008,\n\nFree Moral Agents is now gearing up to release their new album Honey In The Carcass Of The Lion, an EP titled Control This and a 10&quot; vinyl collaboration with legendary Fela Kuti's drummer and Afro Beat co-founder Tony Allen titled North Is Red.","torrent":{"xt":"urn:btih:d14313b1d91f581abb86ea26bf4d2dc53ddfc08a","amp;dn":"Free+Moral+Agents+-+Control+This+%282010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d14313b1d91f581abb86ea26bf4d2dc53ddfc08a","infoHashBuffer":{"type":"Buffer","data":[209,67,19,177,217,31,88,26,187,134,234,38,191,77,45,197,61,223,192,138]},"announce":[],"urlList":[]}}