{"title":"Michael Anderson - 1984 (1956)","uid":6763838,"size":1350725252,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d14d4b397643af3f69c8e6838cf57269cf15c418&amp;dn=Michael+Anderson+-+1984+%281956%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"mfccorrea","files":4,"time":1319294183,"description":"Great liberties were taken with the story written by Orwell and published in 1949, a year before Orwell passed away. Those liberties were to the detriment of one of the most powerful and depressing books ever written. The year is, of course, 1984, and London is the capital of one of three world communities of Oceania. It's after the first atomic war, and everyone in London (and everywhere else) is constantly watched by TV cameras (which are also screens) and by &quot;Big Brother&quot; and his faceless aides. The surroundings are drab, and no individuality will be tolerated. The walls are festooned with posters which read &quot;War Is Peace,&quot; &quot;Freedom Is Slavery,&quot; and &quot;Big Brother Is Watching You.&quot; And he is. O'Brien works for the state and finds that he cannot handle the stultifying atmosphere of being ruled by the Minsitry of Love because he is falling for Sterling. They begin to have a clandestine affair which will be life-threatening if ever uncovered by the Anti-Sex League or the Thought Police. Sterling and O'Brien make plans to overthrow Big Brother and they are joined in their cabal by Redgrave, but he is, in reality, a member of the Government who eventually informs on them. Since there are two-way microphones in every residence, the deepest fears of every citizen have been audiotaped and are known to the authorities. When someone is brought in, they are taken to Room 101, where they have to confront their innermost fears. In the case of O'Brien, it's rats, and when he must face the little furry things, he breaks. The end of the movie is varied, depending on which country you see it in. The British version has Sterling and O'Brien killed. The American version has O'Brien betraying Sterling and so successfully brainwashed that he shouts for the love of Big Brother rather than &quot;down with Big Brother,&quot; the words he screams as his last epithet in England. The last words of the book are also different. After O'Brien's character is bumped off, the comment is made that &quot;he loved Big Brother.&quot; Another version of the film was made in the 1980s which was equally depressing and ultimately unsuccessful with the critics and the public. Perhaps this is one of those novels that defies cinematization and must be savored in one's brain, rather than with the ears and eyes. The same could be said for Huxley's Brave New World.\n\nFile Name .........................................: 1984.avi\nFile Size (in bytes) ............................: 1,350,496,256 bytes\nRuntime ............................................: 1:30:13\n\nVideo Codec ...................................: XviD ISO MPEG-4\nFrame Size ......................................: 640x472 (AR: 1.356)\nFPS .................................................: 23.976\nVideo Bitrate ...................................: 1730 kb/s\nBits per Pixel ...................................: 0.239 bpp\nB-VOP, N-VOP, QPel, GMC.............: [B-VOP], [], [], []\n\nAudio Codec ...................................: 0x2000 (Dolby AC3) AC3\nSample Rate ...................................: 48000 Hz\nAudio Bitrate ...................................: 256 kb/s [2 channel(s)] CBR\nNo. of audio streams .......................: 1\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0048918/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0048918/&lt;/a&gt;\n\nEnglish audio; French, Spanish and Portuguese subtitles\n\nMy rip\n\nMichael Anderson - 1984 (1956)","torrent":{"xt":"urn:btih:d14d4b397643af3f69c8e6838cf57269cf15c418","amp;dn":"Michael+Anderson+-+1984+%281956%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d14d4b397643af3f69c8e6838cf57269cf15c418","infoHashBuffer":{"type":"Buffer","data":[209,77,75,57,118,67,175,63,105,200,230,131,140,245,114,105,207,21,196,24]},"announce":[],"urlList":[]}}