{"title":"Cream - I Feel Free (Live-Beat Club)  (2nafish)","uid":5240606,"size":97228804,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d1bb60c94135d14a6007638f5731904013273632&amp;dn=Cream+-+I+Feel+Free+%28Live-Beat+Club%29++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1261746186,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;I Feel Free&quot; is a song first recorded by the British blues rock band Cream. The song was written by Pete Brown and Jack Bruce and was the first of their many collaborations. It was the first track on the US version of their debut album, Fresh Cream (1966), and the band's second hit single, following the surprising release of &quot;Wrapping Paper&quot;. Like all tracks on Cream's first US album, the producer's credit went to Robert Stigwood. The tracks were produced by the band, however.\n\n&quot;I Feel Free&quot; was an important song for the band. The song contained one of the more brief guitar solos by Eric Clapton, and became effectively the first song to showcase what the band had to offer. Though much of Cream's repertoire was blues-rock, this song presented straight rock and psychedelic aspects.\n\nFresh Cream is Cream's December 1966 debut album. It was the first LP release of producer Robert Stigwood's new &quot;Independent&quot; Reaction Records label. It reached number 6 in the UK in February 1967 and - eventually - number 39 in the US in August 1968. The British version omitted &quot;I Feel Free&quot; (then their current single), while the US version contained it, though it dropped &quot;Spoonful&quot;. The CD re-issue of 2000 preserves both songs in the album's running order.\n\nIn 2003, the album was ranked number 101 on Rolling Stone magazine's list of the 500 greatest albums of all time.\n\nCream were a 1960s British blues-rock band and supergroup consisting of bassist/vocalist Jack Bruce, guitarist/vocalist Eric Clapton, and drummer Ginger Baker. Their sound was characterised by a hybrid of blues, hard rock and psychedelic rock, combining Clapton's blues guitar playing with the powerful voice and intense basslines of Jack Bruce and the jazz-influenced drumming of Ginger Baker. Wheels of Fire was the world's first platinum-selling double album. Cream is widely regarded as being the world's first notable and functioning supergroup.\n\nCream's music included songs based on traditional blues such as &quot;Crossroads&quot; and &quot;Spoonful&quot;, and modern blues such as &quot;Born Under a Bad Sign&quot;, as well as more eccentric songs such as &quot;Strange Brew&quot;, &quot;Tales of Brave Ulysses&quot; and &quot;Toad&quot;. Cream's biggest hits were &quot;I Feel Free&quot; (UK, #11), &quot;Sunshine of Your Love&quot; (US, #5), &quot;White Room&quot; (US, #6), &quot;Crossroads&quot; (US, #28), and &quot;Badge&quot;.\n\nCream, together with The Jimi Hendrix Experience, made a significant impact upon the popular music of the time, and along with Hendrix popularised the use of the wah-wah pedal. They provided a heavy yet technically proficient musical theme that foreshadowed and influenced the emergence of English bands such as Led Zeppelin, Deep Purple, and The Jeff Beck Group in the late 1960s. The band's live performances influenced progressive rock acts such as Rush, jam bands such as The Allman Brothers Band, Grateful Dead, Phish and heavy metal bands such as Black Sabbath\n\nCream was ranked #16 on VH1's 100 Greatest Artists of Hard Rock and Rolling Stone Magazine named them the sixty-sixth greatest artist of all time.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:d1bb60c94135d14a6007638f5731904013273632","amp;dn":"Cream+-+I+Feel+Free+%28Live-Beat+Club%29++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1bb60c94135d14a6007638f5731904013273632","infoHashBuffer":{"type":"Buffer","data":[209,187,96,201,65,53,209,74,96,7,99,143,87,49,144,64,19,39,54,50]},"announce":[],"urlList":[]}}