{"title":"Unpatriotic History of the Second World War","uid":7735086,"size":3456444,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d1ce5b816cfb2b52fb4dc2965f03e6a25849050e&amp;dn=Unpatriotic+History+of+the+Second+World+War&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"octubre","files":-1,"time":1350459800,"description":"Unpatriotic History of the Second World War\nBy James Heartfield\n\nThe Second World War was not the Good War of legend. James Heartfield explains that both Allies and Axis powers fought for the same goals - territory, markets and natural resources. \n\n---\n\nSixty million people died in the Second World War, and still they tell us it was the Peoples War.\n\nThe official history of the Second World War is Victors History. This is the history of the Second World War without the patriotic whitewash.\n\nThe Second World War was not fought to stop fascism, or to liberate Europe. It was a war between imperialist powers to decide which among them would rule over the world, a division of the spoils of empire, and an iron cage for working people, enslaved to the war production drive.\n\nThe unpatriotic history of the Second World War explains why the Great Powers fought most of their war not in their own countries, but in colonies in North Africa, in the Far East and in Germanys hoped-for Empire in the East. Find out how wildcat strikes, partisans in Europe and Asia, and soldiers mutinies came close to ending the war. And find out how the Allies invaded Europe and the Far East to save capitalism from being overthrown.\n\nJames Heartfield challenges the received wisdom of the Second World War.","torrent":{"xt":"urn:btih:d1ce5b816cfb2b52fb4dc2965f03e6a25849050e","amp;dn":"Unpatriotic+History+of+the+Second+World+War","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1ce5b816cfb2b52fb4dc2965f03e6a25849050e","infoHashBuffer":{"type":"Buffer","data":[209,206,91,129,108,251,43,82,251,77,194,150,95,3,230,162,88,73,5,14]},"announce":[],"urlList":[]}}