{"title":"Midas Dekkers - Rood (MP3, 2011)","uid":10522409,"size":436760887,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d1ea3e70234265ac718c84f138065126bc5558a9&amp;dn=Midas+Dekkers+-+Rood+%28MP3%2C+2011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":30,"time":1405002369,"description":"Stammen gewone vrouwen af van de apen,roodharigen zijn aan de katten verwant. Geen wonder dat ze Midas Dekkers bekoren. En hem niet alleen. Wie rood haar koud laat is blind. Roodharigheid is de beste harigheid. De kleur is luid, maar niet duidelijk. Als de blonde de held is en de zwarte de boef, wat speelt dan de rode? Heks? Hoer? Madonna? Juist in haar dubbelzinnigheid schuilt de kracht. Roodharigen zijn zeldzaam en dreigen uit te sterven. Waar haal je zo gauw nieuwe vandaan? Genetici weten het bijna.\n\nVoor hen blijft roodharigheid een erfelijke afwijking, zij het de aardigste afwijking die er is. Zou je uiterlijk dan toch iets over je inborst zeggen? Zijn roodharigen echt ook rood van binnen? Door-en-door? Midas Dekkers is bioloog en schrijver. Hij was jarenlang columnist bij Vroege vogels en heeft vele beestenbundels gepubliceerd, zoals de bestsellers Lief dier, De vergankelijkheid, en De larf.\n\nEn ook luisterboeken: Midas leest het beest en De jaloerse kip en andere beesten. Midas Dekkers praat zoals hij schrijft, en schrijft zoals hij praat.\n","torrent":{"xt":"urn:btih:d1ea3e70234265ac718c84f138065126bc5558a9","amp;dn":"Midas+Dekkers+-+Rood+%28MP3%2C+2011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1ea3e70234265ac718c84f138065126bc5558a9","infoHashBuffer":{"type":"Buffer","data":[209,234,62,112,35,66,101,172,113,140,132,241,56,6,81,38,188,85,88,169]},"announce":[],"urlList":[]}}