{"title":"Lil Half Dead - Steel On A Mission (1996)","uid":4255775,"size":67573593,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d21d0f0b3a0a75a0c46a5012460d82f2df841b6e&amp;dn=Lil+Half+Dead+-+Steel+On+A+Mission+%281996%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"cancelchristmas","files":11,"time":1214239788,"description":"Lil 1/2 Dead's sophomore LP (following his similarly excellent debut &quot;The Dead Has Arisen&quot;) was 1996's &quot;Steel on a Mission.&quot; Just like his first, this album is an amazing piece of 90s west coast g-funk and is and always has been embarrassingly slept-on. This album is quite similar to his debut, but overall I think I like this one a little better. At only ten tracks, it is a little more consistent with no skits and sounds a little more focused. No longer claiming Tha Dogg Pound, Half Dead has advanced two years lyrically, and his rapping is a little more varied and interesting. The cover, while really cool looking if you ask me, is a little misleading, kind of suggesting some sort of horrorcore. Half Dead is a smooth, laidback g-funk rapper in the vein of DJ Quik or Daz Dillinger. He raps of his experiences in Long Beach and is fun to listen to, he has a youthful flow and voice. The production is the real treat in Half Dead's music, though. The multiple producers who contribute to &quot;Steel on a Mission&quot; make simply phenomenal beats. The beats are upbeat but very laidback, always thick with thumping, catchy basslines, woozy synthesizer lines, and funky guitars and instrumentals. Half Dead usually has catchy hooks in his songs and is just really fun to listen to. &quot;Steel on a Mission&quot; is one of the lost gems of the g-funk era, a really great and underrated album.\n\nTracklist:\n\n 1. Steel on a Mission '96 (4:04)\n 2. Low Down (4:24)\n 3. Southern Girl (4:03)\n 4. Back in the Day (4:44)\n 5. Givin' It Up (5:08)\n 6. Young HD (4:30)\n 7. If You Don't Know (4:27)\n 8. Still Rollin' (4:37)\n 9. Gotta Git Cha (4:22)\n10. Cavvy Sounds (4:30)\n","torrent":{"xt":"urn:btih:d21d0f0b3a0a75a0c46a5012460d82f2df841b6e","amp;dn":"Lil+Half+Dead+-+Steel+On+A+Mission+%281996%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d21d0f0b3a0a75a0c46a5012460d82f2df841b6e","infoHashBuffer":{"type":"Buffer","data":[210,29,15,11,58,10,117,160,196,106,80,18,70,13,130,242,223,132,27,110]},"announce":[],"urlList":[]}}