{"title":"320 Hunter Smoke On The Water","uid":6796862,"size":12506995,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d29cbd41ca06490b1e9d0c556d16a266b5849e80&amp;dn=320+Hunter+Smoke+On+The+Water&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"320hunter","files":1,"time":1320489173,"description":"Now will you get the chance to laugh properly for me. It's no secret that I plays some instruments, and works in Cubase it's a hobby and I am an amateur but here you enjoy my interpretation of Deep Purple's Smoke On The Water. Laugh write what you want I can take it I answer what I think is legitimate and even negative criticism is always good haha :)\n\n\n\n\n\n\n\nActually the chords are G5, Bb5, C5, etc. They're power chords (triads without a third), and the root is not on the bottom of the voicing.\n\nWhen you're trying to come up with a guitar part from a piano part that was made from a guitar part, you're probably going to run into some inconsistancies when compared to the original recording. Sometimes things are moved around to different octaves for ease on the piano; sometimes certain notes are left out or added to the chords. The recording will be your best guide.\n\nHowever, when reading the piano music for guitar, remember that guitar is actually a transposing instrument. Written music for guitar is transposed up one octave, and the notes you play consequently sound one octave lower than written. So if you were to play the piano music from the book on the guitar, you would have to play everything up one octave to compensate.\n\nThat said, from the looks of the opening piano part, the original guitar riff has been moved up an octave to better fit the piano's range.\n\n\n\n\n                     ========&gt; LEGAL UPLOAD :D &lt;========","torrent":{"xt":"urn:btih:d29cbd41ca06490b1e9d0c556d16a266b5849e80","amp;dn":"320+Hunter+Smoke+On+The+Water","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d29cbd41ca06490b1e9d0c556d16a266b5849e80","infoHashBuffer":{"type":"Buffer","data":[210,156,189,65,202,6,73,11,30,157,12,85,109,22,162,102,181,132,158,128]},"announce":[],"urlList":[]}}