{"title":"Men Behaving Badly","uid":6093358,"size":16260276224,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d310d6eadb2cfd959cdd724a183946f736f5de69&amp;dn=Men+Behaving+Badly&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"fillinthisspace","files":52,"time":1294658750,"description":"Here for your viewing pleasure is every episode of the classic British comedy, Men Behaving Badly.\n\nThere's a few other torrents of this series floating around but they're showing their age. These are new DVD encodes, properly cropped and de-interlaced and with a 4:3 aspect ratio.\n\nYou'll no doubt notice these AVIs aren't all the same in size. That's because there's only two options... encode for a target file size, or encode for a target quality. I always do the latter, which means the file sizes vary accordingly. I've no idea why encoding for file size rather than quality is still the more commonly used method as it doesn't make sense to me. Not these days. There are some quality variations in a few episodes, but that's just the original DVDs and nothing to do with the encoding.\n\nAll episodes are 640x480 with the original 2ch AC3 audio (except for the Comic Relief and Red Nose Day specials which I re-encoded from downloaded files), and all should be playable using any standalone player.\n\nMy upload speed is very slow, and it'll no doubt take me several days to completely seed the whole torrent so please be patient. I considered splitting it up into seasons but eventually some seasons will be seeded better than others, and as the old torrents are already split into seasons I thought it might be better to keep these newer encodes together so they stay together. If you're one of the initial downloaders please don't disappear too quickly when you're done as my bandwidth is limited so I can't keep seeding forever. Some initial help would be much appreciated. :-)\n\nEnjoy.","torrent":{"xt":"urn:btih:d310d6eadb2cfd959cdd724a183946f736f5de69","amp;dn":"Men+Behaving+Badly","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d310d6eadb2cfd959cdd724a183946f736f5de69","infoHashBuffer":{"type":"Buffer","data":[211,16,214,234,219,44,253,149,156,221,114,74,24,57,70,247,54,245,222,105]},"announce":[],"urlList":[]}}