{"title":"Treating Dementia in Context: A Step-by-Side guide to Working","uid":13859881,"size":1120789,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d3383bacdaf4f73b8991848c2355af93851164e7&amp;dn=Treating+Dementia+in+Context%3A+A+Step-by-Side+guide+to+Working&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Dr.Soc","files":1,"time":1458025192,"description":"Treating Dementia in Context: A Step-by-Side guide to Working with Individuals and Families By Susan M. McCurry, Claudia Drossel\r\n2011 | 220 Pages | ISBN: 1433809362 | PDF | 1 MB\r\n\r\n\r\nDementia is a life-altering diagnosis for patients and loved-ones alike. The progressive disease causes cognitive, emotional, and behavioural changes that can frustrate the efforts of even the most dedicated caregivers. Given the uniquely personal nature of dementia symptoms, treatment can be a supremely challenging experience, even for seasoned health care professionals. In this book, authors Susan McCurry and Claudia Drossel present a clear and practical blueprint for psychologists, physicians, nurses, social workers, and other health care professionals who work with dementia patients and their families. Their evidence-based contextual model of dementia care lays out broad intervention strategies, and encourages readers to use their own creativity and inner resources to develop appropriate solutions for each unique situation and individual. The chapters present a rich variety of vignettes that illustrate common quality-of-life concerns in dementia patients, including medical co-morbidities, patient/caregiver relationships, caregiver burnout, and interactions with health care professionals. Throughout, the authors combine a comprehensive knowledge of the literature with their own extensive clinical experience in advocating a compassionate and open-minded stance that respects the individuality, preferences, and dignity of dementia patients. Health care professionals at all levels of experience, from outpatient to assisted living to residential care settings, will find Treating Dementia in Context an inspirational resource for clinical practice","torrent":{"xt":"urn:btih:d3383bacdaf4f73b8991848c2355af93851164e7","amp;dn":"Treating+Dementia+in+Context%3A+A+Step-by-Side+guide+to+Working","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3383bacdaf4f73b8991848c2355af93851164e7","infoHashBuffer":{"type":"Buffer","data":[211,56,59,172,218,244,247,59,137,145,132,140,35,85,175,147,133,17,100,231]},"announce":[],"urlList":[]}}