{"title":"The Chemical Brothers - The Salmon Dance","uid":7666972,"size":5387377,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d363edf062bd3e128ed177046c7fd3a4b7e3b33b&amp;dn=The+Chemical+Brothers+-+The+Salmon+Dance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"YahSoft","files":-1,"time":1348471172,"description":"Lyrics:\n\nHello Boys and girls, my name is FatLip\nand this is my friend Sammy the Salmon\n*What it do?*\nToday, we're going to teach you some fun facts about Salmon,\nAnd a brand new dance.\nLet me introduce to you a brand new dance\nI know you're gonna love it if you give it one chance\nIt's not complicated, it's not too hard\nYou don't even have to be a hip hop star\nSee anyone can do it, all you need is style\nListen up peep gang I'm gonna show you how\nPut your hands to the side, as silly as it seems\nAnd shake your body like a salmon floatin' up stream!\nI'll float up stream\n(you know how we do it, you know how we do it)\nAgain\n*All my peeps spend part of their life in fresh water*\n*And part of their life in salt water*\nWow, very interesting\n*We change round a couple of days after spawning*\n*Then we die*\nWhen I first did the Salmon all the people just laughed\nThey looked around and stood like I was on crack\nI heard somebody say out loud what the fuck is that\nThis nigga's dancin like a fish while he's doin' the snap\nBut the more I kept doing it the more they kept feelin' it\nAnd then I heard some bitches say yo that niggas killin' it\nBy the end of the night everyone was on my team\nAnd the whole club was dancing like a salmon floatin' up stream!\nI'll float up stream\n(you know how we do it, you know how we do it)\nagain.\n*Most of our friends find their home waters by sense of smell*\n*which is even more keen than that of a dog or a bear*\nWow.\n*My family also rely on ocean currents, tides*\n*The gravitational pull of the moon*(I'm floatin' upstream again)\nThe moon? Fish pay attention to the moon? Wow. Who knew?\n*Did you know?*\nWhat?\n*That I could go to Japan, and back.*\nYou're kidding me. Amazing. Jeez.\n*Polluted water can kill both baby salmon, that are developing*\n*and the adult salmon, that are on their way to spawn.*\nWow what a shame, what a shame\nHuh?\nWoah.\nWow. Hey s-kids, hey give it up for s-Sammy the Salmon and his amazing salmon dance.\nHuh? Whadda ya say?\nWho's hungry?\n\n\nEnjoy and Seed. - YahSoft","torrent":{"xt":"urn:btih:d363edf062bd3e128ed177046c7fd3a4b7e3b33b","amp;dn":"The+Chemical+Brothers+-+The+Salmon+Dance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d363edf062bd3e128ed177046c7fd3a4b7e3b33b","infoHashBuffer":{"type":"Buffer","data":[211,99,237,240,98,189,62,18,142,209,119,4,108,127,211,164,183,227,179,59]},"announce":[],"urlList":[]}}