{"title":"Ben Hur  (1925)","uid":5074232,"size":1468035000,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d3b10241a5f07aeca5d4bda7099e3edfe3b5e67a&amp;dn=Ben+Hur++%281925%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sheila6","files":5,"time":1251673951,"description":"Movies : Drama : DVD Rip : English\n\n\n\nBen-Hur: A Tale of the Christ\n\n\n\n\nRuntime: 143 min | Germany: 151 min (restored version)\n\nDirector: Fred Niblo\n\nWriters: Lew Wallace (novel)\n\nJune Mathis (adaptation).\n\n\n\n\nChildhood friends, Judah Ben-Hur and Messala meet again as adults, this time with Roman officer Messala as conqueror and Judah as a wealthy, though conquered, Israelite. A slip of a brick during a Roman parade causes Judah to be sent off as a galley slave, his property confiscated and his mother and sister imprisoned. Years later, as a result of his determination to stay alive and his willingness to aid his Roman master, Judah returns to his homeland an exalted and wealthy Roman athlete. Unable to find his mother and sister, and believing them dead, he can think of nothing else than revenge against Messala.\n\n\n\nCast:\nRamon Novarro ... Judah Ben-Hur\nFrancis X. Bushman ... Messala\nMay McAvoy ... Esther\nBetty Bronson ... Mary\nClaire McDowell ... Princess of Hur\nKathleen Key ... Tirzah.\n\n\nTrivia for Ben-Hur: A Tale of the Christ (1925) \n\nThe sea battle was filmed near Livorno, Italy. Many extras apparently lied about being able to swim, and due to political troubles engulfing Italy at the time, tension between Fascist supporters of Benito Mussolini and their opponents was evident.\n\n\nForty-eight cameras were used to film the sea battle, a record for a single scene.\n\n\nA staged fire on one of the ships got out of control. Armor-clad extras had to jump in the water. There is conflicting information as to whether any of them were killed.\n\n\nThe first attempt to film the chariot race was on a set in Rome, but there were problems with shadows and the racetrack surface. Then one of the chariots' wheels came apart and the stuntman driving it was thrown in the air and killed. See also Ben-Hur (1959).\n\n\nThe set was abandoned and a new one built in Culver City. 42 cameras were used to film the race and 50,000 feet of film consumed. Second unit director B. Reeves Eason offered a bonus to the winning driver. The final pile-up was filmed later. No humans were seriously injured during the US production, but several horses were killed.\n\n\nAt $3.9 million, the most expensive silent movie ever.\n\n\nMGM inherited the production when the company was founded in 1924; with the film over budget and getting out of control, the studio halted production and relocated the shoot from Italy to California, under the supervision of Irving Thalberg. William Wyler, one of sixty assistant directors for the chariot race, went on to direct the remake Ben-Hur (1959).\n\n\nThe religious scenes, plus Ben Hur's entrance into Rome and some interior scenes that occur thereafter, were shot in two-strip Technicolor.\n\nThe famous chariot scene was filmed at what is now the intersection of LaCienega and Venice Boulevards in Los Angeles.\n\n\nThis production used more that 600 gallons of Max Factor's Liquid Body Make-up.\n\n\n\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Ben-Hur_(1925_film)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Ben-Hur_(1925_film)&lt;/a&gt;\n\n\n\n\n\nEnjoy and Seed!!\n","torrent":{"xt":"urn:btih:d3b10241a5f07aeca5d4bda7099e3edfe3b5e67a","amp;dn":"Ben+Hur++%281925%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3b10241a5f07aeca5d4bda7099e3edfe3b5e67a","infoHashBuffer":{"type":"Buffer","data":[211,177,2,65,165,240,122,236,165,212,189,167,9,158,62,223,227,181,230,122]},"announce":[],"urlList":[]}}