{"title":"Consortium.Update.v1.1-RELOADED","uid":9552932,"size":58251037,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d3cc3988337fc64b72847068cd3eb1a9e21eb55f&amp;dn=Consortium.Update.v1.1-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Tenguken","files":15,"time":1391298421,"description":"CONSORTIUM Update v1.1 (c) Interdimensional Games Inc\n\n02/2014 :..... RELEASE.DATE .. PROTECTION .......: Steam\nDISC(S) .. GAME.TYPE ........: Action, Adventure\n\n----------------------------------------------------------------------------\n\nCheck the included .txt file for a list of what's new.\n\nGame One of the iDGi-1 Trilogy.\nTaking place entirely aboard a massive futuristic aircraft, CONSORTIUM is a\nfirst person science-fiction role-playing experience unlike any other. The\nstory begins in our world - the &quot;real world&quot; - where we here at\nInterdimensional Games have developed a satellite (iDGi-1) capable of\nopening a digital rift through time and space...\nAnyone with an internet connection can travel through this rift and awaken\nwithin an alternate dimension from our own - the &quot;game world&quot; - in the\nyear 2042.\nFeatures:\n* Considered the first of three planned games, each containing their own\nfully resolvable story arcs but linked by the concept and a much larger\ndesign to the story and its countless mysteries.\n* Immerse yourself into the complete interactive story of what happens aboard\nthe C-3800-D &quot;ZENLIL&quot; Consortium Command vessel on December 21st, 2042...\n* Built with a modified version of the SOURCE engine, explore ZENLIL, a\nliving and highly interactive environment with complete freedom and agency.\nIncludes turbulence and non-scripted decompression events!\n* Engage with a cast of over 20 people with an innovative and life like\nconversation system with over 4,000 lines of fully voiced dialogue. OR...\ndon't engage with them at all and choose to never speak a word!\n* Experience an all original orchestral score by award winning composer Jeremy\nSoule\n* Engage in a deep mystery concerning an on-board murder and a large band of\nmercenaries who seem to want YOU dead.\n* Dive into a world with well over 150,000 words of back-story and lore, where\neverything you read, see, speak, or hear relates to the story and characters,\nand everything is there for a reason.\n* A highly original energy based inventory system with original sci-fi weapons,\ngadgets and armor.\n* The story unfolds based largely on your actions. You may use diplomacy and\ntalk your way through the entire game - never shooting anyone! OR, decide to\nuse deadly or non-lethal force.\n* Forge lasting relationships with the crew of ZENLIL, and alter the course of\nthe story through your actions. Your choices will change your play\nexperience, and subsequent playthroughs offer the chance to make different\ndecisions and see all new outcomes.\n* Regardless of what you choose to do or not, the experience always moves\nforward, adapting seamlessly to YOU.\n\n----------------------------------------------------------------------------\n\n1. Unrar.\n2. Install the update.\n3. Copy over the cracked content from the /Crack directory to your game\n&lt;install&gt; directory.\n4. Play the game. Note: don't allow it through your firewall.\n5. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:d3cc3988337fc64b72847068cd3eb1a9e21eb55f","amp;dn":"Consortium.Update.v1.1-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3cc3988337fc64b72847068cd3eb1a9e21eb55f","infoHashBuffer":{"type":"Buffer","data":[211,204,57,136,51,127,198,75,114,132,112,104,205,62,177,169,226,30,181,95]},"announce":[],"urlList":[]}}