{"title":"Carthage Must Be Destroyed: The Rise and Fall -epub","uid":6636332,"size":3897692,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d3f8303082b3a6f0aabf6320089631a23005b1e5&amp;dn=Carthage+Must+Be+Destroyed%3A+The+Rise+and+Fall+-epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bookzilla","files":1,"time":1314570039,"description":"Carthage Must Be Destroyed: The Rise and Fall of an Ancient Civilization\n\nHistorian Richard Mills, of Cambridge, makes telling use of the latest discoveries yielded by Carthaginian ruins in a splendid, comprehensive effort to present the city-state as a dynamic entity and minimize it as a victimized, second-tier society so often portrayed in the histories of Roman and Western interpreters. Blood-curdling battles receive their pyrrhic due, and Hannibal's trans-Alps adventure and his humbling demise are covered in masterful detail.&quot; \n-(Newark) Star-Ledger \n\n&quot;Carthage Must Be Destroyed is a fine, sweeping survey of the rise and fall of an empire and a glimpse into the diversity of the ancient world.&quot; \n-The Wall Street Journal \nProduct Description\nAn epic history of a doomed civilization and a lost empire. \n\nThe devastating struggle to the death between the Carthaginians and the Romans was one of the defining dramas of the ancient world. In an epic series of land and sea battles, both sides came close to victory before the Carthaginians finally succumbed and their capital city, history, and culture were almost utterly erased. \n\nDrawing on a wealth of new archaeological research, Richard Miles vividly brings to life this lost empire-from its origins among the Phoenician settlements of Lebanon to its apotheosis as the greatest seapower in the Mediterranean. And at the heart of the history of Carthage lies the extraordinary figure of Hannibal-the scourge of Rome and one of the greatest military leaders, but a man who also unwittingly led his people to catastrophe. \n\nThe first full-scale history of Carthage in decades, Carthage Must Be Destroyed reintroduces modern readers to the larger-than-life historical players and the ancient glory of this almost forgotten civilization. \n\nHardcover: 544 pages \nPublisher: Viking Adult (July 21, 2011) \nLanguage: English \n \n","torrent":{"xt":"urn:btih:d3f8303082b3a6f0aabf6320089631a23005b1e5","amp;dn":"Carthage+Must+Be+Destroyed%3A+The+Rise+and+Fall+-epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3f8303082b3a6f0aabf6320089631a23005b1e5","infoHashBuffer":{"type":"Buffer","data":[211,248,48,48,130,179,166,240,170,191,99,32,8,150,49,162,48,5,177,229]},"announce":[],"urlList":[]}}