{"title":"Starlord UK (01 - 22 +Extras) (1978 - 1982)","uid":10281765,"size":586377946,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d49356574d2d1668ce2087ad0e923a350c00f425&amp;dn=Starlord+UK+%2801+-+22+%2BExtras%29+%281978+-+1982%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"nemesis43","files":27,"time":1401716585,"description":"Starlord UK (01 - 22 + Extras) (1978 - 1982)\n\nStarlord is a British science fiction weekly anthology comic that was published by IPC Magazines between May and October 1978. Like many IPC titles, it had a fictional editor, in this case the titular Starlord, a protege of 2000AD's Tharg who had supposedly come to Earth to prepare humanity for the future amidst a dangerous cosmos via the stories within.\n\nThe first three issues of Starlord came with free gifts - issue one came with a Starlord Trooper badge (there were six badges to collect - one per issue), issue two came with a folded-card 'space calculator' (which displayed facts on the planets in our solar system) and issue three came with a Starblast game (a 20cm x 16cm card with a wipe clean surface - played a bit like Battleships).\n\nStarlord only lasted 22 issues before merging with 2000AD (prog 86). Two Starlord strips initially survived the merger, futuristic mutant bounty hunter Strontium Dog and robotic disaster relief agency Ro-Busters, with a third, TimeQuake, recounting the adventures of James Blocker of Time Control as he sought to spare Earth from devastating temporal disruptions, eventually being briefly revived in 2000AD. Other Starlord strips included Mind Wars, the story of twin humans turned into powerful psi-weapons by a hostile alien species who planned to use them against humanity; Holocaust, about private investigator Carl Hunter, who stumbled across a covert alien invasion; and Planet of the Damned, set on a hostile world on the other side of a dimensional portal accessed via the Bermuda Triangle.\n\nOne Summer Special (1978) and three annuals (1980-1982) were also published.","torrent":{"xt":"urn:btih:d49356574d2d1668ce2087ad0e923a350c00f425","amp;dn":"Starlord+UK+%2801+-+22+%2BExtras%29+%281978+-+1982%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d49356574d2d1668ce2087ad0e923a350c00f425","infoHashBuffer":{"type":"Buffer","data":[212,147,86,87,77,45,22,104,206,32,135,173,14,146,58,53,12,0,244,37]},"announce":[],"urlList":[]}}