{"title":"A Hoe Lot of Trouble (A Nina Quinn Mystery, #1) - Heather Webber","uid":9023514,"size":442668,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d49d1c1380bcda3a4f66858d1014586f1345a10f&amp;dn=A+Hoe+Lot+of+Trouble+%28A+Nina+Quinn+Mystery%2C+%231%29+-+Heather+Webber&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1381319681,"description":"Meet Nina Quinn, garden landscaper extraordinaire and very amateur sleuth, in this charming cosy series that is perfect for fans of Carolyn Hart.\n\nNina Quinn has had enough of her cheating cop husband. His affair with his partner has driven her close to the edge--and him out of their home. Nina, the owner of Taken By Surprise, a landscaping business that specializes in surprise garden makeovers, already has too much on her plate--her delinquent stepson has let his pet snake loose in the house, and her nosy mother won't stop pestering her to get her bridesmaid's dress fitted for her sister's upcoming nuptials. But it's the strange disappearance of gardening tools--including a very expensive set of hoes--that really throws a wrench in things. And when she gets a call that her oldest friend's father-in-law, a beloved old man who introduced her to landscaping, has been murdered, Nina knows that it's time to start digging for clues to the frustrating, mysterious, and downright evil things that have disturbed her peaceful Ohio hometown.","torrent":{"xt":"urn:btih:d49d1c1380bcda3a4f66858d1014586f1345a10f","amp;dn":"A+Hoe+Lot+of+Trouble+%28A+Nina+Quinn+Mystery%2C+%231%29+-+Heather+Webber","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d49d1c1380bcda3a4f66858d1014586f1345a10f","infoHashBuffer":{"type":"Buffer","data":[212,157,28,19,128,188,218,58,79,102,133,141,16,20,88,111,19,69,161,15]},"announce":[],"urlList":[]}}