{"title":"Ambiguities of Domination: Politics, Rhetoric, and Symbols in Co","uid":8871203,"size":27447220,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d556df87cb3ffcb65d24976bd58aa7e02476f58c&amp;dn=Ambiguities+of+Domination%3A+Politics%2C+Rhetoric%2C+and+Symbols+in+Co&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"blackatk","files":-1,"time":1378068523,"description":"Publication Date: June 15, 1999 | ISBN-10: 0226877884 | ISBN-13: 978-0226877884 | Edition: 1\n\n\nIn Syria, the image of President Hafiz al-Asad is everywhere. In newspapers, on television, and during orchestrated spectacles Asad is praised as the &quot;father,&quot; the &quot;gallant knight,&quot; even the country's &quot;premier pharmacist.&quot; Yet most Syrians, including those who create the official rhetoric, do not believe its claims. Why would a regime spend scarce resources on a cult whose content is patently spurious?\n\nWedeen concludes that Asad's cult acts as a disciplinary device, generating a politics of public dissimulation in which citizens act as if they revered their leader. By inundating daily life with tired symbolism, the regime exercises a subtle, yet effective form of power. The cult works to enforce obedience, induce complicity, isolate Syrians from one another, and set guidelines for public speech and behavior. Wedeen's ethnographic research demonstrates how Syrians recognize the disciplinary aspects of the cult and seek to undermine them. Provocative and original, Ambiguities of Domination is a significant contribution to comparative politics, political theory, and cultural studies.\n\n\nAbout the Author\nLisa Wedeen is professor in and chair of the Department of Political Science at the University of Chicago and the author of Peripheral Visions: Publics, Power, and Performance in Yemen.\n\n\nPaperback: 251 pages\nPublisher: University Of Chicago Press; 1 edition (June 15, 1999)\nLanguage: English\nISBN-10: 0226877884\nISBN-13: 978-0226877884\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Ambiguities-Domination-Politics-Rhetoric-Contemporary/dp/0226877884/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Ambiguities-Domination-Politics-Rhetoric-Contemporary/dp/0226877884/&lt;/a&gt;\n\nTags: President, Hafiz, al-Asad, Bashar, al-assad, assad, Syria, Syrian, Russia, Russian, Iran, Iranian, Lebanon, Hezbollah, PRC, China, IRGC, proxy, crisis, Damascus, Damascene, cult, of, personality, dictator, Tartus, Navy, military, political, science, international, relations, crisis, diplomacy, ","torrent":{"xt":"urn:btih:d556df87cb3ffcb65d24976bd58aa7e02476f58c","amp;dn":"Ambiguities+of+Domination%3A+Politics%2C+Rhetoric%2C+and+Symbols+in+Co","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d556df87cb3ffcb65d24976bd58aa7e02476f58c","infoHashBuffer":{"type":"Buffer","data":[213,86,223,135,203,63,252,182,93,36,151,107,213,138,167,224,36,118,245,140]},"announce":[],"urlList":[]}}