{"title":"Coast to Coast AM June 10, 2013 - Cybernetics NSA Spying","uid":8586558,"size":57116156,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d5bf315a18bd7e45c286193e9ece7ddc61baafd7&amp;dn=Coast+to+Coast+AM+June+10%2C+2013+-+Cybernetics+NSA+Spying&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pyramid91","files":5,"time":1371545868,"description":"MP3 version wins!\nCourtesy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\n\nDate:\n06-10-13\nHost:\nGeorge Noory\nGuests:\nKevin  Warwick,             David  Seaman,                   Dr. Peter  Breggin\nDuring the first half, Professor of Cybernetics at the University of Reading, England, Kevin Warwick spoke about advances in artificial intelligence, robotics and cyborgs. He defined the concept of a cyborg as a human who is enhanced through technology to have extra abilities. It's an intriguing question to explore-- would you have implants in your eyes if they could give you X-ray vision, or undergo a procedure so you could communicate telepathically?, he pondered. If it was a simple, safe procedure to have small implants installed, many people might consider it, kind of like laser eye surgery, he suggested. Currently, three students have small magnets implanted in their fingers as an experiment into expanding their sensory inputs with sonar, he reported.  \nWarwick shared details about robots being developed with biological brains using rat neurons, and how research like this is helping people with neurological problems. He touched on his research project involving a robot named Morgui that has five senses-- vision, hearing, infrared, ultrasonics, and radar, and how this data is fused together. He also talked about the Turing test, in which people try to guess whether they are communicating with a human or artificial intelligence. Warwick foresees robotic or autonomous cars coming in the near future, in which drivers might switch into this mode like they do with cruise control when they're on a freeway or toll road. \n------------------------------------\nIn the latter half, reporter David Seaman discussed the breaking news about whistleblower Edward Snowden, and the ramification of his disclosures regarding NSA surveillance of American citizens via the Internet and telephone. Glenn Greenwald, the journalist who first received the leaked information, has said that Snowden has given him thousands of documents, many of which are significant stories. &quot;So, it's quite possible that by early next week, you and I could be living in a different kind of world,&quot; Seaman remarked, adding that he believes we're seeing a massive abuse of power, and the disassembling of 4th Amendment rights. \nSeaman suspects that we have not learned the full extent of the NSA surveillance of American phone calls-- and that in spite of what we've been told, they may actually have transcripts of all conversations. We do know they have logs of all calls over the past seven years, including the numbers you've called, the numbers that have called you, the length of the calls, and the location data, he said. Snowden called this an &quot;existential threat to democracy,&quot; and while Pres. Obama and various Senators have defended the surveillance, other Senators have expressed concern. Seaman is particularly galled by Pres. Obama presenting himself to voters as a constitutional law scholar, and now backing these actions. Seaman suggested that the ultimate goal of such surveillance is to prevent or stifle civil unrest. \nOverconfidence\nDuring the first half-hour, psychiatrist Dr. Peter Breggin reacted to a new study about overconfidence, which finds that people can draw inaccurate conclusions when they underestimate what they don't know. Genuine confidence comes from the ability to think for yourself and solve problems, Breggin commented.  \nNews segment guest: Will Thomas\nWebsite(s):\n kevinwarwick.com\n\n breggin.com\nBook(s):\n March Of The Machines: The Breakthrough in Artificial Intelligence\n I, Cyborg\n","torrent":{"xt":"urn:btih:d5bf315a18bd7e45c286193e9ece7ddc61baafd7","amp;dn":"Coast+to+Coast+AM+June+10%2C+2013+-+Cybernetics+NSA+Spying","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5bf315a18bd7e45c286193e9ece7ddc61baafd7","infoHashBuffer":{"type":"Buffer","data":[213,191,49,90,24,189,126,69,194,134,25,62,158,206,125,220,97,186,175,215]},"announce":[],"urlList":[]}}