{"title":"Ebook Library - 3   (Epub and Mobi)","uid":6748444,"size":1313141057,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d68928c5825e4f29b689b40906a46a1a4495ce39&amp;dn=Ebook+Library+-+3+++%28Epub+and+Mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"rosie1966","files":2729,"time":1318792704,"description":"475 books included:\n\n\nA. J. Jacobs\t - The Know-it-All: One Man's Humble Quest to Become the Smartest Person in the World\nAdolfo Bioy Casares, Ruth L. C. Simms\t - The Invention of Morel\nAdrian Johns\t - Piracy: the intellectual property wars from Gutenberg to Gates\nAlan Dean Foster\t - Dirge\nAlan Dean Foster\t - Flinx Transcendent: A Pip &amp; Flinx Adventure\nAlan Dean Foster\t - For Love of Mother-Not\nAlan Dean Foster\t - Into the thinking kingdoms\nAlan Dean Foster\t - Lost and found: a novel\nAlan Dean Foster\t - Phylogenesis\nAlan Dean Foster\t - The Chronicles of Riddick\nAlan Dean Foster\t - The Human Blend\nAlasdair Gray\t - Lanark: a life in 4 books\nAlfred Bester\t - The Stars My Destination\nAllan Folsom\t - The Day After Tomorrow: A Novel\nAmy Bloom\t - Love Invents Us\nAmy Chua\t - Battle Hymn of the Tiger Mother\nAndy McDermott\t - The Sacred Vault: A Novel\nAndy Rooney\t - Andy Rooney: 60 Years of Wisdom and Wit\nAngie Sage\t - Septimus Heap, Book One: Magyk\nAnita Shreve\t - Fortune's rocks: a novel\nAnita Shreve\t - Light on snow: a novel\nAnna Whitelock\t - Mary Tudor: Princess, Bastard, Queen\nAnne McCaffrey\t - The Mystery of Ireta: Dinosaur Planet &amp; Dinosaur Planet Survivors\nAnne McCaffrey, Mercedes Lackey, Margaret Ball\t - Brain Ships\nAnne Rice\t - The queen of the damned\nAnthony Bourdain\t - A Cook's Tour: In Search of the Perfect Meal\nAnthony Bourdain\t - Bone in the Throat\nAnthony Bourdain\t - The Bobby Gold stories\nAntony John\t - Five Flavors of Dumb\nAron Ralston\t - Between a Rock and a Hard Place\nArthur C. Clarke\t - Childhood's End\nArthur C. Clarke\t - Rendezvous With Rama\nArto Paasilinna, Pico Iyer, Herbert Lomas\t - The Year of the Hare\nAyn Rand\t - The romantic manifesto: a philosophy of literature\nBarbara Hambly\t - Dead water\nBarbara Kingsolver, Steven L. Hopp, Camille Kingsolver\t - Animal, Vegetable, Miracle: A Year of Food Life\nBarbara Park, Denise Brunkus\t - Junie B. Jones Has a Monster Under Her Bed\nBarbara Park, Denise Brunkus\t - Junie B. Jones is (almost) a flower girl\nBarbara Park, Denise Brunkus\t - Junie B. Jones is Captain Field Day\nBarry Maitland\t - Bright Air\nBetsy Tobin\t - Bone House: A Novel\nBetty Smith\t - A tree grows in Brooklyn\nBill Bryson\t - I'm a stranger here myself: notes on returning to America after twenty years away\nBrad Meltzer\t - The Tenth Justice\nBradley K. Martin\t - Under the Loving Care of the Fatherly Leader: North Korea and the Kim Dynasty\nBrent Weeks\t - Beyond the Shadows\nBrent Weeks\t - Shadow's Edge\nBrian Herbert, Kevin J. Anderson\t - Hunters of Dune\nBrian Herbert, Kevin J. Anderson\t - Sandworms of Dune\nBrian Stableford\t - Architects of Emortality\nBrian Stableford\t - Dark Ararat\nBrian Stableford\t - Inherit the Earth\nBrian Stableford\t - The Cassandra Complex\nBrian Stableford\t - The Fountains of Youth\nBrian Stableford\t - The Omega Expedition\nBrian Stableford, Stableford Brian\t - The Dragon Man\nBruno Schulz, Celina Wieniewska\t - Sanatorium under the sign of the hourglass\nC. S. Lewis\t - Last Battle\nC. S. Lewis\t - Prince Caspian\nC. S. Lewis\t - The horse and his boy\nC. S. Lewis\t - The magician's nephew\nC. S. Lewis\t - The silver chair\nCameron Stracher\t - The Water Wars\nCarey Rockwell\t - On the Trail of the Space Pirates: A Tom Corbett Space Cadet Adventure\nCarl Sagan\t - Contact\nCarl Sagan\t - Cosmos\nCarl Sagan\t - Pale Blue Dot: A Vision of the Human Future in Space\nCarl Sagan\t - The Demon-Haunted World: Science as a Candle in the Dark\nCatherine Cooper\t - The Golden Acorn\nCharles Austen\t - Like Warm Sun on Nekkid Bottoms\nCharles Bukowski\t - Women\nCharlie Huston\t - The Mystic Arts of Erasing All Signs of Death\nCharlotte Wood\t - Brothers &amp; Sisters\nChina Mieville\t - Iron Council\nChina Mieville\t - The Scar\nChris Bradford\t - The Ring of Earth\nChris Bradford\t - The Way of the Warrior\nChris Bradford\t - Young Samurai : The Way Of The Dragon\nChris Bradford\t - Young Samurai: The Way of the Sword\nChris Moriarty\t - Spin State\nChristina Baker Kline\t - Bird in Hand\nChristopher Bayly, Tim Harper\t - Forgotten Wars: Freedom and Revolution in Southeast Asia\nChristopher Hadnagy\t - Social Engineering: The Art of Human Hacking\nChristopher Hitchens\t - Hitch-22: A Memoir\nChristopher Kimball\t - Fannie's Last Supper: Re-creating One Amazing Meal from Fannie Farmer's 1896 Cookbook\nChristopher M. Clark\t - Iron kingdom: the rise and downfall of Prussia, 1600-1947\nChristopher Moore\t - A Dirty Job\nChristopher Moore\t - Bite Me: A Love Story\nChristopher Moore\t - Island of the Sequined Love Nun\nChristopher Moore\t - You Suck: A Love Story\nChristopher Pike\t - The Secret of Ka\nChuck Gannon, Steve White, Charles E. Gannon\t - Extremis\nChuck Logan\t - Absolute Zero\nChuck Logan\t - After the Rain\nClive Cussler\t - Atlantis Found\nCormac McCarthy\t - Blood meridian, or, The evening redness in the West\nCormac McCarthy\t - The road\nDalton Trumbo\t - Johnny Got His Gun\nDaniel Quinn\t - Ishmael\nDave Eggers\t - How We Are Hungry\nDave Eggers\t - You Shall Know Our Velocity\nDavid Anthony Durham\t - Acacia: Book One: The War with the Mein\nDavid Lindsey\t - The Face of the Assassin\nDavid Lindsey\t - The Rules of Silence\nDavid Rosen\t - I Just Want My Pants Back\nDavid Stephen Mitchell\t - Cloud Atlas: A Novel\nDavid Wong\t - John Dies at the End\nDawn French\t - A Tiny Bit Marvellous\nDayton Ward\t - Star Trek: Typhon Pact: Paths of Disharmony\nDean Koontz\t - By the light of the moon\nDean Koontz\t - Darkness Under the Sun (Novella): A Tale of Suspense\nDean Koontz\t - False Memory\nDean Koontz\t - Phantoms\nDean Koontz\t - The Darkest Evening of the Year\nDean Koontz\t - The eyes of darkness\nDean Koontz\t - The Key to Midnight\nDean Koontz\t - The Taking\nDean Koontz\t - Tick Tock\nDean R. Koontz\t - The Face of Fear\nDeborah Cadbury\t - Chocolate Wars: The 150-Year Rivalry Between the World's Greatest Chocolate Makers\nDeborah Chester\t - Realm of Light\nDeborah Chester\t - Reign of Shadows\nDeborah Chester\t - Shadow War\nDeborah Digges\t - The Stardust Lounge: Stories from a Boy's Adolescence\nDerek Lin\t - Tao te ching: annotated &amp; explained\nDiana Gabaldon\t - Outlander\nDiane Chamberlain\t - The Shadow Wife\nDonald Harstad\t - Code 61\nDonald Harstad\t - Known Dead: A Novel\nDonald Harstad\t - The Big Thaw\nDonita K. Paul\t - Dragonspell\nDouglas Adams\t - Life, the Universe and Everything\nDouglas Adams\t - So Long, and Thanks for All the Fish\nDouglas Adams\t - The Restaurant at the end of the universe\nDouglas Clegg\t - Afterlife\nDuane Dog Chapman\t - Where Mercy Is Shown, Mercy Is Given\nE. B. Sledge\t - With the Old Breed: At Peleliu and Okinawa\nEarl Emerson\t - Into the Inferno\nEarl Emerson\t - Primal Threat\nEarl Emerson\t - Vertical Burn\nEarlene Fowler\t - Goose in the Pond\nEdwin A. Abbott\t - Flatland (missing illustrations)\nEileen Cook\t - The Education of Hailey Kendrick\nElizabeth McCracken\t - An exact replica of a figment of my imagination: a memoir\nElizabeth Strout\t - Olive Kitteridge\nEric Flint\t - 1636: The Saxon Uprising\nEric Lamet\t - A Child Al Confino: The True Story of a Jewish Boy and His Mother in Mussolini's Italy\nEric Nylund\t - Halo: Evolutions - Essential Tales of the Halo Universe\nEric Nylund\t - Halo: The Fall of Reach\nEric S. Nylund\t - Halo: First Strike\nEric S. Nylund\t - Halo: Ghosts of Onyx\nErich Maria Remarque\t - All Quiet on the Western Front\nErnest Hemingway\t - For Whom the Bell Tolls\nEugenia Kim\t - The calligrapher's daughter: a novel\nFannie Flagg\t - Standing in the Rainbow\nFlannery O'Connor\t - Wise Blood\nFrancois Rabelais, Sir Thomas Urquhart, Peter Antony Motteux\t - Gargantua and Pantagruel\nFriedrich Wilhelm Nietzsche\t - Thus Spake Zarathustra\nFyodor Dostoyevsky, Andrew R. MacAndrew\t - The Brothers Karamazov\nFyodor Dostoyevsky, Richard Pevear\t - Notes From Underground\nFyodor Dostoyevsky, Richard Pevear, Larissa Volokhonsky\t - The Brothers Karamazov: A Novel in Four Parts With Epilogue\nGabriel Cousens, M.D.\t - Conscious Eating: Second Edition\nGabrielle Pina\t - Chasing Sophea: a novel\nGareth Hinds, William Shakespeare\t - King Lear\nGarth Nix\t - Across the Wall\nGary Phillips, Jervey Tervalon\t - The Cocaine Chronicles\nGary Taubes\t - Why We Get Fat: And What to Do About It\nGene Wolfe\t - The Shadow of the Torturer\nGeorge P. Pelecanos\t - Drama city: a novel\nGeorge P. Pelecanos\t - Shame the devil: a novel\nGeorge P. Pelecanos\t - The Turnaround\nGreg Bear\t - Halo: Cryptum\nGreg Egan\t - Schild's Ladder\nGregg Andrew Hurwitz\t - The Kill Clause\nGuy Adams\t - The World House\nGuy Gavriel Kay\t - Tigana\nHarlan Ellison (Ed)\t - Again, Dangerous Visions\nHaruki Murakami, J. Philip Gabriel\t - Kafka on the Shore\nHenry Petroski\t - The book on the bookshelf\nHermann Hesse\t - Steppenwolf\nHoward Marks\t - Senor Nice\nHoward Marks\t - The Howard Marks book of dope stories\nIain M. Banks\t - Against a Dark Background\nIain M. Banks\t - The Player of Games\nIan Kershaw\t - Hitler\nIan Morris\t - Why the West Rules--for Now: The Patterns of History, and What They Reveal About the Future\nIris Murdoch\t - The Bell\nIsaac Asimov\t - Forward the Foundation\nIsaac Asimov\t - Foundation\nIsaac Asimov\t - Foundation and Earth\nIsaac Asimov\t - Foundation and Empire\nIsaac Asimov\t - Foundation's Edge\nIsaac Asimov\t - Prelude to Foundation\nIsaac Asimov\t - Second Foundation\nJ. Gregory Keyes\t - The Born Queen\nJack Kerouac\t - The Dharma bums\nJacqueline Sheehan\t - Lost &amp; Found\nJames A. Owen\t - The Indigo King\nJames A. Owen\t - The Search for the Red Dragon\nJames A. Owen\t - The Shadow Dragons\nJames Patterson, Michael Ledwidge\t - Tick Tock\nJames R. Green\t - Death in the Haymarket: a story of Chicago, the first labor movement, and the bombing that divided gilded age America\nJames Swain\t - Deadman's Bluff\nJames Swain\t - Sucker bet\nJames Swain\t - The Night Monster: A Novel of Suspense\nJames Swain\t - The Night Stalker: A Novel of Suspense\nJames Tooley\t - The beautiful tree: a personal journey into how the world's poorest people are educating themselves\nJanet Evanovich\t - Motor Mouth\nJann Wenner, Joe Levy\t - The Rolling Stone interviews\nJean M. Auel\t - The Mammoth Hunters\nJean M. Auel\t - The Plains of Passage\nJean M. Auel\t - The shelters of stone\nJean M. Auel\t - The valley of horses: a novel\nJean Shepherd\t - In God we trust: all others pay cash\nJean-Christophe Valtat\t - Aurorarama\nJeffery Deaver\t - Hard news\nJeremy Robinson\t - The Last Hunter - Descent\nJerome David Salinger\t - The catcher in the rye\nJerzy Kosinski\t - The painted bird\nJo Nesbo\t - Nemesis\nJodi Lynn Copeland, Anya Bast, Lauren Dane, Kit Tunstall\t - What Happens in Vegas...After Dark: Hot for Revenge\\The Promise\\Sensual Magic\\Divine Desires\nJoe Abercrombie\t - The Heroes\nJoe Haldeman\t - A Separate War and Other Stories\nJoe Haldeman\t - Forever Free\nJoe Haldeman\t - The Forever War\nJohn Darwin\t - The Empire Project: The Rise and Fall of the British World-System, 1830-1970\nJohn Fisher\t - Tommy Cooper: Always Leave Them Laughing\nJohn Grisham\t - Skipping Christmas\nJohn Grisham\t - The Runaway Jury\nJohn Grisham\t - The Testament\nJohn Huxtable Elliott\t - Empires of the Atlantic world: Britain and Spain in America, 1492-1830\nJohn Lloyd, John Mitchinson\t - The Book of General Ignorance\nJohn Lloyd, John Mitchinson\t - The Second Book of General Ignorance: Everything You Think You Know Is Still Wrong\nJohn Lutz\t - In for the Kill\nJohn Lutz\t - Mister X\nJohn Lutz\t - Other Than Murder\nJohn Scalzi\t - Old Man's War\nJohn Szwed\t - Alan Lomax\nJohn Updike\t - My Father's Tears: And Other Stories\nJohn Varley\t - Wizard\nJohn Wyndham\t - The Chrysalids\nJohn Wyndham\t - The Day of the Triffids\nJonathan Lethem\t - The Fortress of Solitude\nJonathan Littell\t - The Kindly Ones: A Novel\nJorge Luis Borges\t - Labyrinths\nJosÃƒÆ’Ã‚Â© Saramago\t - Blindness\nJoseph Staten\t - Halo: Contact Harvest\nJostein Gaarder\t - Sophie's World: A Novel About the History of Philosophy\nJoyce Appleby, Joyce Oldham Appleby\t - The relentless revolution: a history of capitalism\nJulie Kagawa\t - The Iron Queen\nKarl Marx, Friedrich Engels\t - The Communist Manifesto\nKate Gosselin\t - I Just Want You to Know: Letters to My Kids on Love, Faith, and Family\nKazuo Ishiguro\t - Never Let Me Go\nKen Kesey\t - One Flew Over the Cuckoo's Nest\nKevin J. Anderson\t - A Forest of Stars\nKevin J. Anderson\t - Hidden Empire\nKevin J. Anderson\t - Horizon Storms\nKevin J. Anderson\t - Metal Swarm\nKevin J. Anderson\t - Of Fire and Night\nKevin J. Anderson\t - Scattered Suns\nKevin J. Anderson\t - The Ashes of Worlds\nKim Edwards\t - The memory keeper's daughter\nKim Stanley Robinson\t - Fifty Degrees Below\nKim Stanley Robinson\t - Forty signs of rain\nKim Stanley Robinson\t - Sixty days and counting\nKitty Kelley\t - His way: the unauthorized biography of Frank Sinatra\nKitty Kelley\t - The royals\nKjell Eriksson\t - The Cruel Stars of the Night\nKjell Eriksson\t - The Demon of Dakar\nKjell Eriksson, Ebba Segerberg\t - The Princess of Burundi\nLani Woodland\t - Intrinsical\nLarry Niven, Jerry Pournelle\t - The mote in God's eye\nLaura Lippman\t - The Girl in the Green Raincoat: A Novel\nLaurell K. Hamilton\t - Swallowing Darkness\nLauren Dane\t - Inside Out\nLauren Dane\t - Laid Bare\nLauren Kate\t - Fallen\nLaurence C. Smith\t - The World in 2050: Four Forces Shaping Civilization's Northern Future\nLavie Tidhar\t - The Bookman\nLawrence Block\t - After the First Death\nLawrence Goldstone, Nancy Bazelon Goldstone\t - The friar and the cipher: Roger Bacon and the unsolved mystery of the most unusual manuscript in the world\nLee Doty\t - Out of the Black\nLee Sandlin\t - Wicked River: The Mississippi When It Last Ran Wild\nLionel Shriver\t - We Need to Talk about Kevin\nLisa Zunshine\t - Why we read fiction: theory of mind and the novel\nLish McBride\t - Hold Me Closer, Necromancer\nLois Greiman\t - Not One Clue: A Mystery\nLori Armstrong\t - Mercy Kill: A Mystery\nLouisa Edwards\t - Can't Stand the Heat\nLouisa Edwards\t - On the Steamy Side\nLynda Barry\t - Cruddy\nMadeleine Albright, Madeleine Korbel Albright\t - Read My Pins: Stories from a Diplomat's Jewel Box\nMalcolm Gladwell\t - Blink: The Power of Thinking Without Thinking\nMargaret Atwood\t - Oryx and Crake: A Novel\nMargaret Atwood, Valerie Martin\t - The Handmaid's Tale\nMargaret C. Wang, Herbert J. Walberg\t - School choice or best systems: what improves education?\nMargaret George\t - The Autobiography of Henry VIII: With Notes by His Fool, Will Somers\nMarianne Delacourt\t - Sharp Turn\nMarina Fiorato\t - The Glassblower of Murano\nMark Charan Newton\t - City of Ruin\nMark Charan Newton\t - Nights of Villjamur\nMark Gimenez\t - The Color of Law: A Novel\nMark Haddon\t - The Curious Incident of the Dog in the Night-Time\nMarlo Thomas\t - Growing Up Laughing: My Story and the Story of Funny\nMarquis De Sade\t - The 120 Days of Sodom\nMartin Amis\t - Money: A Suicide Note\nMary McGarry Morris\t - A Hole in the Universe\nMary McGarry Morris\t - The last secret: a novel\nMatthew Reilly\t - Hell Island\nMegan Hart, Lauren Dane\t - No Reservations\nMichael Blastland; Andrew Dilnot\t - The Numbers Game\nMichael Caine\t - The Elephant to Hollywood\nMichael Cordy\t - The Source\nMichael J. Braddick\t - God's fury, England's fire: a new history of the English Civil Wars\nMichael R. Phillips\t - A Day to Pick Your Own Cotton\nMichael Sims\t - The Penguin Book of Victorian Women in Crime: Forgotten Cops and Private Eyes from the Time of Sherlock Holmes\nMiguel De Cervantes Saavedra, Edith Grossman, Harold Bloom\t - Don Quixote\nMihaly Csikszentmihalyi\t - Good business: leadership, flow, and the making of meaning\nMike Brown\t - How I Killed Pluto and Why It Had It Coming\nMobileReference, mobi\t - Holy Bible - The Illustrated King James Bible (KJV): The Old Testament, The New Testament, and Deuterocanonical literature\nMustafa Ziyalan, Amy Spangler\t - Istanbul Noir\nMyron Uhlberg\t - Hands of my father: a hearing boy, his deaf parents, and the language of love\nNaomi Klein\t - No Logo\nNeil Gaiman\t - Neverwhere: A Novel\nNeil Gaiman, Dave McKean\t - Coraline\nNeil Gaiman, Terry Pratchett\t - Good Omens: The Nice and Accurate Prophecies of Agnes Nutter, Witch\nNeil Russell\t - City of War\nNelson Mandela\t - The Long Walk to Freedom\nNicholas Sparks\t - The Choice\nNoam Chomsky\t - The Chomsky Reader\nNoel Riley Fitch\t - Appetite for Life: The Biography of Julia Child\nNora Roberts\t - Brazen virtue\nNorman Stone\t - The Atlantic and Its Enemies: A History of the Cold War\nNury Vittachi\t - The Feng Shui Detective's Casebook\nOrlando Figes\t - Natasha's dance: a cultural history of Russia\nPai Kit Fai\t - The Concubine's Daughter\nPatrick McGrath\t - Asylum\nPaul Roche\t - Aristophanes: The Complete Plays\nPerri O'Shaughnessy\t - Move to Strike\nPeter Guralnick\t - Dream boogie: the triumph of Sam Cooke\nPhilip Bobbitt\t - The shield of Achilles: war, peace, and the course of history\nPhilip K. Dick\t - A maze of death\nPhilip K. Dick\t - Flow my tears, the policeman said\nPhilip K. Dick\t - In Milton Lumky Territory\nPhilip K. Dick\t - Paycheck\nPhilip K. Dick\t - The Man in the High Castle\nPhilip K. Dick\t - The Three Stigmata of Palmer Eldritch\nPhilip K. Dick\t - The Zap Gun\nPhilip K. Dick\t - Ubik\nPiers Brendon\t - The decline and fall of the British Empire, 1781-1997\nR. A. Salvatore\t - The Chaos Curse\nR. D. Wingfield\t - A Killing Frost\nR. D. Wingfield\t - A Touch of Frost\nR. D. Wingfield\t - Frost At Christmas\nR. D. Wingfield\t - Hard Frost\nR. S. Downie\t - Ruso and the Root of All Evils\nR. Scott Bakker\t - The Darkness That Comes Before\nR. Scott Bakker\t - The Warrior Prophet\nR. T. Jordan\t - A Talent for Murder\nRay Kurzweil\t - The Singularity Is Near: When Humans Transcend Biology\nRaymond Chandler\t - The High Window\nRaymond Chandler\t - The lady in the lake\nRaymond Chandler\t - The simple art of murder\nRaymond Chandler\t - Trouble is my business\nRaymond Charles Barrett\t - Short Story Writing\nRebecca Dean\t - The Golden Prince\nRennie Airth\t - The Dead of Winter\nRichard Adams\t - Watership Down\nRichard Baker\t - Farthest Reach: The Last Mythal\nRichard Baker\t - Final Gate: The Last Mythal\nRichard Lee Byers\t - Unclean: The Haunted Lands\nRichard Lee Byers\t - Undead: The Haunted Lands\nRichard Lee Byers\t - Unholy: The Haunted Lands\nRichard North Patterson\t - Protect and Defend\nRita Cosby\t - Blonde Ambition: The Untold Story Behind Anna Nicole Smith's Death\nRobert A. Heinlein\t - Starship Troopers\nRobert A. Heinlein\t - Stranger in a Strange Land\nRobert A. Heinlein, Robert A.\t - The Moon Is a Harsh Mistress\nRobert Charles Wilson\t - Spin\nRobert Cormier\t - Fade\nRobert Crais\t - L.A. Requiem\nRobert K. Wilcox\t - Target\nRobert L. O'Connell\t - The Ghosts of Cannae: Hannibal and the Darkest Hour of the Roman Republic\nRobert Ludlum, Eric van Lustbader\t - The Bourne Sanction\nRobert Paul Weston\t - Dust City\nRoberto BolaÃƒÆ’Ã‚Â±o\t - 2666\nRobin Kaye\t - Yours for the Taking\nRobin Lane Fox\t - The Classical World\nRodney Crowell\t - Chinaberry Sidewalks\nRoger Rosenblatt\t - Unless It Moves the Human Heart: The Craft and Art of Writing\nRon Chernow\t - Titan: The Life of John D. Rockefeller, Sr\nRonald Reagan, Michael Reagan, James D. Denney\t - In the words of Ronald Reagan: the wit, wisdom, and eternal optimism of America's 40th president\nS. J. Rozan\t - Bronx Noir\nSam Harris\t - The Moral Landscape: How Science Can Determine Human Values\nSam Kashner, Nancy Schoenberger\t - Furious Love: Elizabeth Taylor, Richard Burton, and the Marriage of the Century\nSaul FriedlÃƒÆ’Ã‚Â¤nder\t - Nazi Germany and the Jews: The years of persecution, 1933-1939\nSaul FriedlÃƒÆ’Ã‚Â¤nder\t - The years of extermination: Nazi Germany and the Jews, 1939-1945\nSimon R. Green\t - Deathstalker destiny: being the fifth and last part of the life and times of Owen Deathstalker\nSimon R. Green\t - Deathstalker Legacy\nSimon R. Green\t - Deathstalker Return\nSinclair Lewis\t - Babbit\nStephen Donaldson\t - Lord Foul's bane\nStephen Hunt\t - Secrets of the Fire Sea\nStephen Hunt\t - The Rise of the Iron Moon\nStephen King\t - Needful things\nStephen King\t - The Running Man\nStephen King\t - Thinner\nStephen Puleo\t - Dark Tide: The Great Boston Molasses Flood of 1919\nStephen R. Donaldson\t - Chaos and Order: The Gap Into Madness\nStephen W. Frey\t - Shadow Account\nStephen W. Frey\t - The chairman: a novel\nStephen W. Frey\t - The ProtÃƒÆ’Ã‚Â©gÃƒÆ’Ã‚Â©\nSteve Hillard\t - Mirkwood: A Novel About J.R.R. Tolkien\nSteve Wozniak, Gina Smith\t - IWoz: computer geek to cult icon : how I invented the personal computer, co-founded Apple, and had fun doing it\nStuart Woods\t - L.A. Dead\nStuart Woods\t - Orchid Beach\nStuart Woods\t - Orchid Blues\nSue Townsend\t - The Growing Pains of Adrian Mole\nSusan Abulhawa\t - Mornings in Jenin\nSusan Richards\t - Lost and found in Russia: encounters in the deep heartland\nThaisa Frank\t - Heidegger's Glasses: A Novel\nThe Believer\t - You're a Horrible Person, But I Like You: The Believer Book of Advice\nThomas Bernhard, Jack Dawson, Mark M. Anderson\t - The Loser\nThomas H. Cook\t - Instruments of Night\nThomas Perry\t - Death Benefits: A Novel\nThomas Perry\t - Nightlife: A Novel\nThomas Pynchon\t - Gravity's Rainbow\nTim McLoughlin\t - Brooklyn Noir\nTim Waggoner\t - Forge of the Mind Slayers\nTim Waggoner\t - Sea of Death\nTim Waggoner\t - Sea of Death\nTim Waggoner\t - Thieves of Blood\nTimothy Snyder\t - Bloodlands: Europe Between Hitler and Stalin\nTobias S. Buckell\t - Halo: The Cole Protocol\nTom Rath\t - Strengths Finder 2.0\nToni Morrison\t - Beloved: a novel\nTony Hsieh\t - Delivering Happiness: A Path to Profits, Passion, and Purpose\nTyler Cowen\t - The Great Stagnation: How America Ate All The Low-Hanging Fruit of Modern History,Got Sick, and Will (Eventually) Feel Better\nUrsula K. Le Guin\t - The Dispossessed: A Novel\nVarious\t - Masters of Noir: Volume Four\nVarious\t - Masters of Noir: Volume One\nVarious\t - Masters of Noir: Volume Three\nVarious\t - Masters of Noir: Volume Two\nVirginia Woolf\t - To the lighthouse\nW.E.B. Griffin\t - Final justice\nWallace Earle Stegner\t - Beyond the hundredth meridian: John Wesley Powell and the second opening of the West\nWallace Earle Stegner\t - Beyond the hundredth meridian: John Wesley Powell and the second opening of the West\nWil Haygood\t - Sweet Thunder: The Life and Times of Sugar Ray Robinson\nWilliam C. Dietz\t - Halo: The Flood\nWilliam Irwin, Gregory Bassham\t - The Ultimate Harry Potter and Philosophy: Hogwarts for Muggles\nWilliam Luther Pierce\t - The Turner Diaries\nWilliam S. Burroughs\t - Naked Lunch: The Restored Text\nWilliam Shakespeare\t - William Shakespeare: The Complete Works 2nd Edition\nWinston Churchill\t - The Gathering Storm\nWinston Churchill\t - Their Finest Hour\nYiyun Li\t - Gold Boy, Emerald Girl\nYvonne Woon\t - Dead Beautiful\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:d68928c5825e4f29b689b40906a46a1a4495ce39","amp;dn":"Ebook+Library+-+3+++%28Epub+and+Mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d68928c5825e4f29b689b40906a46a1a4495ce39","infoHashBuffer":{"type":"Buffer","data":[214,137,40,197,130,94,79,41,182,137,180,9,6,164,106,26,68,149,206,57]},"announce":[],"urlList":[]}}