{"title":"Sexually Broken--Amber Rayne assfucked by 2 big dicks Matt Willi","uid":9235759,"size":1077285512,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d6a55ecfc32cb5924497fdc7215079cf256f200b&amp;dn=Sexually+Broken--Amber+Rayne+assfucked+by+2+big+dicks+Matt+Willi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"merzedes","files":-1,"time":1385172547,"description":"Amber Rayne assfucked by 2 big dicks while folded in half and restrained in strict metal bondage! | Amber Rayne | Matt Williams\n\nNovember 22, 2013\n\n\nMP4 only.\n\n\nAmber Rayne is a natural born pervert. If she wasn't doing porn she would still be flying her freak flag high, the fact she can get actually paid to do what she truly loves is just icing on the cake. In addition to being a crazed sex monkey, Amber is also unusually flexible. Today we are going to push that flexibility to its limits.\n\nIn a setup designed to teach Amber the true definition of Sexuallybroken, we start with her blindfolded and bolted down to the wooden stage, a vibrator drilled down between her legs. The wooden post behind her ensures she has zero wiggle room. As the vibrator sends waves of pleasure through her bound body, the cock train gets started on her mouth hole. No mercy, no respite, just brutal repeated pounding as the dicks reshape the back of her throat. Amber is a dick sucking champion though, and even with her neck cranked back she manages to deep throat balls deep. It is obviously time to up our game.\n\nMoving quickly, we unshackle her and move her over to a metal pipe frame. Then we simply jackknife her in half and shackle her back in place. Amber is reduced to wearing her knees as earmuffs and her ass is completely, helplessly exposed. We don't often do anal here on Sexuallybroken, but for a legendary anal whore like Amber, it would be a crime to pass up on that well-trained hole. 10 inches of massive black thunder walk right up and own her ass. The look on Amber's face can only be described as bliss.\n\nWe try, we really do, but it doesn't seem like it is possible to break a girl like Amber. Bent in half in one of the most uncomfortable positions possible while almost a foot of cock penetrates her colon and all Amber does is ask for more with a sex dazed grin dancing across her face. You win this round Amber, it is back to the drawing board for us. \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2013/11_22arayne5/SexuallyBroken-Amber-Rayne-Matt-Williams-Amber-Rayne-assfucked-by-2-big-dicks-while-folded-in-half-and-restrained-in-strict-metal-bondage.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2013/11_22arayne5/SexuallyBroken-Amber-Rayne-Matt-Williams-Amber-Rayne-assfucked-by-2-big-dicks-while-folded-in-half-and-restrained-in-strict-metal-bondage.php&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:d6a55ecfc32cb5924497fdc7215079cf256f200b","amp;dn":"Sexually+Broken--Amber+Rayne+assfucked+by+2+big+dicks+Matt+Willi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6a55ecfc32cb5924497fdc7215079cf256f200b","infoHashBuffer":{"type":"Buffer","data":[214,165,94,207,195,44,181,146,68,151,253,199,33,80,121,207,37,111,32,11]},"announce":[],"urlList":[]}}