{"title":"Entreatos (2004)","uid":4547366,"size":734334976,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d71052e34d298a08a85aa1ff0c63c0fdacc21e06&amp;dn=Entreatos+%282004%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"abdlixo","files":1,"time":1228179298,"description":"The movie was filmed during the presidential elections in 2002, both first and second turn. The movie was filmed in miniDV. The president appears in a way that he had never shows up before. He smokes his cigarillos and always has a beer in hand when he is not working.\n\nHe says he doesn&amp;#039;t like military forces, he tell bad things about his opponents and speaks a lot of bad words. Seeing this movie you realize that he is really an unique president, like no other in the history of Brazil, or many others countries. His friends and politic Allies are also showed in the picture with very much reality. \n\nOf course everybody saw the camera, but even though, they acted different than they would act on television cameras. In the campaign it is clear the importance of the marketeer. A person that can change the result of the elections, and change the future of the country. It takes to another discussion: should the people vote for the best politician or the best marketeer ?? Anyway, it is a raw look at the high politic campaign. And for bonus, it is very funny, because the president Lula is very funny.\n\nÃ‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§\nÃ‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§\n\nDe 25 de setembro a 27 de outubro de 2002 a equipe de filmagem acompanhou passo a passo a campanha de LuÃƒÂ­s InÃƒÂ¡cio Lula da Silva ÃƒÂ  presidÃƒÂªncia da RepÃƒÂºblica. O filme revela os bastidores de um momento histÃƒÂ³rico atravÃƒÂ©s de material exclusivo, como conversas privadas, reuniÃƒÂµes estratÃƒÂ©gicas, telefonemas, traslados, gravaÃƒÂ§ÃƒÂµes de pronunciamentos e programas eleitorais.\n\nRecebeu 2 indicaÃƒÂ§ÃƒÂµes ao Grande PrÃƒÂªmio Cinema Brasil, nas categorias de Melhor Diretor e Melhor DocumentÃƒÂ¡rio.\n\nO projeto de gravar dois documentÃƒÂ¡rios sobre a campanha presidencial de 2002 nasceu a partir de conversas entre a Videofilmes e a Rede Globo. O projeto inicial previa que JoÃƒÂ£o Moreira Salles acompanharia a campanha de Lula no 2Ã‚Âº turno e Eduardo Coutinho seguiria a campanha de seu adversÃƒÂ¡rio no mesmo perÃƒÂ­odo. Com a saÃƒÂ­da da Rede Globo, o projeto original foi alterado. \n\nA intenÃƒÂ§ÃƒÂ£o do diretor JoÃƒÂ£o Moreira Salles era apenas acompanhar a campanha de Lula no 2Ã‚Âº turno, mas como havia a possibilidade de que ele saÃƒÂ­sse vitorioso jÃƒÂ¡ no 1Ã‚Âº turno o inÃƒÂ­cio das filmagens foi antecipado.\n\nA autorizaÃƒÂ§ÃƒÂ£o para que a equipe de Entreatos filmasse os bastidores da campanha de Lula teve que ser negociada diariamente, mesmo com a autorizaÃƒÂ§ÃƒÂ£o prÃƒÂ©via do Partido dos Trabalhadores para que as filmagens fossem realizadas.\n\nA equipe de filmagens que acompanhou a campanha de Lula era composta de 7 pessoas. Foram gravadas ao todo 240 horas, atravÃƒÂ©s de cÃƒÂ¢meras digitais. O material filmado durante a campanha foi guardado em cofres e nÃƒÂ£o teve nenhuma divulgaÃƒÂ§ÃƒÂ£o atÃƒÂ© que Entreatos estivesse finalizado, em 2004.\n\nNa ediÃƒÂ§ÃƒÂ£o final os realizadores optaram por utilizar as cenas mais reservadas de Lula na campanha, testemunhadas em grande parte apenas pela equipe de filmagem.\n\nA cena em que Lula recebe a confirmaÃƒÂ§ÃƒÂ£o de que foi eleito Presidente do Brasil foi filmada por Mariana, filha do senador AloÃƒÂ­sio Mercadante. A equipe de filmagens de Entreatos nÃƒÂ£o recebeu autorizaÃƒÂ§ÃƒÂ£o para rodar naquele dia, logo o diretor JoÃƒÂ£o Moreira Salles pediu a Mariana, que estaria no local no momento, que fizesse a cÃƒÂ¢mera.\n\nAs filmagens chegaram ao fim em 28 de outubro de 2002, com o telefonema do presidente dos Estados Unidos George W. Bush a Lula, de dentro do aviÃƒÂ£o Air Force One. Esta cena nÃƒÂ£o foi incluÃƒÂ­da no filme, por decisÃƒÂ£o do diretor.\n\nÃ‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§\nÃ‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§Ã‚Â§\n\nRuntime: 117 min \nCountry: Brazil \nLanguage: Brazilian Portuguese","torrent":{"xt":"urn:btih:d71052e34d298a08a85aa1ff0c63c0fdacc21e06","amp;dn":"Entreatos+%282004%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d71052e34d298a08a85aa1ff0c63c0fdacc21e06","infoHashBuffer":{"type":"Buffer","data":[215,16,82,227,77,41,138,8,168,90,161,255,12,99,192,253,172,194,30,6]},"announce":[],"urlList":[]}}