{"title":"Candiria - The Process Of Self-Development [Hardcore/Rap/Jazz]","uid":4097851,"size":65852272,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d7594d8a02fcdd9ab4b4c7cc8ebeca6379b85bfa&amp;dn=Candiria+-+The+Process+Of+Self-Development+%5BHardcore%2FRap%2FJazz%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"benmarvin","files":13,"time":1206411866,"description":"1  \tThree Times Again\n2 \tOnefortyeight\n3 \tPull\n4 \tMethod of Expression\n5 \tTemple of Sickness\n6 \tMathematics\n7 \tWork in Progress\n8 \tMatter. Anti. Matter\n9 \tCleansing\n10 \tElevate in Madness\n11 \tDown to the Last Element\n12 \tThe Process of Self-Development\n13 \tLeaving the Atmosphere\n\nOn &quot;Process of Self-Development,&quot; as on their other albums, Candiria display an admirable disregard for what virtually every other band on the planet is doing. These guys clearly aren&amp;#039;t concerned with the restrictions of genre: they mix hardcore, metal, jazz, hip-hop, and ambient, often within one song. Candiria throw traditional song structures out the window as well; there&amp;#039;s nary a verse-chorus pattern to be found here. As for conventional time signatures, forget it. But if you&amp;#039;re looking for a band that&amp;#039;s not afraid to challenge the technical and stylistic boundaries of heavy music, then you&amp;#039;re in the right place.\n\nWhile &quot;Process of Self-Development&quot; does contain plenty of rampaging, furious hardcore, it&amp;#039;s far removed from hardcore stereotypes. Far from being simplistic and testosterone-laden, Candiria&amp;#039;s version of hardcore is intelligent, innovative, and unpredictable. Combining jazz precision and near-death-metal heaviness, they create some of the most jarring and irregular time signatures in all of heavy music. With Candiria, there&amp;#039;s always a surprise lurking just around the corner.\n\nFronting the madness is the one and only Carley Coma, whose vocal cords sound sort of like they&amp;#039;re composed of sandpaper. His throat-ripping screams are unintelligible and completely devoid of melody, but they&amp;#039;re more than effective as an extra instrument, augmenting the band&amp;#039;s already heavy assault. I don&amp;#039;t think this album contains Carley&amp;#039;s best vocals (that would be &quot;300 Percent Density&quot;), but there&amp;#039;s no denying his uniqueness. On guitars, John Lamacchia and Eric Matthews pile on one pummeling riff after another, and Kenneth Schalk is a brilliant and complex drummer.\n\nMy favorite song on the disc, &quot;Elevate In Madness,&quot; is a prime example of what makes Candiria such a great and unique band. The song starts with a minute and a half of the band&amp;#039;s signature hardcore sound. Then, where most bands might think about putting in a chorus, the song suddenly goes into a twenty-second jazz-fusion interlude before making an abrupt return to heaviness. Another choice cut, &quot;Work In Progress,&quot; has a brief hip-hop break inserted into the middle of six-plus minutes of hardcore fury. Normal bands don&amp;#039;t do things like this, but fortunately Candiria are way beyond normal.\n\nAnd there&amp;#039;s more. A lot more. Candiria devote entire songs to hip-hop (the extremely clever &quot;Method of Expression&quot;), Jazz (&quot;Matter.Anti.Matter&quot;) and ambient music (&quot;Onefourtyeight&quot;). And I won&amp;#039;t even attempt to describe the weirdness that is the last two tracks. Suffice to say this album is very, very, very eclectic.\n\nSo in conclusion, I say let the mainstreamers have their Creed, their Staind, their Linkin Park, their Nickelback, and their Puddle of Mudd. Candiria leaves &amp;#039;em all in the dust. I don&amp;#039;t think &quot;Process of Self-Development&quot; is their best album (check out &quot;300 Percent Density&quot;), and I can&amp;#039;t unreservedly recommend it to everyone, but there are a privileged few who will truly get it. ","torrent":{"xt":"urn:btih:d7594d8a02fcdd9ab4b4c7cc8ebeca6379b85bfa","amp;dn":"Candiria+-+The+Process+Of+Self-Development+%5BHardcore%2FRap%2FJazz%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7594d8a02fcdd9ab4b4c7cc8ebeca6379b85bfa","infoHashBuffer":{"type":"Buffer","data":[215,89,77,138,2,252,221,154,180,180,199,204,142,190,202,99,121,184,91,250]},"announce":[],"urlList":[]}}