{"title":"Timbaland feat. Nelly Furtado &amp; SoShy - Morning After Dark","uid":5265179,"size":166045700,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d792e2d56486dfd1ca512c9fb38ca111ddc40010&amp;dn=Timbaland+feat.+Nelly+Furtado+%26+SoShy+-+Morning+After+Dark&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1262825836,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 4000 Kb/s\nAudio: Linear PCM, 48000 Hz, Stereo, 1536 kbps\n\n\nThis video has no logo and is the edited version with Nelly Furtado.\n\n\n&quot;Morning After Dark&quot; is a song by American hip-hop record producer and rapper, Timbaland taken from his third studio album, Timbaland Presents Shock Value II. The song features French singer SoShy and was released as the first single from the album on October 26, 2009.\n\nThe international version of the song features an additional rap verse from Canadian singer Nelly Furtado and it is this version which features on the album.\n\nThe music video was directed by Paul &quot;Coy&quot; Allen. The video uses the version of the song that features only SoShy due to the fact that Nelly's verse was recorded after Timbaland and SoShy filmed the music video. On November 16, 2009 Rap Up released a 50-second preview/teaser of what the video will entail. The video premiered exclusively on Timbaland's official website on November 22 2009. The video is a estimated 7 minutes in length, longer than the song itself, featuring a story plot based on a girl on her way to a party who has mysterious encounters with vampires similar to the film Twilight who in the beginning gets a call from her friend about a party. The girl, while walking her way to the club, gets followed by a mysterious black cat along with Timbaland following her in the background from afar singing his verses. While the girl is walking a mysterious man shows up, but disappears shortly after. When the girl gets on a bus SoShy appears singing her verses of the song. While there, the girl encounters another mysterious man. The girl, when arriving at the party, meets yet another mysterious man but unlike the other two, she seems to know this one, and after a frightening experience at the club the girl runs out. The man comes to comfort her and asks her to tell him what she saw, to which she replies &quot;I think I saw a vampire&quot;. This scene is very similar to the iconic scene in Twilight upon which the video is based. Then next scene involves Timbaland and SoShy along with a group of people confronting the mysterious man and his posse stating he still hasn't learned his lesson. The man and his posse then flee while the girl is still very confused. At that moment she looks at a shimmering scar on her hand which resembles a crescent. The video ends with various cut scenes of Timbaland and SoShy singing their verses in dark alleys which are shown throughout the video. The last scene includes the girl waking up in her room meaning it was all just a dream sequence and, while talking to her mom on the phone, the cat from the beginning of the video appears next to her.\n\nOn November 27, 2009, an edited version of the video was released for the version of the song that features Nelly Furtado. Nelly is featured in the video, appearing in a kitchen with a black cat while singing her verse.\n\nShock Value II is the third solo studio album, from American record producer Timbaland serving as the second volume of the platinum-selling Shock Value which topped charts worldwide and received 16 platinum certifications.\n\nInitially slated for a 2008 release the project was pushed into 2009 and tentatively confirmed for November 23, 2009 through Blackground Records, however, it was pushed back once more and finally released on December 7, 2009 in the UK and December 8 in the US.\n\n\nMy Videos: &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:d792e2d56486dfd1ca512c9fb38ca111ddc40010","amp;dn":"Timbaland+feat.+Nelly+Furtado+%26+SoShy+-+Morning+After+Dark","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d792e2d56486dfd1ca512c9fb38ca111ddc40010","infoHashBuffer":{"type":"Buffer","data":[215,146,226,213,100,134,223,209,202,81,44,159,179,140,161,17,221,196,0,16]},"announce":[],"urlList":[]}}