{"title":"Ancient Secrets of the Kama Sutra (1998) - anal, Stephanie Swift","uid":4822815,"size":698596709,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:d7f2bfd47d6d55ea13960475c49c7ae26e857d6e&amp;dn=Ancient+Secrets+of+the+Kama+Sutra+%281998%29+-+anal%2C+Stephanie+Swift&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"pure_screens","files":7,"time":1238833912,"description":"Ancient Secrets of the Kama Sutra\n\n\n\n\n\nscreens (+ DVD-covers):\n &lt;a href=&quot;\nhttp://x4x.blogbugs.org/8277517/Ancient-Secrets-of-the-Kama-Sutra---screens.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://x4x.blogbugs.org/8277517/Ancient-Secrets-of-the-Kama-Sutra---screens.html&lt;/a&gt;\n\n\n\n\n\n\nJulie and Steve are one happily married couple. In other words, the dinner banter is more sparkling than the pillow talk. Along comes a provacative book in an interesting little shop, and as fast as you can say Kama Sutra, their existence is magically transformed into a passionate melange of fantasy and flesh. Turn the page on everything you know. A new chapter is written.\n\n\n\nActresses\n\n    * Alex Dane                 [Anal]\n    * Dyanna Lauren             [Facial]\n    * Felecia                   [LezOnly]\n    * Holly Body                [Facial]\n    * Jeanna Fine\n    * Juliette Carelton         [Facial]\n    * Leanna Heart\n    * Papillon\n    * Stephanie Swift           [Facial]\n    * Tatiana                   [Anal Facial DP]\n    * Veronica Hart             [NonSex]\n \n   \nScene Breakdowns\n\n    * Scene 1. 2 guys, Tatiana\n    * Scene 2. Holly Body, Juliette Carelton, TT Boy\n    * Scene 3. brun, Dyanna Lauren, Felecia\n    * Scene 4. Dyanna Lauren, others, Papillon, Tatiana\n    * Scene 5. Alex Dane, Mickey, SDrake, Stephanie Swift\n    * Scene 6. Dyanna Lauren, Vince Vouyer\n\n\nStudio:      Vivid\nDirector:    Brad Armstrong\nReleased:    1998\nFormat:      Xvid\nResolution:  624 x 416\nDuration:    01:09:36\n\n\n1400+ torrents (ALWAYS with honest screens &amp; detailed info):\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/pure_screens&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pure_screens&lt;/a&gt;\n\n\n\n\nREVIEW:\n\nIt seems that Dyanna Lauren and Vince Vouyer need something to spice up\ntheir lovemaking, which brings them to a bookstore where a magic book\ngiven to them them by Veronica Hart (still looking spectacular for her\nage) whisks them into the world of Kama Sutra where they can find the\nsexual freedom they search. (Actually, this seems to be more a Perfumed\nGarden kind of deal - the actual Kama Sutra is really rather dry\nreading.) Veronica guides the couple through a number of erotic\nencounters, first as viewers and then as participants. This kind of\nthing has been done before, but as a hook to hang picturesque sex scenes\non, it does its job. \n\nIn the first scene we see Princess Kali (Tatiana, a natural-breasted \nbrunette) riding an elephant to meet two guards (one is TT Boy) armed \nwith fake-looking scimitars. Soon they brandish their more convincing \nflesh swords as the princess practices &quot;samahita samboca&quot;, the art of \ntaking two or more male lovers. (As Veronica helpfully informs us in \nvoiceover.) The scene ends with a condomless DP and a facial, and is \ngenerally well shot and whets our appetite for more of the same.\n\nHaving witnessed this, the travelers enter the palace of Prince Guthala, \nwhere the master of the house (Jon Dough) is being entertained by two \ndancers (Holly Body and Leanna Heart, I think).  The dance performance\nturns into a fairly nice threeway. I like especially the deep kisses \nshared between the girls. They are rewarded for their efforts with equal \nhelpings of the prince's cum on their faces. Still pretty entertaining, \nand the sight of Leanna's bare feet gets a bonus point or two. \n\nThe prince invites our tourists to a dinner which turns into an orgy\ninvolving six people. Initially Jon is paired with Dyanna, Vince with\nTatiana and Peter North with Papillon, but variations develop, as one\nwould expect. On the Excalibur Films website Papillon is described as an\nAfrican-American or black actress, although her skin is actually lighter\nthan Peter's. In any case I like her looks a lot; I haven't seen her\nbefore. She has a stud in her tongue - after this scene Peter and Vince\nmight be able to testify whether it really helps with fellatio. Jon\nfucks Dyanna doggie style wearing a condom, which he peels off for a\ncumshot on her ass and pussy, while Vince gives her a facial. Tatiana\nand Papillon get a hosing from Peter. Generally I find orgy scenes\ndistracting, the view keeps jumping around, and here the action is\nspread on both sides of a long table which tends to block the view. And\nPapillon does not get enough exposure. However, the track record is\npretty good so far. On to the next...\n\nAfter the orgy our couple retires to their quarters. After Dyanna takes\na low-tech shower they begin to read the book together. They read a\nstory about a snake charmer (Jake Steed?) who wants to get in touch with\nhis dead wife, who was killed by a snake. The wife's spirit is played by\nJeanna Fine in a Medusa-like getup (snakes for hair). No sex in this\nvery brief scene. \n\nIn the next story two princesses (Stephanie Swift and Alex Dane, I\nthink; both nice and natural girls) are travelling by camel to Bombay to\nmeet their future husbands. They are escorted by two guards (one is\nMickey G, whom I last saw wearing a VR helmet in PsychoSexuals). Camping\nat night by a fire, the guards soon seduce the girls, while the camels\nlook on dispassionately. The girls take to cocksucking surprisingly well\nfor supposed virgins. Before long, Alex is on her back, impaled by\nMickey while Steph takes the other man doggy style, and then they switch\npartners and positions. Alex is treated to a vigorous butt-pounding,\nwhich she apparently enjoys, frigging herself at the same time. Her\npartner's sticky load splashes on her ass and pussy. Steph gets a facial\nfrom Mickey. [Condoms were used with Steph.] \n\nDyanna and Vince decide to practice what they have learned. Completely\nnaked, she sucks him for quite a while, and then leans on a bedpost to\nbe on the receiving end of oral pleasure. The scene devvelops into a\nfairly vigorous pussy-pounding session after which Vince splatters\nDyanna's &quot;holiest of holies&quot; with his ointment.  Fade to...\n\nBack in the bookstore, the couple is kissing passionately, eager to\nhurry back home and have some more sex. Veronica looks after them and\nsmiles. \n\nTechnically the main feature is pretty much as good as it gets.\nAlongside with PsychoSexuals from NuTech, this has the best picture I\nhave yet seen in an adult DVD, and the sound is excellent as well. The\nethnic-style music is just right for this flick and it never clashes\nwith the scenes: we get to hear the jingling of the girls' jewelry as\nthey move, as well as their gasps and moans. The extras are a mixed bag.\nMost of them I could live without. (For instance the Cybersex ad is\nextremely stupid.) In my PC-based setup the much-touted multiple angles\nwere mostly a needless hassle. There are short (about half a minute)\nsegments in each sex scene which you can view from four different\nangles, but almost always the default one is good enough, and the\ntransitions from these segments cause a slight hiccup in the playing. \n\nMy copy of the DVD also freezes in chapter 17, at 00:33:11. It is\npossible to skip to the next chapter tp resume playing. A minor\nannoyance.\n\nWith its earnest and wholesome attitude towards sex, this DVD is\nprobably best suited for couples who are not into the seamier side of\nsmut. It delivers just about everything we've come to expect from a\nstraight porn, in a consensual atmosphere and beautiful settings. A\nhardened raincoater might find it too tame and nice, lacking in the more\noutrageous acts and extreme closeups. (With such pretty sets and\ncostumes, concentrating on split beaver shots would be a bit of a\nwaste.) I would have liked a little more dialog (there is almost none\nexcept for the voiceovers which get just a little bit annoying) and a\nsense of humor. You can't have everything.\n\nFinal note: Obviously Vivid have opted for low compression encoding,\nwhich in the case of this flick results in good quality. Along with the\nmany extras this explains why their DVD feature films are cut down to a\nlittle over an hour length. There simply isn't any room for more footage\non a single layered DVD. I guess it would cost too much to go for double\nsided or dual layered DVD's, because none of the adult studios seem to\nhave done it. (Except for Private's Pyramid series.) They could make\nroom by losing some of the extras, but maybe most of the consumers will\nnever miss the cut scenes. Too bad...\n\n\n\n\n\n.","torrent":{"xt":"urn:btih:d7f2bfd47d6d55ea13960475c49c7ae26e857d6e","amp;dn":"Ancient+Secrets+of+the+Kama+Sutra+%281998%29+-+anal%2C+Stephanie+Swift","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7f2bfd47d6d55ea13960475c49c7ae26e857d6e","infoHashBuffer":{"type":"Buffer","data":[215,242,191,212,125,109,85,234,19,150,4,117,196,156,122,226,110,133,125,110]},"announce":[],"urlList":[]}}