{"title":"Beethoven Sonatas Friedrich Gulda","uid":10429471,"size":2123857436,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:d81c947d5c9d81fa21f5218417c285a0932bba40&amp;dn=Beethoven+Sonatas+Friedrich+Gulda&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"magneez","files":125,"time":1403788036,"description":"FLAC+CUE+scans\n\n\nrandom amazon review:\n\nGulda's Beethoven cycle is the best I've ever heard, aside from Schnabel's. And in some ways, it is even better. First, Gulda's technique is better than any I have ever heard, sailing through the most difficult passages with audible ease. Of course such facility would be meaningless, if not in the service of the music, which is the second point. Gulda is totally unselfconscious, so that I do not hear his &quot;interpretation,&quot; but only the meaning of the music. Everything is there: dynamic control second to none, fantastic range of color and touch, perfectly judged tempi, and superbly intelligent phrasing. The result is that the counterpoint is clarified as never before, and also the long-term structural thrust of each movement and of the whole sonata. Third, the sound is (to me) excellent--utterly clear and present without annoying reverberation, &quot;bite,&quot; or mushiness. Finally, the price is lower than any other set of comparable quality, and the whole set is nicely packaged in a box of nine cardboard sleeves.\n\nI am comparing Gulda's set to several others I have heard over the years (from memory--not a/b listening). The most recent is the Kovacevich, with which it has shares several features. Both use generally faster tempi, of course in the fast movements but markedly in the slower ones, including the adagios. If Romanticism in the slow movements is what you seek, neither Gulda nor Kovacevich will do: try Kuerti (slower than whom I have never heard). But Gulda is slightly faster even than Kovacevich. Goode, Roberts, and Frank, though very good in many respects, all seem clunky by comparison. Kempff, possessing great beauty of tone and color along with compelling authority, is too uniform in tempi and lacks &quot;fire.&quot; I have not heard Brendel in years, so I make no comments there. [...]","torrent":{"xt":"urn:btih:d81c947d5c9d81fa21f5218417c285a0932bba40","amp;dn":"Beethoven+Sonatas+Friedrich+Gulda","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d81c947d5c9d81fa21f5218417c285a0932bba40","infoHashBuffer":{"type":"Buffer","data":[216,28,148,125,92,157,129,250,33,245,33,132,23,194,133,160,147,43,186,64]},"announce":[],"urlList":[]}}