{"title":"Dr. Laura Schlessinger The Proper Care and Feeding of Husbands A","uid":3502884,"size":138221196,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d89bd9fd9fa5d266ef7189e6872dfaf1ee05f90a&amp;dn=Dr.+Laura+Schlessinger+The+Proper+Care+and+Feeding+of+Husbands+A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"fattygordon","files":32,"time":1152736808,"description":"The Proper Care &amp; Feeding of Husbands\n\nIn her latest book, Dr. Laura Schlessinger urgently reminds women that they have the power to control the quality of their lives with their men?this power is released when women practice THE PROPER CARE AND FEEDING OF HUSBANDS.\n\nIn talking to men and women about their relationships for over twenty-five years on radio, \\\\\\&quot;Dr. Laura\\\\\\&quot; has found that women no longer understand their own ability to create the relationships and family life that they truly desire. Years ago women were taught by their mothers that they needed to be wise and sensitive and \\\\\\&quot;work\\\\\\&quot; their men?they knew how to create and maintain a happy and well-functioning relationship using their so called \\\\\\&quot;feminine wiles\\\\\\&quot; in benevolent and mutually satisfying ways. Today, women have replaces these feminine wiles with disdain, hypersensitivity, criticism, bullying and nagging.\n\nDr. Laura explains that emotionally men are \\\\\\&quot;simple\\\\\\&quot; creatures and women only need provide such basic necessities as respect, gratitude, food, sex, and some space for \\\\\\&quot;guy time\\\\\\&quot; in order to achieve the happy home they truly desire.\n\nUsing transcripts from actual callers and letters from her audience (with which readers will definitely identify), Dr. Laura demonstrates how following her straightforward advice has helped their marriages. Dr. Laura reminds women that the greatest source of displeasure and stress in their lives is their abdication of their own femininity, sensuality, and sexuality by having turned themselves into virtual workhorses.\n\nIn THE PROPER CARE AND FEEDING OF HUSBANDS Dr. Laura shows America?s wives, step-by-step, how to wield their innate power as women to attain the intimacy, love, joy, sexual pleasure and the peaceful home they so desperately want.","torrent":{"xt":"urn:btih:d89bd9fd9fa5d266ef7189e6872dfaf1ee05f90a","amp;dn":"Dr.+Laura+Schlessinger+The+Proper+Care+and+Feeding+of+Husbands+A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d89bd9fd9fa5d266ef7189e6872dfaf1ee05f90a","infoHashBuffer":{"type":"Buffer","data":[216,155,217,253,159,165,210,102,239,113,137,230,135,45,250,241,238,5,249,10]},"announce":[],"urlList":[]}}