{"title":"The Architect's Apprentice by Elif Shafak","uid":11422751,"size":2155364,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d8da8f5e94a6ab48675cf3058a56e2a65bcce370&amp;dn=The+Architect%27s+Apprentice+by+Elif+Shafak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"zubabrase","files":-1,"time":1415634171,"description":"Elif Shafak is Turkey's most-read woman writer and an award-winning novelist. She writes in both English and Turkish. Her books have been translated into more than 40 languages.\n\nShafak blends Western and Eastern traditions of storytelling, bringing out the voices of women, minorities, subcultures, immigrants and global souls. Defying cliches and transcending boundaries her works draws on different cultures and cities, and reflects a strong interest in history, philosophy, culture, mysticism, Sufism and gender equality.\n\nShafak is also a political scientist and has taught at various universities in the USA, UK and Turkey. She has written for several international daily &amp; weekly \npublications, including The Guardian, The New York Times, The Independent and The World Post/Huffington post.\n\nAbout the novel\n\n'There were six of us: the master, the apprentices and the white elephant. We built everything together...'\n\nSixteenth century Istanbul: a stowaway arrives in the city bearing an extraordinary gift for the Sultan. The boy is utterly alone in a foreign land, with no worldly possessions to his name except Chota, a rare white elephant destined for the palace menagerie.\n\nSo begins an epic adventure that will see young Jahan rise from lowly origins to the highest ranks of the Sultan's court. Along the way he will meet deceitful courtiers and false friends, gypsies, animal tamers, and the beautiful, mischievous Princess Mihrimah. He will journey on Chota's back to the furthest corners of the Sultan's kingdom and back again. And one day he will catch the eye of the royal architect, Sinan, a chance encounter destined to change Jahan's fortunes forever.\n\nFilled with all the colour of the Ottoman Empire, when Istanbul was the teeming centre of civilisation, The Architect's Apprentice is a magical, sweeping tale of one boy and his elephant caught up in a world of wonder and danger.\n\n*************************\n\nRemarks\n\n1. To help people download some or all of the above titles, I would appreciate it if you could keep the torrent alive by seeding it for at least an hour after you have finished. Thanks for your co-operation.\n\n2. The above title are available in the following formats: azw3, epub and mobi. They are of retail quality","torrent":{"xt":"urn:btih:d8da8f5e94a6ab48675cf3058a56e2a65bcce370","amp;dn":"The+Architect%27s+Apprentice+by+Elif+Shafak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8da8f5e94a6ab48675cf3058a56e2a65bcce370","infoHashBuffer":{"type":"Buffer","data":[216,218,143,94,148,166,171,72,103,92,243,5,138,86,226,166,91,204,227,112]},"announce":[],"urlList":[]}}