{"title":"Capt. Beefheart - Ice Cream for Crow (1982) [FLAC]","uid":4721974,"size":242252563,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d8e86a49daf543ff8016a45984a79e0dc3d01194&amp;dn=Capt.+Beefheart+-+Ice+Cream+for+Crow+%281982%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"storoa","files":18,"time":1234560763,"description":"Review\tby Ned Raggett\n\nWith yet one final Magic Band lineup in place, featuring Richard Snyder on bass and Cliff Martinez on drums alongside returning vets Jeff Moris Tepper and Gary Lucas, Beefheart put the final touch on his recording career to date with Ice Cream for Crow. It's a last entertaining blast of wigginess from one of the few truly independent artists in late 20th century pop music, with humor, skill, and style all still intact (as even the song titles like &quot;Semi-Multicoloured Caucasian&quot; and &quot;Cardboard Cutout Sundown&quot; show). With the Magic Band turning out more choppy rhythms, unexpected guitar lines, and outrÃƒÂ© arrangements, Captain Beefheart lets everything run wild as always, with successful results. Sometimes he sounds less like the blues shouter of lore and more of a spoken word artist with an attitude, thus the stuttering flow of &quot;The Host the Ghost the Most Holy.&quot; &quot;Hey Garland, I Dig Your Tweed Coat&quot; is even more entertainingly outrageous, Beefheart's addictive if near impenetrable ramble about tobacco juice and straw hats and more backed by an insanely great arrangement. Magic Band members each get chances to shine one way or another -- &quot;Evening Bell&quot; in particular demonstrates why Lucas went on to later solo renown, a complex, suddenly shifting solo instrumental that sits somewhere between background music and head-scratching &quot;how did he do that?&quot; intrigue. ","torrent":{"xt":"urn:btih:d8e86a49daf543ff8016a45984a79e0dc3d01194","amp;dn":"Capt.+Beefheart+-+Ice+Cream+for+Crow+%281982%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8e86a49daf543ff8016a45984a79e0dc3d01194","infoHashBuffer":{"type":"Buffer","data":[216,232,106,73,218,245,67,255,128,22,164,89,132,167,158,13,195,208,17,148]},"announce":[],"urlList":[]}}