{"title":"ASME Press,.Air Engines","uid":4773937,"size":5441019,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d946ce2f062d872c895dd9393dc4cae85e925a04&amp;dn=ASME+Press%2C.Air+Engines&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"philmccrevice","files":1,"time":1237143019,"description":"I had spent the past several years informally studying Stirling engines, and this book vastly improved my understanding of the workings of this kind of engine in the course of a week. Stirling engines are known for their great efficiency, but the one historic difficulty preventing the widespread deployment of these engines is power density. (Stirling engines tend to be far larger than other less efficient engines of the same power output, so much so as to have been impractical for many applications. . . until now) The challenges to the development of a power dense Stirling engine are examined one at a time, and explained in both common terms, as well as formulas and equations, though admittedly, some of the text was rather hard to understand without a great deal of effort. This is understandable; this book is, after all, aimed at engineers. \n\nThe book comes in two parts: chapters 1-4 are by Theodor Finkelstein, and cover a pretty detailed history of air engines, including the Ericsson engine, and the Stirling engine and its variants, from their invention and early history through the beginnings of what Allan Organ calls the &quot;dark ages&quot;, a period of about 50 years when virtually no work was done on this kind of engine. Allan Organ authors the book from chapters 5 through the end, and covers the rebirth of the Stirling engine in the 1930's through the present. His approach is a lot more technical, and relies much more on equations and other technical explanations. \n\nIf you are a casual hobbyist, or simply investigating Stirling engines without a background in mechanical engineering, I still recommend this book. Do not let the equations intimidate you; get as much out of the rest of the book as you can. This book offers the collected understanding of many years of research into the cause and effect behind the operations of this class of engines, and if you are willing to work to understand it, you will find this book to be very helpful to your research   THIS IS A 500.00 DOLLAR BOOK...WOW","torrent":{"xt":"urn:btih:d946ce2f062d872c895dd9393dc4cae85e925a04","amp;dn":"ASME+Press%2C.Air+Engines","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d946ce2f062d872c895dd9393dc4cae85e925a04","infoHashBuffer":{"type":"Buffer","data":[217,70,206,47,6,45,135,44,137,93,217,57,61,196,202,232,94,146,90,4]},"announce":[],"urlList":[]}}