{"title":"Tom Duggett - Gothic Romanticism. Architecture, Politics, and Li","uid":10292784,"size":2905296,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d95989f9b6fbc5ccadbc56fc32a6b57691523cd8&amp;dn=Tom+Duggett+-+Gothic+Romanticism.+Architecture%2C+Politics%2C+and+Li&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1401882149,"description":"Description\nProduct Details\nBook Title: Gothic Romanticism: Architecture, Politics, and Literary Form (Nineteenth-Century Major Lives and Letters)\nBook Author: Tom Duggett (Author)\nSeries: Nineteenth-Century Major Lives and Letters\nHardcover: 232 pages\nPublisher: Palgrave Macmillan (May 25, 2010)\nLanguage: English\nISBN-10: 0230615325\nISBN-13: 978-0230615328\n\n===================================================================================\nBook Description\nRelease date: May 25, 2010 | ISBN-10: 0230615325 | ISBN-13: 978-0230615328 | Edition: 1\nGothic Romanticism, winner of the 2010 MLA Prize for Independent Scholars, is a study of the relationship between British Romanticism and the Gothic Revival. With accessible readings of a wide range of canonical and rare texts, and spanning the Romantic discourses of architecture, politics, and literary form, the book recovers the collaborative project of Wordsworth, Coleridge, and Southey for a purified 'Gothic' poetry and a 'second Gothic' culture.\n\n===================================================================================\nReviews\n***Winner of the 2010 MLA Prize for Independent Scholars Award!***\n\n&quot;Tom Duggett's Gothic Romanticism is a compellingly ambitious study of the pursuit of a purer and better gothic in late-eighteenth and early-nineteenth-century England. Focusing on Wordsworth and the Lake Poets' attempt to refine a coarser, more sensational gothic as set forth in the novels of Radcliffe and Scott and in antiquarian curiosities, Duggett weaves sustained analysis of their poetry with thoughtful commentary on medieval architectural imagery and history, the turn to conservative politics, and educational reform. This multileveled investigation demonstrates in engaging prose the centrality of a cultivated rhetoric of a gothic aesthetic in this period while provocatively suggesting its relevance to a post-9/11 era where architecture 'has assumed an importance that seemed without precedent.' Gothic Romanticism goes far in detailing such a poetic, cultural, and historical precedent.&quot; - MLA Prize for Independent Scholars Citation, Jan 2012\n\n&quot;A fine achievement.&quot; - The Wordsworth Circle\n\n&quot;A genuine contribution to the study of Wordsworth's career as well as to the intertwined cultural landscape of Britain in the late eighteenth and early nineteenth centuries.&quot; - Romanticism\n\n&quot;For scholars of the fantastic, Gothic Romanticism reads on a double register. Its depth of historical context makes this book a companion to English literatures of the fantastic that rehearse long-standing national narratives, creating their own continuities with the past.&quot; - Journal of the Fantastic in the Arts\n\n&quot;Duggett develops new ways of understanding Gothicism through an approach that is refreshingly historicist and culturally ambitious, and which encompasses the literary uses of architecture, national and international politics, and educational theory . . . strikingly original analysis is a significant recasting of William Wordsworth as the chief architect of emergent Gothic culture, as well as sophisticated new models of both Gothicism and Romanticism that promise to inspire further important work.&quot; - Nick Groom, Professor of English, University of Exeter, Cornwall Campus\n\n&quot;Duggett takes the reader deep into the Gothic edifices of Romanticism and charts the Lake Poets' involvement in the Gothic Revival and formation of a Gothicised British sensibility. His important study provides a crucial corrective to Gothic and Romantic studies, making this book essential reading.&quot; - Marie Mulvey-Roberts, University of the West of England\n\n&quot;Duggett achieves a subtle tracing of the complex and ambivalent trope of the Gothic as it appears, often in occluded form, in a number of Wordsworth's works. His handling of the political writing is exceptionally illuminating.&quot; - Tim Fulford, Professor of English, Nottingham Trent University\n\n===================================================================================\nAbout the Author\nTom Duggett is a lecturer in English Literature at Xi'an Jiaotong Liverpool University. He has previously taught at the University of St. Andrews and the University of Bristol, and has published articles in Romanticism, The Wordsworth Circle, and various other journals.\n===================================================================================","torrent":{"xt":"urn:btih:d95989f9b6fbc5ccadbc56fc32a6b57691523cd8","amp;dn":"Tom+Duggett+-+Gothic+Romanticism.+Architecture%2C+Politics%2C+and+Li","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d95989f9b6fbc5ccadbc56fc32a6b57691523cd8","infoHashBuffer":{"type":"Buffer","data":[217,89,137,249,182,251,197,204,173,188,86,252,50,166,181,118,145,82,60,216]},"announce":[],"urlList":[]}}