{"title":"Le Roy Ladurie. Montaillou, Village Occitan de 1294 a 1324","uid":5488702,"size":7868637,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d992eef5b87c154af403987e874dcfc1886780ea&amp;dn=Le+Roy+Ladurie.+Montaillou%2C+Village+Occitan+de+1294+a+1324&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"henry821","files":-1,"time":1270866837,"description":"Author: Le Roy Ladurie\nTitle: Montaillou, Village Occitan de 1294 a 1324\nLanguage: Russian (translation)\nSource: bit. ly/aIMeRT\n\nA fascinating history of a fourteenth-century village, Montaillou, in the mountainous region of southern France, almost destroyed by internal feuds and religious heterodoxy. Ladurie's portrait is based on a detailed register of Jacques Fournier, Bishop of Pamiers and future Pope Benedict XII, who conducted rigorous inquisition into heresy within his diocese. Fournier was a consummate inquisitor, an acute psychologist who was able to elicit from the accused the innermost secrets of their thoughts and actions. He was pitiless in the pursuit of error, and meticulous in recording that pursuit.\n\nLeRoy Ladurie analyzes the behavior, demography, social mentality, and cosmology of the community of peasants and shepherds, and vividly evokes the daily life of the village and mountain pastures. His portrait of Montaillou is dominated by the personal histories of two men: the curÃƒÂ© Pierre Clergue, a brutal and powerful man who placed his enemies in the hands of the inquisitor; and the shepherd Pierre Maury, a friend of the Albigensian perfecti and a fatalist who returned from Spain to disappear in the inquisitor's prison in his own country.\n","torrent":{"xt":"urn:btih:d992eef5b87c154af403987e874dcfc1886780ea","amp;dn":"Le+Roy+Ladurie.+Montaillou%2C+Village+Occitan+de+1294+a+1324","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d992eef5b87c154af403987e874dcfc1886780ea","infoHashBuffer":{"type":"Buffer","data":[217,146,238,245,184,124,21,74,244,3,152,126,135,77,207,193,136,103,128,234]},"announce":[],"urlList":[]}}