{"title":"The Fog Of War [DivX - Ita Mp3]","uid":5203766,"size":629378530,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d9b02344670d9402d739fed5caa9b2fc6bd6f185&amp;dn=The+Fog+Of+War+%5BDivX+-+Ita+Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Duracell72","files":1,"time":1260286558,"description":"The Fog Of War [DivX - Ita\n\nTitolo originale: The foga of war\nTitolo italino: La guerra secondo McNamara\nAnno: 2003 \nPaese: Usa\nRegia: Errol Morris\nSoggetto: Errol Morris\nSceneggiatura: Errol Morris \nGenere: Documentario inchiesta\nAudio: Italiano\n\nThe Fog of War: La guerra secondo Robert McNamara ÃƒÂ¨ un film del 2003 diretto da Errol Morris, presentato fuori concorso \n\nal 56Ã‚Â° Festival di Cannes e vincitore del Premio Oscar come miglior documentario\nErrol Morris organizza il materiale registrato in 30 ore di conversazione con Robert Strange McNamara, Segretario alla \n\nDifesa coi Presidenti John Fitzgerald Kennedy e Lyndon B. Johnson, in 11 lezioni, corredate di un'ingente mole di \n\nmateriale documentario visivo e sonoro - particolarmente interessanti le registrazioni delle conversazioni tra McNamara e \n\ni due Presidenti - il cui filo conduttore puÃƒÂ² essere individuato in una delle affermazioni iniziali: &quot; Se i popoli non dimostrano \n\nsaggezza, si scontreranno come talpe cieche e l'annientamento sarÃƒÂ  reciproco &quot;.\nCon luciditÃƒÂ , senza auto-indulgenza, a volte con accenti commossi (ad es. nel ricordare la morte del suo amico John \n\nKennedy), l' ex professore di Harvard, uno dei potenti della terra, parla degli avvenimenti bellici che lo videro protagonista.\nDenuncia la ferocia e la mancanza di proporzionalitÃƒÂ , rispetto al fine da raggiungere, degli atroci bombardamenti sul \n\nGiappone nel corso della Guerra nel Pacifico, in particolare quello su Tokyo, con 100.000 vittime in un'unica operazione, di \n\ncui egli fu uno dei responsabili, nella sua qualitÃƒÂ  di addetto all'Ufficio di controllo statistico dell'Aeronautica: &quot;Ci siamo \n\ncomportati da criminali di guerra&quot;.\nDescrive il proprio ruolo durante la Crisi di Cuba, traendone spunto per una riflessione (viene in mente Il dottor \n\nStranamore di Stanley Kubrick) su come il combinarsi della disposizione all'errore dell'essere umano, unita al controllo di \n\neccezionali potenzialitÃƒÂ  distruttive, il ricorso alle quali puÃƒÂ² essere deciso in 15 minuti da un'unica persona, rischiÃƒÂ² di \n\nportare uomini razionali come John Kennedy, Nikita Khrushchev e Fidel Castro sull'orlo dell'annientamento delle proprie \n\nnazioni.\nSvela i retroscena dei fatti del Golfo del Tonchino che, a partire da un siluramento mai avvenuto di due cacciatorpediniere \n\namericani, portarono alla definitiva escalation della Guerra del Vietnam e le inconciliabili divergenze con Johnson e gli alti \n\nquadri militari che portarono alle sue dimissioni.\nIl freddo calcolatore, l'&quot;uomo che ha una risposta a tutte le domande&quot;, come veniva definito, con sarcasmo, negli ambienti \n\npolitici e giornalistici, giunto ai 90 anni non puÃƒÂ² che registrare il fallimento del sogno wilsoniano di un mondo senza guerre \n\ne ripetere con Thomas Eliot: &quot;Non smetteremo di esplorare e alla fine della nostra esplorazione torneremo al punto di \n\npartenza e conosceremo quel luogo per la prima volta&quot;.\n\nDimensione: 600MB \nDurata: 01:39:29\nParte Video: 555MB\nParte Audio: 39,8MB\nVideo Codec: Dvix 5.0 \nVideo Bitrate: 780kb/s\nRisoluzione: 720x576 \nFPS (Frames/sec):25\nQF (Frame quality): 0,075b/p \nAudio Codec:Mp3 \nAudio Bitrate: 56kb/s\nFreq Audio: 24.000Hz","torrent":{"xt":"urn:btih:d9b02344670d9402d739fed5caa9b2fc6bd6f185","amp;dn":"The+Fog+Of+War+%5BDivX+-+Ita+Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9b02344670d9402d739fed5caa9b2fc6bd6f185","infoHashBuffer":{"type":"Buffer","data":[217,176,35,68,103,13,148,2,215,57,254,213,202,169,178,252,107,214,241,133]},"announce":[],"urlList":[]}}