{"title":"Virginia Cowles - The Phantom Major","uid":11782684,"size":379395226,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:da02482f4d64356e395eb90b91af8c64efaa68d1&amp;dn=Virginia+Cowles+-+The+Phantom+Major&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":20,"time":1427656230,"description":"PHANTOM MAJOR, THE: The Story of David Stirling and the SAS Regiment\n\nIn the dark and uncertain days of 1941 and 1942, when Rommel's Afrika Korps was sweeping towards Egypt and the Suez Canal, a small group of daring raiders made history for the Allies. They operated deep behind the German lines, driving hundreds of miles through the deserts of North Africa. They hid by day and struck by night, destroying aircraft, blowing up ammunition dumps, derailing trains and killing many times their own number.\nThe men were the Special Air Service, the SAS, the brainchild of David Stirling, a deceptively mild-mannered man with a brilliant idea. Under his command, small teams of resourceful, highly trained men penetrated beyond the front lines of the opposing armies and wreaked havoc where the Germans least expected it.\nVirginia Cowles's The Phantom Major is a classic account of these raids, an amazing tale of courage, impudence and daring, packed with action and high adventure. Her narrative, based on the eyewitness testimony of the men who took part, gives a fascinating insight into the early years of the SAS.\n\n\nAmazon reader review:\n\n&quot;Great great book!\nThis is one of my favorite books of all time. Knowing that these guys where real and did these things. Just amazing! I was a young soldier the first time I read this book. I really did learn a little about the craft of soldiering from this book. These guys where such great guys! At one point in time in the war these guys destroyed more axes aircraft then the RAF did during that same time. The way they did it you would never think would work. But it did over and over.&quot;","torrent":{"xt":"urn:btih:da02482f4d64356e395eb90b91af8c64efaa68d1","amp;dn":"Virginia+Cowles+-+The+Phantom+Major","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da02482f4d64356e395eb90b91af8c64efaa68d1","infoHashBuffer":{"type":"Buffer","data":[218,2,72,47,77,100,53,110,57,94,185,11,145,175,140,100,239,170,104,209]},"announce":[],"urlList":[]}}