{"title":"The Hooters - 1985 - Nervous Night","uid":8632090,"size":290259760,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dac2ceade8a3134e2f2f36aab2070af463f252c4&amp;dn=The+Hooters+-+1985+-+Nervous+Night&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":17,"time":1372654674,"description":"This is the same torrent that was uploaded to Demonoid in September 2011.\n\n\nThe Hooters - Nervous Night (1985)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51Q8EK1WS6L._SL500_AA300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51Q8EK1WS6L._SL500_AA300_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nDVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nAMG Bio.txt\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nFirst biography paragraph from All Music (by Jason Ankeny):\n\nBest remembered for a string of mid-'80s hits including the MTV staple &quot;And We Danced,&quot; Philadelphia rockers the Hooters were led by singer/keyboardist Rob Hyman and singer/guitarist Eric Bazilian, whose longtime creative partnership also yielded hits for artists including Cyndi Lauper and Joan Osborne. Hyman and Bazilian first teamed in the group Baby Grand, which also included future producer Rick Chertoff; after a pair of LPs for Arista, the band dissolved in 1978, with the Hooters forming soon after. Also including guitarist John Lilley, bassist Rob Miller, and drummer David Uosikkinen, the group honed an eclectic blend of rock, folk, and ska, taking their name from the melodica, or &quot;hooter,&quot; which lent their sound its distinctive edge; while the Hooters earned a devoted cult following at home in Philadelphia, Hyman and Bazilian also enjoyed busy careers as composers and session players, most notably contributing extensively to Cyndi Lauper's 1983 blockbuster She's So Unusual. The album was produced by Chertoff, who co-wrote the oft-covered ballad &quot;Time After Time&quot; with Hyman.\n\nRead all of the bio at: &lt;a href=&quot;\nhttp://www.allmusic.com/artist/the-hooters-p4510/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/artist/the-hooters-p4510/biography&lt;/a&gt;\n\nAll Music Album Review (by Kenyon Hopkin):\n\nOften overlooked, the Hooters' Nervous Night was a defining record not only for the band, but for 1985 itself. Filled to the brim with fun, danceable new wave-ish rock, the album is a wonderful representation of a lighthearted era. The peppy vocals of keyboardist Rob Hyman and guitarist Eric Bazilian give the band an assured, happy energy, while the sporadic use of the mandolin and melodica (a combination harmonica/keyboard) gives the group its distinctive sound. &quot;And We Danced&quot; and &quot;Day by Day&quot; became instant pop hits, but the remainder of Nervous Night is almost as strong. &quot;All You Zombies,&quot; which refers to stories in the Bible, is the band's most powerful moment; along with &quot;Where Do the Children Go,&quot; the track showed that the Hooters could be serious and dramatic as well as upbeat. Although the band wasn't able to maintain its momentum with subsequent records, Nervous Night remains a noteworthy contribution to mid-'80s rock and doesn't sound quite as dated as the work of some of the band's contemporaries.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/album/nervous-night-r9508&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/album/nervous-night-r9508&lt;/a&gt;\n\nAmazon.com's page: &lt;a href=&quot; http://www.amazon.com/dp/B000002636&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B000002636&lt;/a&gt;\n\nTrack List:\n\n01. And We Danced\n02. Day By Day\n03. All You Zombies\n04. Don't Take My Car Out Tonight\n05. Nervous Night\n06. Hanging On A Heartbeat\n07. Where Do The Children Go\n08. South Ferry Night\n09. She Come In Colors\n10. Blood From A Stone\n","torrent":{"xt":"urn:btih:dac2ceade8a3134e2f2f36aab2070af463f252c4","amp;dn":"The+Hooters+-+1985+-+Nervous+Night","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dac2ceade8a3134e2f2f36aab2070af463f252c4","infoHashBuffer":{"type":"Buffer","data":[218,194,206,173,232,163,19,78,47,47,54,170,178,7,10,244,99,242,82,196]},"announce":[],"urlList":[]}}