{"title":"[FSX] MegaScenery Earth New York 002","uid":8182073,"size":634576655,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:dae3ea76ba96c4c9517341188f71d1b91e9861b6&amp;dn=%5BFSX%5D+MegaScenery+Earth+New+York+002&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Ziggy2by2","files":-1,"time":1361643576,"description":"The entire state - BORDER to BORDER - of New York State in photoreal detail.\n\nNew York State is 54,556 square miles in size and has 442 airports. You'll see everything that you see in New York in real life in the scenery. This is a massive area.\n\nAs an added bonus, we now provide all the VFR and IFR charts in digital PDF format to enable you to get the most out of your scenery. This includes TACs and Sectionals, IFR enroute charts and 457 page book of Instrument Approach plates, Airport Diagrams, SIDs and STARs. The charts are downloadable along with your scenery files.\n\nSome of the cities and landmarks you'll get to enjoy as you explore New York State include:\n\nCities: New York, Albany (Capital), Buffalo, Rochester, Syracuse\n\nLakes: Ontario, Seneca, Cayuga, Oneida, Great Sacandaga, George, Chautauqua\n\nMountains: Adirondacks, Mt Marcy, (5,305 Feet), Algonquin Peak, Mount Haystack, Mount Skylight, Dix Mountain, Iroquois Peak, Boundary Peak and a total of 50 mountains above 4,000 feet.\n\nState Parks &amp; National Forests: Dozens of them!\n\nMajor Rivers: Niagara, Allegheny, Genesee, Oswego, St Lawrence, Black, Delaware, Mohawk, Hudson.\n\nSome Other Major Landmarks &amp; Highlights: Niagara Falls, Lake Placid, Finger Lakes, The Adirondacks.\n\nDiscover the rest of it all for yourself! There's a LOT to see!\n\n\nSimply place the files into your:\nC:Program Files (x86)Microsoft GamesMicrosoft Flight Simulator XAddon Scenery\n\nThen in FSX go to Settings, Scenery Library, Add Area and add each file individually.\n\nEnjoy. If you have any questions feel free to ask :)","torrent":{"xt":"urn:btih:dae3ea76ba96c4c9517341188f71d1b91e9861b6","amp;dn":"%5BFSX%5D+MegaScenery+Earth+New+York+002","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dae3ea76ba96c4c9517341188f71d1b91e9861b6","infoHashBuffer":{"type":"Buffer","data":[218,227,234,118,186,150,196,201,81,115,65,24,143,113,209,185,30,152,97,182]},"announce":[],"urlList":[]}}