{"title":"Lonely Planet - Discover Caribbean Islands (2014).epub Gooner","uid":14741025,"size":86331346,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:db2940c1500103f6bac2ac989678d565447f8036&amp;dn=Lonely+Planet+-+Discover+Caribbean+Islands+%282014%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1464665664,"description":"Lonely Planet - Discover Caribbean Islands (Travel Guide) - 1st Edition (2014).epub Gooner\r\n\r\nPublisher: Lonely Planet; 1 edition (14 Nov. 2014)\r\nLanguage: English\r\nISBN-10: 1743219032\r\nISBN-13: 978-1743219034\r\n\r\nLonely Planet: The world's leading travel guide publisher\r\n\r\nLonely Planet Discover Caribbean Islands is your passport to the most relevant, up-to-date advice on what to see and skip, and what hidden discoveries await you. Swim below the waters with darting fish, wander along the sand and stop at a lazy beach bar, or hike into emerald wilderness; all with your trusted travel companion. Get to the heart of the Caribbean Islands and begin your journey now!\r\n\r\nInside Lonely Planet's Discover Caribbean Islands:\r\n\r\n* Full-colour maps and images throughout\r\n\r\n* Highlights and itineraries help you tailor your trip to your personal needs and interests\r\n\r\n* Insider tips to save time and money and get around like a local, avoiding crowds and trouble spots\r\n\r\n* Essential info at your fingertips - hours of operation, phone numbers, websites, transit tips, prices\r\n\r\n* Honest reviews for all budgets - eating, sleeping, sight-seeing, going out, shopping, hidden gems that most guidebooks miss\r\n\r\n* Cultural insights give you a richer, more rewarding travel experience - background on slavery and piracy, wildlife, cuisine.\r\n\r\n* Over 30 colour maps\r\n\r\n* Covers Jamaica, Dominican Republic, Puerto Rico, US &amp; British Virgin Islands, Leeward Islands, French Antilles, Windward Islands and more\r\n\r\nThe Perfect Choice: Lonely Planet's Discover Caribbean Islands, our easy-to-use guide, filled with inspiring and colorful photos, focuses on the Caribbean Islands' most popular attractions for those looking for the best of the best.\r\n\r\n* Looking for a guide focused on only one or a few islands in this destination? Check out Lonely Planet's Jamaica, Puerto Rico &amp; Haiti and Dominican Republic guides for a comprehensive look at all these islands have to offer.\r\n\r\nAuthors: Written and researched by Lonely Planet, Jean-Bernard Carrillet, Paul Clammer, Michael Grosberg, Andrea Schulte-Peevers, Polly Thomas, Ryan Ver Berkmoes, Karla Zimmerman.\r\n\r\nAbout Lonely Planet: Since 1973, Lonely Planet has become the world's leading travel media company with guidebooks to every destination, an award-winning website, mobile and digital travel products, and a dedicated traveller community. Lonely Planet covers must-see spots but also enables curious travellers to get off beaten paths to understand more of the culture of the places in which they find themselves","torrent":{"xt":"urn:btih:db2940c1500103f6bac2ac989678d565447f8036","amp;dn":"Lonely+Planet+-+Discover+Caribbean+Islands+%282014%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db2940c1500103f6bac2ac989678d565447f8036","infoHashBuffer":{"type":"Buffer","data":[219,41,64,193,80,1,3,246,186,194,172,152,150,120,213,101,68,127,128,54]},"announce":[],"urlList":[]}}