{"title":"Art and Pornography - Philosophical Essays - PDF","uid":9759279,"size":1587998,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dbdd0bee7f997d40176ee18e86b5615a258fd3d8&amp;dn=Art+and+Pornography+-+Philosophical+Essays+-+PDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AtomTPB","files":1,"time":1394789890,"description":"Pages: 344 pages\nPublisher: Oxford University Press, USA (February 7, 2013)\nLanguage: English\nISBN-10: 0199609586\nISBN-13: 978-0199609581\nFormat: PDF\n\n\n\nArt and Pornography presents a series of essays which investigate the artistic status and aesthetic dimension of pornographic pictures, films, and literature, and explores the distinction, if there is any, between pornography and erotic art. Is there any overlap between art and pornography, or are the two mutually exclusive? If they are, why is that? If they are not, how might we characterize pornographic art or artistic pornography, and how might pornographic art be distinguished, if at all, from erotic art? Can there be aesthetic experience of pornography? What are some of the psychological, social, and political consequences of the creation and appreciation of erotic art or artistic pornography? Leading scholars from around the world address these questions, and more, and bring together different aesthetic perspectives and approaches to this widely consumed, increasingly visible, yet aesthetically underexplored cultural domain. The book, the first of its kind in philosophical aesthetics, will contribute to a more accurate and subtle understanding of the many representations that incorporate explicit sexual imagery and themes, in both high art and demotic culture, in Western and non-Western contexts. It is sure to stir debate, and healthy controversy.","torrent":{"xt":"urn:btih:dbdd0bee7f997d40176ee18e86b5615a258fd3d8","amp;dn":"Art+and+Pornography+-+Philosophical+Essays+-+PDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbdd0bee7f997d40176ee18e86b5615a258fd3d8","infoHashBuffer":{"type":"Buffer","data":[219,221,11,238,127,153,125,64,23,110,225,142,134,181,97,90,37,143,211,216]},"announce":[],"urlList":[]}}