{"title":"Middle Range Theory for Nursing, 3E Smith [PDF][StormRG]{HTD15}","uid":11784997,"size":9482329,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc279fc95bad3caa2d34932518a7a4e9fdff6daa&amp;dn=Middle+Range+Theory+for+Nursing%2C+3E+Smith+%5BPDF%5D%5BStormRG%5D%7BHTD15%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"0xmovva","files":3,"time":1427721528,"description":"TITLE/EDITION Middle Range Theory for Nursing: Third Edition\nBy: Mary Jane Smith PhD RN (Author), Patricia R. Liehr PhD RN (Author)\nPaperback: 488 pages\nPublisher: Springer Publishing Company; 3 edition (May 15, 2013)\nLanguage: English\nISBN-10: 0826195512\nISBN-13: 978-0826195517\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n\n\n\nAwarded first place in the 2013 AJN Book of the Year Awards in the Nursing Research category\n&quot;This is an outstanding edition of this book. It has great relevance for learning about, developing, and using middle range theories. It is very user friendly, yet scholarly.&quot; Score: 90, 4 Stars.--Doody's Medical Reviews\n\nMiddle range theory has become a vital staple of nursing education and application to research. These theories, which lie between the working hypotheses derived from day-to-day research and the larger, systemic efforts to develop unified theories, cover the scientific underpinnings that guide nursing practice and research.\n\nThis third edition of a two-time AJN Book of the Year Award winner contains two new theories, including self-reliance theory and transitions theory. It revises and updates all other content, and provides ladders of abstraction for each theory to guide students in their appropriate use. This highly accessible book integrates nursing theory with well-defined practice areas, identifies purpose and basic concepts, foundational literature, relationships among concepts, and use in practice. Chapters are organized by central theories, each of which is covered in depth. Comprehensive bibliographies at the end of each chapter facilitate more in-depth research. The book remains an essential text for theory and research courses in master's and doctoral nursing programs.\n\nNew to the Third Edition:\nPresents two new theories: self-reliance theory and transitions theory\nDeletes two theories no longer in use: community empowerment and family stress/adaptation\nUpdates and revises all other content from the second edition\nGuides students in appropriate use of theory per level of complexity","torrent":{"xt":"urn:btih:dc279fc95bad3caa2d34932518a7a4e9fdff6daa","amp;dn":"Middle+Range+Theory+for+Nursing%2C+3E+Smith+%5BPDF%5D%5BStormRG%5D%7BHTD15%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc279fc95bad3caa2d34932518a7a4e9fdff6daa","infoHashBuffer":{"type":"Buffer","data":[220,39,159,201,91,173,60,170,45,52,147,37,24,167,164,233,253,255,109,170]},"announce":[],"urlList":[]}}