{"title":"Flash MX Games: ActionScript for Artists","uid":6605627,"size":13830111,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dcf0dd244ba3e10ca276d5dbd39716bd04a4e6ca&amp;dn=Flash+MX+Games%3A+ActionScript+for+Artists&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_F1_","files":-1,"time":1313392165,"description":"Flash MX Games: ActionScript for Artists\nNik Lever (Author)\n\nPaperback: 438 pages\nPublisher: Focal Press; Book edition (December 25, 2002)\nLanguage: English\nISBN-10: 0240519035\nISBN-13: 978-0240519036\n\nLearn the professional skills you need to make the best use of Flash for creating interactive animation and producing exciting, dynamic Internet content. Nik Lever, writing as an artist for artists, takes you through the entire process from creating the art and animation for games in Flash, to adding the interactivity using Flash's ActionScripting language. He also provides valuable extra coverage of how Flash integrates with Director 8.5 Shockwave studio and C++.\n\nAs a designer using Flash you will see how you can apply your creative skills to the many stages of game production and produce your own interactive games with this versatile package. As an animator you will be able to add interactive functionality to your own animation and produce a game. As a web developer you will see how to make the best use of the sophisticated development environment Flash offers for the production of both artwork and code to create low bandwidth, animated web content that sells!\n\nThe free CD-Rom includes all the code and files you need to try out each tutorial from the book so you can see exactly how each game was created. Learn from the many different types of games provided as examples, from simple quizzes to platform-based games. High score tables and multi-player games using sockets, vital to higher level online games, are also covered in detail to ensure you have the complete skill set needed to succeed in this competitive arena. \n\n* Benefit from the experience of a successful games designer whose Flash sites regularly get 10,000+ hits per day\n* Explained by an artist for artists so you can easily see how Flash ActionScript can work for your own games development","torrent":{"xt":"urn:btih:dcf0dd244ba3e10ca276d5dbd39716bd04a4e6ca","amp;dn":"Flash+MX+Games%3A+ActionScript+for+Artists","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcf0dd244ba3e10ca276d5dbd39716bd04a4e6ca","infoHashBuffer":{"type":"Buffer","data":[220,240,221,36,75,163,225,12,162,118,213,219,211,151,22,189,4,164,230,202]},"announce":[],"urlList":[]}}