{"title":"Northern Soul ~ Instrumental Collection Best Of","uid":4280620,"size":107013706,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dd4be20340ee78d6acc14469a85d9b395006f662&amp;dn=Northern+Soul+%7E+Instrumental+Collection+Best+Of&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"imunionjack","files":40,"time":1215400052,"description":"Northern Soul ~ Instrumentals\nby unionjack \n\nNorthern soul is the term used in the United Kingdom for a type of mid-tempo and uptempo heavy-beat soul music (of mainly African American origin) that was popularized in Northern England from the mid 1960s onwards. The term also refers to the associated dance styles and fashions that emanated from the Twisted Wheel club in Manchester and spread to other dancehalls and nightclubs, such as the Golden Torch (in Stoke-upon-Trent), the Highland Rooms at the Blackpool Mecca and the Wigan Casino. Northern soul dancing was usually athletic, resembling the later dance styles of disco and break dancing. Featuring spins, flips, and backdrops, the northern soul dancing style was inspired by the stage performances of visiting American soul acts.\nI have been on the Northern Soul scene for many years as Promoter, Dj and total freak. And thought it was about time to ive a bit back from the scene that causes me to have so many sleepless nights.\nThis torrent was compliled so all the very best instrumentals could be on one compillation so the people who either are new to the music or just fans of it and cant find these rarities.\nThese instrumentals cover all types of Northern, floaters, shufflers and out n out stompers. These are mine and also borrowed from others ( Thanks alot guys ~ Keep the Faith !!!)\nAll that is left to say is enjoy the sounds and to please seed them ~ we need to keep these tracks alive.\n \nunionjack ( Soul ~ As Deep As You Like and Some )\n\t\t\t\t\t\t\t\t\t\t\t\t\t  \n","torrent":{"xt":"urn:btih:dd4be20340ee78d6acc14469a85d9b395006f662","amp;dn":"Northern+Soul+%7E+Instrumental+Collection+Best+Of","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd4be20340ee78d6acc14469a85d9b395006f662","infoHashBuffer":{"type":"Buffer","data":[221,75,226,3,64,238,120,214,172,193,68,105,168,93,155,57,80,6,246,98]},"announce":[],"urlList":[]}}