{"title":"The Searchers 3CD remastered Pye set 320k  (musicfromrizzo)","uid":6774056,"size":463532752,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dda628dcd1d011a1501e6a2a9ce3e96871f84e38&amp;dn=The+Searchers+3CD+remastered+Pye+set+320k++%28musicfromrizzo%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"musicfromrizzo","files":-1,"time":1319673530,"description":"The Searchers 3CD PYE Collection (remastered) 320k (musicfromrizzo) \nmp3 from FLAC\n\n\nThe Searchers sound much like the Beatles by the way, as they have  \nsimilar backgrounds in musical genre I suggest\n\nenjoy these oldies, a review from oldies.com where the product is offered\nfor sale follows below.\n\nMichael Rizzo Chessman\nmusicfromrizzo\n\noldies.com Comment Review of this CD set:\n\nThe Searchers: Mike Pender, John McNally (vocals, guitar); Tony Jackson\n(vocals, bass); Chris Curtis (vocals, drums).\n\nRecorded between 1963 &amp; 1982. Includes liner notes by David Wells.\n\nThis three-CD boxed set collects 75 tracks--including classics such as &quot;Needles\n&amp; Pins,&quot; &quot;Love Potion No. 9,&quot; and &quot;Don't Throw Your Love Away&quot;-- that the beloved \nBritish Invasion group the Searchers recorded for Pye Records from 1963 to 1982.\n\nIt used to be, with reissues of the Searchers' classic Pye Records sides, that the \nchallenge was getting them to sound good. Since 20-bit and 24-bit remastering have \nbecome the norm, however, the only challenge for Sanctuary Records (or the Sequel \nand Castle Records imprints) seems to be how inexpensive they can make the group's \nU.K. CDs, and also how many different reissues and compilations they can get out \non the group's Pye Records library of around 100 songs -- after all, this three-CD \nset is at least the second triple-decker career survey of the group put out by the \nlabel since the 1980s. And the Liverpool-based band is threatening to pass the Who \nin terms of the sheer number of reissues and compilations of their work, which is \namazing when you consider that the Searchers last charted a single about 38 years \npreviously -- to be sure, they've been adding many good and some great songs to \ntheir catalog in the decades since, but no hits as such. This set is nicely \ncomprehensive at 75 songs, limited as it is to finished masters and official \nreleases -- there are no vault finds here such as the Iron Door Sessions tracks or \nlive radio recordings, just singles, B-sides, EP tracks, and LP tracks covering \nfour years in their history, all sounding excellent and in stereo wherever they \nwere mastered that way.\n\n\nThe Searchers - (I'll Be) Missing You (remastered)\nThe Searchers - Ain't Gonna Kiss Ya (remastered)\nThe Searchers - Ain't That Just Like Me (remastered)\nThe Searchers - All My Sorrows (remastered)\nThe Searchers - Alright (remastered)\nThe Searchers - Be My Baby (remastered)\nThe Searchers - Bumble Bee (remastered)\nThe Searchers - Bye Bye Johnny (remastered)\nThe Searchers - Can't Help Forgiving You (remastered)\nThe Searchers - Cherry Stone (remastered)\nThe Searchers - Crazy Dreams (remastered)\nThe Searchers - Da Doo Ron Ron (remastered)\nThe Searchers - Does She Really Care For Me (remastered)\nThe Searchers - Don't Cha Know (remastered)\nThe Searchers - Don't Hide It Away (remastered)\nThe Searchers - Don't Throw Your Love Away (remastered)\nThe Searchers - Don't You Know Why (remastered)\nThe Searchers - Each Time (remastered)\nThe Searchers - Everybody Come Clap Your Hands (remastered)\nThe Searchers - Farmer John (remastered)\nThe Searchers - Four Strong Winds (remastered)\nThe Searchers - Goodbye My Love (remastered)\nThe Searchers - Have You Ever Loved Somebody (remastered)\nThe Searchers - He's Got No Love (remastered)\nThe Searchers - Hollywood (remastered)\nThe Searchers - Hungry For Love (remastered)\nThe Searchers - I (Who Have Nothing) (remastered)\nThe Searchers - I Count The Tears (remastered)\nThe Searchers - I Don't Want To Be The One (remastered)\nThe Searchers - I Don't Want To Go On Without You (remastered)\nThe Searchers - I Pretend I'm With You (remastered)\nThe Searchers - I'll Be Doggone (remastered)\nThe Searchers - I'll Cry Tomorrow (remastered)\nThe Searchers - If I Could Find Someone (remastered)\nThe Searchers - Innocent Victim (remastered)\nThe Searchers - It's All Been A Dream (remastered)\nThe Searchers - It's In Her Kiss (remastered)\nThe Searchers - It's Just The Way (Love Will Come And Go) (remastered)\nThe Searchers - It's Time (remastered)\nThe Searchers - Listen To Me (remastered)\nThe Searchers - Love Potion No. 9 (remastered)\nThe Searchers - Magic Potion (remastered)\nThe Searchers - Money (That's What I Want) (remastered)\nThe Searchers - Needles &amp; Pins (remastered)\nThe Searchers - No One Else Could Love You (remastered)\nThe Searchers - Oh My Lover (remastered)\nThe Searchers - Popcorn Double Feature (remastered)\nThe Searchers - Saturday Night Out (remastered)\nThe Searchers - Sea Of Heartbreak (remastered)\nThe Searchers - Second Hand Dealer (remastered)\nThe Searchers - Sho' Know A Lot About Love (remastered)\nThe Searchers - Since You Broke My Heart (remastered)\nThe Searchers - So Far Away (remastered)\nThe Searchers - Some Other Guy (remastered)\nThe Searchers - Someday We're Gonna Love Again (remastered)\nThe Searchers - Sugar &amp; Spice (remastered)\nThe Searchers - Sweets For My Sweet (remastered)\nThe Searchers - Take It Or Leave It (remastered)\nThe Searchers - Take Me For What I'm Worth (remastered)\nThe Searchers - The System (remastered)\nThe Searchers - This Empty Place (remastered)\nThe Searchers - This Feeling Inside (remastered)\nThe Searchers - Til I Met You (remastered)\nThe Searchers - Till You Say You'll Be Mine (remastered)\nThe Searchers - Too Many Miles (remastered)\nThe Searchers - Tricky Dicky (remastered)\nThe Searchers - Twist &amp; Shout (remastered)\nThe Searchers - Unhappy Girls (remastered)\nThe Searchers - Western Union (remastered)\nThe Searchers - What Have They Done To The Rain (remastered)\nThe Searchers - When I Get Home (remastered)\nThe Searchers - When You Walk In The Room (remastered)\nThe Searchers - Where Have All The Flowers Gone (remastered)\nThe Searchers - Where Have You Been (remastered)\nThe Searchers - You Can't Lie To A Liar (remastered)","torrent":{"xt":"urn:btih:dda628dcd1d011a1501e6a2a9ce3e96871f84e38","amp;dn":"The+Searchers+3CD+remastered+Pye+set+320k++%28musicfromrizzo%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dda628dcd1d011a1501e6a2a9ce3e96871f84e38","infoHashBuffer":{"type":"Buffer","data":[221,166,40,220,209,208,17,161,80,30,106,42,156,227,233,104,113,248,78,56]},"announce":[],"urlList":[]}}