{"title":"Paul Horwich's Philosophical Writings","uid":10993722,"size":49871763,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ddc1cc205ad0ff7dd64e9efb8828f9dfe4a48c44&amp;dn=Paul+Horwich%27s+Philosophical+Writings&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"philosophi","files":-1,"time":1410039440,"description":"Paul Horwich's Philosophical Writings\n\nPaul Horwich is a British analytic philosopher at New York University, whose work includes writings on causality, the philosophy of language (especially truth, and meaning) and Wittgenstein's later philosophy. Horwich earned his PhD from Cornell University; his thesis advisor was Richard Boyd (title of the doctoral thesis: The Metric and Topology of Time). He has previously taught at MIT, University College London, and CUNY Graduate Center.\n\nThe work for which he is best known, Truth (1990), presented a detailed defense of the minimalistic variant of the deflationary theory of truth. He is opposed to appealing to reference and truth to explicate meaning, and so has defended a naturalistic use theory of meaning in his book Meaning. Other concepts he has advanced are a probabilistic account of scientific methodology and a unified explanation of temporally asymmetric phenomena.\n\nIn the context of philosophical speculations about time travel, Horwich coined the term autoinfanticide to describe a scenario, depicting a variant of the grandfather paradox, in which a person goes back in time and deliberately or inadvertently kills his or her infant self, although he malformed the word as &quot;autofanticide&quot;.","torrent":{"xt":"urn:btih:ddc1cc205ad0ff7dd64e9efb8828f9dfe4a48c44","amp;dn":"Paul+Horwich%27s+Philosophical+Writings","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddc1cc205ad0ff7dd64e9efb8828f9dfe4a48c44","infoHashBuffer":{"type":"Buffer","data":[221,193,204,32,90,208,255,125,214,78,158,251,136,40,249,223,228,164,140,68]},"announce":[],"urlList":[]}}