{"title":"Bob Marley And The Wailers - Uprising (1980) WMA320","uid":6079012,"size":116176450,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ddc97057f82b748944bbadb7eef18b3b658dd6c4&amp;dn=Bob+Marley+And+The+Wailers+-+Uprising+%281980%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1294020821,"description":"Many Bob Marley fans insist the best or &quot;real&quot; Marley is the rawer, rootsier early stuff like CATCH A FIRE or the early Tuff Gong recordings. While I would agree that you can't go wrong with virtually any Bob Marley album, I personally prefer the more polished and (even more) melodic pop reggae he created towards the end of his career, like KAYA and this fantastic album, UPRISING. \n\nOn UPRISING, Marley is at the height of his powers and he's accompanied by a stellar band. All of the musical elements fall perfectly into place on every single track. These tunes demonstrate that Marley had a greater, more sophisticated mastery over his craft at this particular point in his life. He was making the best of every moment he had. It's been a while since I read Tim White's excellent and highly recommended Bob Marley biography CATCH A FIRE, but I'm pretty sure Marley was aware that he had brain cancer during the recording of this album. Sadly, his tragic death was just around the corner. \n\nWithout a doubt, this is soulful, spiritual music whether the songs deal with worldly themes such as on &quot;Pimper's Paradise&quot; or overtly religious ones like &quot;Forever Loving Jah.&quot; Even an agnostic like me can revel in the warm love and sheer joy in this music, which I feel even when Bob addresses the negative sides of life as he does on &quot;Bad Card,&quot; for example. This album is loaded with important, universal themes the whole world should hear. The last track (on the original album release), &quot;Redemption Song,&quot; featuring Marley alone on vocal and guitar, is something quite different from the other tracks and it's particularly poignant. On the whole, UPRISING is so fun to listen to and so groove-worthy that I've heard it hundreds of times and I never get tired of it. \n\nBob Marley created raggae and he's still the best raggae musician of all time. He's one of the greatest musicians ever, regardless of the genre. \n\nby Rich Latta\n\nTRACKLIST:\n\n01 - Coming In From The Cold.wma                       \n02 - Real Situation.wma                                \n03 - Bad Card.wma                                      \n04 - We And Dem.wma                                    \n05 - Work.wma                                          \n06 - Zion Train.wma                                    \n07 - Pimper's Paradise.wma                             \n08 - Could You Be Loved.wma                            \n09 - Forever Loving Jah.wma                            \n10 - Redemption Song.wma                               \n11 - Redemption Song (Band Version).wma                \n12 - Could You Be Loved (12'' Mix).wma \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:ddc97057f82b748944bbadb7eef18b3b658dd6c4","amp;dn":"Bob+Marley+And+The+Wailers+-+Uprising+%281980%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddc97057f82b748944bbadb7eef18b3b658dd6c4","infoHashBuffer":{"type":"Buffer","data":[221,201,112,87,248,43,116,137,68,187,173,183,238,241,139,59,101,141,214,196]},"announce":[],"urlList":[]}}