{"title":"Portable CoolEdit Pro v2.1 - THINSTALL","uid":4121647,"size":23685576,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ddf340e87c79d0646beb1dfa1a9b4dea3fbada70&amp;dn=Portable+CoolEdit+Pro+v2.1+-+THINSTALL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Donleavy","files":1,"time":1207587879,"description":"This is an excellent Thinstalled app. It may be old but it is still a very good tool.\nI have had no trouble with it\nI hope that you find it useful\n\nreview from http://dvd-audioworld.com/dvd-audio_news.htm\nAPRIL 10, 2003\nSYNTRILLIUM have just launched version 2.1 of their popular CoolEdit Pro audio editing software.\nAccording to SYNTRILLIUM, CoolEdit Pro is &quot;the complete multitrack recording system for your PC.&quot;\nCoolEdit Pro can handle up to 128 tracks, supports 24bit/192kHz (and higher), has more than 45 DSP\neffects (mastering and analysis tools and audio restoration features), and uses up to 32-bit processing.\nThe latest 2.1 version now supports multichannel (surround) audio and has a host of other new features\nSome of the improvements and new features mentioned on the &quot;cooledit&quot; website include,\n&quot;Multichannel encoder with WMA and WAV 5.1 file output\n\nWith the new multichannel encoder, you can take any mix from Cool Edit Pro&amp;#039;s Multitrack View and\npan the tracks and busses to create a surround sound mix. You can preview your surround mixes on\nany sound card that has a DirectSound multichannel driver, and export the mix as a single 5.1 WMA\nfile, one interleaved 6-channel WAV file, or 6 individual mono wave files.\n\nWMA 9 support\nCool Edit Pro&amp;#039;s WMA 9 features includes support for the format&amp;#039;s new capabilities, including encoding\nto either constant bitrate or variable bitrate, support for sample rates up to 96kHz and bit depths to 24-\nbit, data rates up to 440 kbps, lossless compression, and multichannel files.\n\nGreatly improved Noise Reduction\nThe new Spectral Decay option makes possible much larger reductions in noise without adding\nunwanted artifacts.\n\nAdditional hardware controller support\nCool Edit Pro now supports the Mackie Control, Tascam US-224, and Event EZbus. Hardware\nmanufacturers can also write support for new controllers with the new Cool Edit Pro controller SDK.\n\nEnhanced SMPTE/MTC master and slave accuracy\n\nCool Edit Pro&amp;#039;s sync to external SMPTE/MTC sources is even more accurate than before. It will now\nchase a source with better than Ã‚Â¼ frame accuracy.\n\nAbility to move tracks in multitrack by right clicking and dragging on track controls\nJust right click in the track controls and drag up and down to reposition entire tracks in the multitrack\nview.\n\nFaster response in VU meters and Frequency and Phase Analysis windows\nAll three of these analysis tools have much smoother updates in real time.\n\nSpin mode for Phase Analysis.\nThe Spin mode in Phase Analysis provides a new way to look at the phase relationships between\nchannels.\n\nIntelligent default sound card selection\nCool Edit Pro now selects its default sound card more intelligently, allowing you to get up and running even faster than before. \n\nMultichannel WAV import and export \nYou can now import WAV files with more than 2 channels as a series of mono WAVs. This enables\nyou to open a WAV file that contains a 5.1 surround mix, edit each of the wave files, and re-save the\ntracks as a multichannel wave file using the multichannel encoder.&quot;\n","torrent":{"xt":"urn:btih:ddf340e87c79d0646beb1dfa1a9b4dea3fbada70","amp;dn":"Portable+CoolEdit+Pro+v2.1+-+THINSTALL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddf340e87c79d0646beb1dfa1a9b4dea3fbada70","infoHashBuffer":{"type":"Buffer","data":[221,243,64,232,124,121,208,100,107,235,29,250,26,155,77,234,63,186,218,112]},"announce":[],"urlList":[]}}