{"title":"Word 2013 eLearning Kit For Dummies [PDF] [StormRG]","uid":10811931,"size":12611781,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:deb31057c4cb2f32a10911b764297902ff4fccc7&amp;dn=Word+2013+eLearning+Kit+For+Dummies+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"F1restorm","files":-1,"time":1408436789,"description":"Word 2013 eLearning Kit For Dummies\nAuthor: Lois Lowe\nPublished: 2014\nPublisher: Wiley\nISBN: 9781118491263 \nFormat: Retail PDF\nNOTE: access to online content requires registration with any email address \n_____________________________________________________________________________\n\nA step-by-step learning package to get you up and running with Word 2013!\n\nIf you're eager to get started using the new Microsoft Word 2013, this self-paced eLearning Kit is an ideal starting point! Featuring a full-color printed book and an online interactive eLearning course, this multimedia kit takes you through the basics of the Word interface and explains how to navigate it, how to get comfortable with the terminology, and how to use its many features. Follow the material sequentially or jump in and out as you wish - it's set up so you can learn at your own pace. Throughout, you will benefit from illustrations, animations, voiceover explanations, and the option of closed captioning if you find you learn better when you can read the instructions.\n\nHelps self-motivated learners master Word 2013, the most popular word processing application\nTeaches you how to create and format a Word document, while guiding you through the entire process so that you get a solid understanding of the importance and potential of every step\nIncludes an easy-to-follow, full-color book and an online interactive Dummies eLearning Course that corresponds with the book available via access code\nAllows you to follow material sequentially or choose separate sections at your own time and pace\nPacked with screenshots, examples, pictures, and step-by-step instructions, Word 2013 eLearning Kit For Dummies helps you get the most of what Word 2013 has to offer!\n","torrent":{"xt":"urn:btih:deb31057c4cb2f32a10911b764297902ff4fccc7","amp;dn":"Word+2013+eLearning+Kit+For+Dummies+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"deb31057c4cb2f32a10911b764297902ff4fccc7","infoHashBuffer":{"type":"Buffer","data":[222,179,16,87,196,203,47,50,161,9,17,183,100,41,121,2,255,79,204,199]},"announce":[],"urlList":[]}}