{"title":"Brutal Intimacy Analyzing Contemporary French Cinema (Wesleyan F","uid":11404088,"size":6003798,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:def7249ed01345b9962ac67b379cf52d1ed01982&amp;dn=Brutal+Intimacy+Analyzing+Contemporary+French+Cinema+%28Wesleyan+F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":1,"time":1415455532,"description":"Brutal Intimacy is the first book to explore the fascinating films of contemporary France, ranging from mainstream genre spectaculars to arthouse experiments, and from wildly popular hits to films that deliberately alienate the viewer. Twenty-first-century France is a major source of international cinema--diverse and dynamic, embattled yet prosperous--a national cinema offering something for everyone. Tim Palmer investigates France's growing population of women filmmakers, its buoyant vanguard of first-time filmmakers, the rise of the controversial cinema du corps, and France's cinema icons: auteurs like Olivier Assayas, Claire Denis, Bruno Dumont, Gaspar Noe, and stars such as Vincent Cassel and Jean Dujardin. Analyzing dozens of breakthrough films, Brutal Intimacy situates infamous titles alongside many yet to be studied in the English language. Drawing on interviews and the testimony of leading film artists, Brutal Intimacy promises to be an influential treatment of French cinema today, its evolving rivalry with Hollywood, and its ambitious pursuits of audiences in Europe, North America, and around the world.\n\nReview\n&quot;Written intelligently and with great fervour, Brutal Intimacy is a successful first book from Palmer and a welcome addition to French film scholarship. Not only should it be of great help to undergraduate students, but also to existing cinema literates and teachers, looking to further their learning and understanding of the modern French film environment.&quot;--Leo Collis, Film International\n\nAbout the Author\nTIM PALMER is an associate professor of film studies at the University of North Carolina-Wilmington. His articles have appeared in journals such as Cinema Journal, Journal of Film and Video, Studies in French Cinema and the French Review. He is cofounder and co-editor-in-chief of the journal Film Matters.\n\nPublisher: Wesleyan University Press (15 April 2011)\nLanguage: English\nISBN-10: 0819568260\nISBN-13: 978-0819568267","torrent":{"xt":"urn:btih:def7249ed01345b9962ac67b379cf52d1ed01982","amp;dn":"Brutal+Intimacy+Analyzing+Contemporary+French+Cinema+%28Wesleyan+F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"def7249ed01345b9962ac67b379cf52d1ed01982","infoHashBuffer":{"type":"Buffer","data":[222,247,36,158,208,19,69,185,150,42,198,123,55,156,245,45,30,208,25,130]},"announce":[],"urlList":[]}}