{"title":"Jesus Unmasked - Todd Friel","uid":11773221,"size":17316805,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dfb37b24abe6a0e4feb033ff97bf598fd97efb6d&amp;dn=Jesus+Unmasked+-+Todd+Friel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1427158414,"description":"\nJesus Christ is the most famous man in human history, but exactly who was He? Some say a fable; others think just one option among many good teachers, or even a nice guy who taught morals. Do any of these descriptions capture the totality of who He was? Jesus Unmasked goes directly to the world?s greatest expert on Jesus Christ, Jesus Himself:\n\n- Who Jesus said He was and why He said it the way He did\n- What historical accounts and Biblical details reveal versus what we assume\n- Why 4000 years of history, prophecy and chronology force every human being to render their verdict about this one man.\n\nWhen you encounter Jesus Unmasked, you will not be ambivalent. Jesus gives us clarity and insight into the nature of God. Interact with what Jesus taught about Himself and draw your own conclusions to the world?s most important question: ?Who is the real Jesus??\n\n\nAbout the author:\nTodd Friel is a fun and engaging speaker with knack for making things like Greek and hermeneutics easy to understand. His presentations are filled with a mix of humor and a strong Biblical foundation. Todd is currently host of ?Wretched Radio,? a daily syndicated talk radio program, as well as host of ?Wretched TV.?","torrent":{"xt":"urn:btih:dfb37b24abe6a0e4feb033ff97bf598fd97efb6d","amp;dn":"Jesus+Unmasked+-+Todd+Friel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfb37b24abe6a0e4feb033ff97bf598fd97efb6d","infoHashBuffer":{"type":"Buffer","data":[223,179,123,36,171,230,160,228,254,176,51,255,151,191,89,143,217,126,251,109]},"announce":[],"urlList":[]}}