{"title":"Neon Drive","uid":14640699,"size":199489718,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:dfc73183cc05134150025b9559840f4a0fa4701c&amp;dn=Neon+Drive&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dauphong","files":1,"time":1463517270,"description":"From beautiful cityscapes and ocean roads to exploding enemy spaceships, Neon Drive has it all. It's inspired by the arcade games of the 80's, but set against a futuristic backdrop of glowing cyber-grid, all in silky-smooth graphics. Neon Drive brings you 7 amazing levels, adding up to hours of enjoyment. Each level features multiple twists and perspective changes, keeping you on your toes (err, wheels) throughout the gameplay.\r\n\r\n\r\nNeon Drive will put your mad dodging skills to a real test, mercilessly pushing the limits of your reaction time and short-term memory to avoid obstacles and dead-ends. Seriously, this game is wicked; just when you think you've got the hang of it, it turns the table on you.\r\n\r\n\r\nEach level of the game comes with a custom-made retro music track, perfectly tuned and in sync with the roadblocks and your enemies. This allows you to just follow the beat, unplug, and zen out. Watch the landscape seamlessly morph from one scene to the next, in a ballet of colors and shapes, and let your inner driver take the wheel. You've got this","torrent":{"xt":"urn:btih:dfc73183cc05134150025b9559840f4a0fa4701c","amp;dn":"Neon+Drive","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfc73183cc05134150025b9559840f4a0fa4701c","infoHashBuffer":{"type":"Buffer","data":[223,199,49,131,204,5,19,65,80,2,91,149,89,132,15,74,15,164,112,28]},"announce":[],"urlList":[]}}