{"title":"SoundBunny 1.0.2 [k'd] By LfsCrew.zip","uid":8519464,"size":4640637,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:e046cfeb4c1a44ec04d0797be952ffd297da4617&amp;dn=SoundBunny+1.0.2+%5Bk%27d%5D+By+LfsCrew.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"skizzolfs","files":1,"time":1369869895,"description":"Name: SoundBunny\nVersion:  - 1.0.2\n\nMac Platform: Intel\nIncludes: K\n\nOS version: Mac: OS X 10.6.8 or higher\n\nLink for more information: http://www.prosofteng.com/products/soundbunny.php\n\n\n\nSoundBunny is a simple, powerful Mac volume control application that allows you to control the volume level for all open applications on your Mac.\nYou can set the volume high for a movie or game you're playing, while setting the volume low for your Mail alerts or notifications.\n\n\nEasy Setup\nSoundBunny is incredibly easy to get up and running (requires a simple restart upon install, so that it can load core system processes appropriately). Once you've restarted, simply drag the volume level sliders for each open application and you're off and hopping! Here is one final note on the installation process. If you have Prosoft's Hear audio enhancement program installed, you cannot use SoundBunny. SoundBunny is actually a subset of Hear and the installation of both programs in not compatible.\n\nSuggested Uses for SoundBunny\nSoundBunny brings the volume control for all of your apps into one, easily accessed location. You are able to either adjust the volume or even mute the programs or programs from its interface. For example, if you are watching a movie or YouTube video and receive a phone call, you are able to mute the movie or video quickly with the SoundBunny application. Since the program discovers all of the sound-enhance applications that are running, you can also control any others that need to be turned down or muted.\n\n\n\nA Versatile Program\nThere are some other uses that make SoundBunny a versatile program. If you are listening to your iTunes and are waiting for an important email, you can turn up the email notification so that you can hear it over the music. Of course, you can then quickly lower the volume or mute the sound on the iTunes app if necessary.\n\nSystem Requirements\nMac: OS X 10.6.8 or higher\nSoundBunny must load at startup and therefore requires a restart upon installation.\nSoundBunny currently does not support USB and FireWire audio interfaces.\nSoundBunny is not compatible with Hear.\n\n[k'd ] By LfS*crew \nBuon Divertimento ;)","torrent":{"xt":"urn:btih:e046cfeb4c1a44ec04d0797be952ffd297da4617","amp;dn":"SoundBunny+1.0.2+%5Bk%27d%5D+By+LfsCrew.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e046cfeb4c1a44ec04d0797be952ffd297da4617","infoHashBuffer":{"type":"Buffer","data":[224,70,207,235,76,26,68,236,4,208,121,123,233,82,255,210,151,218,70,23]},"announce":[],"urlList":[]}}