{"title":"LumaPix Fotofusion v4.2","uid":4216095,"size":11463695,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e0fd9e33b9c53ddeffec314359d3fceede43639c&amp;dn=LumaPix+Fotofusion+v4.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Black_Bilbo","files":4,"time":1212346920,"description":"\nFotoFusionÂ® is a revolutionary digital layout tool for building collages, scrapbooks, and flush-mounted photo albums from digital photos.\n\nIt converts a selection of your images into a unique photo collage instantly, then provides elegant photo editing tools to re-organize, crop, color balance, and package your composition.\n\nThe resulting collage can be shared with friends and customers via email, published to the web as a web album, or printed from business card up to poster size.\n\nPaper + Digital Templates ::\n\nThe dotScrap Alliance is a new Scrapbooking industry consortium based around FotoFusion - including K &amp; Company, Creative Imaginations, Daisy D&amp;#039;s, Westrim, KI Memories, L&amp;#039;il Davis, Scrapbook.com, ScrapJazz.com, MyCliqueTV, SEI, and more.\n\nPaper kits found in retail stores that are marked with &amp;#039;dotScrap Ready&amp;#039; have easily-downloaded FotoFusion templates to make the paper kits even easier to work with.\n\nResolution Independence :\n\nFotoFusion is built on a &amp;#039;resolution independent&amp;#039; rendering engine; it stores references to images as opposed to permanently resizing images to make them fit into your layout. Any image manipulation you perform (cropping, rotating, resizing, color correction, etc) are all remembered as changes to that original image and not as new images. Text and vector mattes are rendered to bitmaps (or &quot;RIPped&quot;) at the final resolution to produce a perfect image.\n\nThe result is striking creative freedom for you - you can change your mind at any time, and make as many adjustments as you like, without fear that your image quality will be degraded\n\nInteractive User Interface :\n\nFotoFusion&amp;#039;s innovative user interface is &quot;real time all the time&quot;: updates are shown immediately, with no &amp;#039;ok&amp;#039; buttons or one-way decisions to make.\n\nDrag controls to set shadow distance and opacity. Drag borders to set the thickness and inset of frame edges. Swap pictures in a snap, crop images interactively, work with multiple selections as easily as with a single frame. It&amp;#039;s all done fluidly and without hesitation.\n\nYou&amp;#039;ll wonder how you got along without such a powerful, elegant system - returning to the tools you work with now will feel like going back in time\n\nSmart Content :\n\ndotScrap content sets a new standard for graphics.\n\nFotoFusion&amp;#039;s intelligent graphical objects act the way you expect: envelopes that hold images, paperclips and pins that hold paper, frames that can be reshaped without stretching, and multi-layer elements that age text and photographs.\n\nEasily found by keyword search, visual browsing or entering a dotScrap ID; downloaded quickly from the LumaPix servers; and consistantly high quality - dotScrap is going to change how you work with graphics.\n\n\nSystem Requirements \n\nThe minimum system configuration required to run FotoFusion photo layout software includes: \nInternet access (high-speed recommended) \nA working e-mail account \n256 MB RAM \nPentium III, 350MHz or faster \n1024x768 desktop display resolution \nA two-button mouse (three buttons recommended) \n20 MB free disk space \n\nSupported Platforms FotoFusion design layout software is certified on: \n\nWindows 2000 (Requires GDI+, Download and Install from here) \nWindows XP \nWindows Vista \n\nMac support FotoFusion photo layout software is currently not available for the Mac. Users with Intel-based Mac systems have reported excellent results running FotoFusion on VMWare and Parallels.\n\nEnjoy!!","torrent":{"xt":"urn:btih:e0fd9e33b9c53ddeffec314359d3fceede43639c","amp;dn":"LumaPix+Fotofusion+v4.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0fd9e33b9c53ddeffec314359d3fceede43639c","infoHashBuffer":{"type":"Buffer","data":[224,253,158,51,185,197,61,222,255,236,49,67,89,211,252,238,222,67,99,156]},"announce":[],"urlList":[]}}