{"title":"Kiss Me Kate (1953) Kathryn Grayson","uid":4728627,"size":732567599,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e14c515101efaef3a1701c609fb0b512438ec554&amp;dn=Kiss+Me+Kate+%281953%29+Kathryn+Grayson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"johnefp","files":-1,"time":1234886859,"description":"Plot Synopsis\tby Hal Erickson\n\nCole Porter's Kiss Me Kate is a musical within a musical -- altogether appropriate, since its source material, Shakespeare's The Taming of the Shrew, was a play within a play. Howard Keel and Kathryn Grayson star as famous Broadway singing team who haven't worked together since their acrimonious divorce. Keel, collaborating with Cole Porter (played by Ron Randell), plans to star in a musical version of The Taming of the Shrew titled &quot;Kiss Me Kate.&quot; Both he and Porter agree that only one actress should play the tempestuous Katherine, and that's Grayson. But she isn't buying, especially after discovering that Keel's latest paramour, Ann Miller, is going to be playing Bianca. Besides, Grayson is about to retire from showbiz to marry the &quot;Ralph Bellamy character,&quot; played not by Bellamy, but by Willard Parker. A couple of gangsters (James Whitmore and Keenan Wynn) arrive on the scene, convinced Keel is heavily in debt to their boss; actually, a young hoofer in the chorus (Tommy Rall) owes the money, but signed Keel's name to an IOU. But since Grayson is having second thoughts about going on-stage, Keel plays along with the hoods, who force Grayson at gunpoint to co-star with her ex-husband so that they'll get paid off. Later the roles are reversed, and the gangsters are themselves finagled into appearing on-stage, Elizabethan costumes and all, though that scene is less of a comic success. This aside, Kiss Me Kate is a well-appointed (if bowdlerized) film adaptation of the Porter musical. Virtually all of the play's songs are retained for the screen version, notably &quot;So in Love,&quot; &quot;Wunderbar,&quot; &quot;Faithful in My Fashion,&quot; &quot;Too Darn Hot,&quot; &quot;Why Can't You Behave?,&quot; &quot;Brush Up Your Shakespeare&quot; (a delightful duet delivered delightfully by Keenan Wynn and James Whitmore), and the title song. Additionally, Porter lifted a song from another play, Out of This World, and incorporated it in the movie version of Kiss Me Kate; as a result, &quot;From This Moment On&quot; has been included in all subsequent stagings of Kate. This MGM musical has the distinction of being filmed in 3-D, which is why Howard Keel and Kathryn Grayson throw so many chairs, dishes, and pieces of fruit at the camera in their domestic battle scenes.\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0045963/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0045963/&lt;/a&gt;\n\nExtra Subtitles\n\n &lt;a href=&quot;\nhttp://www.opensubtitles.org/en/search/sublanguageid-all/idmovie-19153&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.opensubtitles.org/en/search/sublanguageid-all/idmovie-19153&lt;/a&gt;\n\n\nDirector:\nGeorge Sidney\n\n\n        Kathryn Grayson\t ... \tLilli Vanessi 'Katharina'\n\n\tHoward Keel\t... \tFred Graham 'Petruchio'\n\n\tAnn Miller\t... \tLois Lane 'Bianca'\n\tKeenan Wynn\t... \tLippy\n\tBobby Van\t... \t'Gremio'\n\n\n\n","torrent":{"xt":"urn:btih:e14c515101efaef3a1701c609fb0b512438ec554","amp;dn":"Kiss+Me+Kate+%281953%29+Kathryn+Grayson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e14c515101efaef3a1701c609fb0b512438ec554","infoHashBuffer":{"type":"Buffer","data":[225,76,81,81,1,239,174,243,161,112,28,96,159,176,181,18,67,142,197,84]},"announce":[],"urlList":[]}}