{"title":"Resilience - Jessie Close","uid":11676726,"size":3469880,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e3050f65090592dd78fcbd5840648826777f4f6e&amp;dn=Resilience+-+Jessie+Close&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1422902565,"description":"The Close sisters are descended from very prominent and wealthy ancestors. When the Close sisters were very young, their parents joined a cult called the MRA, or Moral Rearmament. The family was suddenly uprooted to a cult school in Switzerland and, ultimately, to the Belgian Congo where their father became a surgeon in the war ravaged republic, and ultimately the personal physician to President Mobutu. Shortly after the girls returned to the US for boarding school, Jessie first started to exhibit symptoms of severe bipolar disorder (she would later learn that this ran in the family, a well-kept secret). Jessie embarked on a series of destructive marriages as the condition worsened. Glenn was always by her side throughout. Jessie's mental illness was passed on to her son, Calen. It wasn't until Calen entered McLean's psychiatric hospital that Jessie herself was diagnosed. Fifteen years and twelve years of sobriety later, Jessie is a stable and productive member of society. Glenn continues to be the major support in Jessie's life.\n\nIn RESILIENCE, the sisters share their story of triumphing over Jessie's illness. The book is written in Jessie's voice with running commentary and an epilogue written by Glenn","torrent":{"xt":"urn:btih:e3050f65090592dd78fcbd5840648826777f4f6e","amp;dn":"Resilience+-+Jessie+Close","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3050f65090592dd78fcbd5840648826777f4f6e","infoHashBuffer":{"type":"Buffer","data":[227,5,15,101,9,5,146,221,120,252,189,88,64,100,136,38,119,127,79,110]},"announce":[],"urlList":[]}}