{"title":"The Dream Syndicate - The Days of Wine and Roses [1982][EAC,log,","uid":8725810,"size":275412109,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e4837b5d144c8aa1cfd6e7a12562e540ac4701c1&amp;dn=The+Dream+Syndicate+-+The+Days+of+Wine+and+Roses+%5B1982%5D%5BEAC%2Clog%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":14,"time":1374513192,"description":"Artist:The Dream Syndicate\nRelease:The Days of Wine and Roses \nReleased: 1982\nLabel: 1993 - Slash Records\nCatalog#: 23844-2\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle:rock\n\n1. &quot;Tell Me When It's Over&quot;\n2. &quot;Definitely Clean&quot;\n3. &quot;That's What You Always Say&quot;\n4. &quot;Then She Remembers&quot;\n5. &quot;Halloween&quot; \n6. &quot;When You Smile&quot;\n7. &quot;Until Lately&quot;\n8. &quot;Too Little, Too Late&quot;\n9. &quot;The Days of Wine and Roses&quot;\n\nOn the one hand, where the Dream Syndicate came from was so obvious that it almost hurt. The Velvet Underground was a clear touchstone (if not quite the original LaMonte Young ensemble the band name referred to), as were the Doors, the Byrds, and any number of blues and country traditions and more. Had they been around in the late '60, one might have wondered whether they would have garnered much attention in comparison. But the early '80s was the band's time and place, and their fusions of all the above and more via punk-inspired energy achieved its own level of deserved attention. Capturing the original killer Wynn/Precoda/Smith/Duck lineup performing with inspiration throughout, The Days of Wine and Roses trumps the &quot;paisley underground&quot; tag the band was saddled with by being a great rock record, full on. While Wynn received the lion's share of attention thanks to his ghost-of-Lou Reed vocals and frontman status, arguably it's Precoda who is the real reason to listen in. Both his rave-ups and gentler shadings are phenomenal, as a random listen of songs like &quot;Definitely Clean&quot; and the sweet, Smith-sung &quot;Too Little, Too Late&quot; show. The Smith/Duck rhythm section grooves along fairly enough, at its best on the Krautrock-inspired chug of Precoda's composition &quot;Halloween.&quot; Highlights include the romping &quot;Then She Remembers,&quot; with a much more direct Wynn vocal that makes for good in-your-face fun, and the mid-tempo moodout of &quot;When You Smile,&quot; Precoda's screeching feedback playing around the mix's edges. Concluding with the epochal title track, which builds to a frenetic climax not once but twice, The Days of Wine and Roses is a grand treat.","torrent":{"xt":"urn:btih:e4837b5d144c8aa1cfd6e7a12562e540ac4701c1","amp;dn":"The+Dream+Syndicate+-+The+Days+of+Wine+and+Roses+%5B1982%5D%5BEAC%2Clog%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4837b5d144c8aa1cfd6e7a12562e540ac4701c1","infoHashBuffer":{"type":"Buffer","data":[228,131,123,93,20,76,138,161,207,214,231,161,37,98,229,64,172,71,1,193]},"announce":[],"urlList":[]}}