{"title":"Science vs. Evolution - Vance Ferrell","uid":11773475,"size":15870839,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e4b250b104aca59b3dd8b58ae4a91fad159d063e&amp;dn=Science+vs.+Evolution+-+Vance+Ferrell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1427169001,"description":"\nOver 3,000 scientific facts which annihilate evolutionary theory This book is based on extensive research and is highly recommended by scientists and educators\n\nThe Facts are on one side--The Theories are on the Other! This very readable 1000-page book is packed with thousands of Scientific Facts that disprove Evolution. It blows it away. Can be used as a source book for Ministers, Teachers, and Students, a Textbook for Home-scholars or group study as well as personal reading. Many charts and Illustrations. Good for school textbook and home study, academies, colleges, home scholar?s etc.\n\n\nAbout the author:\nVance Ferrell was raised in San Francisco, Calif. He has been a very studious man who had 22 yrs of formal education. He received a BA in 1955 from Pacific Union College (Angwin, Calif.). 1965 he received a MA from the Potomac University in (Washington DC). In 1958 he received a BD from Andrews University (Berrien Springs, Mich.). Throughout the years Vance Ferrell has been in love with his Creator and compelled to defend a loving Heavenly Father. Vance Ferrell has spent much time doing extensive research in the fields of botany, biology, geology and other sciences","torrent":{"xt":"urn:btih:e4b250b104aca59b3dd8b58ae4a91fad159d063e","amp;dn":"Science+vs.+Evolution+-+Vance+Ferrell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4b250b104aca59b3dd8b58ae4a91fad159d063e","infoHashBuffer":{"type":"Buffer","data":[228,178,80,177,4,172,165,155,61,216,181,138,228,169,31,173,21,157,6,62]},"announce":[],"urlList":[]}}