{"title":"The Structure of Evolutionary Theory - Stephen Gould","uid":6764344,"size":14245963,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e4e75a69f351f0442359fb45dc561337bf84fc8d&amp;dn=The+Structure+of+Evolutionary+Theory+-+Stephen+Gould&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"rosie1966","files":2,"time":1319315631,"description":"The theory of evolution is regarded as one of the greatest glimmerings of understanding humans have ever had. It is an idea of science, not of belief, and therefore undergoes constant scrutiny and testing by argumentative evolutionary biologists. But while Darwinists may disagree on a great many things, they all operate within a (thus far) successful framework of thought first set down in The Origin of Species in 1859.\n\nIn The Structure of Evolutionary Theory, a monumental labor of academic love, Stephen Jay Gould attempts to define and revise that framework. Using the clear metaphors and personable style he is so well known for, Gould outlines the foundation of the theory and attempts to use it to show that modern evolutionary biology has lost its way. He then offers his own system for reconciling Darwin's &quot;basic logical commitments&quot; with the critiques of modern scientists.\n\nGould's massive opus begs a new look at natural selection with the full weight of history behind it. His opponents will find much to criticize, and orthodox, reductionist Darwinists might feel that Gould has given them short shrift. But as an opening monologue for the new century's biological debates, The Structure of Evolutionary Theory sets a mountainous precedent in exhaustive scholarship, careful logic, and sheer reading pleasure.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:e4e75a69f351f0442359fb45dc561337bf84fc8d","amp;dn":"The+Structure+of+Evolutionary+Theory+-+Stephen+Gould","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4e75a69f351f0442359fb45dc561337bf84fc8d","infoHashBuffer":{"type":"Buffer","data":[228,231,90,105,243,81,240,68,35,89,251,69,220,86,19,55,191,132,252,141]},"announce":[],"urlList":[]}}