{"title":"The Killing Rain by  P.J. Parrish (Request) (Epub) {Rose88}","uid":10796324,"size":623981,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e5052363524c915cb7b3616093d8f8292a650311&amp;dn=The+Killing+Rain+by++P.J.+Parrish+%28Request%29+%28Epub%29+%7BRose88%7D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TheRose88","files":-1,"time":1408297234,"description":"Title: The Killing Rain\nAuthor: P.J. Parrish\nPublished: Aug 2013\nPublisher: Our Noir\nFormat: Epub (Retail)\nLanguage: English\nGenres: Fiction, Mystery, Suspense\n\nA deep freeze is bearing down on the Florida Everglades, the kind of brutal storm the locals call a killing rain. For detective Louis Kincaid, the coldest night of the year has brought a terrifying new chill -- the kidnapping of a boy who has come to look up to Louis as a father-figure. But Louis soon realizes this is not a routine kidnapping. It is the start of a killing spree by two ruthless men who are using the boy as a pawn in a deadly game. With time running out, Kincaid must track his twisted adversaries who are one step away from committing the ultimate horror.\n\nA missing child and a truly vicious family of killers make for a brisk race against time in Parrish's latest adventure featuring Florida detective Louis Kincaid (Island of Bones, etc.). Kincaid has just begun to connect romantically with defense attorney Susan Outlaw when her estranged husband, Austin, a globe-trotting businessman of shady ways and means, arrives at her doorstep, wanting time with son Ben. Father and son head off for ice cream, but don't return. Louis follows their trail, which leads back to Austin's office, where police have just discovered the brutally murdered bodies of Austin's partner and secretary. Austin later lands in Louis's custody but Ben remains missing. Austin eventually reveals his botched role in a transaction to purchase Micronesian women as slaves. This lean, fast-paced yarn takes a rather silly final turn, when the ruthless patriarch behind the whole mess, and his motives, are revealed (the slaves weren't used for work or sex but for hunting prey. ","torrent":{"xt":"urn:btih:e5052363524c915cb7b3616093d8f8292a650311","amp;dn":"The+Killing+Rain+by++P.J.+Parrish+%28Request%29+%28Epub%29+%7BRose88%7D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5052363524c915cb7b3616093d8f8292a650311","infoHashBuffer":{"type":"Buffer","data":[229,5,35,99,82,76,145,92,183,179,97,96,147,216,248,41,42,101,3,17]},"announce":[],"urlList":[]}}