{"title":"Melatonin: Therapeutic Value and Neuroprotection [2014] [PDF]","uid":13078821,"size":8120170,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e67f1a6c113a9fb0dd96060744f351df5ceaf91e&amp;dn=Melatonin%3A+Therapeutic+Value+and+Neuroprotection+%5B2014%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"NoctDeath","files":2,"time":1450883192,"description":"Title: Melatonin: Therapeutic Value and Neuroprotection \r\nAuthor: Venkatramanujan Srinivasan, Gabriella Gobbi, Samuel D. Shillcutt, Sibel Suzen \r\nFormat: PDF \r\nHardcover: 573 pages \r\nPublisher: CRC Press; 1 edition (October 15, 2014) \r\nLanguage: English \r\nISBN: 9781482220094 \r\n\r\n\r\nThere is growing interest in the field of melatonin research regarding its neurobiological mechanisms as well as its repercussions in clinical practice. Melatonin: Therapeutic Value and Neuroprotection explores melatonin’s neuroprotective effects and discusses the therapeutic potential of melatonin and melatonin agonists in treating neurodegenerative diseases and other ailments. Topics include:\r\n\r\n- The basic aspects of melatonin’s physiology, including its production, bioavailability, and metabolism\r\n- The functional importance of melatonin receptors and their role in mediating the therapeutic effectiveness of melatonin in cancer\r\n- Melatonin’s effect on the regulation of blood pressure, sleep, and circadian rhythms\r\n- The cardioprotective role of melatonin\r\n- The neuroprotective role in glaucoma, Alzheimer’s disease, Parkinson’s disease, and neurodegenerative diseases\r\n- Use as a therapeutic agent for treating epilepsy and degenerative discs\r\n- Treatment for obesity, diabetes mellitus, and other metabolic disorders\r\n- Protective role in peri-natal hypoxic-ischemia\r\n\r\nThe contributors also examine the discovery of a number of melatonergic agonists, their potential role as antioxidants, and their therapeutic applications in treating glaucoma, Parkinson’s disease, Alzheimer’s disease, primary insomnia, and psychiatric disorders. Opening new vistas in our understanding of etiology, pharmacotherapy, and treatment, the book is a significant milestone in our knowledge about advances in melatonin’s physiology and its therapeutic application in a number of disorders","torrent":{"xt":"urn:btih:e67f1a6c113a9fb0dd96060744f351df5ceaf91e","amp;dn":"Melatonin%3A+Therapeutic+Value+and+Neuroprotection+%5B2014%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e67f1a6c113a9fb0dd96060744f351df5ceaf91e","infoHashBuffer":{"type":"Buffer","data":[230,127,26,108,17,58,159,176,221,150,6,7,68,243,81,223,92,234,249,30]},"announce":[],"urlList":[]}}