{"title":"Invincible Iron Man v5 by Fraction (2008-2012|100%|Dgtl+|E+MM+)","uid":9627939,"size":1755508370,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e680b8b96f3d6c099d8bea3a5f32fbc72b6f5435&amp;dn=Invincible+Iron+Man+v5+by+Fraction+%282008-2012%7C100%25%7CDgtl%2B%7CE%2BMM%2B%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1392623387,"description":"For a more detailed overview of this series, please see the wikilink here: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Invincible_Iron_Man&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Invincible_Iron_Man&lt;/a&gt;\n\nIn 2008, writer Matt Fraction took over the Iron Man series - after Volume 5's enormously successful run by Warren Ellis and others - and transformed it into a tightly plotted 60+ issue masterpiece, winning an Eisner Award in the process (along with Sal Larroca, the primary artist on the series). Fraction built on elements of many previous Iron Man stories and drew some key ideas from Ellis' arcs, but redefined Tony Stark in his own way, from the ground up. Following the events of Civil War and other major Marvel crossovers, Stark was at a low point both personally and professionally. Fraction took that theme to the next level, as he introduced new enemies (with old bloodlines) who completely wanted to destroy Stark Enterprises and kill Tony himself. During this volume, Stark would see his entire company go down in flames, his own job security threatened (and then eventually being eliminated as Director of S.H.I.E.L.D. altogether), his own body and mind ripped apart quite literally and his attempts to rebuild his life thwarted at every turn. In dropping him so far down, however, Fraction was able to show Stark truly relentless nature and the depths of his struggle as just a man among the literal and figurative gods - and most importantly, how far he was willing to go to protect those he cared about, even beyond death. Larroca's art was equally adept at weaving the tale through bold images, and creative paneling, along with wonderful physical and facial expressiveness on many of main players in this drama. All in all, this is a great run and one of the defining works of Fraction's career to date, as well as a significant portrayal of Iron Man as we have rarely seen him.\n\nThis torrent collects every issue of Fraction's run, including the Annual, in reading order along with appropriate extras. That encompasses issues 01-33, then continues with the renumbered issue 500 through to 527 (with 500.1 there as well). The run is spread out over 15 folders, which I have listed below, and they are divided into story arcs. The extras included are the Rescue One-Shot by Fraction's wife, Kelly Sue DeConnick; the Fear Itself 7.3 issue that deals with Iron Man's part of the crossover, also written by Fraction; and the FCBD 2010 issue with Thor and Iron Man that takes place during the run but is self-contained and tangential (included as a bonus only, and not really required reading). The labeling is as follows (with some brief commentary):\n\n-01 The Five Nightmares (IIM 01-07) - Stark Industries is attacked by the son of Obadiah Stane, and he wants to prove himself by killing Tony.\n-02 World's Most Wanted (IIM 08-19) - Norman Osborn is the new Director of S.H.I.E.L.D. (as part of the Dark Reign event) and he wants the data on every superhero out there. The only problem is that lone copy of the information is in Tony's brain! Thus begins a wild and thrilling hunt as Tony must erase his brain to save everything before Osborn can get to him.\n-03 Rescue One-Shot [by Kelly Sue DeConnick] - Pepper Potts has a new role, and reflects on it in this one-off story.\n-04 Stark Disassembled (IIM 20-24) - Tony Stark is dead, for all intents and purposes. He needs a &quot;reboot&quot; and gets one, with the help of his friends. But there are lasting consequences...\n-05 Stark Resilient (IIM 25-33) - Ezekial Stane is not done with Stark, and his new partners are old enemies. Can Tony refocus his genius to engineer a new kind of empire and legacy? Or will the opposition shut him down permanently first?\n-06 Mandarin - The Story Of My Life (IIM Annual) - The Mandarin hires a director to tell his life story, but the script isn't quite the truth. Hilarity (and violence) ensure\n-07 The New Iron Age (IIM 500) - A special blowout anniversary issue that takes place in the far future.\n-08 What It Was Like, What Happened, And What It's Like Now (IIM 500.1) - Tony's history, in his own words. Sort of...\n-09 Fix Me (IIM 501-503) - Doctor Octopus needs Tony's help, whether he likes it or not. Otherwise, the bomb drops on Manhattan, literally.\n-10 Fear Itself (IIM 504-509) - Tony's mental nightmares re-awaken. So does his alcohol abuse.\n-11 Fear Itself 7.3 - Iron Man - Part of the crossover, this issue focuses on Tony's side of things.\n-12 Demon (IIM 510-515) - Tony battles personal, mental, and physical demons.\n-13 Long Way Down (IIM 516-520) - The Mandarin attacks, viciously.\n-14 The Future (IIM 521-527) - The stunning conclusion of Fraction's epic.\n-15 Bonus - FCBD Iron Man + Thor - Fair Weather - a fun one-off story that sees Iron Man and Thor battle some elitists who have repurposed Stark tech to terraform the Moon. It was Tony's ideas to control the weather as a weapon that started the whole mess, though (oops)!\n\nNearly every issue is digital, with the exception of 25-33 and the FCBD issue which have only analog scans; all of those are Minutemen scanners except for 33 which is by &quot;Dakota Scanning&quot; and terrible quality (but it is apparently all that exists, for some reason). Issues 01-24 are HD courtesy of Monafekk-Empire. The Rescue issue is by Cypher-Empire, the Annual is in 3 parts from the web by Minutemen-InnerDemons, the Fear Itself addition is by Zone-Empire. Issues 500-527 are by megan-Empire; I had to manually edit out the complete pages of all the Iron Man covers from #500 because it kept crashing my CDisplayEx, but otherwise the actual story + letters page is intact and that fixed the problem.\n\nSo yeah, sorry for the text wall but I hope I sold you on reading this if you haven't done so already. Please seed this one if you like it - enjoy! :-)\n\n","torrent":{"xt":"urn:btih:e680b8b96f3d6c099d8bea3a5f32fbc72b6f5435","amp;dn":"Invincible+Iron+Man+v5+by+Fraction+%282008-2012%7C100%25%7CDgtl%2B%7CE%2BMM%2B%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e680b8b96f3d6c099d8bea3a5f32fbc72b6f5435","infoHashBuffer":{"type":"Buffer","data":[230,128,184,185,111,61,108,9,157,139,234,58,95,50,251,199,43,111,84,53]},"announce":[],"urlList":[]}}