{"title":"Mario Bross 2009","uid":4782118,"size":39606270,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e7542fe41560bbbf04ed0da00d58d6f2f4a9872c&amp;dn=Mario+Bross+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GreedilyPink","files":1,"time":1237415818,"description":"\n\nRemember Mario Bross? The most famous game in Nintendo? Now it comes with the newest version and we can play it with our PC.. Razz\nIn the game you play as a young kid known as Maryo. Likely one of Mario's offspring. Wink Anywho, one of the things you will quickly notice is the strikingly familiar and similar backgrounds, characters and objects in the game. As I said, the game emulates Super Mario World quite well. The excellent graphics and eye candy at least partially make up for that. It's not like the game isn't playable, because it fully is. It's just that it plays in such a different way that you have to tinker a bit to get a full grasp of what does what and how things work before diving headlong into the game.\n\nA couple things I liked about the game was the sound effect, a few of which seem to be fairly common default sounds that you can find in many different open source projects, which gives you kind of a weird feeling hearing them and expecting to see another familiar character you love, but seeing Maryo instead. The quality of the graphics is also excellent. While the old Super Mario World was in 16 bit Nintendo splendor, Secret Maryo Chronicles is in simulated 3d. I say simulated because while it's not actually 3d, it looks a lot like it is.\n\nAnother thing I did like is that the game doesn't lag. You really have to go out of your way to make this game lag. I had all kinds of background processes and applications running, and the game didn't hang or hiccup once. Even during some of the heaviest action.\n\nThe levels on Secret Maryo Chronicles though have to be one of the best features of the game. I found them to be both challenging, and fun to explore. Unlike Super Tux and most of the original Mario games, you can actually go backwards on the map all you want. You're not locked into one point on the map once you pass a certain spot. You can go all the way back to the beginning, run around, explore, or do what you like. While not necessary, it does lend itself to being rather fun if you want it to be. If nothing else, it's a useful tool.\n","torrent":{"xt":"urn:btih:e7542fe41560bbbf04ed0da00d58d6f2f4a9872c","amp;dn":"Mario+Bross+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7542fe41560bbbf04ed0da00d58d6f2f4a9872c","infoHashBuffer":{"type":"Buffer","data":[231,84,47,228,21,96,187,191,4,237,13,160,13,88,214,242,244,169,135,44]},"announce":[],"urlList":[]}}