{"title":"Capitalism.2.and.Capitalism.Plus","uid":6779687,"size":203676051,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e7dce5ca8a679c77af8a98eb30fd5498f011b0b2&amp;dn=Capitalism.2.and.Capitalism.Plus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"hariuab","files":5,"time":1319854202,"description":"\n\nTrevor Chan has earned the right to put his name on the box cover of his games. Sure, the Hong Kong based designer lacks the prestige of Sid Meier and Will Wright, but hes carved out a niche for himself by helming some of the more memorable strategy games in recent years. While the Capitalism and Seven Kingdoms series might have been cult hits rather than commercial successes, its a sure bet that buyers didnt consider heading back to the store for a refund. Addictive play blended with outstanding depth made all four of these games instant classics.\n\n\n\nNow the developer and his team at Enlight Software are getting back to basics with Trevor Chans Capitalism II, the first addition to this series of award winning economic simulations since Capitalism Plus arrived in the spring of 1997. Based on our impressions of a late beta, the new game is a complete reworking of the original that goes back to familiar territory without simply repeating the past. Although the objectives and essential elements are all back, they are being presented in a new fashion, with all sorts of additions that fully bring the world of big business and high finance to life. Economic systems are more complex; successful corporations can build massive headquarters; there are now dozens of retail businesses to operate and products to research, manufacture, and sell; a multiplayer mode has been included for the first time; and you can even top everything off by building a mansion to celebrate your worship of mammon.\n\nZoom in to see cars and pedestrians.\n\nStill, even with all of the new features, a lot here will be familiar to series veterans. Capitalism II seems to be pretty much the same game under the hood, inasmuch as youre still trying to make billions by establishing successful retail stores, building productive factories, and making a killing on Wall Street. Gameplay has been expanded in a number of areas, however. A configurable custom option provides for something very similar to solo skirmish play in a real time strategy game. It gives you a chance to tweak every possible aspect of gameplay. Along with basic components like character name and portrait, you also get to choose one of eight difficulty levels ranging from 3 percent all the way to a whopping 200 percent, select the amount of startup capital, and set the number, aggressiveness, and competence of your CPU controlled opposition. Goals can also be changed in regard to wealth and corporate status, and certain goods and industries can be excluded. So, if youve got an aversion to tobacco products, make a quick stop here before starting a game and remove all of the R.J. Reynolds wannabes from the playing field.\n\nMinimum System Requirements\nSystem: PII 233 or equivalent\nRAM:64 MB\nHard Drive Space:250 MB\n\nRecommended System Requirements\nSystem: PII 350 or equivalent\nRAM:128 MB","torrent":{"xt":"urn:btih:e7dce5ca8a679c77af8a98eb30fd5498f011b0b2","amp;dn":"Capitalism.2.and.Capitalism.Plus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7dce5ca8a679c77af8a98eb30fd5498f011b0b2","infoHashBuffer":{"type":"Buffer","data":[231,220,229,202,138,103,156,119,175,138,152,235,48,253,84,152,240,17,176,178]},"announce":[],"urlList":[]}}