{"title":"THE MAJESTY OF THE LAW - Sandra Day O'Connor. {FerraBit}","uid":4863279,"size":311988843,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e82ce1722fc0d8a5c7e7463cd2ef0a38a0e6b4df&amp;dn=THE+MAJESTY+OF+THE+LAW+-+Sandra+Day+O%5C%27Connor.+%7BFerraBit%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"FerraBit","files":-1,"time":1240353991,"description":"The Majesty of the Law: Reflections of a Supreme Court Justice\nby Sandra Day O'Connor (2003)\n\nRead by Burnadette Dunne\n\nFormat: 8 CDs to MP3\nBitrate: ~72kbps (iTunes 8, 64kbps, VBR medium, 44kHz, mono). 186 tracks.\nPublisher: Books on Tape; UNABRIDGED EDITION. (2003)\nISBN-10: 0736693289; ISBN-13: 978-0736693288. Non-Fiction &gt; Law \n\n  In this intimate portrait of an institution, America's first female \nSupreme Court Justice traces the Court's history to its inner workings\nin contemporary life. By couching her narrative in her personal reflections,\nshe shows how landmark cases, key ideas, and influential people have \nbuilt the Court as an edifice that continues to demand active \ninterpretation. Her book particularly emphasizes the turbulent battle \nwomen have fought in the legal system since America's inception - her own\nposition an expression of the labors of the suffrage movement and its \nefforts to change the lives of American women in voting booths, jury boxes,\nand homes. One of the most powerful women in American history tells us\nwhat she thinks matters most in American law. \n\nCheers, FerraBit\nApril 2009\n\nLinks:\nhttp://en.wikipedia.org/wiki/Sandra_Day_O'Conner \n\nOriginally posted: thepiratebay, demoniod, mininova\n____________________________________________\n\n  From Publishers Weekly\nO'Connor, veteran associate justice of the U.S. Supreme Court, distills in this book the scores of talks she has given across the country and around the world in the 20 years since her accession to the high court. O'Connor, the author of the bestselling memoir Lazy B, is an enthusiast of the American legal system, reaching back to its origins in the Magna Carta and, later, in the English Privy Council, with its power to invalidate legislation. Declaring federal and state laws unconstitutional, of course, is the core of the Supreme Court's authority over this country's legal system, and O'Connor traces the exercise of that authority from the era of Chief Justice John Marshall to Brown v. Board of Education. In other chapters, O'Connor profiles Supreme Court titans such as Holmes and Taft, and reviews the long struggle to gain for women the right to vote. Elsewhere, the author suggests reforms for the jury system, extols the benefits of an independent judiciary and offers a graceful tribute to Justice Thurgood Marshall. Canons of ethics prohibit judges from public comment on controversial matters likely to arise in their future cases, and a Supreme Court justice cannot reveal the dynamics of the Court's deliberations. These rules of discretion pervade O'Connor's book. Divisive (and provocative) issues such as abortion, the death penalty or affirmative action are addressed only in the broadest possible generalities. Purged of controversy, O'Connor's book is an engagingly written civics lesson, delivering a warm appreciation of legal history and principles but little light on the issues the Supreme Court confronts today. Copyright 2003 Reed Business Information, Inc. --This text refers to an out of print or unavailable edition of this title. \n\n  From School Library Journal\nAdult/High School-Justice O'Connor gives a history of the U.S. judicial system with an emphasis on how the Supreme Court evolved into its present form. For students only dimly aware of the court through a basic civics class and the occasional sensational case highlighted by the media, this title will prove to be enlightening. The book takes on a conversational tone, and it's easy to imagine oneself in a university lecture hall with O'Connor as the (usually) fascinating professor who has her feet firmly planted in the real world. To get the most out of the book, it should be read cover to cover. However, it is also useful for readers who wish commentary on particular aspects of the Supreme Court, historical cases, or personalities. The tone is even, and O'Connor has a kind and often complimentary attitude toward fellow justices past and present. High points are her experiences working with Justice Thurgood Marshall, and her thoughts on women and the law. As a bonus, she includes a glimpse into her views on judicial systems of countries that are undergoing their own painful evolutions, such as the former Soviet bloc. All in all, this is a good book for readers who would like a personable introduction to one of our nation's most powerful institutions.\n\n","torrent":{"xt":"urn:btih:e82ce1722fc0d8a5c7e7463cd2ef0a38a0e6b4df","amp;dn":"THE+MAJESTY+OF+THE+LAW+-+Sandra+Day+O%5C%27Connor.+%7BFerraBit%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e82ce1722fc0d8a5c7e7463cd2ef0a38a0e6b4df","infoHashBuffer":{"type":"Buffer","data":[232,44,225,114,47,192,216,165,199,231,70,60,210,239,10,56,160,230,180,223]},"announce":[],"urlList":[]}}