{"title":"Radiohead - My Iron Lung [promo].VOB","uid":10394913,"size":326768640,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e832c36370eb6cab073abbb439051389ab7a8c29&amp;dn=Radiohead+-+My+Iron+Lung+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1403256108,"description":"Radiohead - My Iron Lung [promo].VOB\n\n\nHQ rare promo music video from a promo DVD. My Iron Lung is the third extended play (EP) by English alternative rock group Radiohead, released in October 1994. The title track later appeared on the band's second studio album The Bends (1995). The EP also contains outtakes from then ongoing recording sessions for The Bends, compiling songs that were issued as B sides on two separate &quot;My Iron Lung&quot; CD singles in the UK and other markets. My Iron Lung was originally released in EP form with all eight songs only in Australia, but it is currently in print worldwide.\n\nThe record is seen as a bridge between the relative simplicity of their 1993 debut album Pablo Honey, and the greater sonic depth of Radiohead's later work, beginning with The Bends. The &quot;My Iron Lung&quot; single charted at number 24 in the UK. It received little radio or MTV attention in the United States.\n\nThe song &quot;My Iron Lung&quot; was recorded live, in the same 1994 London concert filmed for Live at the Astoria, with only singer Thom Yorke later overdubbed. The song as it appears on the 1994 singles/EP is virtually identical to the version that appeared the next year on The Bends, with only some barely audible changes in mixing levels.\n\n&quot;My Iron Lung&quot; was Radiohead's reaction to &quot;Creep&quot;, their massive hit of 1993 which also became something of a millstone for Yorke. The song's caustic, self reflexive lyrics used the iron lung as a metaphor for the way &quot;Creep&quot; had both sustained the band's life and constrained them (&quot;this is our new song / just like the last one / a total waste of time / my iron lung&quot;). An acoustic version of &quot;Creep&quot; itself appears at the end of the EP.\n\nRadiohead are an English rock band from Abingdon, Oxfordshire, formed in 1985. The band consists of Thom Yorke (lead vocals, guitar, piano), Jonny Greenwood (lead guitar, keyboards, other instruments), Colin Greenwood (bass), Phil Selway (drums, percussion), and Ed O'Brien (guitar, backing vocals).\n\nRadiohead released their debut single &quot;Creep&quot; in 1992. The song was initially unsuccessful, but it became a worldwide hit several months after the release of their debut album, Pablo Honey (1993). Radiohead's popularity rose in the United Kingdom with the release of their second album, The Bends (1995). Radiohead's third album, OK Computer (1997), propelled them to greater international fame. Featuring an expansive sound and themes of modern alienation, OK Computer is often acclaimed as one of the landmark records of the 1990s.[\n\nRadiohead have sold more than 30 million albums worldwide, with the band's work being placed highly in both listener polls and critics' lists; they have the distinction of doing so in both the 1990s and 2000s. In 2005, Radiohead were ranked number 73 in Rolling Stone's list of &quot;The Greatest Artists of All Time&quot;, while Jonny Greenwood (48th) and Ed O'Brien were both included in Rolling Stone's list of greatest guitarists, and Thom Yorke (66th) in their list of greatest singers. In 2009, Rolling Stone readers voted the group the second best artist of the 2000s.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/My_Iron_Lung&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/My_Iron_Lung&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/PAOEoAafn&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/PAOEoAafn&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x576 (4:3) 25fps 9800kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD, 16 bit]\n   Duration: 00:04:37\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.5\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:e832c36370eb6cab073abbb439051389ab7a8c29","amp;dn":"Radiohead+-+My+Iron+Lung+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e832c36370eb6cab073abbb439051389ab7a8c29","infoHashBuffer":{"type":"Buffer","data":[232,50,195,99,112,235,108,171,7,58,187,180,57,5,19,137,171,122,140,41]},"announce":[],"urlList":[]}}