{"title":"[FSX] Aerosoft - German Airports 1: Friedrichshafen","uid":7064347,"size":120591235,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e861154dd0aa46342d9a4bf84bfba2adb4068718&amp;dn=%5BFSX%5D+Aerosoft+-+German+Airports+1%3A+Friedrichshafen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_SnakEye","files":1,"time":1330463659,"description":"he next airport of German Airports 1 is now &quot;ready for departure&quot; in Microsoft Flight Simulator. In good tradition, the award winning German Airports team provides this scenery of Friedrichshafen airport in a stunning quality.\nThis add-on of Friedrichshafen airport represents the latest status of development of the real airport. The buildings, the layout of the runways and taxiways as well as the Navaids are exactly as they are in reality.\nA photo real ground texture has been used for the base of the scenery to ensure a real life feeling of the airport. The terrain has been edited to be compatible with other add-ons. One of many highlights of this scenery are the Dynamic Airport Enhancement Services AESLite which brings a near to life virtual reality into the scenery with its vehicles on the apron and on the near motorways!\n \nMany years of experience in creating virtual airport sceneries have once again paid off and can be seen in the new masterpiece of Friedrichshafen Airport which not only convinces with its rich details but also with a terrific frame rate.\nFeatures:\n Detailed representation of the airport and close surroundings, incl. important objects\n High resolution photorealistic ground textures, based on aerial images\n Authentic 3D models of all airport buildings and facilities\n Including all navaids (ILS,VOR/DME,NDB,ATIS)\n Amazing night effects\n Fully acurate runway and taxiway lights\n Dynamic vehicles on the aprons and motorways by AESLite\n Compatible with AES (Airport Enhancement Services) \n Many scenery effects\n Seasonal ground textures\n Complete manual (German, English) with additional information about the airport","torrent":{"xt":"urn:btih:e861154dd0aa46342d9a4bf84bfba2adb4068718","amp;dn":"%5BFSX%5D+Aerosoft+-+German+Airports+1%3A+Friedrichshafen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e861154dd0aa46342d9a4bf84bfba2adb4068718","infoHashBuffer":{"type":"Buffer","data":[232,97,21,77,208,170,70,52,45,154,75,248,75,251,162,173,180,6,135,24]},"announce":[],"urlList":[]}}