{"title":"The Hooters - 1989 - Zig Zag","uid":8632099,"size":303928421,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e9632069843b7ffc0224770c510bf6149c87fb31&amp;dn=The+Hooters+-+1989+-+Zig+Zag&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":17,"time":1372654912,"description":"This is the same torrent that was uploaded to Demonoid in September 2011.\n\n\nThe Hooters - Zig Zag (1989)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/412B7MXETZL._SL500_AA300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/412B7MXETZL._SL500_AA300_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nDVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nAMG Bio.txt\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nFirst biography paragraph from All Music (by Jason Ankeny):\n\nBest remembered for a string of mid-'80s hits including the MTV staple &quot;And We Danced,&quot; Philadelphia rockers the Hooters were led by singer/keyboardist Rob Hyman and singer/guitarist Eric Bazilian, whose longtime creative partnership also yielded hits for artists including Cyndi Lauper and Joan Osborne. Hyman and Bazilian first teamed in the group Baby Grand, which also included future producer Rick Chertoff; after a pair of LPs for Arista, the band dissolved in 1978, with the Hooters forming soon after. Also including guitarist John Lilley, bassist Rob Miller, and drummer David Uosikkinen, the group honed an eclectic blend of rock, folk, and ska, taking their name from the melodica, or &quot;hooter,&quot; which lent their sound its distinctive edge; while the Hooters earned a devoted cult following at home in Philadelphia, Hyman and Bazilian also enjoyed busy careers as composers and session players, most notably contributing extensively to Cyndi Lauper's 1983 blockbuster She's So Unusual. The album was produced by Chertoff, who co-wrote the oft-covered ballad &quot;Time After Time&quot; with Hyman.\n\nRead all of the bio at: &lt;a href=&quot;\nhttp://www.allmusic.com/artist/the-hooters-p4510/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/artist/the-hooters-p4510/biography&lt;/a&gt;\n\nAll Music Album Review (by Mark W.B. Allender):\n\nThis release shows the Hooters trying to modernize their sound from the over-romantic power pop of their previous efforts (e.g., &quot;And We Danced&quot;): a little more dirt, a little less gloss, a little more personal expression. The songwriting has gotten better in places here as well, still delivering infectious pop hooks with more sophisticated lyrics particularly on songs like &quot;Brother, Don't You Walk Away,&quot; &quot;You Never Know Who Your Friends Are,&quot; and &quot;Deliver Me.&quot;  They do go over the top with the heavy metal ballads so popular in the late '80s; &quot;Always a Place&quot; and &quot;Give the Music Back&quot; reek of over-sentimentality. And &quot;Mr. Big Baboon&quot; has got to be one of the most stupid songs to come out of 1989.  The white reggae version of &quot;500 Miles&quot; featuring Peter, Paul, and Mary -- a very uncharacteristic Hooters tune -- alone makes the record worthwhile, however. They still show off their non-traditional auxiliary instrumentation in places: mandolin, accordion, harmonium, this time with a little more class.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/album/zig-zag-r9506&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/album/zig-zag-r9506&lt;/a&gt;\n\nAmazon.com's page: &lt;a href=&quot; http://www.amazon.com/dp/B0000026RW&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B0000026RW&lt;/a&gt;\n\nTrack List:\n\n01. Brother, Don't You Walk Away\n02. Deliver Me\n03. 500 Miles\n04. You Never Know Who Your Friends Are\n05. Heaven Laughs\n06. Don't Knock It 'til You Try It\n07. Give The Music Back\n08. Always A Place\n09. Mr. Big Baboon\n10. Beat Up Guitar\n\n","torrent":{"xt":"urn:btih:e9632069843b7ffc0224770c510bf6149c87fb31","amp;dn":"The+Hooters+-+1989+-+Zig+Zag","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9632069843b7ffc0224770c510bf6149c87fb31","infoHashBuffer":{"type":"Buffer","data":[233,99,32,105,132,59,127,252,2,36,119,12,81,11,246,20,156,135,251,49]},"announce":[],"urlList":[]}}