{"title":"StrapOnSquad - Fucking Machine Lesbian Domination for Layla Pric","uid":15116339,"size":1434193272,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:e987420150de93a02af24519c8d46d198dae684b&amp;dn=StrapOnSquad+-+Fucking+Machine+Lesbian+Domination+for+Layla+Pric&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"merzedes","files":1,"time":1467050402,"description":"StrapOnSquad - Fucking Machine Lesbian Domination for Layla Price with Isa Mendez and\r\n\r\n\r\nFucking Machine Lesbian Domination for Layla Price with Isa Mendez &amp; June 24, 2016\r\n\r\nDescription: Mean and sultry BDSM Mistresses Isa Mendez and _ have brought back sub slut Layla Price. She was such a obedient and strong sex slave, gladly taking everything she was given. Isa and _ want more. That's all it takes around here for a lesbian domination threesome. Layla Price ends up on a crate, frozen in bondage, hands tied down by her side, legs kept open for the fucking machine Isa and _ brought for their slut. They attached a thick long dildo to open her up. _ enters the dungeon and flips on the machine while Isa introduces Layla to her big black strapon dildo again, deep down her throat, fucking her brain in! _ raises the speed and joins Isa in feeding layla another 10&quot; big black rubber dick. The Mistresses take turns turning the nob up, distracting Layla from taking strapon cock face fucking. The machine is taken away, yet Layla is kept in place. Isa and _ inspect their sex slave's pussy and asshole, pleased to see pretty pink. Their black rubber dicks bust her pink pussy wide open. Double penetration pushes her limits. She orgasms constantly. This curious girl, with her Mistresses training, is becoming a sex slave to keep around, following every order, taking every inch of cock, rough and deep. Layla's one problem is she didn't ask permission to cum, squirting all over herself. If she wants to cum, she'll cum over and over, one after another. \r\n   \r\n Screens\r\n \nhttp://www.straponsquad.com/t2/show.php?a=1970_1&amp;nats=typein.4.84.232.0.0.0.0.0\r\n\r\n Uploaded by Merzedes and Shallow2\r\n\r\n 21 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\n Just keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\n Also, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\n Any Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n\r\n Cheers :-)","torrent":{"xt":"urn:btih:e987420150de93a02af24519c8d46d198dae684b","amp;dn":"StrapOnSquad+-+Fucking+Machine+Lesbian+Domination+for+Layla+Pric","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e987420150de93a02af24519c8d46d198dae684b","infoHashBuffer":{"type":"Buffer","data":[233,135,66,1,80,222,147,160,42,242,69,25,200,212,109,25,141,174,104,75]},"announce":[],"urlList":[]}}