{"title":"call of cthulhu (2005)","uid":4482332,"size":781682688,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ea06e161a1e05d0d13a2b98c4adb11de8eaefdff&amp;dn=call+of+cthulhu+%282005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"newgypsy","files":1,"time":1225584331,"description":"The Call of Cthulhu is HP Lovecraft&amp;#039;s most famous story. It is the only story to feature the celebrated monster Cthulhu and in many ways it encapsulates the ideas that went on to permeated Lovecraft&amp;#039;s Cthulhu Mythos. The film follows the story&amp;#039;s three-part narrative construction, and it moves from the 1920s to 1908 to the1870s and back, as the story does. The story embodies HPL&amp;#039;s nihilistic world view, his cosmic perspective, and his sense that mankind is doomed by its own insignificance. And it&amp;#039;s a pretty good globe-trotting adventure story.\n\nThis is the best adaptation of any H.P. Lovecraft movie ever made, either by fans or big studio. It&amp;#039;s a silent movie, done in a style that makes it look almost as if truly made long years ago.\n\nThe script comes directly from the Call of Cthulhu story, with virtually no alterations whatsoever.\n\nIt has been done to look as an old movie (from the times when Lovecraft was alive), so the F/X department are appropriately rudimentary or done in modern media to replicate the original ones.\n\nDirect influences to the style are Metropolis, Faust, and Nosferatu; 3 great silent movies. ( taken from http://www.imdb.com/title/tt0478988/)","torrent":{"xt":"urn:btih:ea06e161a1e05d0d13a2b98c4adb11de8eaefdff","amp;dn":"call+of+cthulhu+%282005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea06e161a1e05d0d13a2b98c4adb11de8eaefdff","infoHashBuffer":{"type":"Buffer","data":[234,6,225,97,161,224,93,13,19,162,185,140,74,219,17,222,142,174,253,255]},"announce":[],"urlList":[]}}