{"title":"Deliver Us from Evil: The Slavery Question in the Old South by L","uid":10770737,"size":3933676,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eaa00806820172af0f91fcca8f58d5b25ca00438&amp;dn=Deliver+Us+from+Evil%3A+The+Slavery+Question+in+the+Old+South+by+L&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Sunghabib","files":-1,"time":1408072137,"description":"Book Description:\n\nA major contribution to our understanding of slavery in the early republic, Deliver Us from Evil illuminates the white South's twisted and tortured efforts to justify slavery, focusing on the period from the drafting of the federal constitution in 1787 through the age of Jackson.\n\nDrawing heavily on primary sources, including newspapers, government documents, legislative records, pamphlets, and speeches, Lacy K. Ford recaptures the varied and sometimes contradictory ideas and attitudes held by groups of white southerners as they tried to square slavery with their democratic ideals. He excels at conveying the political, intellectual, economic, and social thought of leading white southerners, vividly recreating the mental world of the varied actors and capturing the vigorous debates over slavery. He also shows that there was not one antebellum South but many, and not one southern white mindset but several, with the debates over slavery in the upper South quite different in substance from those in the deep South. In the upper South, where tobacco had fallen into comparative decline by 1800, debate often centered on how the area might reduce its dependence on slave labor and &quot;whiten&quot; itself, whether through gradual emancipation and colonization or the sale of slaves to the cotton South. During the same years, the lower South swirled into the vortex of the &quot;cotton revolution,&quot; and that area's whites lost all interest in emancipation, no matter how gradual or fully compensated.\n\nAn ambitious, thought-provoking, and highly insightful book, Deliver Us from Evil makes an important contribution to the history of slavery in the United States, shedding needed light on the white South's early struggle to reconcile slavery with its Revolutionary heritage.\n\nProduct Details:\n\nPaperback: 688 pages\nPublisher: Oxford University Press; Reprint edition (November 1, 2011)\nLanguage: English\nISBN-10: 0199832439\nISBN-13: 978-0199832439\n\n\n-------\nSeed - Share - Enjoy - Give me Thumbs Up\n-------","torrent":{"xt":"urn:btih:eaa00806820172af0f91fcca8f58d5b25ca00438","amp;dn":"Deliver+Us+from+Evil%3A+The+Slavery+Question+in+the+Old+South+by+L","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eaa00806820172af0f91fcca8f58d5b25ca00438","infoHashBuffer":{"type":"Buffer","data":[234,160,8,6,130,1,114,175,15,145,252,202,143,88,213,178,92,160,4,56]},"announce":[],"urlList":[]}}