{"title":"Radiohead - Creep [uncensored promo].VOB","uid":10466362,"size":238710784,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:eaac74ebd05ce9ce06406b775ca90961a0a8d241&amp;dn=Radiohead+-+Creep+%5Buncensored+promo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1404201202,"description":"Radiohead - Creep [uncensored promo].VOB\n\n\nVery HQ rare uncensored promo music video from a promo DVD. &quot;Creep&quot; is a song by the English alternative rock band Radiohead. Radiohead released &quot;Creep&quot; as their debut single in 1992, and it later appeared on their first album, Pablo Honey (1993). During its initial release, &quot;Creep&quot; was not a chart success. However, upon re-release in 1993, it became a worldwide hit. Attendees of Radiohead's early gigs often exhibited little interest in the band's other songs, causing the band to react against &quot;Creep&quot; and play it less often during the mid-to-late 1990s. In 1998, halfway through their OK Computer tour, the band dropped the song from set lists altogether. &quot;Creep&quot; was not played live again until 2001, but it has since reappeared several times on the band's live sets. \n\nAccording to Radiohead bassist Colin Greenwood, Thom Yorke wrote &quot;Creep&quot; while studying at Exeter University in the late 1980s. Guitarist Jonny Greenwood said the song was inspired by a girl that Yorke had followed around who showed up unexpectedly during a show by the band.\n\nIn 1992 during rehearsal sessions with producers Sean Slade and Paul Q. Kolderie, Radiohead spontaneously performed &quot;Creep&quot;. Yorke described &quot;Creep&quot; to the producers as &quot;our Scott Walker song&quot;; Slade and Kolderie mistook the singer's remark and believed the song was a cover. After tension arose due to unsatisfactory attempts at recording other songs, Slade and Kolderie tried to improve morale by requesting Radiohead to play &quot;Creep&quot; again. The band recorded the song in a single take; after the performance everyone in the room burst into applause. Once the band assured Kolderie that &quot;Creep&quot; was an original song, he called EMI to tell them to consider the song as Radiohead's next single. While the recording had minimal overdubs and the band did not intend to release it, the producers were impressed with the song.\n\n\nRadiohead are an English rock band from Abingdon, Oxfordshire, formed in 1985. The band consists of Thom Yorke (lead vocals, guitar, piano), Jonny Greenwood (lead guitar, keyboards, other instruments), Colin Greenwood (bass), Phil Selway (drums, percussion), and Ed O'Brien (guitar, backing vocals).\n\nRadiohead released their debut single &quot;Creep&quot; in 1992. The song was initially unsuccessful, but it became a worldwide hit several months after the release of their debut album, Pablo Honey (1993). Radiohead's popularity rose in the United Kingdom with the release of their second album, The Bends (1995). Radiohead's third album, OK Computer (1997), propelled them to greater international fame. Featuring an expansive sound and themes of modern alienation, OK Computer is often acclaimed as one of the landmark records of the 1990s.[\n\nRadiohead have sold more than 30 million albums worldwide, with the band's work being placed highly in both listener polls and critics' lists; they have the distinction of doing so in both the 1990s and 2000s. In 2005, Radiohead were ranked number 73 in Rolling Stone's list of &quot;The Greatest Artists of All Time&quot;, while Jonny Greenwood (48th) and Ed O'Brien were both included in Rolling Stone's list of greatest guitarists, and Thom Yorke (66th) in their list of greatest singers. In 2009, Rolling Stone readers voted the group the second best artist of the 2000s.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Creep_(Radiohead_song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Creep_(Radiohead_song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/kaPdBAaFA&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/kaPdBAaFA&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x576 (4:3) 25fps 8000kbps\n   Audio: MPEG Digital Audio 48000Hz stereo 192kbps\n   Duration: 00:03:57\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.5\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:eaac74ebd05ce9ce06406b775ca90961a0a8d241","amp;dn":"Radiohead+-+Creep+%5Buncensored+promo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eaac74ebd05ce9ce06406b775ca90961a0a8d241","infoHashBuffer":{"type":"Buffer","data":[234,172,116,235,208,92,233,206,6,64,107,119,92,169,9,97,160,168,210,65]},"announce":[],"urlList":[]}}