{"title":"Brooke Shields - Down Came the Rain - My Journey Through Postpar","uid":5306393,"size":149168648,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:eb882ec539ad9866bb30dc883aa93938c490a500&amp;dn=Brooke+Shields+-+Down+Came+the+Rain+-+My+Journey+Through+Postpar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"arzendiq","files":62,"time":1264407155,"description":"Down Came the Rain - My Journey Through Postpartum Depression\n\nby Brooke Shields\n\nWhen Brooke Shields welcomed her newborn daughter, Rowan Francis Henchy, into the world, something unexpected followed -- a crippling depression. Now, for the first time, Brooke talks about the trials, tribulations, and finally the triumphs that occurred before, during, and after the birth of her daughter.\n\nIn what sill strike a chord with millions of women, Brooke Shields openly shares the story of how she battled a condition that is widely misunderstood, despite the fact it affects one in ten new mothers She discusses the illness in the context of her own life, including her struggle to get pregnant; the high expectations she had for herself and that society as well as others placed on her as a new mom; and the roles her husband, friends, and family played as she struggled to attain her maternal footing in the midst of severe postpartum depression And, ultimately, Brooke tells how she found a way out through talk therapy, medication, and time.\n\nBrooke has grown up  in the public eye, but this is the story of what happened to the private woman, the one the world hasn't seen before With intelligence, humor, and startling honesty, Brook speaks directly to the listener, making us feel close to her experience, her pain,  and her ultimate triumph.\n\n6 hours. Abridged. Read by the author.\n\n64 kbps Ogg Vorbis","torrent":{"xt":"urn:btih:eb882ec539ad9866bb30dc883aa93938c490a500","amp;dn":"Brooke+Shields+-+Down+Came+the+Rain+-+My+Journey+Through+Postpar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb882ec539ad9866bb30dc883aa93938c490a500","infoHashBuffer":{"type":"Buffer","data":[235,136,46,197,57,173,152,102,187,48,220,136,58,169,57,56,196,144,165,0]},"announce":[],"urlList":[]}}