{"title":"SCHLONDORFF - The Lost Honor of Katharina Blum (1975) CRITERION","uid":4174873,"size":939591459,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ebdd8b903fcbb58378169b2f40ce2ba26215893f&amp;dn=SCHLONDORFF+-+The+Lost+Honor+of+Katharina+Blum+%281975%29+CRITERION&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"zeinabqureshi","files":4,"time":1210069257,"description":"The Lost Honour of Katharina Blum (1975)\nVolker Schlondorff, Margarethe von Trotta\nRip# 10, Criterion Spine# 177\nIMDb Link: http://www.imdb.com/title/tt0073858/\n\n---=Notes=----------------------------------------------------------------------\n\nWith this movie, all films in the Criterion Collection by Volker Schlondorff is now available on BitTorrent.\nThe films are\n\tDie Blechtrommel (The Tin Drum, 1979), available on tpb and on various other trackers\n\tDie Junge Torless (Young Torless, 1966), my upload, on tpb\n\tDer Fangschuss (Coup de Grace, 1976), my upload, on tpb\n\tVerlorene Ehre der Katharina Blum (The Lost Honour of Katharina Blum, 1975), my upload, tpb\n\t\n\t**\n\t\nThis wonderful movie never quite shows its age; it is hard to believe that this is more than 33 years old. The main theme - the invasion of private lives by the media - is as relevant today as in 1975. The destructive erosion of personal lives by the media - here, the newspaper - is brilliantly shown. Though often compared to the film Network, the two are not similar in any way at all. This film is political, while the other is merely about the dynamics of the broadcasting (telecasting) industry.   \n\nIt is an adaptation of the novel written by Heinrich Boll.\n\n---=Wiki=-----------------------------------------------------------------------\nThe Lost Honour of Katharina Blum is a 1975 film adaptation by Volker Schlondorff and Margarethe von Trotta of the novel of the same name by Heinrich Boll. The title character is an innocent housekeeper whose life is ruined by an invasive tabloid reporter and a police investigation when the man with whom she has just fallen in love turns out to be a radical bank robber. The film stars Angela Winkler as Blum, Mario Adorf as Kommissar Beizmenne, Dieter Laser as Totges, and JÃƒÂ¼rgen Prochnow as Ludwig.\n\nThe film, unlike the novel, ends with a scene at Totges' funeral, with his publisher delivering a hypocritical condemnation of the murder as an infringement on the freedom of the press.\n\nIn interviews for the 2003 Criterion Collection DVD release of the film, Schlondorff and other crew members argue for the film's continued relevance today, drawing an analogy between the political climate of panic over terrorism in 1970s West Germany and the post-September 11, 2001 situation in the U.S.\n\n---=AMG=------------------------------------------------------------------------\nThe Lost Honor of Katharina Blum marks the directorial debut for actress Margarethe von Trotta, who co-directed the film with her then-husband Volker SchlÃƒÂ¶ndorff. At a costume party, Katharina Blum (Angela Winkler) meets Ludwig Goetten (JÃƒÂ¼rgen Prochnow ) and spends the night with him. The next morning, he's gone and the police bust into her apartment looking for him with the belief that he is a dangerous terrorist. She is taken into police custody and interrogated by Kommissar Beizmenne (Mario Adorf), who questions her about her every action. Meanwhile, sleazy reporter Werner Toetges (Dieter Laser) makes her story into a scandal in the papers by writing sensational stories about her personal life and portraying her as a criminal in photos. He exaggerates the testimonies of her ex-husband, neighbors, and even her elderly mother who is dying of cancer in an intensive care hospital. With the fear-induced public thinking she is a Communist and terrorist sympathizer, Katharina receives hate mail and personal threats until she is finally driven over the edge.\n\n---=Rip Info=-------------------------------------------------------------------\n\t---=Audio=-------------------------------------\n\t0x0055 MPEG-1 Layer 3\n\t48000Hz  128 kb/s tot , Joint Stereo \n\tInterleave: 83 ms\n\n\t---=Video=-------------------------------------\n\t688 x 400 @ 23.976 fps, XviD\n\t1:46:12, 152,760 frames\n\tQf 0.158/1043 kbps\n\n\t---=Size=--------------------------------------\n\t938,749,952 (152,760 frames)\n\n\t---=Subtitles=---------------------------------\n\tSRT in English included.\n\tOriginal SUB/IDX included in rar file.\n\t\n\t---=Credits=-----------------------------------\n\tThanks to Tansir and friends at DVD World\n\t\n*********************************** FREAKYFLICKS ************************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'","torrent":{"xt":"urn:btih:ebdd8b903fcbb58378169b2f40ce2ba26215893f","amp;dn":"SCHLONDORFF+-+The+Lost+Honor+of+Katharina+Blum+%281975%29+CRITERION","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebdd8b903fcbb58378169b2f40ce2ba26215893f","infoHashBuffer":{"type":"Buffer","data":[235,221,139,144,63,203,181,131,120,22,155,47,64,206,43,162,98,21,137,63]},"announce":[],"urlList":[]}}