{"title":"Electric Wiring Domestic, 12th Ed  UK (Malestrom)","uid":4718372,"size":2091636,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ebee432306ae88ff6a7263d2b7a84a665d4c2d43&amp;dn=Electric+Wiring+Domestic%2C+12th+Ed++UK+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1234388678,"description":" &lt;a href=&quot;http://www.image-upload.net/images/t6j8qmfepzo2h81rnp.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/t6j8qmfepzo2h81rnp.jpeg&lt;/a&gt;\n\nBrian Scaddan, &quot;Electric Wiring: Domestic, 12 Ed&quot;\nNewnes | 2003-04 | ISBN: 0750659157 | 128 pages | PDF \n\nElectric Wiring Domestic is the definitive guide to home wiring to professional standards. This makes it ideal for serious DIY work, especially for letting or resale, and essential reading for professionals who are not trained electricians, undertaking the wiring work involved in plumbing, central heating, security alarms, television and aerial installation, and telephone installation. The handy format and clear, straightforward text have also made this book popular as a quick reference source for electricians.\n\nElectric Wiring Domestic has been in print continuously since 1940. The twelfth edition has been updated in line with the latest versions of the IEE Wiring Regulations (BS 7671:2001) and includes a new chapter on bathroom wiring and a useful Appendix covering basic electrical facts and formula.\n\nBrian Scaddan is a Chief Examiner and Honorary Member of City and Guilds. He has over 30 years' experience in Further Education and professional training, and is now Director of Brian Scaddan Associates, Engineering Training Consultants. He is a leading author of books on electrical installation, inspection and testing, including IEE Wiring Regulations: Explained and Illustrated and Electrical Installation Work.\n\n* The how-to-guide for home wiring to professional standards\n* Essential reading for serious DIY, electrical installation, plumbing, heating systems, TV and security alarm installation\n* Fully in line with the latest UK IEE Wiring Regulations (BS 7671:2001) ","torrent":{"xt":"urn:btih:ebee432306ae88ff6a7263d2b7a84a665d4c2d43","amp;dn":"Electric+Wiring+Domestic%2C+12th+Ed++UK+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebee432306ae88ff6a7263d2b7a84a665d4c2d43","infoHashBuffer":{"type":"Buffer","data":[235,238,67,35,6,174,136,255,106,114,99,210,183,168,74,102,93,76,45,67]},"announce":[],"urlList":[]}}