{"title":"Evil Dead The Musical 2007 Original Cast Recording","uid":3793190,"size":62797667,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ebf76fd38bed2995e9cbbc06e2f3b5ab45639187&amp;dn=Evil+Dead+The+Musical+2007+Original+Cast+Recording&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Berserkr-ca","files":26,"time":1188758871,"description":"Based on Sam Raimi?s 80s cult classic films, Evil Dead tells the tale of 5 college kids who travel to a cabin in the woods and accidentally unleash an evil force. And although it may sound like a horror, its not! The songs are hilariously campy and the show is bursting with more farce than a Monty Python skit. From rave reviews and standing ovations in New York and Montreal this uproarious show is now thrilling them in Toronto. Join us!\n\nEVIL DEAD: THE MUSICAL, co-directed by Canada?s Christopher Bond and TonyÂ® Award winner Hinton Battle, is produced by Jeffrey Latimer Entertainment and the Diesel Playhouse.\n\nWhile the title may convey horror - fans, critics and audiences alike are calling it an uproariously funny musical comedy. Based on Sam Raimi?s 80s cult-classic horror films, EVIL DEAD: THE MUSICAL unearths the old familiar story: boy and friends take a weekend getaway at abandoned cabin, boy expects to get lucky, boy unleashes ancient evil spirit, friends turn into Candarian Demons, boy fights until dawn to survive. As musical mayhem descends upon this sleepover in the woods, ?camp? takes on a whole new meaning with uproarious numbers like ?All the Men in my Life Keep Getting Killed by Candarian Demons,? ?Look Who?s Evil Now? and ?Do the Necronomicon.?\n\nEVIL DEAD: THE MUSICAL first glimpsed the light of day in Toronto, where early workshop engagements played to capacity and beyond. While mainstream audiences flocked to the show, diehard Evil Dead fans made pilgrimages from across North America to witness the birth of a new cult hit. The popular workshop production enjoyed two sold-out runs at Toronto?s Transac Club before heading off to Montreal, where EVIL DEAD: THE MUSICAL opened on July 2, 2004 at the Cabaret du Plateau as part of the 22nd Just For Laughs Festival. In the fall of 2006, EVIL DEAD: THE MUSICAL opened in New York Off-Broadway to rave reviews from both critics and audiences. The New York Times calls it ?The Next Rocky Horror Picture Show?, Variety says that it is ?A ridiculous amount of fun!? and Hollywood Reporter concludes that it is ?Silly, fun?.and not terrifying at all.? The New York Production was produced by Just For Laughs Live, Jenkay LLC, Bill Franzblau and Jeffrey Latimer Entertainment.\n\nDirected by Christopher Bond and three-time TonyÂ® Award-winner Hinton Battle (Miss Saigon, The Tap Dance Kid, Sophisticated Ladies), EVIL DEAD: THE MUSICAL includes book and lyrics by George Reinblatt, music by Frank Cipolla, Christopher Bond, Melissa Morris and George Reinblatt with music supervision by Frank Cipolla, choreography by Hinton Battle and set design by TonyÂ® Award winner David Gallo (Drowsy Chaperone).\n &lt;a href=&quot;\nhttp://www.evildeadthemusical.com/album.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.evildeadthemusical.com/album.htm&lt;/a&gt;","torrent":{"xt":"urn:btih:ebf76fd38bed2995e9cbbc06e2f3b5ab45639187","amp;dn":"Evil+Dead+The+Musical+2007+Original+Cast+Recording","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebf76fd38bed2995e9cbbc06e2f3b5ab45639187","infoHashBuffer":{"type":"Buffer","data":[235,247,111,211,139,237,41,149,233,203,188,6,226,243,181,171,69,99,145,135]},"announce":[],"urlList":[]}}