{"title":"Sixpence None The Richer - Divine Discontent (2002)","uid":4157213,"size":54189771,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:eca708b56af1b646f1ef245a701573c8acdc3bb1&amp;dn=Sixpence+None+The+Richer+-+Divine+Discontent+%282002%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"absolutefun","files":15,"time":1209206271,"description":"Sixpence None The Richer: Leigh Nash (vocals); Matt Slocum (guitar, E-bow, cello, keyboards, vibraphone); Sean Kelly (guitar); Jerry Dale McFadden (piano, Hammond B-3 organ, Mellotron); Justin Cary (bass); Dale Baker, Rob Mitchell (drums, percussion).\n\nAdditional personnel includes: Bruce Dukov, Eve Butler, Mario De Leon, Peter Kent, Brian Leonard, Bob Peterson, Rachel Purkin, John Wittenberg, Rick Todd, Suzie Katayama.\n\nProducers: Paul Fox, Matt Slocum, Rob Cavallo.\n\nGenre: Rock/Pop, Rock, Pop, Alternative, Christian, Christian Rock\n\nOriginal Year: 2002\n\nRecorded at Ocean Way Recording, Nashville, Tennessee and at Record One, Sherman Oaks, California.\n\nAustin, TX's Sixpence None The Richer have traveled a rather unusual path. After two mid-'90s records, the openly Christian band had a sizeable cult following in the secular world, much of it in the unlikely domain of indie-rock, before scoring a gargantuan teen-movie soundtrack aided pop hit in 1999 with &quot;Kiss Me,&quot; from the outfit's third release. Three years removed from the top of the charts, the group--centered around guitarist/songwriter Matt Slocum and the bewitching vocals of Leigh Nash--offer album #4, DIVINE DISCONTENT.\n\nThe passage of time has only shifted their Sundays-indebted sound slightly; it's a bit less mournful, a bit less orchestral, but still possessed of a balance between dark uncertainty and the hope omnipresent in their earlier work. Moreover, Sixpence still know how to craft songs that haunt the memory days after last hearing, like the opening track &quot;Breathe Your Name,&quot; which opens lightly before a crescendo into a rapturous hook. Of particular note is the cover of Crowded House's 1987 hit &quot;Don't Dream It's Over,&quot; on which Nash's otherworldly vocals transform the song into something original yet warmly familiar, which could be said of all of DIVINE DISCONTENT.\n(Source: cduniverse.com)\n\nTrack Listing:\n\n01 Breathe Your Name\n02 Tonight\n03 Down And Out Of Time\n04 Waiting On The Sun\n05 Still Burning\n06 Melody Of You\n07 Paralyzed\n08 I've Been Waiting\n09 Eyes Wide Open\n10 Dizzy\n11 Tension Is A Passing Note\n12 Million Parachute, A\n13 Don't Dream It's Over\n\n(Bitrate: 128 kbps)","torrent":{"xt":"urn:btih:eca708b56af1b646f1ef245a701573c8acdc3bb1","amp;dn":"Sixpence+None+The+Richer+-+Divine+Discontent+%282002%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eca708b56af1b646f1ef245a701573c8acdc3bb1","infoHashBuffer":{"type":"Buffer","data":[236,167,8,181,106,241,182,70,241,239,36,90,112,21,115,200,172,220,59,177]},"announce":[],"urlList":[]}}