{"title":"Game Theory - 2nd Edition - Hans Peters","uid":12008739,"size":6949139,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ed3baf2e173fb4a0fbeba7b6c72d482676e5cb05&amp;dn=Game+Theory+-+2nd+Edition+-+Hans+Peters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1434043091,"description":"This textbook presents the basics of game theory both on an undergraduate level and on a more advanced mathematical level. It is the second, revised version of the successful 2008 edition. The book covers most topics of interest in game theory, including cooperative game theory. Part I presents introductions to all these topics on a basic yet formally precise level. It includes chapters on repeated games, social choice theory, and selected topics such as bargaining theory, exchange economies, and matching. Part II goes deeper into noncooperative theory and treats the theory of zerosum games, refinements of Nash equilibrium in strategic as well as extensive form games, and evolutionary games. Part III covers basic concepts in the theory of transferable utility games, such as core and balancedness, Shapley value and variations, and nucleolus. Some mathematical tools on duality and convexity are collected in Part IV. Every chapter in the book contains a problem section. Hints, answers and solutions are included","torrent":{"xt":"urn:btih:ed3baf2e173fb4a0fbeba7b6c72d482676e5cb05","amp;dn":"Game+Theory+-+2nd+Edition+-+Hans+Peters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed3baf2e173fb4a0fbeba7b6c72d482676e5cb05","infoHashBuffer":{"type":"Buffer","data":[237,59,175,46,23,63,180,160,251,235,167,182,199,45,72,38,118,229,203,5]},"announce":[],"urlList":[]}}