{"title":"The Wooden Sky - If I Don't Come Home You'll Know I'm Gone [2009","uid":8250424,"size":286767502,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:edb78cf638e5af0d17632c6ccf0a337d7ce9b6a1&amp;dn=The+Wooden+Sky+-+If+I+Don%27t+Come+Home+You%27ll+Know+I%27m+Gone+%5B2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":20,"time":1363155032,"description":"Artist: The Wooden Sky\nRelease: If I Don't Come Home You'll Know I'm Gone\nDiscogs: 3261426\nReleased: 2009\nLabel: Black Box Recordings\nCatalog#: BBR015\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: Canada\nStyle: Rock, Alternative Rock, Indie Rock\n\nTracklisting:\n\n01. Oh My God (It Still Means A Lot To Me)\n02. (Bit Part)\n03. Angels\n04. My Old Ghosts\n05. Call If You Need Me\n06. When We Were Young\n07. An Evening Hymn\n08. Something Hiding For Us In The Night\n09. Oslo\n10. The Late King Henry\n11. Lock And Key\n12. Fairweather Friends\n13. River Song One\n\n\nLet's face it. Indie music that's based in roots or folk has become a pretty tired genre pretty quickly. For every Dr. Dog or Bright Eyes there are hundreds, if not thousands, of bland bands that add little artistically or entertainment-wise to the genre. What's a music fan to do?\n\nWell thankfully Toronto's own The Wooden Sky are here with an answer in the form of their new album If I Don't Come Home You'll Know I'm Gone (out August 25th). The Wooden Sky takes all the best elements of the indie roots/folk/country spectrum and adds in an assortment of other embellishments to create an innovative form of the genre.\n\nMany of the tracks on the record are rooted firmly in the traditional styles. The album opener, &quot;Oh My God (It Still Means A Lot To Me)&quot;, is well done standard alt.country, complete with banjo, harmonica, and lovely harmony vocals. The twangy lament quotient is filled by the Blue Rodeo-esque &quot;An Evening Hymn&quot;. We're treated to a tender duet with weeping guitars in &quot;Oslo&quot;. The band even gives us a dose of Drive-By Trucker-like indie Southern Rock with &quot;When We Were Young&quot;.\n\nWhere the band truly excels however is when they incorporate unexpected styles into their aural presentation. It's impossible to ignore The Animals' '60s psychedelic garage on &quot;Angels&quot;. &quot;My Old Ghosts&quot; starts as a Bright Eyes-soundalike until The Wooden Sky thunders down an art rock clatter. Similarly, &quot;Call If You Need Me&quot; begins as a pedestrian rootsy number before building into an Arcade Fire-style frenzy.\n\nBut there's yet another dimension to The Wooden Sky. It's the pop sensibility that's revealed on &quot;The Late King Henry&quot;, a song which boasts one of the most infectious singalongs in roots music in recent memory.\n\nIf I Don't Come Home You'll Know I'm Gone is a well-crafted piece of art that retains an impressive experimental soul.","torrent":{"xt":"urn:btih:edb78cf638e5af0d17632c6ccf0a337d7ce9b6a1","amp;dn":"The+Wooden+Sky+-+If+I+Don%27t+Come+Home+You%27ll+Know+I%27m+Gone+%5B2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edb78cf638e5af0d17632c6ccf0a337d7ce9b6a1","infoHashBuffer":{"type":"Buffer","data":[237,183,140,246,56,229,175,13,23,99,44,108,207,10,51,125,124,233,182,161]},"announce":[],"urlList":[]}}