{"title":"Batman - Arkham Asylum 15th Anniversary Edition (2004|Dgtl|SoU-E","uid":9538329,"size":599595219,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:eddc174373f2209aa856ef25661f44c5da9f37b1&amp;dn=Batman+-+Arkham+Asylum+15th+Anniversary+Edition+%282004%7CDgtl%7CSoU-E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"VikTSlick","files":1,"time":1390977880,"description":"For more information on this graphic novel, please visit the wikilink here: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Arkham_Asylum:_A_Serious_House_on_Serious_Earth&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Arkham_Asylum:_A_Serious_House_on_Serious_Earth&lt;/a&gt;\n\nSubtitled &quot;A Serious House on Serious Earth&quot;, Grant Morrison's Arkham Asylum is indeed true to its billing. First published in 1989, this seminal book examines the psychology of Batman and the super-villains he ends up dealing with on a regular basis - most notably The Joker. These themes presage similar elements that would end up as part of Morrison's famed Batman run much later. The story revolves around the inmates at Arkham taking over the Asylum - and inviting Batman to come join them for some &quot;fun&quot;. In parallel, we learn much more about Amadeus Arkham himself and the impetus for creating the infamous institution which is named for him. Morrison forces the reader to consider whether Batman himself is as equally insane as any of his enemies, while filtering in nightmarish imagery. Speaking of which, Dave McKean's art lends the whole affair a spooky, psychotic vibe - lines are not clearly defined and characters sometimes seem to melt into their backgrounds because of distortion. The Joker is rendered as a ghoul from the darkest depths of the imagining - shifting and changing perspective from panel-to-panel. Gaspar Saladino's lettering is right lauded for similar reasons - stretched and sprayed across the face of the page to symbolize madness. This is the 2004 15th Anniversary Edition, with many interesting additional notes by Morrison explaining some of the conceptual process. Thanks to Son of Ultron-Empire for this beautiful digital copy - if any book deserves to be rendered so cleanly, most certainly it is this. Please seed as always and...welcome to the madhouse! :-)\n\n(cue the Anthrax -      \n\n","torrent":{"xt":"urn:btih:eddc174373f2209aa856ef25661f44c5da9f37b1","amp;dn":"Batman+-+Arkham+Asylum+15th+Anniversary+Edition+%282004%7CDgtl%7CSoU-E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eddc174373f2209aa856ef25661f44c5da9f37b1","infoHashBuffer":{"type":"Buffer","data":[237,220,23,67,115,242,32,154,168,86,239,37,102,31,68,197,218,159,55,177]},"announce":[],"urlList":[]}}