{"title":"ZC.VideoConverter-4.0.5[Crack.Incl][Win.All]","uid":7768112,"size":17273199,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ee4fa7e3657b5479d340439c6b4bdf2c297ff5e0&amp;dn=ZC.VideoConverter-4.0.5%5BCrack.Incl%5D%5BWin.All%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":1,"time":1351438363,"description":"ZC Video Converter is a program for converting your favorite videos into formats supported by a number of devices, including the iPod and other mobile devices. If you need to convert your digital video files, this software can get the job done. The features of this video converter are quite basic and the interface proved very easy to navigate. All that you need to do is add an Input File to the list, select it, set the Output Format and Output Folder and then start converting. The conversion time depends on the file size, but you help decrease the time by going with a lower quality. Medium is the default and we found that this still produced a good quality video. There only appeared to be a very slight delay in the audio compared with the original file, but it was hardly noticeable. You can also burn existing DVD files with this software as well as edit a video clip. The editing features consist of cutting the start and finish time, cropping, and adding a watermark. Although most users won't need to crack open the Help file, it does give detailed instructions in case you run into trouble.","torrent":{"xt":"urn:btih:ee4fa7e3657b5479d340439c6b4bdf2c297ff5e0","amp;dn":"ZC.VideoConverter-4.0.5%5BCrack.Incl%5D%5BWin.All%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee4fa7e3657b5479d340439c6b4bdf2c297ff5e0","infoHashBuffer":{"type":"Buffer","data":[238,79,167,227,101,123,84,121,211,64,67,156,107,75,223,44,41,127,245,224]},"announce":[],"urlList":[]}}