{"title":"About Elly (Darbareye Elly - 2009) Retail (NL SUBS) vlinder TBS","uid":6149924,"size":8205333533,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ee7b42aaab4b69f0a5219fc743d87332aca412a3&amp;dn=About+Elly+%28Darbareye+Elly+-+2009%29+Retail+%28NL+SUBS%29+vlinder+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Vlinder2","files":-1,"time":1296844848,"description":"About Elly (Darbareye Elly - 2009) \n\nIran\nDrama\n119 minuten\n\ngeregisseerd door Asghar Farhadi\nmet Golshifteh Farahani, Taraneh Alidoosti en Marila Zare'i\n\n      \n\n \n  About Elly (Darbareye Elly - 2009) \nLiefhebbers van een avondje film, vergeet niet dat er nog tig andere films zijn en die om u aandacht schreeuwen. Kleine pareltjes die veel te goed zijn om in de anonimiteit te verzwelgen.\n\nDeze film geregisseerd door Asghar Farhadi, is de vierde film van Farhadi na &quot;Fireworks Wednesday&quot;. Deze film won de Zilveren Beer voor Beste Regisseur op het Filmfestival van Berlijn, en werd ook genomineerd voor 10 awards op het International Film Festival in Teheran, waar Farhadi de &quot;Crystal Symorgh&quot; won voor de beste regie. About Elly is ook de officiÃƒÂ«le inzending voor de Oscar, voor beste niet Engelstalige film.\n\nIn tegenstelling tot &quot;onze&quot; Carice van Houten werd de actrice Golshifteh Farahani nÃƒÂ­et door Ridley Scott uit de film Body of Lies geknipt. Ze was daarmee de eerste Iraanse ster die een rol speelde in een grote Hollywood productie. In haar thuisland werd haar verschijnen in Body of Lies haar niet in dank afgenomen: Farahani kreeg huisarrest en miste daardoor een auditie voor de vrouwelijke hoofdrol in Prince of Persia, in Londen. \n\n6 maanden lang mocht Farahani Iran niet uit. Zodra haar &quot;straf&quot; voorbij was, pakte ze haar biezen. Sindsdien woont ze in Parijs, waar ze kan doen en laten wat ze wil. De laatste film die Farahani in Iran maakte was deze prachtige film, &quot;About Elly'.\n\nDeze film laat zich niet eenvoudig in een hokje stoppen, en begint erg luchtig, met enkele komische momenten, waarna de sfeer al gauw een stuk grimmiger wordt. Drama en mysterie voeren vanaf dat moment de boventoon. Regisseur Farhadi trekt dan de diepte in en observeert vakkundig hoe vriendschappen gebukt kunnen gaan onder het al dan niet vertellen van de waarheid. Hij bouwt de film perfect op; juist door losjes en onschuldig te beginnen, komt de klap extra hard aan en is de sfeer in het tweede deel van de film zo beklemmend. De personages zijn realistisch en innemend en worden uitstekend geportretteerd.\n\nAsghar Farhadi heeft een fascinerende film gemaakt die je na verloop van tijd onder de huid gaat zitten. Het scenario zit ijzersterk in elkaar en wordt gedragen door een prima cast, met de talentvolle Golshifteh Farahani als absolute uitblinker. Typisch zo'n film die, nadat je hem gezien hebt, nog een tijdje blijft nasudderen. Farhadi begint steeds meer aanspraak te maken op een plekje in het rijtje illustere Iraanse filmmakers.\n\nAbout Elly speelt zich af in het hedendaagse Iran. Een groep oude studievrienden besluit er een weekendje met vrouw en kinderen tussenuit te gaan, lekker uitwaaien aan de kust. Sepideh heeft Elly de lerares van haar dochter uitgenodigd voor de trip, in de hoop haar te kunnen koppelen aan Achmad, wiens huwelijk met een Duitse recentelijk op de klippen is gelopen. De gereserveerde en mysterieuze Elly lijkt geen idee te hebben dat Sepideh haar onder valse voorwendselen heeft meegevraagd voor het weekendje aan zee en voelt zich ongemakkelijk als ze merkt dat achter haar rug om over haar gepraat wordt. De afspraak was dat ze maar een dagje zou blijven, maar als ze op het punt staat om te vertrekken werkt Sepideh zich in allerlei bochten om er maar voor te zorgen dat Elly blijft. Als op een onbewaakt ogenblik een van de kinderen in de woeste zee terechtkomt, slaat de paniek toe. Zeker wanneer blijkt dat Elly vervolgens spoorloos is. Vanaf dat moment raken de gebeurtenissen in een stroomversnelling.\n\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/56503&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/56503&lt;/a&gt;\n\n\nEngish\n\nIt's a story about three Iranian families who are traveling to North of Iran in order that they can introduce the teacher of one of these families daughters to one of their divorced friends who's coming from Germany to Iran but everything changes when the young teacher (Elly) disappears and no one knows if she's still alive or not? the judgments of these people about Elly forms the whole story of the film\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1360860/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1360860/&lt;/a&gt;\n\nIran\nDrama\n119 minuten\n\ngeregisseerd door Asghar Farhadi\nmet Golshifteh Farahani, Taraneh Alidoosti en Marila Zare'i\n\nBron: Retail \nAudio: Perzisch, Farsi \nAudio: DD 2.0\nOndertitels: Nederlands\nCategorie : Beeld \nFormaat : DVD9 \nBron : Retail\nThanks BOB1961 : SwingNow   \nOndertitels : Nederlands (instelbaar)\nCover : Yes \nGenre : Drama\n \nWeblink : http://www.aboutelly.com/ \n\n \n \nWeblink : &lt;a href=&quot; http://www.moviemeter.nl/film/56503&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.moviemeter.nl/film/56503&lt;/a&gt;\nWeblink : &lt;a href=&quot; http://www.imdb.com/title/tt1360860/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt1360860/&lt;/a&gt;  \n\nTBS\n\nBlack-Sam","torrent":{"xt":"urn:btih:ee7b42aaab4b69f0a5219fc743d87332aca412a3","amp;dn":"About+Elly+%28Darbareye+Elly+-+2009%29+Retail+%28NL+SUBS%29+vlinder+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee7b42aaab4b69f0a5219fc743d87332aca412a3","infoHashBuffer":{"type":"Buffer","data":[238,123,66,170,171,75,105,240,165,33,159,199,67,216,115,50,172,164,18,163]},"announce":[],"urlList":[]}}