{"title":"She-Hulk Complete","uid":4230442,"size":1293155726,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:eea800abaa8a1b22abee668bc03e5403c7e8293a&amp;dn=She-Hulk+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Rishab","files":131,"time":1213027311,"description":"She-Hulk (Jennifer Susan Walters) is a Marvel Comics superheroine. Created by writer Stan Lee and artist John Buscema, she first appeared in Savage She-Hulk #1 (February 1980).\n\nShe-Hulk has been a member of the Avengers, the Fantastic Four, Heroes For Hire, Defenders, Fantastic Force, and S.H.I.E.L.D. A highly skilled lawyer, she has served as legal counsel to various superheroes on numerous occasions. Her cousin is Bruce Banner, better known as The Incredible Hulk.\n\nShe-Hulk is one character which Marvel has really changed a lot since her introduction. Earlier she was Savage She-Hulk with a little bit of Hulk in her, now she is the super sexy She-Hulk. This torrent contains Savage She-Hulk vol 1, Sensational She-Hulk which become vol 2. Then Marvel really goofed up and the next series was also named as Vol 1 and the current ongoing series is called vol 2. Apart from these run ups this torrent also contains She Graphic novel, which I believe is must for every She-hulk fan and some other one-shots too. This torrent has enough of She-Hulk to satisfy anyones lust for Shulkie. I shouldnt be using such language but thats what they did with the character and it also become hugely popular. So there are good number of people who like to see her like that.Enjoy and Seed","torrent":{"xt":"urn:btih:eea800abaa8a1b22abee668bc03e5403c7e8293a","amp;dn":"She-Hulk+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eea800abaa8a1b22abee668bc03e5403c7e8293a","infoHashBuffer":{"type":"Buffer","data":[238,168,0,171,170,138,27,34,171,238,102,139,192,62,84,3,199,232,41,58]},"announce":[],"urlList":[]}}