{"title":"Israelology - Arnold Fruchtenbaum","uid":11729725,"size":1463721,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eede6aeeb2c3c57ad79351a6f7e508122f81e952&amp;dn=Israelology+-+Arnold+Fruchtenbaum&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1425243753,"description":"\n One's view of Israel is key in determining one's theology. This groundbreaking study investigates four approaches to the theology of Israel Past, Present and Future, and scrutinizes beliefs that tend to confuse the identities of both Israel and the Church. The Biblical Evangelist called Israelology a &quot;tremendous, masterful book... Amillennialism, postmillennialism and other forms of Covenant Theology go up in smoke under the withering blaze of biblical light Fruchtenbaum places on them\n\n\nAbout the author:\n Upon graduating from high school, Arnold was forced by his father to leave home because of his faith. In 1962, he began undergraduate education at Shelton College in New Jersey. Transferring to Ohio's Cedarville College, he graduated with a Bachelor of Arts degree in Hebrew and Greek in 1966. He then moved to Israel, where he studied archaeology, ancient history, historical geography, and Hebrew at the American Institute of Holy Land Studies and the Hebrew University in Jerusalem. During this time, he witnessed the historic Six-Day War in 1967. Later that year, Arnold returned to the U.S. and entered Dallas Theological Seminary for studies in Hebrew and Old Testament. He also began working as a missionary with ABMJ (today, Chosen People Ministries)","torrent":{"xt":"urn:btih:eede6aeeb2c3c57ad79351a6f7e508122f81e952","amp;dn":"Israelology+-+Arnold+Fruchtenbaum","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eede6aeeb2c3c57ad79351a6f7e508122f81e952","infoHashBuffer":{"type":"Buffer","data":[238,222,106,238,178,195,197,122,215,147,81,166,247,229,8,18,47,129,233,82]},"announce":[],"urlList":[]}}