{"title":"Richard Branson - Reach for the Skies - Balooning Birdmen and bl","uid":7910194,"size":5245409,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eee2ed47b17a15b5c8569ede27803b03e58d259b&amp;dn=Richard+Branson+-+Reach+for+the+Skies+-+Balooning+Birdmen+and+bl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"KatQwerty","files":3,"time":1355193321,"description":"One of the world's most famous business leaders (and a well-known avian fanatic) explores the pioneers of flight. \n\nBestselling author and billionaire entrepreneur Sir Richard Branson has always been obsessed with the skies. To promote a new Virgin Airlines route, he became the first man to water ski behind a blimp. His Virgin Galactic venture will soon offer ordinary people the opportunity to experience spaceflight aboard the first commercial spaceliner, SpaceShipTwo.\n\nIn Reach for the Skies, Branson examines the history of aviation over the last two hundred years, putting the spotlight on trailblazers such as:\n\n* Tony Jannus, who made the first ever commercial flight over Tampa Bay, Florida, in 1914.\n* Leo Valentin, the &quot;bird man&quot; who jumped from 9,000 feet wearing a pair of wooden wings in the 1950s.\n* Steve Fossett, who broke 130 world records in planes, balloons, and airships.\n\nThe pioneers of flight-not just the world-famous Wright Brothers, but also lesser known visionaries and dreamers-made it possible for any of us with the desire and the commitment to reach for the skies ourselves.","torrent":{"xt":"urn:btih:eee2ed47b17a15b5c8569ede27803b03e58d259b","amp;dn":"Richard+Branson+-+Reach+for+the+Skies+-+Balooning+Birdmen+and+bl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eee2ed47b17a15b5c8569ede27803b03e58d259b","infoHashBuffer":{"type":"Buffer","data":[238,226,237,71,177,122,21,181,200,86,158,222,39,128,59,3,229,141,37,155]},"announce":[],"urlList":[]}}