{"title":"Red Hot Chili Peppers - Stadium Arcadium (2002) WMA320","uid":6096444,"size":316614036,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f01a06a262f489adc64416e02398e9a0a1d377d9&amp;dn=Red+Hot+Chili+Peppers+-+Stadium+Arcadium+%282002%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1294795451,"description":"Wow. I see a lot of old fans complaining about the direction &quot;their&quot; Peppers have taken here. Well, if you don't like it go form your own band and write your own &quot;perfect&quot; music! \n\nThere are a few common fallacies being repeated here: \n\n1) &quot;This album is soft. Too many ballads. Boo hoo.&quot; Huh? Maybe you are not playing it loud enough, but I hear plenty of blistering guitar and slammin beats for my tastes. The bass tone is as good as it has been since BSSM and the drums are bright and present. There are quite a few mid-tempo pieces, but they usually resolve to scorching bridges of pure rock power. \n\n2) &quot;The Peppers have abandoned their roots! Boo hoo.&quot; Please. Just because they are not retreading their young punk vibe over and over again it does not mean they have lost their integrity. I personally think punk AND metal sound best when a young band has something to prove. If they keep at it, without maturing, it sounds pretty stale. So I appreciate that they have moved on. I still love the old records and they are not going anywhere. Bottom line, if you want a dangerous punk sound look underground, this band has grown up. \n\n3) &quot;They mailed it in. It's all about Frusciante now. Boo hoo.&quot; Nonsense. They bring it all to the table on this record. Yes, John's layered sounds are a huge part of the post-Californication sound, but I personally think this is Flea's best work. He is master of a ridiculous number of styles and still manages to sound like himself. No imitators possible. He practically invents a new style of bass on &quot;Hard to Concentrate&quot;. I defy you to tell me you've heard anything like that stuttering little groove played on a bass guitar before (he seems to be pulling modern hip hop grooves into his own brand of upper register playing) and the next tune &quot;21st Century&quot; is a clinic on creative funk bass groove. Flea has reached a perfect balance of his relentless power and a &quot;less is more&quot; approach. If you have seen them play &quot;Subway to Venus&quot; at a billion beats per minute recently you know that neither he nor John have lost their chops, they just make different choices now. They are playing exactly what they think is beautiful and powerful and funky, no more no less. The reason I buy every album they make is because I trust them to make THEIR choices not MINE. I do that in my own band. I like where they are going as much as where they have been. Anthony Keidis has NEVER sounded better. His lyrics are on par with the other albums, equal parts sublime abstract genius and quirky Keidis nonsense delivered in his unique style. Again if you think the lyrics aren't good, then grab a mike and let us hear yours. Keidis is doing his thing well here. \n\n4) &quot;It's still not as good as Blood Sugar! Boo hoo.&quot; Of course not, but it is not trying to replace that album. That was 15 freaking years ago folks! That was the perfect album for that time. I was 19 at the time and it absolutely consumed me, but that was a young man's album. This is an album for the same man 15 years later. It may not be for everyone, but it's not the Pepper's problem if you haven't grown up or if you just don't care for the music they like to make. \n\n5) &quot;They only care about singles now! Boo hoo.&quot; More nonsense. They are making the best music they can in the style that they like which includes more flavors than almost any other band out there. It is an insult to them or any other band to tell them they are half-assing it. It takes a lot of hard work and dedication to put together even a so-so band, so when a band like this goes in to make a double album of &quot;over produced&quot; material it is NOT because they are just trying to sell a few more albums. These guys are already independently wealthy. They are making music, period. If you don't like it...hey...there are more bands out there than ever before...good luck finding one that cares as much about their music as these guys. \n\nOh...the album... (hee hee) \n\nIt is twenty eight songs of pure &quot;grown up&quot; Peppers. If you like the last two albums there is plenty here to digest for the entire summer. If you just like the old &quot;real&quot; Peppers then go dig up your old albums, stay in your cave and dream about the &quot;good old days&quot; when you thought they were &quot;your&quot; band...or you could come out into the sunshine with the REAL living Peppers and enjoy the ride. \n\n&quot;If you don't like this album, then you don't like the Red Hot Chili Peppers. Period.&quot; - Flea \n\nby R. Otero\n\nTRACKLIST:\nDisc 1:\n01 - Dani California.wma                                    \n02 - Snow (Hey Oh).wma                                      \n03 - Charlie.wma                                            \n04 - Stadium Arcadium.wma                                   \n05 - Hump De Bump.wma                                       \n06 - She's Only 18.wma                                      \n07 - Slow Cheetah.wma                                       \n08 - Torture Me.wma                                         \n09 - Strip My Mind.wma                                      \n10 - Especially In Michigan.wma                             \n11 - Warlocks.wma                                           \n12 - C'mon Girl.wma                                         \n13 - Wet Sand.wma                                           \n14 - Hey.wma                                                \n\nDisc 2:\n01 - Desecration Smile.wma                                  \n02 - Tell Me Baby.wma                                       \n03 - Hard To Concentrate.wma                                \n04 - 21st Century.wma                                       \n05 - She Looks To Me.wma                                    \n06 - Readymade.wma                                          \n07 - If.wma                                                 \n08 - Make You Feel Better.wma                               \n09 - Animal Bar.wma                                         \n10 - So Much I.wma                                          \n11 - Storm In A Teacup.wma                                  \n12 - We Believe.wma                                         \n13 - Turn It Again.wma                                      \n14 - Death Of A Martian.wma   \n\nWMA 320Kbps 44100H STEREO","torrent":{"xt":"urn:btih:f01a06a262f489adc64416e02398e9a0a1d377d9","amp;dn":"Red+Hot+Chili+Peppers+-+Stadium+Arcadium+%282002%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f01a06a262f489adc64416e02398e9a0a1d377d9","infoHashBuffer":{"type":"Buffer","data":[240,26,6,162,98,244,137,173,198,68,22,224,35,152,233,160,161,211,119,217]},"announce":[],"urlList":[]}}