{"title":"NEO Scavenger v0.974b","uid":8744249,"size":28108932,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f0487af53c85cf763d38818a5ef26da6192e33e1&amp;dn=NEO+Scavenger+v0.974b&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AN0NYMOUS142857","files":1,"time":1374878438,"description":"How long can you survive the post-apocalyptic wastelands of NEO Scavenger? In the near-future, supernatural activity and human warfare have fragmented mankind into pockets of civilization struggling to survive in wild and dangerous lands. You awaken alone in an abandoned facility with no food nor water, and only a hospital gown and some mysterious items as clues to your identity. NEO Scavenger is a game where you must survive in the wasteland long enough to figure out who you are. Each turn you must decide where to go, how to scavenge for supplies, and how to deal with anything and anyone you encounter. And with each passing minute, the pit in your stomach grows, your dehydration worsens, your muscles tire, and your body temperature drops in the cold autumn air. Choose your starting abilities carefully, because they and your wit are the only tools you have in the apocalypse!\n_Key Features_\n- Post Apocalyptic Setting with Elements of Supernatural Horror:\nNEO Scavenger takes place in a near-future, post apocalyptic Earth, where human warfare and supernatural activity have fragmented mankind into struggling pockets of civilization. Harsh wilderness and blasted ruins cover most of the planet, dotted by fragile settlements that can be extinguished in an instant. A few cities survived the apocalypse, evolving into massive, ultra-urban fortresses. Other areas have become so devastated that even to this day, the only inhabitants are the ghosts of the past.\n- Strategic, Turn-based Play:\nThe game takes place on a hex grid, with movement and combat taking place in a turn-based fashion. Visibility is limited by obstacles and elevation, as well as day/night. Apart from boundaries and a few landmarks, the map is randomized each game, meaning terrain features and resources move from game-to-game. And the ever-present threat of monsters and bandits lurks around every corner. Choose your battles carefully, use discretion when scavenging a site, and only sleep when you're absolutely safe.\n- Character Customization:\nStart each game with strengths and weaknesses you choose. Decide which areas of knowledge you'll have, which abilities, and which skills. Want more than the normal starting amount? Choose a handicap or two to grant some extra space for skills. You choose your play style, be it tough guy, scientist, woodsman, skulker, or something of your own design!\n- High-quality, Hand-drawn Art:\nNEO Scavenger is all illustrated by hand, in a style that harkens back to the height of single-player, computer role-playing games. Enjoy a bird's eye view of the game world from an isometric perspective. Individually drawn items change appearance as they are equipped, dropped, or wielded. Enjoy hand-painted vignettes during key encounters and scenes.\n- Scavenger's Paradise:\nYour survival in the wastelands of NEO Scavenger depends on knowing where to look for useful items, and knowing what's worth taking versus leaving. Scavenge the ruins of old suburban neighborhoods for old clothes and tools. Use your knowledge of plants to scavenge for food in the forest. A large variety of items awaits the persistent and prepared scavenger, many of which have multiple uses. But beware, many items won't last long in the demanding life of a scavenger. Survivors are always looking for backup items!\n\n- Survival Management:\nSurvival in NEO Scavenger requires constant managing of resources. Keep a watchful eye on your hunger and thirst. Is the outside temperature dropping? Do you have enough clothing to keep your core temperature up? When was the last time you slept? Can you go much longer before passing out? Keep all of these in balance, or risk potentially crippling or fatal conditions.\n\n- Rigorous Inventory Management:\nPosition and rotate items into your available carrying space to maximize your carrying capacity. Everything has a use, and most items have value. But choose what you carry carefully. Everything also has weight. Overburdening yourself means you'll fatigue faster, and space taken by one item may mean sacrificing another.\n- Crafting of Items:\nUse items you've scavenged to make useful tools and prepare food. Not sure if that water is safe to drink? Boil it first. Deep in the woods and need warm clothes? Try skinning some squirrels for their fur. Scavenging is as much about making do with what you have as it is about finding what you need.\n- Challenging Gameplay:\nNEO Scavenger is not an easy game. You will not be told what to do, or how to survive. There is no hand-holding, and nobody's got your back. Mistakes quickly turn into death in the apocalypse. And when you die, that's it. Game over.\n_Adobe Flash System Requirements_\nProcessor: 2.33GHz or faster x86-compatible processor, or Intel Atom 1.6GHz or faster processor for netbooks\nMemory: 512MB of RAM (1GB of RAM recommended for netbooks)\nGraphics Card: 128MB of graphics memory\n_Installation Instructions_\nI. Fully extract the game to a directory of your choice\nII. Play","torrent":{"xt":"urn:btih:f0487af53c85cf763d38818a5ef26da6192e33e1","amp;dn":"NEO+Scavenger+v0.974b","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0487af53c85cf763d38818a5ef26da6192e33e1","infoHashBuffer":{"type":"Buffer","data":[240,72,122,245,60,133,207,118,61,56,129,138,94,242,109,166,25,46,51,225]},"announce":[],"urlList":[]}}