{"title":"Chucho Valdes - New Conceptions [FLAC] TQMP","uid":4380463,"size":360405838,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f1621bb5b279414c5d12b6430b7023aadb25a90c&amp;dn=Chucho+Valdes+-+New+Conceptions+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pastafari","files":-1,"time":1220631732,"description":"Chucho Valdes - New Conceptions\n2003\n\nBrought to you by TQMP\nThe Quality Music Project\n\nAlbum review ---\nWe're all familiar with jazzers who map their aesthetic onto a Latin template: Dizzy and Bird, Cal Tjader, McCoy Tyner, Sonny Rollins, Miles Davis, Joe Henderson, Jane Bunnett, and Stan Getz come to mind as artists who've successfully done that.\n\nBut how about essentially Latin artists who map a Latin aesthetic onto a jazz template? Not as many of those. Danilo Perez, Edward Simon, Gonzalo Rubalcaba, Hilton Ruiz, Eddie Palmieri, Egberto Gismonti, and Jorge Dalto come immediately to mind. Interestingly, all are pianists (Gismonti is also a noted guitarist), whereas among the former, almost all are saxophonists or trumpeters. \n\nThen there's Chucho Valdes, perhaps the Big Daddy of the latter group. Is there anyone out there with a deeper Latin rhythmic sensibility, a harder swinging approach, than the former leader of Irakere? Maybe Hilton Ruiz, but I don't think so.\n\nBesides being the Latin jazz rhythm champ, Valdes has stuff going for him that NOBODY else does. First off, his latest disc features all Latin players. Not a name jazzer in sight anywhere. Usually, a Latin jazz disc relies on a least one or two noted Norte Americano jazz players, to give it credibility and name recognition among the main audience for this type of music. Second, Valdes is, simply, the ruling king of Latin jazz keyboard. Period. It comes out all over this disc from the opening notes of the first cut, &quot;La Comparsa.&quot; Third, he does something I don't think I've ever heard another piano player do, namely, play Latin with his left hand and jazz with his right hand (check out his unbelievable solo beginning about the middle of Miles Davis's famous &quot;Solar,&quot; and the feat is repeated in a short passage in &quot;Sin Clave Pero Con Swing&quot;). Fourth, there's some impossibly deep Latin groove hapening with this band. It's like these ritmo grooves are in their blood (check out esp. the rhythmic workout near the close of &quot;Solar&quot;).\n\nWhat's really going on here is what goes on with all the best jazz records: a tradition (Latin jazz, in this case) is perfected by the artist, then deconstructed, and finally put back together in a new way that both pays proper respect to the tradition and advances the music in new (and sometimes astounding) directions.\n\nThus, we get neither ungrounded, half-baked, wild expermention that sometimes characterizes the wooly avant-garde nor slavish deference to traditions that sometimes comes out of the Crescent City. Instead, we get absolutely mesmerizing jazz of the highest order. As you can probably tell, I'm wild about this disc, which I would venture to say is among the finest, if not the absolute finest, Latin jazz disc ever recorded.\n-- Jan P. Dennis &quot;Longboard jazzer&quot;\nTop 500 reviewer @ amazon.com &lt;a href=&quot;\nhttp://www.amazon.com/New-Conceptions-Chucho-ValdÃƒÂ©s/dp/B0000C3I8G&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/New-Conceptions-Chucho-ValdÃƒÂ©s/dp/B0000C3I8G&lt;/a&gt;\n\nTracks\n01- La Comparsa\n02- You Don't Know What Love Is\n03- Los Guiros\n04- Nanu\n05- Solar\n06- Sin Clave Pero Con Swing\n07- Homenaje A Ellington\n\nArtwork (300dpi scan), EAC log and CUE sheet included.\n\nFormat: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt; \n\nEnjoy, seed and inhale!\n\nLegalise it!\n\nPastafari Cubensis &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;\nProud Member of the Church of the Flying Spaghetti Monster &lt;a href=&quot;\nhttp://venganza.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://venganza.org&lt;/a&gt;","torrent":{"xt":"urn:btih:f1621bb5b279414c5d12b6430b7023aadb25a90c","amp;dn":"Chucho+Valdes+-+New+Conceptions+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1621bb5b279414c5d12b6430b7023aadb25a90c","infoHashBuffer":{"type":"Buffer","data":[241,98,27,181,178,121,65,76,93,18,182,67,11,112,35,170,219,37,169,12]},"announce":[],"urlList":[]}}