{"title":"ABC of Transfer and Retrieval Medicine [PDF] [StormRG]","uid":11373084,"size":6420201,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f21139e362a6c13451d2430325f700b2fe8546af&amp;dn=ABC+of+Transfer+and+Retrieval+Medicine+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"0xmovva","files":2,"time":1415114758,"description":"TITLE/EDITION ABC of Transfer and Retrieval Medicine (ABC Series) \nAuthor: Adam Low (Editor), Jonathan Hulme (Editor)\nSeries: ABC Series\nPaperback: 224 pages\nPublisher: BMJ Books; 1 edition (November 10, 2014)\nLanguage: English\nISBN-10: 1118719751\nISBN-13: 978-1118719756\nFormat: Retail PDF\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n___________________________________________________________________________________\n\n\nABC of Transfer and Retrieval Medicine provides the key information required to help health care professionals involved in the movement of critically ill patients to do so safely, correctly and with confidence.\n\nBeginning with the practical and clinical considerations to be taken into account during patient transfer and an overview of transfer equipment, it then addresses pharmacological aspects of patient transfer, the roles and responsibilities of the transfer team, and the requirements of neonatal, paediatric and specialist transfers.\n\nMapped against the syllabus for the Diploma of Retrieval and Transfer Medicine (Royal College of Surgeons of Edinburgh), it has been developed as a core resource for the diploma whilst providing an invaluable resource for any healthcare professional involved in the transfer of critically ill patients including anaesthetists, intensivists, nurses from ICU/ED and paramedics. It also includes frameworks for radiology and arterial blood gas interpretation, guidance on patient triage, transfer checklists and equipment checklists, and a summary of the relevant national guidelines.\n\nFrom a multidisciplinary international author team, this new addition to the ABC series is a useful resource for all health care professionals involved in the transfer of patients. It is relevant to anaesthetists, intensivists, paramedics, critical care and emergency department nursing staff who are required to take part in intra and inter hospital transfers","torrent":{"xt":"urn:btih:f21139e362a6c13451d2430325f700b2fe8546af","amp;dn":"ABC+of+Transfer+and+Retrieval+Medicine+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f21139e362a6c13451d2430325f700b2fe8546af","infoHashBuffer":{"type":"Buffer","data":[242,17,57,227,98,166,193,52,81,210,67,3,37,247,0,178,254,133,70,175]},"announce":[],"urlList":[]}}