{"title":"Railworks TS2016 DTG DR BR 24 Loco Add-On","uid":12759869,"size":120555263,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f2463794bc0f2f05661fd19caf598bafb8ea8ac0&amp;dn=Railworks+TS2016+DTG+DR+BR+24+Loco+Add-On&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TS2015","files":1,"time":1447514225,"description":"A workhorse of German and Polish railways, the BR 24 ‘Steppenpferd’ comes to Train Simulator from Romantic Railroads. \r\n\r\nThe ‘Steppenpferd’ (‘Prairie Horse’) was developed specifically for the long, flat routes in West and East Prussia between 1928 and 1940 as passenger locomotives. The Deutsche Reichsbahn soon pressed these heavy steam engines into service and they served the DR well until the outbreak of World War II. \r\n\r\nDuring wartime, a number of the locomotives were moved to Poland, where 34 remained after 1945 and re-classified as Oi2 by the PKP. These locomotives served until the last was withdrawn in 1976. Of the remaining locomotives, 47 were taken on by the Deutsche Bundesbahn and retired by 1968. Four locomotives were left with the DR following WWII and withdrawn from services in the 1970s. \r\n\r\nIn total, four examples have been preserved – three in Germany and one in Poland. \r\n\r\nThe BR 24 for Train Simulator is available in black livery and features cab lighting, accurately recreated steam simulation (including simulated boiler explosion) and functioning PZB90 in-cab signalling, plus custom route assets including a loco shed, water crane and coaling &amp; sanding tower. \r\n\r\n\r\n\r\n\r\nTHIS ADDON WILL WORK ON LEGIT AND PIRATED VERSION OF TRAIN SIMULATOR 2016!!!","torrent":{"xt":"urn:btih:f2463794bc0f2f05661fd19caf598bafb8ea8ac0","amp;dn":"Railworks+TS2016+DTG+DR+BR+24+Loco+Add-On","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2463794bc0f2f05661fd19caf598bafb8ea8ac0","infoHashBuffer":{"type":"Buffer","data":[242,70,55,148,188,15,47,5,102,31,209,156,175,89,139,175,184,234,138,192]},"announce":[],"urlList":[]}}