{"title":"Carl Sagan Contact","uid":5057056,"size":1315903,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f36cda4b28e0351a31e70d05dd13c1650a040ccd&amp;dn=Carl+Sagan+Contact&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"stinkii","files":3,"time":1250478769,"description":"Contact is a science fiction novel written by Carl Sagan and published in 1985. A film adaptation of the novel starring Jodie Foster was released in 1997. Eleanor &quot;Ellie&quot; Arroway is the director of &quot;Project Argus,&quot; in which scores of radio telescopes in New Mexico have been dedicated to the search for extraterrestrial intelligence (SETI).\n\nBefore long, the project does, indeed, discover the first confirmed communication from extraterrestrial beings, a repeating series of the first 261 prime numbers (a sequence of prime numbers is a commonly predicted first message from alien intelligence, since mathematics is considered a &quot;universal language,&quot; and it is conjectured that algorithms that produce successive prime numbers are sufficiently complicated so as to require intelligence to implement them). Further analysis of the message reveals that two additional messages are contained in different forms of modulation of the signal. The second message is a primer, a kind of instruction manual that teaches how to read further communications. The third is the real message, the plans for a machine that appears to be a kind of highly advanced vehicle, with seats for five human beings.","torrent":{"xt":"urn:btih:f36cda4b28e0351a31e70d05dd13c1650a040ccd","amp;dn":"Carl+Sagan+Contact","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f36cda4b28e0351a31e70d05dd13c1650a040ccd","infoHashBuffer":{"type":"Buffer","data":[243,108,218,75,40,224,53,26,49,231,13,5,221,19,193,101,10,4,12,205]},"announce":[],"urlList":[]}}