{"title":"Brave DVDRip 400MB Mkv","uid":7820072,"size":418418832,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f402c2c7db530109acd666c6cd77138174c15b40&amp;dn=Brave+DVDRip+400MB+Mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"napster22","files":1,"time":1352772658,"description":"Brave is a 2012 American computer-animated fantasy adventure film produced by Pixar Animation Studios and distributed by Walt Disney Pictures. It was written by Mark Andrews, Steve Purcell, Brenda Chapman, and Irene Mecchi, directed by Andrews and Chapman[3] and co-directed by Purcell. The film's voice cast features Kelly Macdonald, Julie Walters, Billy Connolly, Emma Thompson, Kevin McKidd, Craig Ferguson, and Robbie Coltrane. To make the most complex visuals possible, Pixar completely rewrote their animation system for the first time in 25 years.[4] It is the first film to use the Dolby Atmos sound format.\nIn the film, set in the Highlands of Scotland, a skilled archer named Merida defies an age-old custom, causing chaos in her kingdom. After consulting a witch for help, her family becomes cursed and Merida is forced to undo the spell herself before it is too late. Brave premiered on June 10, 2012, at the Seattle International Film Festival, and was released in North America on June 22, 2012, to both positive reviews and box office success.","torrent":{"xt":"urn:btih:f402c2c7db530109acd666c6cd77138174c15b40","amp;dn":"Brave+DVDRip+400MB+Mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f402c2c7db530109acd666c6cd77138174c15b40","infoHashBuffer":{"type":"Buffer","data":[244,2,194,199,219,83,1,9,172,214,102,198,205,119,19,129,116,193,91,64]},"announce":[],"urlList":[]}}