{"title":"Wario Ware - Do It Yourself  [Eur]","uid":5548071,"size":134246926,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:f456346249af442009c6eb0a7903245a55fdf309&amp;dn=Wario+Ware+-+Do+It+Yourself++%5BEur%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"chusca","files":3,"time":1273443823,"description":"Puede que sea un tipo un poco loco con bigote, pero nadie puede negar que Wario nos ha proporcionado mucha diversiÃƒÂ³n a lo largo de los aÃƒÂ±os con sus geniales microjuegos. Ahora, Wario regresa con WarioWare D.I.Y., la ÃƒÂºltima entrega de la serie de inusuales microjuegos, y en esta ocasiÃƒÂ³n viene con una tentadora oferta, puesto que podrÃƒÂ¡s crear tus propios microjuegos. De ahÃƒÂ­ el Do It Yourself (hazlo tÃƒÂº mismo) del tÃƒÂ­tulo... El juego incluye 90 nuevos microjuegos en los que unos buenos reflejos y tener cierto ojo para lo ridÃƒÂ­culo serÃƒÂ¡n esenciales. Intenta ser mÃƒÂ¡s listo que los creadores de algunos de los juegos de acciÃƒÂ³n mÃƒÂ¡s desmedida, como pisotear latas, aplastar tubos de pasta dentÃƒÂ­frica y... agarrar a alguien de la nariz, que estÃƒÂ¡n esperÃƒÂ¡ndote para engancharte. Hasta ahÃƒÂ­, todo muy WarioWare. Pero la parte mÃƒÂ¡s llamativa de este juego es la que te ofrece la posibilidad de ser creativo en el Estudio D.I.Y. Ã‚Â¿Siempre has querido probar lo de desarrollar un juego o crees que tienes ideas mÃƒÂ¡s divertidas que las de los creadores de Wario? Entonces, ÃƒÂ©sta es tu oportunidad de demostrar que eres tan bueno como todos los bigote-maniacos. El juego te enseÃƒÂ±a todo lo que necesitas saber para poder .....Incluye el EspaÃƒÂ±ol. Juego adictivo.\nOtras CaracterÃƒÂ­sticas\n* Ponte en la piel de un desarrollador de juegos y crea tus propios microjuegos.\n* Disfruta de los noventa juegos ya instalados y descarga muchos mÃƒÂ¡s gracias a la ConexiÃƒÂ³n Wi-Fi de Nintendo.\n* Comparte tus microjuegos con amigos y familiares a travÃƒÂ©s de una conexiÃƒÂ³n inalÃƒÂ¡mbrica local.\n* Hazte con el tÃƒÂ­tulo para WiiWare WarioWare D.I.Y. Showcase para conseguir mÃƒÂ¡s microjuegos y poder llevar las creaciones realizadas en la Nintendo DS a la gran pantalla. \n\n","torrent":{"xt":"urn:btih:f456346249af442009c6eb0a7903245a55fdf309","amp;dn":"Wario+Ware+-+Do+It+Yourself++%5BEur%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f456346249af442009c6eb0a7903245a55fdf309","infoHashBuffer":{"type":"Buffer","data":[244,86,52,98,73,175,68,32,9,198,235,10,121,3,36,90,85,253,243,9]},"announce":[],"urlList":[]}}