{"title":"Moksha-mkv-DDR","uid":8540447,"size":740304407,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f49c35b1410167f9cd43fd87db52a602aacd8a4c&amp;dn=Moksha-mkv-DDR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SaM","files":2,"time":1370370674,"description":"DDR Presents\n\nMoksha\nA Documentary on the Widows of Vrindavan\n(A film by Pankaj Butalia)\n\nDVD Rip - 700MB - x.264/mkv\n\nSynopsis:\nFrom the mid 19th century, a trend had emerged in Bengal - widows, who in the absence of their husbands were no longer valued, were abandoned and found their way to the great vaisnavaite religious places like Puri &amp; Vrindavan. The trend has continued and even today, widows who can no longer stand the neglect or the strife in their lives, wind their way to Vrindavan.\n\nHere, amid abject penury the eke out a living - singing Bhajans at some temples and Ashrams for a pittance every day. This documentary tells of the lives of these women: Their hardship and their loneliness; their anguish because their near and dear ones have abandoned them and their fortitude in face of hardships any one of us would have crumbled under, had we faced it. Its a tale of human endurance, but also a tale of devotion - for these women, there is nothing left but Krishna and Radharani..\n\nComments:\nPankaj Butalia's documentary is profoundly moving as it tells the tale of how these abandoned women preserve their dignity, despite abject poverty. It traces the history of three of the women, to bring home the dependence of these women on their menfolk. I loved the non-judgemental tone of the documentary. It does not take sides. Its more telling because it does not wish to make a statement. The statement that results is a stark one. It is difficult to sit through his documentary. Its a long one and there are few light moments. The story telling is patchy and often replete with details that may not even be necessary. Yet it is a compelling one, if only because it starkly brings home the place of women in 21st Century Bengal - that region, which we still like to think as an enlightened oasis in a medieval and backward country.\n\nCamera work is good with some very elegant shots, but I seemed to feel that it was a still photographer acting as a cinematographer. I liked the introductory and explanatory poetry, although it is a bit commonplace, the way it has been used. Surprisingly there is next to no use of music - Butalia merely uses natural sounds and the chantings of the widows. Its a very slow documentary and after a while, you feel like taking a break before returning to see the rest. You won't feel good, seeing this documentary - instead a sense of pathos will grip you.\n\nThe Documentary is in Bengali with hardcoded English subtitles which are easy to read and comprehend.\n\nUploader's Notes:\nI spent a bit of time over this rip. It was partly because the original wasn't very good, but also because I love Vrindavan and its narrow by-lanes. I think the rip is good and you will enjoy viewing the movie.\n\nIMDB Link:\nMoksha (1993) - IMDb http://www.imdb.com/title/tt0137960/\n\n\nseeding 24x7 at 1 GBps+\n\n\n\n\n","torrent":{"xt":"urn:btih:f49c35b1410167f9cd43fd87db52a602aacd8a4c","amp;dn":"Moksha-mkv-DDR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f49c35b1410167f9cd43fd87db52a602aacd8a4c","infoHashBuffer":{"type":"Buffer","data":[244,156,53,177,65,1,103,249,205,67,253,135,219,82,166,2,170,205,138,76]},"announce":[],"urlList":[]}}