{"title":"Blows to the Head - How Boxing Changed My Mind (2010).pdf Gooner","uid":13212215,"size":2883009,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f5d520f8548ed9ea6bf8481f2a82213e2bb7f939&amp;dn=Blows+to+the+Head+-+How+Boxing+Changed+My+Mind+%282010%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1452644099,"description":"Blows to the Head - How Boxing Changed My Mind (2010).pdf Gooner\r\n\r\nPublisher: State Univ of New York Pr (January 7, 2010)\r\nLanguage: English\r\nISBN-10: 1438430019\r\nISBN-13: 978-1438430010\r\n\r\nI peered through the Venetian blinds in our den, with its view of the playground next door, and watched mournfully as the popular girls played softball. I wanted to run fast, hit hard, and wear a cute uniform. These girls seemed to know something about life that I didn t. \r\nWhen Binnie Klein took up boxing in her midfifties, the reaction from friends and acquaintances was always the same: You? Why, after all, would a middle-aged Jewish psychotherapist with no previous history of athletics take up boxing? In Blows to the Head, Klein offers a provocative tale of an unlikely contender whose unexpected fascination with boxing takes her beyond the ring and leads her back to her roots and to a surprising chapter of the Jewish immigrant experience. With candor and wit, she reveals a series of memories and insights that would never have been possible if she hadn t been drawn toward a pair of boxing gloves during a physical therapy session. In a story that will captivate and inspire women and men, athletes and nonathletes, Klein shows us that if we turn over the weird stones on our path, the ones we usually ignore, we may find ourselves on an unexpected journey that will summon vitality back into our lives.&quot;","torrent":{"xt":"urn:btih:f5d520f8548ed9ea6bf8481f2a82213e2bb7f939","amp;dn":"Blows+to+the+Head+-+How+Boxing+Changed+My+Mind+%282010%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5d520f8548ed9ea6bf8481f2a82213e2bb7f939","infoHashBuffer":{"type":"Buffer","data":[245,213,32,248,84,142,217,234,107,248,72,31,42,130,33,62,43,183,249,57]},"announce":[],"urlList":[]}}