{"title":"Rapid ACLS Revised 2nd Ed [PDF][tahir99] VRG.pdf","uid":10609212,"size":3553196,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f61f0f1bbf581c23a00ff4061c1c7cd186ac5a02&amp;dn=Rapid+ACLS+Revised+2nd+Ed+%5BPDF%5D%5Btahir99%5D+VRG.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tahir99","files":-1,"time":1406022009,"description":"RAPID ACLS - Revised Reprint, 2e (Rapid Review Series)\n\nby Barbara J Aehlert RN BSPA (Author)\n\nISBN-13: 978-0323083201 ISBN-10: 032308320X Edition: 2nd April 22, 2011\n\nDesigned to offer essential information on-the-spot, where it's needed most! RAPID ACLS, 2nd Edition, Revised Reprint is now updated to reflect the 2010 emergency cardiovascular care guidelines. It contains a broad range of topics pertaining to advanced cardiac life support including information on airway management, pharmacology, vascular access, ECGs, electrical therapy, acute coronary syndromes, and special resuscitation situations. Loaded with tables, mnemonics, and algorithms throughout, RAPID ACLS, 2nd Edition, Revised Reprint is ideal for use in clinical practice or during an ACLS course.\n\nCompact 3 x 5 Â½-inch size presents essential information in a quick-reference format.\nFluid-resistant paper is durable for rugged clinical use.\nFull-color illustrations show clear, vivid presentations of essential concepts and common cardiac rhythms for clear and easy interpretation.\nConcise, accessible bullet points and numbered lists make key information easy to find, read, and understand.\nConvenient format uses spiral binding and color tabs as section dividers allow you to quickly locate important information in an emergency.\nOver 70 tables throughout the text including dysrhythmias and cardiac medications provide the basics of dysrhythmias and medications at a glance.\nCommonly used but rarely memorized information broken down into tables, algorithms, and acronyms help in locating essential information.\n\nReflects the 2010 emergency cardiovascular care guidelines. ","torrent":{"xt":"urn:btih:f61f0f1bbf581c23a00ff4061c1c7cd186ac5a02","amp;dn":"Rapid+ACLS+Revised+2nd+Ed+%5BPDF%5D%5Btahir99%5D+VRG.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f61f0f1bbf581c23a00ff4061c1c7cd186ac5a02","infoHashBuffer":{"type":"Buffer","data":[246,31,15,27,191,88,28,35,160,15,244,6,28,28,124,209,134,172,90,2]},"announce":[],"urlList":[]}}