{"title":"The Hunter- Farmer Diet Solution [PDF] [StormRG]","uid":10333748,"size":3955783,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f63b2ea6ba39e6f2787295a0fc6148c8bdecf27b&amp;dn=The+Hunter-+Farmer+Diet+Solution+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"krystine","files":-1,"time":1402442817,"description":"The Hunter/Farmer Diet Solution: Do You Have the Metabolism of a Hunter or a Fermer? Find Out...and Achieve Your Health and Weight-Loss Goals (Healthy Living (Hay House))\nAuthor: Mark Liponis M.D.\nPublished: 2012\nPublisher: Hay House\nISBN: 9781401935535\nFormat: Retail PDF\nReader Required:Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nAmericans are overweight, and they're getting heavier. Other than wanting to perform invasive surgical procedures, most doctors offer little help. Their advice is usually &quot;Eat less, exercise more,&quot; which falls back on the outdated dogma of calories in/calories out. Medical research on dieting is confusing and often contradictory. Not only are physicians unsure about which weight-loss plan is best, but their patients are, too! It has become an &quot;every one for him- or herself&quot; situation, where we're forced to experiment, hoping to hit on the magic weight-loss formula by chance . . . and the increasing number of fad diets makes our odds of picking the right weight-loss plan even less likely. Why can't the medical industry make sense of the overload of information and give us sound advice that actually enables people to lose weight and improve their health? Fortunately, recent studies have shined a new light on the subject and may finally help us understand a successful way to diet. This research proves what many men and women have learned through trial and error: some do better on a low-carb diet, and others do better on a low-fat diet. This is because some people have the metabolism of a hunter, while others have the metabolism of a farmer. In this groundbreaking book, Dr. Mark Liponis, a leading expert in preventive and integrative medicine, will show you how to determine which type you are so that you can lose weight and improve your health at the same time. Once you know your type, you'll be on the road to successful weight loss and greater health and well-being!","torrent":{"xt":"urn:btih:f63b2ea6ba39e6f2787295a0fc6148c8bdecf27b","amp;dn":"The+Hunter-+Farmer+Diet+Solution+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f63b2ea6ba39e6f2787295a0fc6148c8bdecf27b","infoHashBuffer":{"type":"Buffer","data":[246,59,46,166,186,57,230,242,120,114,149,160,252,97,72,200,189,236,242,123]},"announce":[],"urlList":[]}}