{"title":"One World Order Rising","uid":7770934,"size":4675818748,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f6802c7aaa05eb1bf4466405f1b050aad2caf6b0&amp;dn=One+World+Order+Rising&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GoAaT999","files":4,"time":1351526601,"description":"Fifth in the Series - One World Order Rising - WTC/ Pentagon Disaster - De-railing the Illuminati Agenda. Recorded in Allentown, PA, 10/ 2001 Workshop. Required Reading for all Level 3 Ministers (Regents) preparing to adopt the Covenant of the Regent Consulate.\n\nContents include: the Imminent Crisis Order, the Inter-galactic Edict of War &amp; the Significance of the Masters Templar Rainbow Roundtables, &quot;Who's Who - Identities of the Players in the Final Conflict Drama, The &quot;Allentown Conspiracy&quot;, Philadelphia, Montauk, MJ-12 &amp; Illuminati One World Order Agendas, Forbidden History: 10,500BC &gt; 1930's &amp; the Evolution of the Agendas of the Fallen Races, the 5.5 Million Year Old &quot;Wall in Time&quot;, Realities of the Ancient Atlantean Pylon Implant Network (APIN) System &amp; Planetary Wormholes, Decoding the Meaning of the &quot;Book of Revelation&quot;, the Reality of the 7, and 12, Seals - plus - the Significance of the Horsemen of the Apocalypse, the Great White Lion, the Golden eagle, the Blue Oxen, the Four Faces of Man (EOMC Grids) &amp; the Fallen Angelic Grid Systems - the Falcon, Phoenix, Dragon and the Dove. &quot;Soul-utions&quot;: Song of Lyra, BiVeca &amp; TriVeca Codes, Advanced Merkaba Mechanics, Protection from Psycho-tronic Processes &amp; Bio-warfare, the Trinity Field - Zone Transharmonic Time Cycles, Inner Earth &amp; the Four faces of Man, Creating Trion Fields, Regent Consulate Commission's and the Grid 2002/03 Deadlines - and - &quot;What Exactly Are We Preparing For?&quot;.\n\n","torrent":{"xt":"urn:btih:f6802c7aaa05eb1bf4466405f1b050aad2caf6b0","amp;dn":"One+World+Order+Rising","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6802c7aaa05eb1bf4466405f1b050aad2caf6b0","infoHashBuffer":{"type":"Buffer","data":[246,128,44,122,170,5,235,27,244,70,100,5,241,176,80,170,210,202,246,176]},"announce":[],"urlList":[]}}