{"title":"A Visual History of the English Bible (gnv64)","uid":7838009,"size":20324360,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f6f73c4f5ad2bdeb379d094ef2e06eecdbffb6e8&amp;dn=A+Visual+History+of+the+English+Bible+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gnv65","files":-1,"time":1353254033,"description":"A Visual History of the English Bible: The Tumultuous Tale of the World's Bestselling Book\nby Donald L. Brake\nBaker Books | September 2008 | ISBN-10: 080101316X | PDF | 352 pages | 19.3 Mb &lt;a href=&quot;\nhttp://www.amazon.com/Visual-History-English-Bible-Bestselling/dp/080101316X&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Visual-History-English-Bible-Bestselling/dp/080101316X&lt;/a&gt;\n\n\nWith a full color layout and over one hundred illustrations, A Visual History of the English Bible covers the fascinating journey of the Bible from the pulpit to the people. Renowned biblical scholar Donald L. Brake invites readers to explore the process of transformation from medieval manuscripts to the contemporary translations of our day. Along the way, readers will meet many heroes of the faith--men and women who preserved and published the Scriptures, often at risk of their own lives. From Wycliffe and Tyndale to King Henry VIII and the Geneva Bible, from the Bishop's Bible and the King James Version to the American Revolution and the Civil War, this tumultuous tale is history come alive. This book is perfect for history buffs, bibliophiles, and anyone interested in the colorful account of the world's most popular book.\nFrom John Wycliffe to King Henry VIII, from the Geneva Bible and the King James Version to the American Revolution and the Civil War, Donald L. Brake brings to life the story of the Bible's transformation into an English bestseller. Along the way you'll meet a number of heroes of the Christian faith who dedicated themselves to preserving and publishing the Scriptures, often at risk to their own lives. You'll also find over one hundred illustrations, helpful explanations of principles in Bible translation and biblical interpretation, and a comparison of today's major new translations. You'll never take your copies of the English Bible for granted again.\n\nCONTENTS\nIllustrations 9\nIntroduction 21\n1. Ancient Bibles: The Triumph of Beauty, the Tyranny of Power 25\n2. He Dared to Act: John Wycliffe and the Bible in English 45\n3. The Man of the Millennium: The Triumph of the Press over the Quill 67\n4. He Dared to Take a Stand: The Monk Becomes a Knight 83\n5. The Fire of Devotion: The Plowman Reads the Bible 91\n6. A Political Pastor Struggles in Exile: The Pastor Survives and His Psalms Endure 111\n7. A Royal Court Intrigue: The First &quot;Authorized&quot; Bible 125\n8. Theology Influences Bible Versions: Notes to Aid the Reader 143\n9. The Clergy's Version: A Bible Longing for an Audience 161\n10. The Catholic Church Responds: From Sacred Latin to Vulgar English 171\n11. A Royal Translation: Splendors of the Stuart Court 183\n12. The King's Bible Revised: From King James to Queen Victoria 205\n13. The Source for English Translations: The Battle for a Standard Greek Text 225\n14. The Bible in America: At War and Peace 249\n15. The Bible as Bestseller: &quot;As Wide as the Waters Be&quot; 265\n16. The People Triumph: The Bible for All Seasons 283\nConclusion 297\nAcknowledgments 299\nA Visual Glossary 303\nNotes 319\nSelected Bibliography 333\nScripture Index 341\nGeneral Index 343","torrent":{"xt":"urn:btih:f6f73c4f5ad2bdeb379d094ef2e06eecdbffb6e8","amp;dn":"A+Visual+History+of+the+English+Bible+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6f73c4f5ad2bdeb379d094ef2e06eecdbffb6e8","infoHashBuffer":{"type":"Buffer","data":[246,247,60,79,90,210,189,235,55,157,9,78,242,224,110,236,219,255,182,232]},"announce":[],"urlList":[]}}