{"title":"Responses to Rembrandt-Who Painted The Polish Rider.pdf","uid":11884577,"size":24184469,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f807cf1d37d80aa9a953f78e90d97524d1768f94&amp;dn=Responses+to+Rembrandt-Who+Painted+The+Polish+Rider.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"STBGD","files":1,"time":1430777968,"description":"Responses to Rembrandt: Who Painted The Polish Rider?\nTimken Publishers | 1994 | ISBN: 0943221188 | English | 190 pages | PDF | 23 MB\n\n\nIn 1910, Henry Clay Frick purchased Rembrandt van Rijn's The Polish Rider for his private collection. Ever since, the painting has hung - undisturbed and uncontested - on the wall of Frick's Fifth Avenue mansion in New York City. There, year in and year out, it has beguiled thousands of visitors. The painting's subject matter has been debated over the years - but never its author, or its impact on viewers, many of whom think it not just a Rembrandt but one of the finest paintings the master executed during his long, prolific career. In 1968, a group of Dutch scholars known as the Rembrandt Research Project, feeling that the master's oeuvre was inflated, began to take Rembrandt to task. The group's members traveled around the world, subjecting Rembrandt to intense scrutiny: they x-rayed paintings; examined the rendering of lace, hands, and signatures; counted threads of warp and woof. Paintings long considered Rembrandts started to fall. Then, in 1984, one of the members of the Project suggested, in print, that The Polish Rider might be next. Perhaps this painting, &quot;one of the world's masterpieces&quot;, wasn't a Rembrandt after all but the work of a lesser-known pupil, Willem Drost. Deattribution of a Rembrandt makes front-page news and sends shock waves through the community of art historians, museum curators, and private collectors. A painting, once worth ten million dollars, sells at auction for a mere eight hundred thousand; one that was the centerpiece of a museum collection is moved to the basement. Yet the paintings themselves do not change - whether they are attributed to Rembrandt van Rijn or Isack Jouderville. In a lively and accessible discussion, novelist and essayist AnthonyBailey presents the drama of The Polish Rider's threatened deattribution. With the painting as a springboard, Bailey explores basic issues of art history, authenticity, and connoisseurship, and discusses the difficulties involved when a single person or committee attempts to reach definitive conclusions on matters of authorship and creative genius","torrent":{"xt":"urn:btih:f807cf1d37d80aa9a953f78e90d97524d1768f94","amp;dn":"Responses+to+Rembrandt-Who+Painted+The+Polish+Rider.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f807cf1d37d80aa9a953f78e90d97524d1768f94","infoHashBuffer":{"type":"Buffer","data":[248,7,207,29,55,216,10,169,169,83,247,142,144,217,117,36,209,118,143,148]},"announce":[],"urlList":[]}}