{"title":"Distant Worlds Universe update v1.9.5.6 beta 2","uid":10630952,"size":18337720,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f8163fda44443ccea5843b6741c6a8843638c9f9&amp;dn=Distant+Worlds+Universe+update+v1.9.5.6+beta+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Nimbleton","files":1,"time":1406313064,"description":"Distant Worlds Universe update 1.9.5.6 beta 2\n\nExtract rar file into main folder\n\nWorks on Skidrow release\n\nThis build has the following changes from 1.9.5.6 beta 1:\n\nCRASH FIXES\n- fixed crash when evaluating designs\n\nBUG FIXES\n- character energy savings bonuses now properly reduce energy consumption instead of increasing it\n\nGAME BALANCE\n- counterespionage strength adjusted - slightly less chance of intercepting enemy intelligence missions\n- reduced chance of empires switching to Corporate Nationalism government type when available\n- altered empire military strength measurement to better account for fighters (affects diplomacy and AI empire evaluations)\n- independent colonies now recruit more defending militia troops\n\nPIRATES\n- pirate factions now pay maintenance for any non-pirate raider troops (once have proper colonies)\n- pirate faction flags retain pirate symbol in top-left corner when edited in game editor\n- pirate faction flags propery update in galaxy view when edited in game editor\n- pirate factions can now build normal planetary facilities and wonders at fully owned colonies using right-click pop-up menu and action buttons\n\nMODDING\n- now allow per-race modding for user interface in a theme (add subfolders named by race under imagesuichrome folder to mod most chrome images, e.g. customizationTHEMENAMEimagesuichromehuman)\n- custom characters with '?' appearance order now never appear at game start\n\n\nThis build has the following changes from 1.9.5.5:\n\n\nCRASH FIXES\n- fixed rare crash when drawing ships\n- fixed crash when giving monetary gifts to other empires\n- fixed crash when sorting ships in fleets\n\nMODDING\n- allow including GameText.txt from a custom mod (i.e. read from theme folder)\n- altered imagesunitscreatures folder to be read from the mod (if present) instead of the root game folder\n- allow modding MP3 files in soundsEFFECTS (not just WAV files)\n- fighters now properly use WeaponImageIndex value in fighters.txt to allow customization of fighter weapon effects\n\nSHIP DESIGN\n- AI ship design now properly adds damage control components when repair bots are unavailable\n- further optimized AI ship design process to allow shrinking designs with maximum construction size while still ensuring critical components are present (e.g. weapons on military ships)\n- Fighter Bay components now considered as weapons in military ship designs (i.e. can have military ship designs with no weapons except for Fighter Bays)\n\nGAME BALANCE\n- AI now gives higher preference to mining station build locations that are closer to space ports, colonies, etc\n- strategic resources used in construction (for components) now weighted slightly higher when considering stockpiles at spaceports and elsewhere\n\nOTHER\n- slightly improved game performance\n- can now build bases in disputed systems if your empire has a colony in the system ","torrent":{"xt":"urn:btih:f8163fda44443ccea5843b6741c6a8843638c9f9","amp;dn":"Distant+Worlds+Universe+update+v1.9.5.6+beta+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8163fda44443ccea5843b6741c6a8843638c9f9","infoHashBuffer":{"type":"Buffer","data":[248,22,63,218,68,68,60,206,165,132,59,103,65,198,168,132,54,56,201,249]},"announce":[],"urlList":[]}}