{"title":"portal 2 multiplayer(coop) crack+patches","uid":6358838,"size":84526953,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f85c7afdebd15950ed4d2074c055e0f962c0a760&amp;dn=portal+2+multiplayer%28coop%29+crack%2Bpatches&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"deadend5","files":1,"time":1304210748,"description":"okay to play this online, u have to ENABLE console in options keyboard/mouse setting, sometimes console doesnt work properly i changed my console button in insert,\nbut thats up to u, just install portal2.update.1.exe first then the second one, then copy the skidrow crack with the cooplauncher in it to your directory. \nits only for 2 players the coop, and u need HAMACHI!! to make it work! google&gt;hamachi download isnt so hard :P,\n\nwhen u open Portal 2 - coop-launcher ul see Host-ip. behind it an connect button chapter, map etc. at hamachi u have to type the host his HAMACHI IP! not normal ip.\nso hamachi ip. of the one who hosts it. IMPORTANT! the host starts the game through the coop launcher. \nand the client connects through console ingame. just like Css.\nMORE IMPORTANT! as client to connect type in console:   connect (HAMACHI IP ADRESS of host!)  not without the ( ).\nokay, THE CLIENT HAS TO CONNECT FIRST THEN IF HE IS AT THE LOADING SCREEN THEN THE HOST, PRESS START HOSTING. \nand the game will popup and will connect to, then if u did it good ul see ur friend ingame ^^. i tested and worked for me.\ni downloaded this, from youtube i saw it was an mp portal crack and i get it working :D, so its not mines.\ni just want to share this. im using the downloaded version portal 2 :) of skidrow btw and using windows7 32bit.\nmaybe some pc's have to run as administrator the coop-launcher.\n\nREAD THIS!!!  DONT SAY ITS NOT WORKING CUZ IT IS. i played online without paying anything ^^ just need hamachi.\n \n","torrent":{"xt":"urn:btih:f85c7afdebd15950ed4d2074c055e0f962c0a760","amp;dn":"portal+2+multiplayer%28coop%29+crack%2Bpatches","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f85c7afdebd15950ed4d2074c055e0f962c0a760","infoHashBuffer":{"type":"Buffer","data":[248,92,122,253,235,209,89,80,237,77,32,116,192,85,224,249,98,192,167,96]},"announce":[],"urlList":[]}}