{"title":"Abbas Kiarostami - Bad ma ra khahad bord aka The Wind Will Carry","uid":3696427,"size":1411663518,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f89fe259b32108419ddaa20009484b2ff776feb1&amp;dn=Abbas+Kiarostami+-+Bad+ma+ra+khahad+bord+aka+The+Wind+Will+Carry&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"kegir","files":4,"time":1180045781,"description":"Iranian Title:  Bad ma ra khahad bord\nEnglish Title: The Wind Will Carry Us\nDirector: Abbas Kiarostami\nYear: 1999\nLanguage: Farsi\nSubtitles: English (softsubs)\nSource: DVD\n\nPlot synopsis from AMG\n\nThis idiosyncratic drama from Iran begins as a jeep winds through the hills of Kurdistan, containing an engineer (Behzad Dourani) and his two assistants (whom we never see) as they search for a small village in the mountains. When they arrive, they are greeted by a young boy, who shows them a place they can stay and guides the engineer to the home of an old woman (also never seen) who seems to be dying. No one is sure what the engineer and his men are doing there; some locals think he&amp;#039;s keeping watch of the old woman and wants to purchase her land when she dies, while others think he could be an archeologist searching for rare artifacts. Meanwhile, the engineer spends his days exploring the village and the people who live there -- most of them women, with the men away at jobs that occupy them night and day for several months out of the year. He also stays in touch with the boy, who watches over the old woman&amp;#039;s health while keeping up with his schoolwork, working on his family&amp;#039;s farm, and helping his mother with the household chores. Meanwhile, the engineer periodically gets calls on his cellular phone, which require him to drive to a graveyard on a hill to receive the call (most, however, are wrong numbers), while making contact with a man digging a deep hole (also unseen) and a girl in the village who milk&amp;#039;s cows which are kept in a dark basement. Concentrating on what we don&amp;#039;t see as often as what we do, Le Vent Nous Emportera bears the distinctive stamp of director Abbas Kiarostami and was embraced by critics in its screening at the 1999 Venice Film Festival.\nMark Deming\n\nA Voice from amazon.com\n\nThree men arrive to a small mountain village in Iran where they are on a secret assignment, to await a woman&amp;#039;s death who is over 100 years old and record the ritual ceremony of the death. As they anticipate the death of the woman, the leader of the group begins to explore the extraordinary village and the residents of the village. This exploration becomes a cultural voyage of rural Iran and a simultaneous self-exploration into his own heart while he keeps in contact with civilization with his cellular phone, which can only be used on higher grounds. Kiarostami grasps the moment of each scene with the same detail as Michelangelo painted the Sistine Chapel ceiling and leaves the audience with a result to amaze and ponder.\n\nAnd another voice from Amanzon.com\n\nOnce again Abbas Kiarostami shows the world how simple it is to make a great film if you are a great filmmaker. This film is a typical Kiarostami film, slow paced but at the same time deeply rich and complex through well exectuted symbolism. It is a film that explores the relationship between contemporary and traditional societies in Iran realized through the placement of a small film crew from Tehran into a small countryside village. They wait for the death of a village elder to begin their work on the film. As the film progresses it becomes less clear whether this elder will pass on and they begin to question their own place. It is possibly the most beautiful film I have ever experienced and I recommend it highly.\n\nFile Name .............: Bad ma ra khahad bord - The Wind Will Carry Us (2 of 2) (Kiarostami 1999, Farsi).avi\nFile Size (in bytes) ..: 703,911,936 bytes\nRuntime (# of frames) .: 58:14.680 (4193304 frames)\n\nVideo Codec ...........: XviD ISO MPEG-4\nFrame Size ............: 640x336 [=1.905]\nFPS ...................: 25.000\nVideo Bitrate .........: 1526 kb/s\nBits per Pixel ........: 0.284 bpp\nB-VOP, N-VOP, QPel, GMC ......: []...[]...[]...[]\n\nAudio Codec ...........: 0x0055 MPEG-1 Layer 3\nSample Rate ...........: 48000 Hz\nAudio bitrate .........: 77 kb/s [1 channel(s)] VBR audio\nInterleave ............: 40 ms\nNo. of audio streams ..: 1\n\nNOT MY RIP     Found along the way on DC++ \n\n********************************* FREAKYFLICKS **********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing\ncinematic art in the digital era. Our goal is to disseminate such works of art\nto the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional\nrole in the history of cinema and its progression in becoming a great art. Films\nthat are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate\nin our community. All you need do is include this tag in your upload and join us\nat the forum to announce your release.\n\n\t\t &lt;a href=&quot;\thttp://www.freakyflicks.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://www.freakyflicks.tk&lt;/a&gt;\n\n\t\t &lt;a href=&quot;\thttp://freakyflicks.proboards54.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://freakyflicks.proboards54.com/&lt;/a&gt;\n\n&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&amp;#039;","torrent":{"xt":"urn:btih:f89fe259b32108419ddaa20009484b2ff776feb1","amp;dn":"Abbas+Kiarostami+-+Bad+ma+ra+khahad+bord+aka+The+Wind+Will+Carry","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f89fe259b32108419ddaa20009484b2ff776feb1","infoHashBuffer":{"type":"Buffer","data":[248,159,226,89,179,33,8,65,157,218,162,0,9,72,75,47,247,118,254,177]},"announce":[],"urlList":[]}}