{"title":"JFK_Zapruder_Film_Symposium_2003_Tufa","uid":6538804,"size":10829793522,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:f923b5f430ddadcdcc6946a82a718b50f791ff01&amp;dn=JFK_Zapruder_Film_Symposium_2003_Tufa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Tufa_911","files":54,"time":1310608981,"description":"This is the 2003 Zapruder film symposium.\n-----------------------------------------\n\nMy video source is the U-tube site Richdell, so you may preview all material there:\n\nThe You-tube videos occasionally (mostly) lack a correct audio-video synchronization,\nand for a spoken presentation, it make everyone look like an idiot. \nI have, to best of my ability, re-synced the video/audio. In some places the sync \nis not perfect, and at a short moment I fail completely to find the correct sync, \nbut this is MUCH BETTER than the U-tube source.\n\nThe video has also been processed and filtered to lower the pixelation of \nthe video, and in DivX format you can also load the AVI:s into your DVD player, \nto look on them on your TV. Total play time is 15:25:59.\nTo work better on a TV set, the picture was reduced in the frame, as most \nTV-sets (the analogue things with a tube) don't show the whole complete \nframe.\n\nVideo format is NTSC, mostly, though this seems not to make any difference \nany more; I have PAL equipment, and it runs just fine.\n\nThe compression is not very aggressive, it is 1500kbps-2000kbps, and the material \nare mostly slow presentations with still pictures.\n\nThe presentations focus mostly on the &quot;Zapruder&quot; film, though a general overview \nof a great many funny things on the JFK assassination is also included.\n\nALL TORRENTS SEEDED, but, kindly, I cannot seed much on each one, so do help \neach other, and be patient. (And if you are not very patient, drop an e-mail.)\n\nTrackers: edit and enter some modern working trackers. I keep a note of working\ntrackers on my site. The seeder and peer shall share at least one tracker.\n\nVisit Simon's site www.cluesforum.info for discussion of current events; \nthe moderators are good at cleaning up the board from insults and garbage; \nindeed a very lovely forum.\n\nTo all JFK-reseachers, check my &quot;new-comer&quot;-interpretation in file\nSecret_Service_Standdown.avi, title taken from a You-tube video.\n\nMay peace and truth surround you when you are hit by the next idiotic &quot;event&quot; \nto promote a new war. This was Tufa on www.tufavideo.net\n","torrent":{"xt":"urn:btih:f923b5f430ddadcdcc6946a82a718b50f791ff01","amp;dn":"JFK_Zapruder_Film_Symposium_2003_Tufa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f923b5f430ddadcdcc6946a82a718b50f791ff01","infoHashBuffer":{"type":"Buffer","data":[249,35,181,244,48,221,173,205,204,105,70,168,42,113,139,80,247,145,255,1]},"announce":[],"urlList":[]}}