{"title":"A Mother's Reckoning: Living in the Aftermath by Sue Klebold","uid":13859873,"size":4216143,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f945a0b9668b17b51a093db3722f46144321ad7a&amp;dn=A+Mother%27s+Reckoning%3A+Living+in+the+Aftermath+by+Sue+Klebold&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Dr.Soc","files":1,"time":1458024971,"description":"A Mother's Reckoning: Living in the Aftermath of Tragedy by Sue Klebold\r\nFebruary 15, 2016 | Hardcover: 336 pages | English | ISBN-10: 1101902752\r\n\r\nOn April 20, 1999, Eric Harris and Dylan Klebold walked into Columbine High School in Littleton, Colorado. Over the course of minutes, they would kill twelve students and a teacher and wound twenty-four others before taking their own lives.\r\n\r\nFor the last sixteen years, Sue Klebold, Dylan’s mother, has lived with the indescribable grief and shame of that day. How could her child, the promising young man she had loved and raised, be responsible for such horror? And how, as his mother, had she not known something was wrong? Were there subtle signs she had missed? What, if anything, could she have done differently?\r\n\r\nThese are questions that Klebold has grappled with every day since the Columbine tragedy. In A Mother’s Reckoning, she chronicles with unflinching honesty her journey as a mother trying to come to terms with the incomprehensible. In the hope that the insights and understanding she has gained may help other families recognize when a child is in distress, she tells her story in full, drawing upon her personal journals, the videos and writings that Dylan left behind, and on countless interviews with mental health experts.\r\n\r\nFilled with hard-won wisdom and compassion, A Mother’s Reckoning is a powerful and haunting book that sheds light on one of the most pressing issues of our time. And with fresh wounds from the recent Newtown and Charleston shootings, never has the need for understanding been more urgent","torrent":{"xt":"urn:btih:f945a0b9668b17b51a093db3722f46144321ad7a","amp;dn":"A+Mother%27s+Reckoning%3A+Living+in+the+Aftermath+by+Sue+Klebold","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f945a0b9668b17b51a093db3722f46144321ad7a","infoHashBuffer":{"type":"Buffer","data":[249,69,160,185,102,139,23,181,26,9,61,179,114,47,70,20,67,33,173,122]},"announce":[],"urlList":[]}}