{"title":"FlashFXP.v4.2.5.Build.1810.Final+Crack","uid":7486258,"size":9125775,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f952e8a5a5cd2a28e3ee2c7d3977471ca3a111bd&amp;dn=FlashFXP.v4.2.5.Build.1810.Final%2BCrack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"reinstallation","files":-1,"time":1343600483,"description":"Description:\nFlashFXP - FTP-client that supports all types of connections, able to work through firewalls, and supports protocols for secure connections SSL / TSL. The program can import lists of sites from many popular FTP-client. There is a convenient feature - the list of pending tasks, which will resume unfinished downloads at any time. The program has the ability to automate downloading using command line parameters. The program allows you to produce and organize the data not only between the local computer, but also two remote FTP-servers. Using FlashFXP, very convenient to download files that are located in different folders or on different FTP-servers. All the files you want to download, you can put in place. The program will remember their location when you start the download to make a connection to the server, go into the folder and start downloading.\n\nThe apparent advantage of standard support FXP is that end users who want to copy files from one FTP-server on the other hand, has no effect on bandwidth limiting their own Internet connection. No need to download a file, then to put it on the other FTP-server. Thus, the file transfer will depend on the speed of the connection between two remote FTP-servers, which in most cases, certainly more than the user.\n\nThis manager has many useful functions, for example, good preparation of the rules will get rid of the routine Clicking on the button &quot;Replace&quot;, &quot;pass&quot;, etc. Also in this program, you will be comfortable and directory synchronization feature. There is a system of filters to automate the exception of the types of files in the queue downloads. In general, those who are more or less familiar with FTP-client, not the slightest amount of work to understand the program. In addition, the program has a multilingual interface, including support for Russian language.","torrent":{"xt":"urn:btih:f952e8a5a5cd2a28e3ee2c7d3977471ca3a111bd","amp;dn":"FlashFXP.v4.2.5.Build.1810.Final%2BCrack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f952e8a5a5cd2a28e3ee2c7d3977471ca3a111bd","infoHashBuffer":{"type":"Buffer","data":[249,82,232,165,165,205,42,40,227,238,44,125,57,119,71,28,163,161,17,189]},"announce":[],"urlList":[]}}