{"title":"Silent Hill Complete Collection (PS2 Classic)(ENG)[FULLDVD]","uid":9653031,"size":9307006026,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:f965949ab4b3e824e93a3508ca0ef5e598b6ce5d&amp;dn=Silent+Hill+Complete+Collection+%28PS2+Classic%29%28ENG%29%5BFULLDVD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sonywo","files":-1,"time":1393126923,"description":"(2001) Silent Hill 2 [PAL-E](Multi-6)\n(2003) Silent Hill 3 [PAL-E](Multi-5)\n(2004) Silent Hill 4: The Room [NTSC-U]\n(2008) Silent Hill: Origins [NTSC to PAL](Multi-5)\n(2010) Silent Hill: Shattered Memories [NTSC-U](Multi-3)\n\nGenre: Action Adventure &gt; Horror\nDeveloper: KCET / Climax Group\nPublisher: Konami \nRelease Year: 2001-2010\nESRB Rating: M\nPlay modes: single player\nPlatform: Playstation 2\nRegion: PAL/NTSC\nGame language:\n2: English, French, German, Italian, Japanese, Spanish\n3: English, French, German, Italian, Spanish\nThe Room: English\nOrigins: English, French, German, Italian, Spanish\nShattered Memories: English, French, Spanish\nNumber of games: 5\nType media: DVD-5\nMedia number: 5 \nType archive: 7z\nCompressed Size: 8.66GB\nUncompressed size: 14.57GB\nImage Format: .ISO\n\n\n[DESCRIPTION]\nSilent Hill 2 - In the sequel to Silent Hill, Silent Hill 2 follows James Sunderland, whose life is shattered when his young wife Mary suffers a tragic death. Three years later, a mysterious letter arrives from Mary, beckoning him to return to their sanctuary of memories, the dark realm of Silent Hill. You must guide James through all-new environments and creepy new areas closed off in the original game. Real-time weather effects, fog, morphing, and shadows set the stage for heart-stopping frights. Be brave as you journey to uncover the truth.\n\nSilent Hill 3 continues the series' trademark brand of psychological horror and terrifying gameplay. As a teenage girl named Heather, you'll explore and unravel the mysterious connection between the godforsaken town and her inner fears. Along the way, you'll encounter many strange characters you're not sure are trustworthy. Silent Hill 3 also features enhanced graphical detail, a more complex storyline, new items and weapons, and even more grotesque monsters than the previous games. Step into this world of nightmares and fight to survive.\n\nSilent Hill 4: The Room - Henry Townshend finds himself trapped in an apartment cursed by a deeply rooted evil. Only by exploring mysterious portals leading to disturbing alternate worlds will Henry begin to uncover the truth. However, mysterious new characters, horrendous creatures, and the undead, use any means necessary to impede his progress. It's up to you to help Henry through expansive areas, including a forest, a prison, and a hotel, in an effort to survive the nightmarish world of Silent Hill 4: The Room.\n\nSilent Hill: Origins - The renowned Silent Hill survival horror series is back with a brand new adventure that reveals many of the series' most hallowed secrets. Assuming the role of Travis Grady, a lone truck driver trapped in Silent Hill while making a routine delivery, players must escape the city's horrific inhabitants and confront the strange hallucinations that have haunted Travis since childhood.\n\nSilent Hill: Shattered Memories - Shattered Memories marks Silent Hill's debut on the Nintendo Wii where the fear is more real than ever before. Also available on the Wii and PSP, Shattered Memories promises to be more terrifying than ever. The choices the players make will shape Harry Mason, as well as the people he meets and the places he visits. The enemies evolve as well, taking the form of the player's deepest fears.\n\n[INSTALL]\nTo unpack , use the 7 -Zip or WinRAR\nBurn with Nero or UltraISO.\nBurn to disc DVD-5 or 4x Speed\nEnjoy! ","torrent":{"xt":"urn:btih:f965949ab4b3e824e93a3508ca0ef5e598b6ce5d","amp;dn":"Silent+Hill+Complete+Collection+%28PS2+Classic%29%28ENG%29%5BFULLDVD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f965949ab4b3e824e93a3508ca0ef5e598b6ce5d","infoHashBuffer":{"type":"Buffer","data":[249,101,148,154,180,179,232,36,233,58,53,8,202,14,245,229,152,182,206,93]},"announce":[],"urlList":[]}}