{"title":"Modern Military Techniques (Artillery and Tanks)","uid":7997499,"size":41773296,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb549cecb9f1b8e1dc83f7d0dc774fb98bfd1065&amp;dn=Modern+Military+Techniques+%28Artillery+and+Tanks%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1357659380,"description":"MODERN MILITARY TECHNIQUES ARTILLERY by TERRY GANDER (Published by Dragon Books 1986)\n\nDESCRIPTION(from back cover): \nModern Artillery comprises a fascinating constellation of purpose built weapons. Field, long range, and counter battery artillery, towed and self-propelled guns, all have their uses in a comprehensive defense artillery.\nTerry Gander's explanations of the guns and rockets in use today are accompanied by detailed illustrations and informative diagrams.\nPages:48\n\nMODERN MILITARY TECHNIQUES TANKS by IAN V. HOGG (Published by Dragon Books 1986)\n\nDESCRIPTION:\nDespite their vulnerability in the face of modern weapons, tanks are still in use throughout the world. The new technology has equipped them with sophisticated computerized electronics, night vision devices, air filtration systems, and laser fire-control systems, as well as dense armour and powerful guns.\nWith detailed illustrations Ian Hogg examines the evolution of the modern tank and the increasingly complicated tactics necessary to combat the threat of anti-tank guided missiles.\nPages:47\n\nThese books are primarily written for children but are equally helpful for older readers just stepping into the world of military science or looking to revise the basics. Given they are quite old but still they provide a very good introduction to both the history of the weapons and the tactics according to which they are employed. In this regards and the amount of information and diagrams condensed into few pages they are head and shoulders above other stuff on the Internet serving a similar purpose.\nThe main reason however of my uploading these books is that Tanks was the first military book that I bought and with a book probably called Fighting Generals (the first military book that I read), with Field Marshal Rommel on the cover and Panzer IIIs charging through the desert in the foreground, is the reason of my undying love for tanks.   ","torrent":{"xt":"urn:btih:fb549cecb9f1b8e1dc83f7d0dc774fb98bfd1065","amp;dn":"Modern+Military+Techniques+%28Artillery+and+Tanks%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb549cecb9f1b8e1dc83f7d0dc774fb98bfd1065","infoHashBuffer":{"type":"Buffer","data":[251,84,156,236,185,241,184,225,220,131,247,208,220,119,79,185,139,253,16,101]},"announce":[],"urlList":[]}}