{"title":"2Pac ft. Nas - Thugz Mansion","uid":4690225,"size":7676928,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fcb8794b2e60b2322c1a83b0eee5449b4d418a1d&amp;dn=2Pac+ft.+Nas+-+Thugz+Mansion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"RunarWorld","files":1,"time":1233366435,"description":"This is my favorite song of 2pac.\n2Pac ft. Nas - Thugz Mansion\n\nYou got any request of videos or music you find on youtube just contact me ;)\n\nSong Lyrics:\nShit, tired of gettin shot at\nTired of gettin chased by the police and arrested\nNiggaz need a spot where WE can kick it\nA spot where WE belong, that's just for us\nNiggaz ain't gotta get all dressed up and be Hollywood\nY'knahmean? Where do niggaz go when we die?\nAin't no heaven for a thug nigga\nThat's why we go to thug mansion\nThat's the only place where thugs get in free and you gotta be a G\n... at thug mansion\n\n[Verse One: 2Pac]\nA place to spend my quiet nights, time to unwind\nSo much pressure in this life of mine, I cry at times\nI once contemplated suicide, and woulda tried\nBut when I held that 9, all I could see was my momma's eyes\nNo one knows my struggle, they only see the trouble\nNot knowin it's hard to carry on when no one loves you\nPicture me inside the misery of poverty\nNo man alive has ever witnessed struggles I survived\nPrayin hard for better days, promise to hold on\nMe and my dawgs ain't have a choice but to roll on\nWe found a family spot to kick it\nWhere we can drink liquor and no one bickers over trick shit\nA spot where we can smoke in peace, and even though we G's\nWe still visualize places, that we can roll in peace\nAnd in my mind's eye I see this place, the players go in fast\nI got a spot for us all, so we can ball, at thug's mansion\n\n[Chorus: J. Phoenix + (Nas)]\nEvery corner, every city\nThere's a place where life's a little easy\nLittle Hennessy, laid back and cool\nEvery hour, cause it's all good\nLeave all the stress from the world outside\nEvery wrong done will be alright (I wanna go)\nNothin but peace (I wanna go) love (I wanna go nigga)\nAnd street passion, every ghetto needs a thug mansion\n\n[Verse Two: Nas]\nA place where death doesn't reside, just thugs who collide\nNot to start beef but spark trees, no cops rollin by\nNo policemen, no homicide, no chalk on the streets\nNo reason, for nobody's momma to cry\nSee I'm a good guy, I'm tryin to stick around for my daughter\nBut if I should die, I know all of my albums support her\nThis whole year's been crazy, asked the Holy Spirit to save me\nOnly difference from me and Ossie Davis, gray hair maybe\nCause I feel like my eyes saw too much sufferin\nI'm just twenty-some-odd years, I done lost my mother\nAnd I cried tears of joy, I know she smiles on her boy\nI dream of you more, my love goes to Afeni Shakur\nCause like Ann Jones, she raised a ghetto king in a war\nAnd just for that alone she shouldn't feel no pain no more\nCause one day we'll all be together, sippin heavnly champagne\nwhere angels soar, with golden wings in thug's mansion\n\n[Chorus w/o Nas]\n\n[Verse Three: 2Pac]\nDear momma don't cry, your baby boy's doin good\nTell the homies I'm in heaven and they ain't got hoods\nSeen a show with Marvin Gaye last night, it had me shook\nDrippin peppermint Schnapps, with Jackie Wilson, and Sam Cooke\nThen some lady named Billie Holiday\nSang sittin there kickin it with Malcolm, 'til the day came\nLittle LaTasha sho' grown\nTell the lady in the liquorstore that she's forgiven, so come home\nMaybe in time you'll understand only God can save us\nWhen Miles Davis cuttin lose with the band\nJust think of all the people that you knew in the past\nthat passed on, they in heaven, found peace at last\nPicture a place that they exist, together\nThere has to be a place better than this, in heaven\nSo right before I sleep, dear God, what I'm askin\nRemember this face, save me a place, in thug's mansion\n\n[Chorus]","torrent":{"xt":"urn:btih:fcb8794b2e60b2322c1a83b0eee5449b4d418a1d","amp;dn":"2Pac+ft.+Nas+-+Thugz+Mansion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fcb8794b2e60b2322c1a83b0eee5449b4d418a1d","infoHashBuffer":{"type":"Buffer","data":[252,184,121,75,46,96,178,50,44,26,131,176,238,229,68,155,77,65,138,29]},"announce":[],"urlList":[]}}