{"title":"Hitman and Appearances (DC Comics)","uid":5235483,"size":910721514,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:fd4ce1af013842a20cd7360a78b1668fc502113a&amp;dn=Hitman+and+Appearances+%28DC+Comics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"brodahisou","files":-1,"time":1261512298,"description":"Hitman (Tommy Monaghan) is a superpowered hitman in the DC Comics Universe. The character was created by Garth Ennis and John McCrea and first appeared in The Demon Annual #2 and then received his own series by Ennis and McCrea lasting 60 issues.\n\nTommy Monaghan, an ex-Marine Gulf War veteran turned contract killer from the Cauldron, a lower-class Irish district of Gotham City was attacked and bitten by a Bloodlines parasite called Glonth. Instead of dying, the bite unexpectedly triggers his metagene and grants him x-ray vision and moderate telepathy. After gaining these powers, Monaghan decides to specialize in killing metahumans and supernatural threats, targets typically shunned by conventional contract killers as too dangerous or too expensive. \n\nDespite its bizarre and often iconoclastic nature, the series is firmly entrenched in the DC Universe. Batman, The Joker, Green Lantern, Catwoman, Etrigan, and Superman all guest star at various points, and joking references are frequently made to then-current DC happenings (such as the long-haired Superman). The series also crossed over with many DC events, including Final Night, One Million, and No Man's Land. \n\nThe series won several awards including;\n\nDogwelder (from the team Section 8) was voted &quot;Best New Character&quot; of 1997 by the readers of Wizard.\n\nHitman issue 34, the Superman-starring &quot;Of Thee I Sing&quot;, won the 1999 Eisner Award for best single issue, presented to Ennis and McCrea.\n\n&quot;For Tomorrow&quot;, in issues 39-42, was a top votegetter for the Comics Buyer's Guide Fan Award for Favorite Story for 2000.\n\nThe 1,000,000 issue was a part of the DC One Million storyline, which was a top votegetter for the Comics Buyer's Guide Fan Award for Favorite Story for 1999.\n\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:fd4ce1af013842a20cd7360a78b1668fc502113a","amp;dn":"Hitman+and+Appearances+%28DC+Comics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd4ce1af013842a20cd7360a78b1668fc502113a","infoHashBuffer":{"type":"Buffer","data":[253,76,225,175,1,56,66,162,12,215,54,10,120,177,102,143,197,2,17,58]},"announce":[],"urlList":[]}}