{"title":"[FSX] - France VFR, PACA Photo HD Vol.2 [RIP] (2012)","uid":7435066,"size":7639980886,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fdab5b50f35fac83bbf8f4d435c1c11d7d40953e&amp;dn=%5BFSX%5D+-+France+VFR%2C+PACA+Photo+HD+Vol.2+%5BRIP%5D+%282012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"xxtsh","files":-1,"time":1342053303,"description":"[FSX] - France VFR, PACA Photo HD Vol.2 [RIP] (2012)\n\nThe scenery PACA PHOTO Vol.2 HD models the western part of the Provence-Alpes-Cote d'Azur in photorealistic textures high resolution (1 meter / pixel) with a mesh (relief) to an accuracy of 4.75 meters. Photographic coverage has a clipping and a full color touch-up routine for a better look. The boundaries of the scenery may differ slightly depending on the administrative boundaries of technical constraints\n\nTECHNICAL SPECIFICATIONS\nHigh resolution photoreal scenery covering a French region.\n0.85 to 1 meter resolution ground texture made from aerial photography (IGN) retreated for an optimal visual rendition in Flight Simulator XÂ® (summer only).\nHigh resolution real 4,75 meter (LOD13) optimized custom mesh incuded.\nAll lakes and rivers have been entirely cut out and faithfully represented, reworked with bodies of landable water.\nWater transparency effects for the whole scenery coverage.\nOptional Waterclass and original water texture provided (depending on regions).\nExtremely precise geo-referenced texture positionning is carried out in order to ensure a maximal compatibility with scenery add-ons for this region.\nProcess development is fully conform to the Microsoft Flight Simulator XÂ® SDK, ensuring a maximal compatibility with future versions of Flight Simulator.\nOpen scenery concept allows an easy integration of scenery add-ons from other editors.","torrent":{"xt":"urn:btih:fdab5b50f35fac83bbf8f4d435c1c11d7d40953e","amp;dn":"%5BFSX%5D+-+France+VFR%2C+PACA+Photo+HD+Vol.2+%5BRIP%5D+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fdab5b50f35fac83bbf8f4d435c1c11d7d40953e","infoHashBuffer":{"type":"Buffer","data":[253,171,91,80,243,95,172,131,187,248,244,212,53,193,193,29,125,64,149,62]},"announce":[],"urlList":[]}}