{"title":"The Interior - Lisa See.epub","uid":8949797,"size":761475,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fdbb8ad33a3b80b22c9d2e95f6b41ee895c468a0&amp;dn=The+Interior+-+Lisa+See.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Mohammad_AT","files":1,"time":1379856482,"description":"In our world, two years have passed since the publication of Flower Net, Lisa See's debut in thriller fiction, but as The Interior begins, only a few months have passed since Liu Hulan, a detective in Communist China's Ministry of Public Security, and U.S. Attorney David Stark first teamed up to catch a murderer--and rekindled their old love affair. Now, as David struggles to find a way to get back to China--or convince Hulan to move to America--Hulan goes to the village of Da Shui at the request of an old friend whose daughter has been murdered. Initial evidence suggests that it may have something to do with the nearby factory owned by an American toy manufacturer, where hundreds of Chinese women are working in sweatshop conditions. Meanwhile, David's old law firm has suddenly offered him an opportunity to head its new Beijing office, where one of his first duties will be to help one of the firm's corporate clients complete his purchase of the toy company. See's descriptions of daily Chinese life, both in Beijing and the far outposts of the country, are richly detailed. But the novel's even greater strength lies in the contests of will between David and Hulan and their various adversaries--as well as between each other, as Hulan struggles against what she perceives as a threat to her independence, and David must withhold critical information from his partner because it comes from one of his clients. While it certainly helps to have read Flower Net, The Interior is a surefooted exotic thriller in its own right, which will undoubtedly earn Lisa See as many new fans as the old ones it pleases.","torrent":{"xt":"urn:btih:fdbb8ad33a3b80b22c9d2e95f6b41ee895c468a0","amp;dn":"The+Interior+-+Lisa+See.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fdbb8ad33a3b80b22c9d2e95f6b41ee895c468a0","infoHashBuffer":{"type":"Buffer","data":[253,187,138,211,58,59,128,178,44,157,46,149,246,180,30,232,149,196,104,160]},"announce":[],"urlList":[]}}