{"title":"Kosovo - Can you Imagine","uid":4986684,"size":673765376,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fdf90ca3a6475e14b247f5085c97fe6ba549c46c&amp;dn=Kosovo+-+Can+you+Imagine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zxspectrum","files":-1,"time":1246749358,"description":"Kosovo: Can You Imagine? is about the Serbs that live in Kosovo and the lack of human rights that they have today, in the 21st century.\nMost of the Kosovo Serbs have been ethnically cleansed by the Albanians who make up the majority of Kosovo. Kosovo has been under UN administration since 1999 when NATO bombed Serbia for 76 days to halt a crackdown on ethnic Albanian separatism in its province of Kosovo.\nIn the years following the war, thousands of Serbs were expelled from their homes, kidnapped and killed. Their houses, cultural and religious sites were burned and destroyed. Kosovo for the Serbs is what Jerusalem is for the Jewish people. It is the cradle of their statehood, culture and religion. Most of the important Serbian Christian Orthodox monasteries are in Kosovo.\nToday, Serbs still have a deep spiritual and traditional connection to Kosovo, a land which is being cleansed of everything Serbian. Most of the Kosovo Serbs are internally displaced, some of them live in small container camps, in ghettos, all this in the heart of Europe in the 21st century. We follow the stories of several Serbs who have fell victim to a nationalist and irredentist ideology that has a goal of creating a pure Albanian state of &quot;Kosova&quot; (&quot;Kosovo&quot; in Albanian) Serbs in Kosovo have no basic human rights. You will be shocked to learn which atrocities they have to face each day.\n\nEnglish / Serbian translation\n","torrent":{"xt":"urn:btih:fdf90ca3a6475e14b247f5085c97fe6ba549c46c","amp;dn":"Kosovo+-+Can+you+Imagine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fdf90ca3a6475e14b247f5085c97fe6ba549c46c","infoHashBuffer":{"type":"Buffer","data":[253,249,12,163,166,71,94,20,178,71,245,8,92,151,254,107,165,73,196,108]},"announce":[],"urlList":[]}}