{"title":"XPEOKPATIA - Debtocracy (2011) Xvid-AC3 v110821.avi","uid":6626603,"size":733935296,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fe69bfa0c649d7a1e8bc9b3a03b0b320e72cce3e&amp;dn=XPEOKPATIA+-+Debtocracy+%282011%29+Xvid-AC3+v110821.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"asc11","files":-1,"time":1314184293,"description":"file name ....... XPEOKPATIA - Debtocracy (2011) hardsubs EN, Xvid 848x480-30 AC3-128k v110821.avi\nfile size ....... 699.94 MiB\nXvid  ........... 1169 kbps 848x480 29.97 fps\nAC3  ............ 128 kbps\n\nspoken languages  Greek, French, English, Spanish, German\nsubtitles ....... custom, English-UK, for hearing-impaired, HARDCODED\nend credits ..... English &amp; transliterated, not original Greek\nduration ........ 74 minutes\n\nlinks:  &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Debtocracy&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Debtocracy&lt;/a&gt;  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1890383/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1890383/&lt;/a&gt;  &lt;a href=&quot;\nhttp://www.debtocracy.gr/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.debtocracy.gr/&lt;/a&gt;  &lt;a href=&quot;\nhttp://www.debtocracy.gr/indexen.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.debtocracy.gr/indexen.html&lt;/a&gt;\n\n-----------\n\nfrom &quot;The Mind Behind Debtocracy&quot;  &lt;a href=&quot;\nhttp://owni.eu/2011/05/06/exclusive-campaigning-documentary-debtocracy-released-in-english/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://owni.eu/2011/05/06/exclusive-campaigning-documentary-debtocracy-released-in-english/&lt;/a&gt;\n\nIn a nutshell, what is Debtocracy about?\n----------------------------------------\n\nWe argue that the current situation is part of a world-wide economic problem, as well as a eurozone issue. Because the eurozone is divided into the core and periphery, we are condemned to suffer from losses of competitiveness in the global economy, and we cannot devalue our currency.\n\nWhat happened cannot be all blamed on the &quot;PIIGS&quot;- as they call us -- although we have our share of the blame. The problem is that Greece created a welfare state without taxing more companies. So the deficit increased. We also have a problem of corruption, but those are details. Even if all politicians were put in prison, the crisis would remain unsolved.\n\nWe also argue Germany is not a model to follow -- they froze salaries for a whole decade! That is not a sustainable model for all of Europe.\n\nSome people claim your documentary is not balanced. How would you respond to these claims?\n-----------------------------------------------------------------------------------\n\nWe never meant to be balanced, quite the opposite, since our counterparts had enough time and media space to put forward their views. And they are not balanced either.\n\nCritics also argue Ecuador is not an accurate example, because it's a developing country and has oil. But oil only represent 25% of their GDP. Besides, we have our own oil: tourism. You could take any country other than Ecuador, and people would still tell you that these are two different countries, even though we face a similar situation with a growing debt and a similar &quot;solutions&quot; put forward by the IMF. In the end, they are just trying to divert the discussion to avoid talking about the main topic of the movie: the need for an audit commission.\n\nIn your opinion, what should Greece do now?\n-------------------------------------------\n\nIt's clear that Greece cannot repay its debt -- whether legally or not, regardless of the interest rate. 350 billions dollars doesn't just grow on trees (and ironically, the market was the first to reach that conclusion). The government keeps on saying they will find the money, but the market is not stupid. The bailout plan designed by the European Union and the IMF was not about rescuing Greece -- it was about saving the German and French banks which would collapse if Greece went bankrupt.\n\nSo our point of view is that we should not expect anything from them. It will be too late if we wait for them to take the necessary measures. We need to find the solutions ourselves and create initiatives.\n\nConsidering that, first we have to carry out the debt audit in order to distinguish what is legal or illegal. There are indications that a huge amount of our sovereign debt is pernicious or illegal. But only an audit commission could determine and prove this. This is why we completely support this proposal. However, it should be driven democratically and transparently, and not by parliamentarians.\n\nWe are more radical than others advancing this proposal, because we think we should stop paying the debt, exit the eurozone, and nationalize the banking system. That is not something easy to get support for as it may seem too radical -- but even some politicians and economists from the center are beginning to consider it.\n\nNationalizing the banks may sound like a communist idea but the problem is so serious and we have to protect the country. If we exit the eurozone the banking system will most likely collapse, and thus we have to protect it from a capital flight out of the country.\n\n=================================================\n\nfrom &quot;Ron Paul: U.S. should declare 'bankruptcy'&quot;\nBy Charles Riley @CNNMoney June 28, 2011: 12:55 PM ET\n &lt;a href=&quot;\nhttp://money.cnn.com/2011/06/28/news/economy/ron_paul_bankruptcy/index.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://money.cnn.com/2011/06/28/news/economy/ron_paul_bankruptcy/index.htm&lt;/a&gt;\n\nNEW YORK (CNNMoney) -- How should the United States deal with its growing debt problem? Ron Paul thinks declaring &quot;bankruptcy&quot; might be a good idea.\n\nThe Texas congressman and Republican presidential candidate was discussing Greece's fiscal trouble with Iowa radio host Jan Mickelson on Monday when he was asked, &quot;If bankruptcy is the cure for Greece, is it also the cure for the United States?&quot;\n\n&quot;Absolutely,&quot; Paul replied.\n. . .\nPaul said social programs -- medical care and other benefits -- have pushed Greece to the edge, and the United States should take note.\n\n&quot;The big message there is the fact that the people who are seeing they are losing their benefits and their free medical care and all, are rioting in the streets,&quot; Paul said. &quot;That is the problem, and we are not immune from that.\n","torrent":{"xt":"urn:btih:fe69bfa0c649d7a1e8bc9b3a03b0b320e72cce3e","amp;dn":"XPEOKPATIA+-+Debtocracy+%282011%29+Xvid-AC3+v110821.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe69bfa0c649d7a1e8bc9b3a03b0b320e72cce3e","infoHashBuffer":{"type":"Buffer","data":[254,105,191,160,198,73,215,161,232,188,155,58,3,176,179,32,231,44,206,62]},"announce":[],"urlList":[]}}