{"title":"Bones Season 1 DVDRip XviD DutchReleaseTeam (dutch subs nl)","uid":6466093,"size":8067372651,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fef2585d13d7f84d56fcd6f4b8087be28e8fa30a&amp;dn=Bones+Season+1+DVDRip+XviD+DutchReleaseTeam+%28dutch+subs+nl%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"Koedje","files":-1,"time":1307964753,"description":"Plot:\n\nemperance Brennan is als forensisch antropologe werkzaam op het Jeffersonian Institute. Samen met haar team van uitermate getalenteerde wetenschappers helpt ze de FBI om moordzaken op te lossen. Niet alleen oude, onopgeloste moordzaken worden opgelost, maar ook recente moordzaken. Tijdens haar werk voor de FBI werkt ze samen met Seeley Booth (David Boreanaz). Tussen de FBI en het Jeffersonian Institute bestaan soms onenigheden, zoals die ook tussen Brennan (en haar team) en Booth bestaan. Maar uiteindelijk lossen de twee partijen de zaken altijd weer op.\n\n\n\n\nSeizoen 1:\n\n\nSeason 1, Episode 1: Pilot\nFBI Agent Booth needs forensic anthropologist Dr. Brennan\\'s help to solve the case of a decomposed body found in a pond in Arlington National Cemetery. \nShe agrees to help if she is a full partner in the case.\n\n\n\t\nSeason 1, Episode 2: The Man in the SUV\nBones is called on to identify the body of a suspected suicide car bomber.\n\n\n\t\nSeason 1, Episode 3: A Boy in a Tree\nBones and Booth investigate the body of a teenager found hanging in a tree on the grounds of an exclusive private school.\n\n\n\t\nSeason 1, Episode 4: The Man in the Bear\nBones and Booth travel to Washington to investigate an arm found in a dead black bear.\n\n\n\t\nSeason 1, Episode 5: A Boy in a Bush\nWhen a young boy goes missing from a mall, Bones is called in to determine if it is his body found in a nearby field.\n\n\n\t\nSeason 1, Episode 6: The Man in the Wall\nBones and Angela\\'s night out goes bad when Bones kicks someone into a wall and reveals a mummified corpse and a bag of methamphetamines.\n\n\n\t\nSeason 1, Episode 7: The Man on Death Row\nA condemned man\\'s lawyer makes a last minute appeal to Bones and Booth to re-examine his case. After looking over the evidence, they determine that the man may not be guilty.\n\n\n\t\nSeason 1, Episode 8: The Girl in the Fridge\nBones and Booth investigate a missing woman found in a fridge while Bones reconnects with her former professor.\n\n\n\t\nSeason 1, Episode 9: The Man in the Fallout Shelter\nWhile the gang is quarantined in the lab for Christmas, they search for clues to solve the mystery of a skeleton found in a fallout shelter.\n\n\n\t\nSeason 1, Episode 10: The Woman at the Airport\nBones and Booth travel to Los Angeles to investigate a body found on a beach. The case leads them to call girls and plastic surgeons. Back in Washington, \nHodgins and Goodman clash while authenticating the remains of an Iron Age warrior.\n\n\n\t\nSeason 1, Episode 11: The Woman in the Car\nBooth and Bones work quickly to solve not only a murder, but also the kidnapping of the victim\\'s child.\n\n\t\nSeason 1, Episode 12: The Superhero in the Alley\nBones and Booth investigate a body found in an alley that is dressed in a costume. The case leads them to a missing teen involved in comic books and a role playing game.\n\n\n\t\nSeason 1, Episode 13: The Woman in the Garden\nBones and Booth investigate the body of a woman found in the car of a gang member. The case leads them to a dangerous Central American gang and a Senator.\n\n\n\t\nSeason 1, Episode 14: The Man on the Fairway\nBones is told to investigate a plane crash involving Chinese delegates, but she is more interested in bone fragments from a person who was not on the plane. \nThe fragments lead to a man whose father has been missing for five years.\n\n\n\t\nSeason 1, Episode 15: Two Bodies in the Lab\nAfter Bones narrowly avoids being shot while on the way to a blind date, the shooter is thought to be connected to one of two murders she\\'s investigating: \none of mob boss James Cugini, the other a victim of serial killer Kevin Hollings.\n\n\n\t\nSeason 1, Episode 16: The Woman in the Tunnel\nThe death of a documentary filmmaker sends Bones and Booth into the shadowy world of tunnels underneath the city.\n\n\n\t\nSeason 1, Episode 17: The Skull in the Desert\nBrennan goes to help Angela when her boyfriend goes missing in the desert, and Booth gets in on the action when the sheriff won\\'t cooperate.\n\n\n\t\nSeason 1, Episode 18: The Man with the Bone\nAfter a dead body is found near a 300 year old finger bone, Booth and Brennan investigate the site, which might be hiding pirate treasure.\n\n\n\t\nSeason 1, Episode 19: The Man in the Morgue\nBones goes to New Orleans post-Katrina and becomes involved in Voodoo guided murder.\n\n\n\t\nSeason 1, Episode 20: The Graft in the Girl\nWhile examining a young girl\\'s cancer, Brennan and Booth uncover a bone-smuggling ring.\n\n\n\t\nSeason 1, Episode 21: The Soldier on the Grave\nBooth and Brennan\\'s investigation into the apparent suicide of a protester in Arlington National Cemetery may lead to a major military scandal.\n\n\n\t\nSeason 1, Episode 22: The Woman in Limbo\nWhen Brennan\\'s mother is found in the Jeffersonian\\'s storage for unidentified remains, Booth opens an official FBI investigation to find out who killed her.\n\n\n\nDeze serie wordt u aangeboden door het DutchReleaseTeam.\nVoor de reviews van de nieuwste films, muziek, series, games etc\nga dan eens naar http://www.hetmultimediacafe.be\n\nDutchReleaseteam = Hardcoded Dutch Subs","torrent":{"xt":"urn:btih:fef2585d13d7f84d56fcd6f4b8087be28e8fa30a","amp;dn":"Bones+Season+1+DVDRip+XviD+DutchReleaseTeam+%28dutch+subs+nl%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fef2585d13d7f84d56fcd6f4b8087be28e8fa30a","infoHashBuffer":{"type":"Buffer","data":[254,242,88,93,19,215,248,77,86,252,214,244,184,8,123,226,142,143,163,10]},"announce":[],"urlList":[]}}