{"title":"Taboo 10 - Ten Years Later [DVDRip]","uid":8305438,"size":806523980,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ff681b827c27ef6aafea8ccd10dadba4e8633d12&amp;dn=Taboo+10+-+Ten+Years+Later+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"chkm8te","files":3,"time":1364359818,"description":"Taboo 10 - Ten Years Later [DVDRip]\n\nTaboo X comes out of the starting box with a free-for-all at Club Babylon. Lere gets reamed over a bar stool, Fantasia gets d.p.'d, while Mona Lisa blows and Flame and Mynx beat their bushes.\nEnter Jonathan Morgan, as the doctor researching sexual deviates, to set up the plot with nurse Melanie. As often is the case, the story-line is incidental at best and merely an excuse to get the romping started. Taboo X is also far removed from its early predecessors, containing no trace of the previous undertones.\nAfter its rather climactic beginning, Taboo X gets a bit confusing, and its individual sex scenes don't quite come up to the opening orgy. As Morgan hears about the wacky sex lives of his patients -- Flame is particularly manic -- Meekah and Melanie Moore try out &quot;what the doctor ordered&quot; on Marc Wallice in a decent threeway. Teri Diver follows in a bed-tumble with hubby Morgan, then takes on Heather Lere for the girl/girl, and Cal and Jake round off the sex with an on-stage d.p. with an uncredited Samantha York. The story ends with Jonathan catching his predecessor's insanity, having been exposed to &quot;too much sexual deviance.&quot; (Dig those &quot;insane&quot; video effects.)\nJudging by its structure, Taboo X might have played better backwards. Sad to say, it's becoming difficult to cover really taboo subjects without taking the risk of getting busted for being too creative (though that's not how the warrant would read). However, considered strictly by itself, this tape easily stands on its own. A big seller and renter already and a must-have for any video store.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=fno5928op8hlr5edgcc0.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=fno5928op8hlr5edgcc0.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=uh06w97oktokscn0ygz3.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=uh06w97oktokscn0ygz3.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:ff681b827c27ef6aafea8ccd10dadba4e8633d12","amp;dn":"Taboo+10+-+Ten+Years+Later+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff681b827c27ef6aafea8ccd10dadba4e8633d12","infoHashBuffer":{"type":"Buffer","data":[255,104,27,130,124,39,239,106,175,234,140,205,16,218,219,164,232,99,61,18]},"announce":[],"urlList":[]}}