{"title":"John Perkins - Confessions of an Economic Hit Man","uid":3362085,"size":268209179,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ffbbb29ad6cb6832d64e4a45f8ea477c11bed5c5&amp;dn=John+Perkins+-+Confessions+of+an+Economic+Hit+Man&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Reboot","files":1,"time":1122516982,"description":"John Perkins - Confessions of an Economic Hit Man\n\n\nJohn Perkins started and stopped writing Confessions of an Economic Hit Man four times over 20 years. He says he was threatened and bribed in an effort to kill the project, but after 9/11 he finally decided to go through with this expose of his former professional life.\n\nPerkins, a former chief economist at Boston strategic-consulting firm Chas. T. Main, says he was an &quot;economic hit man&quot; for 10 years, helping U.S. intelligence agencies and multinationals cajole and blackmail foreign leaders into serving U.S. foreign policy and awarding lucrative contracts to American business. &quot;Economic hit men (EHMs) are highly paid professionals who cheat countries around the globe out of trillions of dollars,&quot; Perkins writes. Confessions of an Economic Hit Man is an extraordinary and gripping tale of intrigue and dark machinations. Think John Le Carr&amp;eacute;, except it's a true story.\n\nPerkins writes that his economic projections cooked the books Enron-style to convince foreign governments to accept billions of dollars of loans from the World Bank and other institutions to build dams, airports, electric grids, and other infrastructure he knew they couldn't afford. The loans were given on condition that construction and engineering contracts went to U.S. companies. Often, the money would simply be transferred from one bank account in Washington, D.C., to another one in New York or San Francisco. The deals were smoothed over with bribes for foreign officials, but it was the taxpayers in the foreign countries who had to pay back the loans. When their governments couldn't do so, as was often the case, the U.S. or its henchmen at the World Bank or International Monetary Fund would step in and essentially place the country in trusteeship, dictating everything from its spending budget to security agreements and even its United Nations votes. It was, Perkins writes, a clever way for the U.S. to expand its &quot;empire&quot; at the expense of Third World citizens. While at times he seems a little overly focused on conspiracies, perhaps that's not surprising considering the life he's led.\n\n\nNumber of files: 1\nRun time: 9 hours, 19 minutes\nAudio codec: mp3, 64 kbps, 44 kHZ, cbr\nSource: CD\n\n\n----\n\nrealityzone.com - theinternationalforecaster.com\n\ndavidicke.com - bridgeoflove.com\nprisonplanet.com - infowars.com\njordanmaxwell.com - sovereignearth.org\nmayanmajix.com - calleman.com\ntaroscopes.com - atlantisbook.com - originsandoracles.com\nconspiracycentral.net:6969","torrent":{"xt":"urn:btih:ffbbb29ad6cb6832d64e4a45f8ea477c11bed5c5","amp;dn":"John+Perkins+-+Confessions+of+an+Economic+Hit+Man","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffbbb29ad6cb6832d64e4a45f8ea477c11bed5c5","infoHashBuffer":{"type":"Buffer","data":[255,187,178,154,214,203,104,50,214,78,74,69,248,234,71,124,17,190,213,197]},"announce":[],"urlList":[]}}