{"title":"[Jaroslav_Krivanek,_Pascal_Gautron]Practical Global Illumination","uid":11047210,"size":13228233,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fff34fb0a1f6409f4bcc7a82a80a481b87ac7dc8&amp;dn=%5BJaroslav_Krivanek%2C_Pascal_Gautron%5DPractical+Global+Illumination&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":2,"time":1410967541,"description":"Irradiance caching is a ray tracing-based technique for computing global illumination on diffuse surfaces. Specifically, it addresses the computation of indirect illumination bouncing off one diffuse object onto another. The sole purpose of irradiance caching is to make this computation reasonably fast. The main idea is to perform the indirect illumination sampling only at a selected set of locations in the scene, store the results in a cache, and reuse the cached value at other points through fast interpolation. This book is for anyone interested in making a production-ready implementation of irradiance caching that reliably renders artifact-free images. Since its invention 20 years ago, the irradiance caching algorithm has been successfully used to accelerate global illumination computation in the Radiance lighting simulation system. Its widespread use had to wait until computers became fast enough to consider global illumination in film production rendering. Since then, its use is ubiquitous. Virtually all commercial and open-source rendering software base the global illumination computation upon irradiance caching. Although elegant and powerful, the algorithm in its basic form often fails to produce artifact-free mages. Unfortunately, practical information on implementing the algorithm is scarce. The main objective of this book is to show the irradiance caching algorithm along with all the details and tricks upon which the success of its practical implementation is dependent. In addition, we discuss some extensions of the basic algorithm, such as a GPU implementation for interactive global illumination computation and temporal caching that exploits temporal coherence to suppress flickering in animations. Our goal is to show the material without being overly theoretical. However, the reader should have some basic understanding of rendering concepts, ray tracing in particular. Familiarity with global illumination is useful but not necessary to read this book.\n\nTable of Contents: Introduction to Ray Tracing and Global Illumination / Irradiance Caching Core / Practical Rendering with Irradiance Caching / Irradiance Caching in a Complete Global Illumination / Irradiance Caching on Graphics Hardware / Temporal Irradiance Caching\n\nPublisher: Morgan and Claypool Publishers (March 30, 2009)\nLanguage: English\nISBN-10: 1598296442\nISBN-13: 978-1598296440\n\n","torrent":{"xt":"urn:btih:fff34fb0a1f6409f4bcc7a82a80a481b87ac7dc8","amp;dn":"%5BJaroslav_Krivanek%2C_Pascal_Gautron%5DPractical+Global+Illumination","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fff34fb0a1f6409f4bcc7a82a80a481b87ac7dc8","infoHashBuffer":{"type":"Buffer","data":[255,243,79,176,161,246,64,159,75,204,122,130,168,10,72,27,135,172,125,200]},"announce":[],"urlList":[]}}